[["1940-01-08T00:00:00", "WWII: Winter War – Battle of Suomussalmi: The Soviet 44th Rifle Division is destroyed by Finnish forces."], ["1940-01-08T00:00:00", "WWII: Food rationing begins in Great Britain."], ["1940-04-12T00:00:00", "The Faroe Islands are occupied by British troops, following the German invasion of Denmark. This action is taken to avert a possible German occupation of the islands with serious consequences for the course of the Battle of the Atlantic."], ["1940-04-12T00:00:00", "Opening day at Jamaica Race Course features the use of parimutuel betting equipment, a departure from bookmaking heretofore used exclusively throughout New York. Other tracks in the state follow suit later in 1940."], ["1940-04-13T00:00:00", "WWII: Second Naval Battle of Narvik: The British Royal Navy causes all eight defending German destroyers in the Ofotfjord to be sunk."], ["1940-04-13T00:00:00", "The New York Rangers win the 1940 Stanley Cup Finals in ice hockey. It will be another 54 years before their next win in 1994."], ["1940-05-15T00:00:00", "WWII: The Dutch Army formally signs a surrender document."], ["1940-05-15T00:00:00", "The very first McDonald's restaurant opens in San Bernardino, California."], ["1940-05-15T00:00:00", "Women's stockings made of nylon are first placed on sale across the United States. Almost five million pairs are bought on this day."], ["1940-05-20T00:00:00", "WWII: German forces (2nd Panzer division), under General Rudolf Veiel, reach Noyelles on the English Channel."], ["1940-05-20T00:00:00", "Holocaust: The Nazi concentration camp and extermination camp Auschwitz-Birkenau, the largest of the German concentration camps, opens in occupied Poland near the town of Oświęcim. From now until January 1945, around 1.1 million people will be killed here."], ["1940-05-26T00:00:00", "WWII: The Dunkirk evacuation of the British Expeditionary Force starts."], ["1940-05-26T00:00:00", "First free flight of Igor Sikorsky's Vought-Sikorsky VS-300 helicopter."], ["1940-06-03T00:00:00", "WWII: Paris is bombed by the Luftwaffe for the first time."], ["1940-06-03T00:00:00", "The Holocaust: Franz Rademacher proposes the Madagascar Plan."], ["1940-06-03T00:00:00", "Weather Bureau transferred to the United States Department of Commerce."], ["1940-06-07T00:00:00", "Daisy Duck debuts in Mr. Duck Steps Out."], ["1940-06-07T00:00:00", "King Haakon VII of Norway and his government are evacuated from Tromsø to London on HMS Devonshire."], ["1940-06-10T00:00:00", "WWII: Italy declares war on France and the United Kingdom."], ["1940-06-10T00:00:00", "WWII: U.S. President Franklin D. Roosevelt denounces Italy's actions with his \"Stab in the Back\" speech during the graduation ceremonies of the University of Virginia."], ["1940-06-10T00:00:00", "WWII: Canada declares war on Italy."], ["1940-06-10T00:00:00", "WWII: The Norwegian Army surrenders to German forces."], ["1940-06-10T00:00:00", "WWII: The French government flees to Tours."], ["1940-06-10T00:00:00", "Jamaican political activist Marcus Garvey dies of a stroke in London."], ["1940-06-14T00:00:00", "WWII: The French government flees to Bordeaux and Paris falls under German occupation."], ["1940-06-14T00:00:00", "WWII: U.S. President Franklin D. Roosevelt signs the Naval Expansion Act into law, which aims to increase the United States Navy's tonnage by 11%."], ["1940-06-14T00:00:00", "WWII: A group of 728 Polish political prisoners from Tarnów become the first residents of the Auschwitz concentration camp."], ["1940-06-15T00:00:00", "WWII: The Soviet Union occupies Lithuania."], ["1940-06-15T00:00:00", "WWII: Verdun falls to German forces."], ["1940-06-16T00:00:00", "The Churchill war ministry in the United Kingdom offers a Franco-British Union to Paul Reynaud, Prime Minister of France, in the hope of preventing France from agreeing to an armistice with Germany, but Reynaud resigns when his own cabinet refuses to accept it."], ["1940-06-16T00:00:00", "The Sturgis Motorcycle Rally is held for the first time in Sturgis, South Dakota."], ["1940-06-17T00:00:00", "WWII: Philippe Pétain becomes Prime Minister of France and immediately asks Germany for peace terms."], ["1940-06-17T00:00:00", "WWII: The Soviet Union occupies Estonia and Latvia."], ["1940-06-17T00:00:00", "WWII: Operation Ariel begins: Allied troops start to evacuate France, following Germany's takeover of Paris and most of the nation."], ["1940-06-17T00:00:00", "WWII: RMS Lancastria, serving as a troopship, is bombed and sunk by Luftwaffe Junkers Ju 88 aircraft while evacuating British troops and nationals from Saint-Nazaire in France with the loss of at least 4,000 lives, the largest single UK loss in any World War II event, immediate news of which is suppressed in the British press. Destroyer HMS Beagle (H30) rescues around 600."], ["1940-06-18T00:00:00", "WWII: Winston Churchill tells the House of Commons of the United Kingdom: \"The Battle of France is over. The Battle of Britain is about to begin.\""], ["1940-06-18T00:00:00", "WWII: Appeal of 18 June: General Charles de Gaulle, de facto leader of the Free French Forces, makes his first broadcast appeal over Radio Londres from London rallying French Resistance, calling on all French people to continue the fight against Nazi Germany: \"France has lost a battle. But France has not lost the war\"."], ["1940-06-24T00:00:00", "United States politics: The Republican Party begins its national convention in Philadelphia and nominates Wendell Willkie as its candidate for president."], ["1940-06-24T00:00:00", "WWII: Vichy France signs armistice terms with Italy."], ["1940-06-30T00:00:00", "WWII: German forces land in Guernsey, marking the start of the 5-year Occupation of the Channel Islands."], ["1940-06-30T00:00:00", "Federal government of the United States reorganisation:\nThe Civil Aeronautics Administration is placed under the Department of Commerce.\nThe U.S. Food and Drug Administration (FDA) is placed under the Federal Security Agency.\nThe United States Fish and Wildlife Service is placed under the Department of the Interior.\n"], ["1940-06-30T00:00:00", "The Civil Aeronautics Administration is placed under the Department of Commerce."], ["1940-06-30T00:00:00", "The U.S. Food and Drug Administration (FDA) is placed under the Federal Security Agency."], ["1940-06-30T00:00:00", "The United States Fish and Wildlife Service is placed under the Department of the Interior."], ["1940-07-06T00:00:00", "Opening of Story Bridge in Brisbane."], ["1940-07-06T00:00:00", "British submarine HMS Shark is sunk."], ["1940-07-11T00:00:00", "WWII: British destroyer HMS Escort is torpedoed and sunk by an Italian submarine."], ["1940-07-11T00:00:00", "WWII: Vichy France begins with a constitutional law which only 80 members of the parliament vote against. Philippe Pétain becomes Prime Minister of France."], ["1940-07-19T00:00:00", "WWII: Allied victory at the Battle of Cape Spada HMAS Sydney and five destroyers sink the Italian cruiser Bartolomeo Colleoni."], ["1940-07-19T00:00:00", "WWII: Adolf Hitler makes a peace appeal to Britain in an address to the Reichstag. Lord Halifax, the British foreign minister, flatly rejects peace terms in a broadcast reply on July 22."], ["1940-08-20T00:00:00", "WWII: Winston Churchill pays tribute in the House of Commons of the United Kingdom to the Royal Air Force: \"Never in the field of human conflict was so much owed by so many to so few.\""], ["1940-08-20T00:00:00", "Leon Trotsky is attacked with an ice axe in his Mexico home by NKVD agent Ramón Mercader."], ["1940-09-07T00:00:00", "Treaty of Craiova: Romania loses Southern Dobruja to Bulgaria."], ["1940-09-07T00:00:00", "WWII: The Blitz – Nazi Germany begins to rain bombs on London (the first of 57 consecutive nights of strategic bombing)."], ["1940-09-12T00:00:00", "In Lascaux, France, 17,000-year-old cave paintings are discovered by a group of young Frenchmen hiking through Southern France. The paintings depict animals and date to the Stone Age."], ["1940-09-12T00:00:00", "The Hercules Munitions Plant in Succasunna-Kenvil, New Jersey explodes, killing 55 people."], ["1940-11-11T00:00:00", "WWII: The Royal Navy launches the first aircraft carrier strike in history, on the Italian battleship fleet anchored at Taranto naval base."], ["1940-11-11T00:00:00", "WWII: German auxiliary cruiser Atlantis captures top secret British mail intended for British Far East Command from the SS Automedon and sends it to Japan."], ["1940-11-11T00:00:00", "Armistice Day Blizzard: An unexpected blizzard kills 144 in the Midwestern United States."], ["1940-11-16T00:00:00", "WWII: In response to Germany levelling Coventry 2 days before, the Royal Air Force begins to bomb Hamburg (by war's end, 50,000 Hamburg residents will have died from Allied attacks)."], ["1940-11-16T00:00:00", "An unexploded pipe bomb is found in the Consolidated Edison office building (only years later is the culprit, George Metesky, apprehended)."], ["1940-11-16T00:00:00", "The Jamaica Association of Local Government Officers is founded."], ["1940-11-25T00:00:00", "Patria disaster: As British authorities attempt to deport Jewish refugees (originating from German-occupied Europe) from Mandatory Palestine to Mauritius aboard the requisitioned emigrant liner SS Patria at Haifa, the Jewish paramilitary organization Haganah sinks the ship with a bomb, killing around 250 refugees and crew."], ["1940-11-25T00:00:00", "de Havilland Mosquito and Martin B-26 Marauder military aircraft both make their first flights."], ["1940-11-25T00:00:00", "Cartoon character Woody Woodpecker makes his debut in the animated short, Knock Knock."], ["1940-12-14T00:00:00", "WWII British destroyers HMS Hereward and HMS Hyperion sink an Italian submarine off Bardia."], ["1940-12-14T00:00:00", "Royal Navy Fairey Swordfish based on Malta bomb Tripoli."], ["1940-12-14T00:00:00", "Plutonium is first synthesized in the laboratory by a team led by Glenn T. Seaborg and Edwin McMillan at the University of California, Berkeley."], ["1940-12-29T00:00:00", "Franklin D. Roosevelt, in a fireside chat to the nation, declares that the United States must become \"the great arsenal of democracy.\""], ["1940-12-29T00:00:00", "WWII: \"Second Great Fire of London\" – Luftwaffe carries out a massive incendiary bombing raid, starting 1,500 fires. Many famous buildings, including the Guildhall and Trinity House, are either damaged or destroyed."], ["1940-12-30T00:00:00", "California's first modern freeway, the future State Route 110, opens to traffic in Pasadena, California, as the Arroyo Seco Parkway (now the Pasadena Freeway)."], ["1940-12-30T00:00:00", "In Sweden, Victor Hasselblad forms the Victor Hasselblad AB Camera Company."], ["1940-01-04T00:00:00", "Brian Josephson, Welsh physicist, Nobel Prize laureate"], ["1940-01-04T00:00:00", "Gao Xingjian, Chinese-born writer, Nobel Prize laureate"], ["1940-01-21T00:00:00", "Jeremy Jacobs, American businessman, owner (Boston Bruins)"], ["1940-01-21T00:00:00", "Jack Nicklaus, American golfer"], ["1940-02-01T00:00:00", "Bibi Besch, Austrian-born American actress (d. 1996)"], ["1940-02-01T00:00:00", "Ajmer Singh, Indian athlete and educator (d. 2010)"], ["1940-02-06T00:00:00", "Tom Brokaw, American television news reporter"], ["1940-02-06T00:00:00", "Jimmy Tarbuck, English comedian"], ["1940-02-08T00:00:00", "Ted Koppel, American journalist"], ["1940-02-08T00:00:00", "Joe South, American singer and songwriter"], ["1940-02-09T00:00:00", "Brian Bennett, British drummer and songwriter (The Shadows)"], ["1940-02-09T00:00:00", "J. M. Coetzee, South African writer, Nobel Prize laureate"], ["1940-02-09T00:00:00", "Seamus Deane, Irish poet and novelist"], ["1940-02-12T00:00:00", "Ralph Bates, English actor (d. 1991)"], ["1940-02-12T00:00:00", "Richard Lynch, American actor (d. 2012)"], ["1940-02-21T00:00:00", "Akihiko Kumashiro, Japanese politician"], ["1940-02-21T00:00:00", "James Wong, Hong Kong composer (d. 2004)"], ["1940-02-22T00:00:00", "Judy Cornwell, English actress"], ["1940-02-22T00:00:00", "Johnson Mlambo, South African politician"], ["1940-02-22T00:00:00", "Billy Name, American photographer and Warhol archivist"], ["1940-02-24T00:00:00", "Pete Duel, American actor (d. 1971)"], ["1940-02-24T00:00:00", "Denis Law, Scottish football player"], ["1940-03-03T00:00:00", "Germán Castro Caycedo, Colombian writer and journalist"], ["1940-03-03T00:00:00", "Owen Spencer-Thomas, English broadcaster, journalist and clergyman"], ["1940-03-10T00:00:00", "Chuck Norris, American actor and martial artist"], ["1940-03-10T00:00:00", "Dean Torrence, American singer (Jan and Dean)"], ["1940-03-16T00:00:00", "Bernardo Bertolucci, Italian writer and film director"], ["1940-03-16T00:00:00", "Jan Pronk, Dutch politician and diplomat"], ["1940-03-26T00:00:00", "James Caan, American actor"], ["1940-03-26T00:00:00", "Nancy Pelosi, Speaker of the United States House of Representatives"], ["1940-04-12T00:00:00", "John Hagee, American televangelist"], ["1940-04-12T00:00:00", "Herbie Hancock, American musician"], ["1940-05-08T00:00:00", "Peter Benchley, American author (d. 2006)"], ["1940-05-08T00:00:00", "Angela Carter, English author and editor (d. 1992)"], ["1940-05-08T00:00:00", "Ricky Nelson, American singer (d. 1985)"], ["1940-05-08T00:00:00", "Toni Tennille, American singer"], ["1940-05-09T00:00:00", "James L. Brooks, American film producer and writer"], ["1940-05-09T00:00:00", "Nuala O'Faolain, Irish journalist and author (d. 2008)"], ["1940-05-15T00:00:00", "Lainie Kazan, American actress and singer"], ["1940-05-15T00:00:00", "Don Nelson, American basketball player and coach"], ["1940-05-17T00:00:00", "Alan Kay, American computer scientist"], ["1940-05-17T00:00:00", "Reynato Puno, Filipino Supreme Court Chief Justice"], ["1940-05-20T00:00:00", "Stan Mikita, Slovakian-born Canadian hockey player"], ["1940-05-20T00:00:00", "Sadaharu Oh, Japanese baseball player"], ["1940-06-08T00:00:00", "Carole Ann Ford, British actress"], ["1940-06-08T00:00:00", "Nancy Sinatra, American singer"], ["1940-06-16T00:00:00", "Neil Goldschmidt, Governor of Oregon"], ["1940-06-16T00:00:00", "Taylor Gun-Jin Wang, Chinese-American astronaut"], ["1940-06-17T00:00:00", "George Akerlof, American economist, Nobel Prize laureate"], ["1940-06-17T00:00:00", "Alan Murray, Australian professional golfer"], ["1940-06-22T00:00:00", "Abbas Kiarostami, Iranian film director, screenwriter, and film producer"], ["1940-06-22T00:00:00", "Esther Rantzen, British broadcaster"], ["1940-06-23T00:00:00", "Adam Faith, English singer and actor (d. 2003)"], ["1940-06-23T00:00:00", "Lord Irvine of Lairg, Lord Chancellor of England"], ["1940-06-23T00:00:00", "Wilma Rudolph, American athlete (d. 1994)"], ["1940-07-03T00:00:00", "César Tovar, Venezuelan baseball player"], ["1940-07-03T00:00:00", "Fontella Bass, American soul singer (d. 2012)"], ["1940-07-10T00:00:00", "Gene Alley, American baseball player"], ["1940-07-10T00:00:00", "Helen Donath, American soprano"], ["1940-07-10T00:00:00", "Tom Farmer, Scottish entrepreneur"], ["1940-07-13T00:00:00", "Paul Prudhomme, American celebrity chef and cookbook author"], ["1940-07-13T00:00:00", "Patrick Stewart, English actor"], ["1940-07-17T00:00:00", "Tim Brooke-Taylor, English comedian"], ["1940-07-17T00:00:00", "Verne Lundquist, American sportscaster"], ["1940-07-18T00:00:00", "James Brolin, American actor and director"], ["1940-07-18T00:00:00", "Joe Torre, American baseball player and manager"], ["1940-07-22T00:00:00", "George Clinton, American musician"], ["1940-07-22T00:00:00", "Alex Trebek, Canadian game show host"], ["1940-07-27T00:00:00", "Pina Bausch, German choreographer (d. 2009)"], ["1940-07-27T00:00:00", "Bharati Mukherjee, Indian-born novelist"], ["1940-08-20T00:00:00", "Musa Geshaev, Chechen poet and historian"], ["1940-08-20T00:00:00", "Rubén Hinojosa, American politician"], ["1940-08-27T00:00:00", "Fernest Arceneaux, American musician (d. 2008)"], ["1940-08-27T00:00:00", "Sonny Sharrock, American jazz musician (d. 1994)"], ["1940-08-29T00:00:00", "Bennie Maupin, American musician"], ["1940-08-29T00:00:00", "Johnny Paris, American musician (Johnny and the Hurricanes) (d. 2006)"], ["1940-09-12T00:00:00", "Linda Gray, American model and actress"], ["1940-09-12T00:00:00", "Skip Hinnant, American actor"], ["1940-09-12T00:00:00", "Mickey Lolich, American baseball player"], ["1940-10-21T00:00:00", "Geoffrey Boycott, English cricketer"], ["1940-10-21T00:00:00", "Manfred Mann, South African rock musician"], ["1940-11-15T00:00:00", "Roberto Cavalli, Italian designer"], ["1940-11-15T00:00:00", "Sam Waterston, American actor"], ["1940-12-04T00:00:00", "Freddy Cannon, American singer"], ["1940-12-04T00:00:00", "Gary Gilmore, American murderer (d. 1977)"], ["1940-12-12T00:00:00", "Sharad Pawar, Indian politician"], ["1940-12-12T00:00:00", "Dionne Warwick, American singer"], ["1940-12-23T00:00:00", "Jorma Kaukonen, American musician (Jefferson Airplane, Hot Tuna)"], ["1940-12-23T00:00:00", "Robert Labine, former mayor of Gatineau, Quebec"], ["1940-03-05T00:00:00", "Maxine Elliott, American actress (b. 1868)"], ["1940-03-05T00:00:00", "Cai Yuanpei, Chinese educator (b. 1868)"], ["1940-03-27T00:00:00", "Madeleine Astor, American survivor of Titanic (b. 1893)"], ["1940-03-27T00:00:00", "Michael Joseph Savage, Prime Minister of New Zealand (b. 1872)"], ["1940-05-28T00:00:00", "Prince Frederick Charles of Hesse (b. 1868)"], ["1940-05-28T00:00:00", "Walter Connolly, American actor (b. 1887)"], ["1940-06-07T00:00:00", "James Hall, American actor (b. 1900)"], ["1940-06-07T00:00:00", "Hugh Rodman, American admiral (b. 1859)"], ["1940-06-21T00:00:00", "Smedley Butler, U.S. general (b. 1881)"], ["1940-06-21T00:00:00", "Janusz Kusociński, Polish athlete (b. 1907)"], ["1940-08-21T00:00:00", "Hermann Obrecht, Swiss Federal Councillor (b. 1882)"], ["1940-08-21T00:00:00", "Leon Trotsky, Russian revolutionary (b. 1879)"], ["1940-08-22T00:00:00", "Sir Oliver Lodge, British physicist (b. 1851)"], ["1940-08-22T00:00:00", "Gerald Strickland, 4th Prime Minister of Malta, 23rd Governor of New South Wales, 15th Governor of Western Australia and 9th Governor of Tasmania (b. 1861)"], ["1940-08-22T00:00:00", "Mary Vaux Walcott, American artist and naturalist (b. 1860)"], ["1940-10-05T00:00:00", "Ballington Booth, American co-founder of Volunteers of America (b. 1857)"], ["1940-10-05T00:00:00", "Lincoln Loy McCandless, Hawaiian politician and cattle rancher (b. 1859)"], ["1940-11-09T00:00:00", "Neville Chamberlain, Prime Minister of the United Kingdom (b. 1869)"], ["1940-11-09T00:00:00", "John Henry Kirby, Texas legislator and American businessman (b. 1860)"], ["1940-11-17T00:00:00", "Eric Gill, British sculptor and writer (b. 1882)"], ["1940-11-17T00:00:00", "Raymond Pearl, American biologist (b. 1879)"]]