[["1964-01-05T00:00:00", "U.S. Senator Barry Goldwater announces that he will seek the Republican nomination for President."], ["1964-01-05T00:00:00", "In the first meeting between leaders of the Roman Catholic and Orthodox churches since the 15th century, Pope Paul VI and Patriarch Athenagoras I of Constantinople meet in Jerusalem."], ["1964-01-12T00:00:00", "Zanzibar Revolution: The predominantly Arab government of Zanzibar is overthrown by African nationalist rebels; a United States Navy destroyer evacuates 61 U.S. citizens."], ["1964-01-12T00:00:00", "Routine U.S. naval patrols of the South China Sea begin."], ["1964-01-16T00:00:00", "Musical Hello, Dolly! opens in New York's St. James Theatre."], ["1964-01-16T00:00:00", "John Glenn, the first American to orbit the Earth, resigns from NASA."], ["1964-01-23T00:00:00", "Pope Paul VI institutes the World Day of Prayer for Vocations. During this celebration the Pope reminds the universal Church that still today salvation comes to everyone. It continues to be celebrated every Fourth Sunday of Easter also known as Good Shepherd Sunday."], ["1964-01-23T00:00:00", "Thirteen years after its proposal and nearly 2 years after its passage by the United States Senate, the 24th Amendment to the United States Constitution, prohibiting the use of poll taxes in national elections, is ratified."], ["1964-01-23T00:00:00", "Arthur Miller's After the Fall opens Off-Broadway. A semi-autobiographical work, it arouses controversy over his portrayal of late ex-wife Marilyn Monroe."], ["1964-01-27T00:00:00", "France and the People's Republic of China announce their decision to establish diplomatic relations."], ["1964-01-27T00:00:00", "U.S. Senator Margaret Chase Smith, 66, announces her candidacy for the Republican presidential nomination."], ["1964-01-29T00:00:00", "The Soviet Union launches 2 scientific satellites, Elektron I and II, from a single rocket."], ["1964-01-29T00:00:00", "Ranger 6 is launched by NASA, on a mission to carry television cameras and crash-land on the Moon."], ["1964-02-04T00:00:00", "The Government of the United States authorizes the Twenty-fourth Amendment to the United States Constitution, outlawing the poll tax."], ["1964-02-07T00:00:00", "A Jackson, Mississippi jury, trying Byron De La Beckwith for the murder of Medgar Evers in June 1963, reports that it cannot reach a verdict, resulting in a mistrial."], ["1964-02-07T00:00:00", "The Beatles arrive from England at New York City's JFK International Airport, receiving a tumultuous reception from a throng of screaming fans, marking the first occurrence of \"Beatlemania\" in the United States."], ["1964-02-11T00:00:00", "Greeks & Turks begin fighting in Limassol, Cyprus."], ["1964-02-11T00:00:00", "The Republic of China (Taiwan) severs diplomatic relations with France because of French recognition of the People's Republic of China."], ["1964-02-17T00:00:00", "Wesberry v. Sanders (376 US 1 1964): The Supreme Court of the United States rules that congressional districts have to be approximately equal in population."], ["1964-02-17T00:00:00", "Gabonese president Léon M'ba is toppled by a military coup and his archrival, Jean-Hilaire Aubame, is installed in his place. However, French intervention restores M'ba's government the next day."], ["1964-03-06T00:00:00", "Constantine II becomes King of Greece, upon the death of his father King Paul."], ["1964-03-06T00:00:00", "Malcolm X, suspended from the Nation of Islam, says in New York City that he is forming a black nationalist party."], ["1964-03-09T00:00:00", "New York Times Co. v Sullivan (376 US 254 1964): The United States Supreme Court rules that under the First Amendment, speech criticizing political figures cannot be censored."], ["1964-03-09T00:00:00", "The first Ford Mustang rolls off the assembly line at Ford Motor Company."], ["1964-03-10T00:00:00", "Soviet military forces shoot down an unarmed reconnaissance bomber that had strayed into East Germany; the 3 U.S. flyers parachute to safety."], ["1964-03-10T00:00:00", "Henry Cabot Lodge Jr., Ambassador to South Vietnam, wins the New Hampshire Republican primary."], ["1964-03-28T00:00:00", "King Saud of Saudi Arabia abdicates the throne."], ["1964-03-28T00:00:00", "Radio Caroline becomes the United Kingdom's first \"Pirate\" radio station, broadcasting from a ship anchored just outside UK territorial waters on the east coast."], ["1964-04-04T00:00:00", "The Beatles hold the top 5 positions in the Billboard Top 40 singles in America, an unprecedented achievement. The top songs in America as listed on April 4, in order, are: Can't Buy Me Love, Twist and Shout, She Loves You, I Want to Hold Your Hand, and Please Please Me."], ["1964-04-04T00:00:00", "Three high school friends in Hoboken, N.J., open the first Blimpie on Washington Street."], ["1964-04-08T00:00:00", "Four of 5 railroad operating unions strike against the Illinois Central Railroad without warning, bringing to a head a 5-year dispute over railroad work rules."], ["1964-04-08T00:00:00", "Gemini 1 is launched, the first unmanned test of the 2-man spacecraft."], ["1964-04-08T00:00:00", "From Russia with Love premiers in U.S. movie theaters."], ["1964-04-13T00:00:00", "The 36th Academy Awards ceremony is held."], ["1964-04-13T00:00:00", "Sidney Poitier is the first African-American to win an Academy Award in the category Best Actor in a Leading Role in Lilies of the Field."], ["1964-04-16T00:00:00", "The Rolling Stones release their debut album, The Rolling Stones."], ["1964-04-16T00:00:00", "Sentences totaling 307 years are passed on 12 men who stole £2.6m in used bank notes, after holding up the night mail train traveling from Glasgow to London in August 1963 – a heist that became known as the Great Train Robbery."], ["1964-04-17T00:00:00", "In the United States, the Ford Mustang is officially unveiled to the public."], ["1964-04-17T00:00:00", "Shea Stadium opens in Flushing, New York."], ["1964-04-20T00:00:00", "U.S. President Lyndon Johnson in New York, and Soviet Premier Nikita Khrushchev in Moscow, simultaneously announce plans to cut back production of materials for making nuclear weapons."], ["1964-04-20T00:00:00", "Nelson Mandela makes his \"I Am Prepared to Die\" speech at the opening of the Rivonia Trial, a key event for the anti-apartheid movement."], ["1964-04-20T00:00:00", "BBC2 starts broadcasting in the UK."], ["1964-04-22T00:00:00", "British businessman Greville Wynne, imprisoned in Moscow since 1963 for spying, is exchanged for Soviet spy Gordon Lonsdale."], ["1964-05-02T00:00:00", "Senator Barry Goldwater receives more than 75% of the votes in the Texas Republican Presidential primary."], ["1964-05-02T00:00:00", "Some 400–1,000 students march through Times Square, New York and another 700 in San Francisco, in the first major student demonstration against the Vietnam War. Smaller marches also occur in Boston, Seattle, and Madison, Wisconsin."], ["1964-05-02T00:00:00", "Henry Hezekiah Dee and Charles Eddie Moore, hitchhiking in Meadville, Mississippi, are kidnapped and beaten by members of the Ku Klux Klan. Their badly decomposed bodies are found by chance 2 months later in July, during the search for 3 civil rights workers – Chaney, Goodman, and Schwerner."], ["1964-05-07T00:00:00", "Pacific Air Lines Flight 773 crashes near San Ramon, California, killing all 44 aboard; the FBI later reports that a cockpit recorder tape indicates that the pilot and co-pilot had been shot by a suicidal passenger."], ["1964-05-07T00:00:00", "At a mail rockets demonstration by Gerhard Zucker on Hasselkopf Mountain near Braunlage (Lower Saxonia, Germany), 3 persons are killed by a rocket explosion."], ["1964-05-23T00:00:00", "Mrs. Madeline Dassault, 63, wife of a French plane manufacturer and politician, is kidnapped while leaving her car in front of her Paris home; she is found unharmed the next day in a farmhouse 27 miles (43 km) from Paris."], ["1964-05-23T00:00:00", "Pablo Picasso paints his fourth Head of a Bearded Man."], ["1964-06-02T00:00:00", "Senator Barry Goldwater wins the California Republican Presidential primary, making him the overwhelming favorite for the nomination."], ["1964-06-02T00:00:00", "Five million shares of stock in the Communications Satellite Corporation (Comsat) are offered for sale at $20 a share, and the issue is quickly sold out."], ["1964-06-11T00:00:00", "Greece rejects direct talks with Turkey over Cyprus."], ["1964-06-11T00:00:00", "In Cologne, Germany, Walter Seifert attacks students and teachers in an elementary school with a flamethrower, killing 10 and injuring 21."], ["1964-06-12T00:00:00", "Pennsylvania Governor William Scranton announces his candidacy for the Republican Presidential nomination, as part of a 'stop-Goldwater' movement."], ["1964-06-12T00:00:00", "Nelson Mandela and 7 others are sentenced to life imprisonment in South Africa, and sent to the Robben Island prison."], ["1964-06-21T00:00:00", "Three civil rights workers, Michael Schwerner, Andrew Goodman, and James Chaney, are murdered near Philadelphia, Mississippi, by local Klansmen and a deputy sheriff."], ["1964-06-21T00:00:00", "Spain beats the Soviet Union 2–1 to win the 1964 European Nations Cup."], ["1964-06-21T00:00:00", "Jim Bunning pitches a perfect game for the Philadelphia Phillies, the first in the National League since 1880."], ["1964-07-18T00:00:00", "Six days of race riots begin in Harlem."], ["1964-07-18T00:00:00", "Judith Graham Pool publishes her discovery of cryoprecipitate, a frozen blood clotting product made from plasma primarily to treat hemophiliacs around the world."], ["1964-07-18T00:00:00", "\"False Hare\" is the final Warner Bros. cartoon with \"target\" titles."], ["1964-07-20T00:00:00", "Vietnam War: Viet Cong forces attack a provincial capital, killing 11 South Vietnamese military personnel and 40 civilians (30 of which are children)."], ["1964-07-20T00:00:00", "The National Movement of the Revolution is instituted as the sole legal political party in the Republic of the Congo."], ["1964-07-24T00:00:00", "There is a minor criticality accident at a United Nuclear Corporation Fuels recovery plant in Wood River Junction, Richmond, Rhode Island. 37-year-old Robert Peabody dies two days after the incident."], ["1964-08-01T00:00:00", "The Final Looney Tune, \"Señorella and the Glass Huarache\", is released before the Warner Bros. Cartoon Division is shut down by Jack Warner."], ["1964-08-01T00:00:00", "Emancipation Day in Barbados, Bermuda, Guyana, St. Vincent and the Grenadines, Trinidad and Tobago, Turks and Caicos Islands, and Jamaica – celebration of the end of slavery in these former and continuing British colonies in the Caribbean."], ["1964-08-04T00:00:00", "American civil rights movement: The bodies of murdered civil rights workers Michael Schwerner, Andrew Goodman and James Chaney are found."], ["1964-08-04T00:00:00", "Vietnam War: United States destroyers USS Maddox and USS Turner Joy are attacked in the Gulf of Tonkin. Air support from the carrier USS Ticonderoga sinks one gunboat, while the other two leave the battle."], ["1964-08-05T00:00:00", "Vietnam War: Operation Pierce Arrow – Aircraft from carriers USS Ticonderoga and USS Constellation bomb North Vietnam in retaliation for strikes against U.S. destroyers in the Gulf of Tonkin."], ["1964-08-05T00:00:00", "The Simba rebel army in the Democratic Republic of the Congo captures Stanleyville, and takes 1,000 Western hostages."], ["1964-08-22T00:00:00", "Fannie Lou Hamer, civil rights activist and Vice Chair of the Mississippi Freedom Democratic Party, addresses the Credentials Committee of the Democratic National Convention, challenging the all-white Mississippi delegation."], ["1964-08-22T00:00:00", "Goalkeeper Derek Foster of Sunderland becomes the youngest-ever player to play in the Football League, aged 15 years and 185 days."], ["1964-09-10T00:00:00", "The African Development Bank (AfDB) is founded."], ["1964-09-11T00:00:00", "In Jacksonville, Florida, John Lennon announces that the Beatles will not play to a segregated audience."], ["1964-09-14T00:00:00", "The third period of the Second Vatican Council opens."], ["1964-09-14T00:00:00", "The London Daily Herald ceases publication, replaced by The Sun."], ["1964-09-17T00:00:00", "Goldfinger opens in the UK."], ["1964-09-17T00:00:00", "Bewitched, starring Elizabeth Montgomery, premieres on ABC."], ["1964-09-21T00:00:00", "The island of Malta obtains independence from the United Kingdom."], ["1964-09-21T00:00:00", "The North American XB-70 Valkyrie makes its first flight at Palmdale, California."], ["1964-10-01T00:00:00", "Three thousand student activists at University of California, Berkeley, surround and block a police car from taking a CORE volunteer arrested for not showing his ID, when he violated a ban on outdoor activist card tables. This protest eventually explodes into the Berkeley Free Speech Movement."], ["1964-10-01T00:00:00", "The Shinkansen high-speed rail system, the world's first such system, is inaugurated in Japan, for the first sector between Tokyo and Osaka."], ["1964-10-05T00:00:00", "Twenty-three men and thirty-one women escape to West Berlin through a narrow tunnel under the Berlin Wall."], ["1964-10-05T00:00:00", "Elizabeth II and The Duke of Edinburgh begin an 8-day visit to Canada."], ["1964-10-15T00:00:00", "The Labour Party wins the parliamentary elections in the United Kingdom, ending 13 years of Conservative Party rule. The new prime minister is Harold Wilson."], ["1964-10-15T00:00:00", "Craig Breedlove's jet-powered car Spirit of America goes out of control in Bonneville Salt Flats in Utah and makes skid marks 9.6 km long."], ["1964-10-16T00:00:00", "Harold Wilson becomes British Prime Minister after leading the Labour Party to a narrow election win over the Tory government of Sir Alec Douglas-Home, which had been in power for 13 years and had four different leaders during that time."], ["1964-10-16T00:00:00", "596: The People's Republic of China explodes an atomic bomb in Sinkiang."], ["1964-10-22T00:00:00", "Canada: A Federal Multi-Party Parliamentary Committee selects a design to become the new official Flag of Canada."], ["1964-10-22T00:00:00", "A 5.3 kiloton nuclear device is detonated at the Tatum Salt Dome, 21 miles (34 km) from Hattiesburg, Mississippi as part of the Vela Uniform program. This test is the Salmon phase of the Atomic Energy Commission's Project Dribble."], ["1964-11-03T00:00:00", "United States presidential election, 1964: Incumbent President Lyndon B. Johnson defeats Republican challenger Barry Goldwater with over 60 percent of the popular vote."], ["1964-11-03T00:00:00", "The Bolivian government of President Víctor Paz Estenssoro is overthrown by a military rebellion led by General Alfredo Ovando Candía, commander-in-chief of the armed forces."], ["1964-11-21T00:00:00", "Second Vatican Council: The third period of the Catholic Church's ecumenical council closes."], ["1964-11-21T00:00:00", "The Verrazano–Narrows Bridge opens to traffic (the world's longest suspension bridge at this time)."], ["1964-11-28T00:00:00", "Mariner program: NASA launches the Mariner 4 space probe from Cape Kennedy toward Mars to take television pictures of that planet in July 1965."], ["1964-11-28T00:00:00", "Vietnam War: United States National Security Council members, including Robert McNamara, Dean Rusk, and Maxwell Taylor, agree to recommend a plan for a 2-stage escalation of bombing in North Vietnam, to President Lyndon B. Johnson."], ["1964-11-28T00:00:00", "France performs an underground nuclear test at Ecker, Algeria."], ["1964-12-01T00:00:00", "Gustavo Díaz Ordaz takes office as President of Mexico."], ["1964-12-01T00:00:00", "Vietnam War: U.S. President Lyndon B. Johnson and his top-ranking advisers meet to discuss plans to bomb North Vietnam (after some debate, they agree on a 2-phase bombing plan)."], ["1964-12-03T00:00:00", "Berkeley Free Speech Movement: Police arrest about 800 students at the University of California, Berkeley, following their takeover of and massive sit-in at the Sproul Hall administration building. The sit-in most directly protested the U.C. Regents' decision to punish student activists for what many thought had been justified civil disobedience earlier in the conflict."], ["1964-12-03T00:00:00", "The Danish football club Brøndby IF was founded as a merger between the two local clubs Brøndbyøster Idrætsforening and Brøndbyvester Idrætsforening. The club has won the national championship Danish Superliga 10 times, and has won the national Danish Cups six times since the club joined the Danish top-flight football league in 1981."], ["1964-12-18T00:00:00", "In the wake of deadly riots in January over control of the Panama Canal, the U.S. offers to negotiate a new canal treaty."], ["1964-12-18T00:00:00", "The deadly Christmas flood of 1964 begins; It becomes one of the most destructive weather events to affect Oregon in the 20th century."], ["1964-12-21T00:00:00", "The James Bond film Goldfinger begins its run in U.S. theaters. It becomes one of the most successful and popular Bond films ever made."], ["1964-12-21T00:00:00", "The General Dynamics F-111 Aardvark makes its first flight."], ["1964-12-22T00:00:00", "Comedian Lenny Bruce is sentenced to 4 months in prison, concluding a 6-month obscenity trial."], ["1964-12-22T00:00:00", "A cyclone in the Palk Strait destroys the Indian town of Dhanushkodi, killing 1800 people."], ["1964-12-22T00:00:00", "The Lockheed SR-71 Blackbird makes its first flight at Palmdale, California."], ["1964-01-06T00:00:00", "Colin Cowherd, American talk show host"], ["1964-01-06T00:00:00", "Henry Maske, German boxer"], ["1964-01-06T00:00:00", "Jacqueline DeLois Moore, American wrestler"], ["1964-01-06T00:00:00", "Rafael Vidal, Venezuelan swimmer and sports commentator (d. 2005)"], ["1964-01-13T00:00:00", "Penelope Ann Miller, American actress"], ["1964-01-13T00:00:00", "Bill Bailey, British comedian"], ["1964-01-17T00:00:00", "Michelle Fairley, Northern Irish actress"], ["1964-01-17T00:00:00", "Michelle Obama, First Lady of the United States"], ["1964-01-23T00:00:00", "Mariska Hargitay, American actress"], ["1964-01-23T00:00:00", "Kelly Parsons, American actress and model"], ["1964-02-05T00:00:00", "Laura Linney, American actress"], ["1964-02-05T00:00:00", "Duff McKagan, American rock musician, songwriter"], ["1964-02-10T00:00:00", "Glenn Beck, American conservative broadcaster"], ["1964-02-10T00:00:00", "John Campbell, New Zealand broadcaster"], ["1964-02-11T00:00:00", "Sarah Palin, American politician, former Governor of Alaska"], ["1964-02-11T00:00:00", "Ken Shamrock, American mixed martial arts fighter"], ["1964-02-15T00:00:00", "Chris Farley, American actor and comedian (d. 1997)"], ["1964-02-15T00:00:00", "Mark Price, American basketball player"], ["1964-02-16T00:00:00", "Bebeto, Brazilian footballer"], ["1964-02-16T00:00:00", "Christopher Eccleston, British actor"], ["1964-02-19T00:00:00", "Jonathan Lethem, American author"], ["1964-02-19T00:00:00", "Richard A. Scott, American illustrator"], ["1964-02-24T00:00:00", "Todd Field, American actor and director"], ["1964-02-24T00:00:00", "Ute Geweniger, German swimmer"], ["1964-03-04T00:00:00", "Paul Bostaph, American drummer"], ["1964-03-04T00:00:00", "Tom Lampkin, American baseball player"], ["1964-03-07T00:00:00", "Bret Easton Ellis, American author"], ["1964-03-07T00:00:00", "Vladimir Smirnov, Kazakh cross-country skier"], ["1964-03-07T00:00:00", "Wanda Sykes, African-American comedian and actress"], ["1964-03-09T00:00:00", "Juliette Binoche, French actress"], ["1964-03-09T00:00:00", "Steve Wilkos, American retired police officer; talk show host"], ["1964-03-10T00:00:00", "Prince Edward, Earl of Wessex, British prince and third son (youngest child) of Elizabeth II and The Duke of Edinburgh"], ["1964-03-16T00:00:00", "Pascal Richard, Swiss road bicycle racer"], ["1964-03-16T00:00:00", "Gore Verbinski, American film director"], ["1964-03-18T00:00:00", "Bonnie Blair, American speed skater"], ["1964-03-18T00:00:00", "Mika Kanai, Japanese voice actress"], ["1964-03-18T00:00:00", "Rozalla, Zambian singer"], ["1964-03-19T00:00:00", "Yoko Kanno, Japanese composer"], ["1964-03-19T00:00:00", "Jake Weber, English actor"], ["1964-03-20T00:00:00", "Michael Keith Smith, American bass player and builder"], ["1964-03-25T00:00:00", "Lisa Gay Hamilton, American actress"], ["1964-03-25T00:00:00", "Vince Offer, American writer, director, comedian and pitchman"], ["1964-03-26T00:00:00", "Martin Donnelly, Northern Irish racecar driver"], ["1964-03-26T00:00:00", "Ed Wasser, American actor"], ["1964-03-29T00:00:00", "Ming Tsai, Chinese-American chef"], ["1964-03-29T00:00:00", "Michael A. Jackson, former sheriff of Prince George's County, Maryland"], ["1964-03-30T00:00:00", "Tracy Chapman, African-American singer"], ["1964-03-30T00:00:00", "Sigurd Haveland, Gibraltarian triathlete and cyclist"], ["1964-03-31T00:00:00", "David Wyman (American football), Former American football player"], ["1964-04-03T00:00:00", "Nigel Farage, British politician and MEP, head of UK Independence Party (UKIP)"], ["1964-04-03T00:00:00", "Bjarne Riis, Danish cyclist"], ["1964-04-07T00:00:00", "Russell Crowe, New Zealand-born actor"], ["1964-04-07T00:00:00", "Steve Graves, Canadian ice hockey player"], ["1964-04-14T00:00:00", "Takumi Yamazaki, Japanese voice actress"], ["1964-04-20T00:00:00", "Crispin Glover, American actor"], ["1964-04-20T00:00:00", "Andy Serkis, British actor"], ["1964-04-25T00:00:00", "Hank Azaria, American actor"], ["1964-04-25T00:00:00", "Andy Bell, English singer and songwriter"], ["1964-04-29T00:00:00", "Federico Castelluccio, Italian-born actor"], ["1964-04-29T00:00:00", "Radek Jaroš, Czech mountaineer"], ["1964-05-05T00:00:00", "Heike Henkel, German high jumper"], ["1964-05-05T00:00:00", "Minami Takayama, Japanese voice actress and singer (Two-Mix & DoCo)"], ["1964-05-07T00:00:00", "Doug Benson, American comedian"], ["1964-05-07T00:00:00", "Ronnie Harmon, American football player"], ["1964-05-07T00:00:00", "Leslie O'Neal, American football player"], ["1964-05-08T00:00:00", "Melissa Gilbert, American actress and president of the Screen Actors Guild"], ["1964-05-08T00:00:00", "Bobby Labonte, American race car driver"], ["1964-05-26T00:00:00", "Caitlín R. Kiernan, American author and paleontologist"], ["1964-05-26T00:00:00", "Lenny Kravitz, American guitarist and singer"], ["1964-06-05T00:00:00", "Dukagjin Pupovci, Kosovo Albanian professor"], ["1964-06-05T00:00:00", "Rick Riordan, American author"], ["1964-06-07T00:00:00", "Gia Carides, Greek-Australian actress"], ["1964-06-07T00:00:00", "Petr Hruška, Czech poet"], ["1964-06-13T00:00:00", "Lance Mountain, American skateboarder"], ["1964-06-15T00:00:00", "Courteney Cox, American actress"], ["1964-06-15T00:00:00", "Michael Laudrup, Danish footballer and manager"], ["1964-06-22T00:00:00", "Amy Brenneman, American actress"], ["1964-06-22T00:00:00", "Dan Brown, American author"], ["1964-07-03T00:00:00", "Joanne Harris, English novelist"], ["1964-07-03T00:00:00", "Yeardley Smith, American voice actress"], ["1964-07-16T00:00:00", "Andy Abraham, British singer"], ["1964-07-16T00:00:00", "Miguel Indurain, Spanish cyclist"], ["1964-07-22T00:00:00", "Adam Godley, British actor"], ["1964-07-22T00:00:00", "Bonnie Langford, British actress"], ["1964-07-22T00:00:00", "John Leguizamo, Colombian-American actor"], ["1964-07-22T00:00:00", "David Spade, American comedian, actor and television personality"], ["1964-07-26T00:00:00", "Sandra Bullock, American actress"], ["1964-07-26T00:00:00", "Anne Provoost, Belgian author"], ["1964-07-30T00:00:00", "Vivica A. Fox, American actress"], ["1964-07-30T00:00:00", "Jürgen Klinsmann, German footballer-manager"], ["1964-08-03T00:00:00", "Lucky Dube, South African reggae musician (d. 2007)"], ["1964-08-03T00:00:00", "Ye Qiaobo, Chinese speed skater"], ["1964-08-03T00:00:00", "Abhisit Vejjajiva, Thai former Prime Minister"], ["1964-08-05T00:00:00", "Adam Yauch, American rapper (Beastie Boys) (d. 2012)"], ["1964-08-06T00:00:00", "Gary Conrad, American animator"], ["1964-08-06T00:00:00", "Gary Valenciano, Filipino musician"], ["1964-08-08T00:00:00", "Nina Hoekman, Dutch draughts players (d. 2014)"], ["1964-08-09T00:00:00", "Brett Hull, Canadian hockey player"], ["1964-08-09T00:00:00", "William Martens, American computer engineer"], ["1964-08-10T00:00:00", "Hiro Takahashi, Japanese singer (d. 2005)"], ["1964-08-22T00:00:00", "Diane Setterfield, British author"], ["1964-08-22T00:00:00", "Mats Wilander, Swedish tennis player"], ["1964-08-26T00:00:00", "Dave Boyes, Canadian male rower"], ["1964-08-26T00:00:00", "Kevin Burns, American politician"], ["1964-08-26T00:00:00", "Allegra Huston, English-American author"], ["1964-08-26T00:00:00", "Bobby Jurasin, Canadian football defensive lineman"], ["1964-08-26T00:00:00", "Chad Kreuter, Major League Baseball catcher"], ["1964-08-26T00:00:00", "Zadok Malka, Israeli footballer"], ["1964-08-26T00:00:00", "Torsten Schmitz, German boxer"], ["1964-08-26T00:00:00", "Carsten Wolf, German male cyclist"], ["1964-09-02T00:00:00", "Andrea Illy, Italian businessman"], ["1964-09-02T00:00:00", "Keanu Reeves, Canadian actor-musician"], ["1964-09-04T00:00:00", "Anthony Weiner, U.S. Representative for New York's 9th congressional district"], ["1964-09-08T00:00:00", "Michael Johns, American health care executive and Presidential speechwriter"], ["1964-09-08T00:00:00", "Raven, American professional wrestler"], ["1964-09-19T00:00:00", "Trisha Yearwood, American country singer"], ["1964-09-22T00:00:00", "Ian Culverhouse, English footballer"], ["1964-09-22T00:00:00", "Juha Turunen, Finnish politician turned criminal"], ["1964-09-25T00:00:00", "Kikuko Inoue, Japanese singer and voice actress"], ["1964-09-30T00:00:00", "Trey Anastasio, American musician"], ["1964-09-30T00:00:00", "Monica Bellucci, Italian actress and model"], ["1964-10-02T00:00:00", "Dirk Brinkmann, German field hockey player"], ["1964-10-02T00:00:00", "Makharbek Khadartsev, Russian free-style wrestler"], ["1964-10-13T00:00:00", "Masaya Onosaka, Japanese voice actor"], ["1964-10-14T00:00:00", "Joe Girardi, American baseball player-manager"], ["1964-10-14T00:00:00", "David Kaye, Canadian voice actor"], ["1964-10-14T00:00:00", "Jim Rome, American sports T.V. and radio host"], ["1964-10-18T00:00:00", "John Swasey, American voice actor"], ["1964-10-19T00:00:00", "Jorge Luis González, Cuban boxer"], ["1964-10-19T00:00:00", "Ty Pennington, American carpenter, model and television personality"], ["1964-10-22T00:00:00", "Dražen Petrović, Croatian basketball player (d. 1993)"], ["1964-10-22T00:00:00", "TobyMac, American-born Christian musician"], ["1964-10-24T00:00:00", "Rosana Arbelo, Spanish singer and composer"], ["1964-10-24T00:00:00", "Paul Bonwick, Canadian House of Commons member"], ["1964-11-04T00:00:00", "Kurt Krakowian, American child actor"], ["1964-11-04T00:00:00", "Douglas Wilson, American television personality and interior designer"], ["1964-11-10T00:00:00", "Kenny Rogers, American baseball player"], ["1964-11-10T00:00:00", "Magnús Scheving, Icelandic producer"], ["1964-11-14T00:00:00", "Rev Run, African-American rapper (Run–D.M.C.)"], ["1964-11-14T00:00:00", "Patrick Warburton, American actor"], ["1964-11-18T00:00:00", "Rita Cosby, American television personality"], ["1964-11-18T00:00:00", "Seth Joyner, African-American football player"], ["1964-11-19T00:00:00", "Fred Diamond, 21st mathematician-century American"], ["1964-11-19T00:00:00", "Mike Gregory, English rugby player and coach (d. 2007)"], ["1964-11-19T00:00:00", "Shawn Holman, American baseball player"], ["1964-11-19T00:00:00", "Phil Hughes, Irish footballer and coach"], ["1964-11-19T00:00:00", "Eric Musselman, Sacramento Kings head coach"], ["1964-11-19T00:00:00", "Nicholas Patrick, English astronaut"], ["1964-11-19T00:00:00", "Peter Rohde, Carlton Football Club player"], ["1964-11-24T00:00:00", "Garret Dillahunt, American actor"], ["1964-11-24T00:00:00", "Alistair McGowan, British actor and comedian"], ["1964-11-28T00:00:00", "Giorgi Bagaturov, Georgian-Armenian chess grandmaster"], ["1964-11-28T00:00:00", "Michael Bennet, American lawyer, businessman and politician"], ["1964-11-28T00:00:00", "Jorge Capitanich, Argentine politician"], ["1964-11-28T00:00:00", "Ken Charlery, St Lucian international footballer"], ["1964-11-28T00:00:00", "Naoto Hori, Japanese football player"], ["1964-11-28T00:00:00", "Paul Kostacopoulos, American college baseball coach"], ["1964-11-28T00:00:00", "Eugene Licorish, Grenadian long jumper"], ["1964-11-28T00:00:00", "Michelle McKormick, American talk radio personality"], ["1964-11-28T00:00:00", "Oscar Muñoz, Colombian wrestler"], ["1964-11-28T00:00:00", "Zurab Sturua, Georgian chess grandmaster"], ["1964-11-28T00:00:00", "Roy Tarpley, American former professional basketball player"], ["1964-11-28T00:00:00", "Craig Wilson, American professional baseball player"], ["1964-11-29T00:00:00", "Don Cheadle, African-American actor"], ["1964-11-29T00:00:00", "Cork Graham, American author"], ["1964-12-04T00:00:00", "Sertab Erener, Turkish singer-songwriter, Eurovision Song Contest 2003 winner"], ["1964-12-04T00:00:00", "Marisa Tomei, American actress"], ["1964-12-07T00:00:00", "Roberta Close, Brazilian transgender model"], ["1964-12-07T00:00:00", "Curtis Hughes, American wrestler"], ["1964-12-07T00:00:00", "Peter Laviolette, American ice hockey coach"], ["1964-12-09T00:00:00", "Larry Emdur, Australian game-show host"], ["1964-12-09T00:00:00", "Paul Landers, German rock musician (Rammstein)"], ["1964-12-09T00:00:00", "Hape Kerkeling, German actor, presenter and comedian"], ["1964-12-10T00:00:00", "Bobby Flay, American chef and host"], ["1964-12-10T00:00:00", "Edith González, Mexican actress"], ["1964-12-14T00:00:00", "Rebecca Gibney, New Zealand-born actress"], ["1964-12-14T00:00:00", "Antje Vowinckel, German radio artist and musician"], ["1964-12-16T00:00:00", "Heike Drechsler, German track-and-field athlete"], ["1964-12-16T00:00:00", "Billy Ripken, American baseball player"], ["1964-12-22T00:00:00", "Mike Jackson, former MLB pitcher"], ["1964-12-26T00:00:00", "Elizabeth Kostova, American author"], ["1964-12-29T00:00:00", "Michael Cudlitz, American actor"], ["1964-12-30T00:00:00", "George Newbern, American actor"], ["1964-12-30T00:00:00", "Sophie Ward, British actress"], ["1964-12-31T00:00:00", "Michael McDonald, American actor and comedian"], ["1964-01-15T00:00:00", "Tawfiq Canaan, Palestinian doctor (b. 1882)"], ["1964-01-15T00:00:00", "Jack Teagarden, American jazz trombonist (b. 1905)"], ["1964-01-27T00:00:00", "Norman Z. McLeod, American film director (b. 1898)"], ["1964-01-27T00:00:00", "Waite Phillips, American oil man, banker and real estate investor (b. 1883)"], ["1964-02-08T00:00:00", "Boshirō Hosogaya, Japanese admiral (b. 1888)"], ["1964-02-08T00:00:00", "Ernst Kretschmer, German psychiatrist (b. 1888)"], ["1964-02-12T00:00:00", "Gerald Gardner (Wiccan), founder of Wiccan religion (b. 1884)"], ["1964-02-25T00:00:00", "Johnny Burke, American lyricist (b. 1908)"], ["1964-02-25T00:00:00", "Maurice Farman, French aircraft designer (b. 1877)"], ["1964-02-25T00:00:00", "Grace Metalious, American writer (b. 1924)"], ["1964-03-06T00:00:00", "Paul of Greece, King of Greece (b. 1901)"], ["1964-03-06T00:00:00", "Edward Van Sloan, American actor (b. 1882)"], ["1964-03-13T00:00:00", "Friedrich Lahrs, German architect (b. 1880)"], ["1964-03-18T00:00:00", "Sigfrid Edström, Swedish sports official (b. 1870)"], ["1964-03-18T00:00:00", "Norbert Wiener, American mathematician (b. 1894)"], ["1964-05-17T00:00:00", "Steve Owen, American football coach (New York Giants) and a member of the Pro Football Hall of Fame (b. 1898)"], ["1964-05-30T00:00:00", "Dave MacDonald, sports car driver (b. 1936)"], ["1964-05-30T00:00:00", "Eddie Sachs, auto racing driver (b. 1927)"], ["1964-05-30T00:00:00", "Leó Szilárd, Hungarian-American physicist (b. 1898)"], ["1964-06-07T00:00:00", "Violet Attlee, Countess Attlee, wife of former British PM Clement Attlee (b. 1895)"], ["1964-06-07T00:00:00", "Charlie Llewellyn, first non-white South African Test cricketer (b. 1876)"], ["1964-06-21T00:00:00", "James Chaney, African-American civil rights activist (killed in Mississippi) (b. 1943)"], ["1964-06-21T00:00:00", "Andrew Goodman, American civil rights activist (killed in Mississippi) (b. 1943)"], ["1964-06-21T00:00:00", "Michael Schwerner, American civil rights activist (killed in Mississippi) (b. 1939)"], ["1964-08-12T00:00:00", "Ian Fleming, British writer (b. 1908)"], ["1964-08-12T00:00:00", "Ernst Kühnel, German art historian (b. 1882)"], ["1964-08-12T00:00:00", "Dmitry Dmitrievich Maksutov, Russian astronomer and inventor (b. 1896)"], ["1964-09-02T00:00:00", "Glenn Albert Black, American archaeologist (b. 1900)"], ["1964-09-02T00:00:00", "Francisco Craveiro Lopes, President of Portugal (b. 1894)"], ["1964-09-02T00:00:00", "Alvin Cullum York, American hero of World War I (b. 1887)"], ["1964-09-18T00:00:00", "Clive Bell, English art critic (b. 1881)"], ["1964-09-18T00:00:00", "Seán O'Casey, Irish writer (b. 1880)"], ["1964-09-28T00:00:00", "Nacio Herb Brown, American songwriter (b. 1896)"], ["1964-09-28T00:00:00", "Harpo Marx, American comedian (Marx Brothers) (b. 1888)"], ["1964-10-27T00:00:00", "Pierre Cartier, French jeweller (b. 1878)"], ["1964-10-27T00:00:00", "Rudolph Maté, Polish cinematographer (b. 1898)"], ["1964-11-05T00:00:00", "Mabel Lucie Attwell, British illustrator (b. 1879)"], ["1964-11-05T00:00:00", "John S. Robertson, Canadian film director (b. 1878)"], ["1964-12-11T00:00:00", "Sam Cooke, African-American singer and songwriter (b. 1931)"], ["1964-12-11T00:00:00", "Percy Kilbride, American actor (b. 1888)"], ["1964-12-11T00:00:00", "Alma Schindler Mahler, wife of Gustav Mahler (b. 1879)"], ["1964-12-14T00:00:00", "William Bendix, American actor (b. 1906)"], ["1964-12-14T00:00:00", "Francisco Canaro, Uruguayan-born composer (b. 1888)"], ["1964-12-31T00:00:00", "Gertrude Michael, American actress (b. 1911)"], ["1964-12-31T00:00:00", "Ólafur Thors, Prime Minister of Iceland (b. 1892)"]]