[["1993-01-01T00:00:00", "Dissolution of Czechoslovakia: The Czech Republic and Slovakia separate in the so-called Velvet Divorce."], ["1993-01-01T00:00:00", "The European Economic Community eliminates trade barriers and creates a European single market."], ["1993-01-01T00:00:00", "British ITV companies GMTV, Carlton Television, Meridian Broadcasting and Westcountry Television start broadcasting, replacing TV-am, Thames Television, TVS and TSW respectively."], ["1993-01-03T00:00:00", "In Moscow, Presidents George H. W. Bush (United States) and Boris Yeltsin (Russia) sign the second Strategic Arms Reduction Treaty."], ["1993-01-03T00:00:00", "The third Star Trek TV series Deep Space Nine premieres in syndication."], ["1993-01-05T00:00:00", "The state of Washington executes Westley Allan Dodd by hanging (the first judicial hanging in America since 1965)."], ["1993-01-05T00:00:00", "US$7.4 million is stolen from the Brink's Armored Car Depot in Rochester, New York in the 5th largest robbery in U.S. history. Four men, Samuel Millar, Father Patrick Moloney, former Rochester Police officer Thomas O'Connor, and Charles McCormick, all of whom have ties to the Provisional Irish Republican Army, are accused."], ["1993-01-05T00:00:00", "MV Braer, a Liberian-registered oil tanker, runs aground off the Scottish island of Mainland, Shetland, causing a massive oil spill."], ["1993-01-19T00:00:00", "The Chemical Weapons Convention (CWC) is signed."], ["1993-01-19T00:00:00", "IBM announces a $4.97 billion loss for 1992, the largest single-year corporate loss in United States history to date."], ["1993-01-19T00:00:00", "Iraq disarmament crisis: Iraq refuses to allow UNSCOM inspectors to use its own aircraft to fly into Iraq, and begins military operations in the demilitarized zone between Iraq and Kuwait, and the northern Iraqi no-fly zones. U.S. forces fire approximately 40 Tomahawk cruise missiles at Baghdad factories linked to Iraq's illegal nuclear weapons program. Iraq then informs UNSCOM that it will be able to resume its flights."], ["1993-01-25T00:00:00", "Mir Aimal Kasi fires a rifle and kills two employees outside Central Intelligence Agency headquarters in Langley, Virginia."], ["1993-01-25T00:00:00", "Social Democrat Poul Nyrup Rasmussen succeeds Conservative Poul Schlüter as Prime Minister of Denmark."], ["1993-01-25T00:00:00", "The Russian space station Mir boasts the first art exhibition in outer space."], ["1993-02-10T00:00:00", "Lien Chan is named by Lee Teng-hui to succeed Hau Pei-tsun as Premier of the Republic of China."], ["1993-02-10T00:00:00", "Mani pulite scandal: Italian legislator Claudio Martelli resigns, followed by various politicians over the next 2 weeks."], ["1993-02-14T00:00:00", "Glafcos Clerides defeats incumbent George Vasiliou in the Cypriot presidential election."], ["1993-02-14T00:00:00", "Albert Zafy defeats Didier Ratsiraka in the Madagascar presidential election."], ["1993-03-12T00:00:00", "1993 Bombay bombings: Several bombs explode in Bombay, India, killing 257 and injuring hundreds more."], ["1993-03-12T00:00:00", "North Korea nuclear weapons program: North Korea announces that it plans to withdraw from the Nuclear Nonproliferation Treaty and refuses to allow inspectors access to nuclear sites."], ["1993-03-24T00:00:00", "The Israeli Knesset elects Ezer Weizman as President of Israel."], ["1993-03-24T00:00:00", "South Africa officially abandons its nuclear weapons programme. President de Klerk announces that the country's 6 warheads had already been dismantled in 1989."], ["1993-03-27T00:00:00", "Jiang Zemin becomes President of the People's Republic of China."], ["1993-03-27T00:00:00", "Following a rash of integrist murders, Algeria breaks diplomatic relations with Iran, accusing the country of interfering in its interior affairs."], ["1993-03-27T00:00:00", "Mahamane Ousmane is elected president of Niger."], ["1993-04-19T00:00:00", "A 51-day stand-off at the Branch Davidian compound near Waco, Texas, ends with a fire that kills 76 people, including David Koresh."], ["1993-04-19T00:00:00", "South Dakota governor George Mickelson and 7 others are killed when a state-owned aircraft crashes near Dubuque, Iowa."], ["1993-04-23T00:00:00", "The World Health Organization declares tuberculosis a Global Emergency."], ["1993-04-23T00:00:00", "Eritreans vote overwhelmingly for independence from Ethiopia in a United Nations-monitored referendum, the Eritrean independence referendum."], ["1993-04-27T00:00:00", "Eritrea: Eritrean independence is declared as a result of a referendum held with United Nations verification."], ["1993-04-27T00:00:00", "Yemeni parliamentary election, 1993: The General People's Congress wins a plurality of 121 seats."], ["1993-04-27T00:00:00", "All members of the Zambia national football team die in a plane crash off Libreville, Gabon en route to Dakar, Senegal."], ["1993-05-01T00:00:00", "Pierre Bérégovoy, former Prime Minister of France, commits suicide."], ["1993-05-01T00:00:00", "A Tamil Tigers suicide bomber assassinates President Ranasinghe Premadasa of Sri Lanka."], ["1993-05-01T00:00:00", "Dingiri Banda Wijetunga became third executive president of Sri Lanka."], ["1993-06-01T00:00:00", "Large protests erupt against Slobodan Milošević's regime in Belgrade; opposition leader Vuk Drašković and his wife Danica are arrested."], ["1993-06-01T00:00:00", "President of Guatemala Jorge Serrano Elías is forced to flee the country after an attempted self-coup."], ["1993-06-01T00:00:00", "Burundian presidential election, 1993: The first multiparty elections in Burundi since the country's independence lead to the election of Melchior Ndadaye, leader of the Front for Democracy in Burundi. The next day's legislative election sees his party win with an overwhelming majority."], ["1993-06-05T00:00:00", "The National Assembly of Venezuela designates Ramón José Velásquez as successor of suspended President Carlos Andrés Pérez."], ["1993-06-05T00:00:00", "24 Pakistani troops in the United Nations forces are killed in Mogadishu, Somalia."], ["1993-06-06T00:00:00", "Following the Revolutionary Nationalist Movement's victory, Gonzalo Sánchez de Lozada becomes president of Bolivia."], ["1993-06-06T00:00:00", "Mongolia holds its first direct presidential elections."], ["1993-06-20T00:00:00", "A 7.5 earthquake hits Japan, killing 385 people."], ["1993-06-20T00:00:00", "John Paxson's 3-point shot in game six of the NBA Finals helps the Chicago Bulls secure a 99–98 win over the Phoenix Suns, and their third consecutive championship."], ["1993-06-24T00:00:00", "A Unabomber bomb injures computer scientist David Gelernter at Yale University."], ["1993-06-24T00:00:00", "Andrew Wiles wins worldwide fame after presenting his proof of Fermat's Last Theorem, a problem that had been unsolved for more than three centuries."], ["1993-06-25T00:00:00", "Kim Campbell becomes the 19th, and first female, Prime Minister of Canada."], ["1993-06-25T00:00:00", "Tansu Çiller of True Path Party forms the new government of Turkey."], ["1993-06-25T00:00:00", "Zoran Lilić succeeds Dobrica Ćosić as President of Yugoslavia."], ["1993-06-25T00:00:00", "The litas is introduced in Lithuania."], ["1993-06-25T00:00:00", "Jacques Attali resigns as President of the European Bank for Reconstruction and Development."], ["1993-06-27T00:00:00", "U.S. President Bill Clinton orders a cruise missile attack on Iraqi intelligence headquarters in the Al-Mansur District of Baghdad, in response to an Iraqi plot to assassinate former U.S. President George H. W. Bush during his visit to Kuwait in mid-April."], ["1993-06-27T00:00:00", "In Bad Kleinen, Germany, GSG 9 troopers arrest Birgit Hogefeld and kill Wolfgang Grams, two Red Army Faction terrorists."], ["1993-07-02T00:00:00", "An integrist mob sets fire to the hotel where The Satanic Verses translator Aziz Nesin resides in Sivas, Turkey, killing 37."], ["1993-07-02T00:00:00", "266 people died after a floating chapel, sank in Bocaue, Bulacan."], ["1993-07-05T00:00:00", "Iraq disarmament crisis: UN inspection teams leave Iraq. Iraq then agrees to UNSCOM demands and the inspection teams return."], ["1993-07-05T00:00:00", "Electrochemist Faiza Al-Kharafi is appointed rector (president) of Kuwait University, the first woman to head a major university in the Middle East."], ["1993-07-19T00:00:00", "Japanese general election, 1993: The loss of majority of the Liberal Democratic Party results in a coalition taking power."], ["1993-07-19T00:00:00", "U.S. President Bill Clinton announces his 'Don't ask, don't tell' policy regarding gays in the American military."], ["1993-07-26T00:00:00", "Miguel Indurain wins the 1993 Tour de France."], ["1993-07-26T00:00:00", "Asiana Airlines Flight 733 crashes into Mt. Ungeo in Haenam, South Korea; 68 die."], ["1993-08-04T00:00:00", "A federal judge sentences Los Angeles Police Department officers Stacey Koon and Laurence Powell to 30 months in prison for violating motorist Rodney King's civil rights."], ["1993-08-04T00:00:00", "The Japanese government issues the Kono Statement, acknowledging the comfort women's (sex slaves) deportation."], ["1993-08-05T00:00:00", "The discovery of the Tel Dan Stele, the first archaeological confirmation of the existence of the Davidic line, is announced."], ["1993-08-05T00:00:00", "Magic: The Gathering undergoes its first general release."], ["1993-09-13T00:00:00", "Norwegian parliamentary election, 1993: The Labour Party wins a plurality of the seats, and Prime Minister Gro Harlem Brundtland retains office."], ["1993-09-13T00:00:00", "PLO leader Yasser Arafat and Israeli prime minister Yitzhak Rabin shake hands in Washington, D.C., after signing a peace accord."], ["1993-09-26T00:00:00", "The first mission in Biosphere 2 ends after two years."], ["1993-09-26T00:00:00", "PoSAT-1 (the first Portuguese satellite) is launched on board French rocket Ariane 4."], ["1993-10-05T00:00:00", "China performs a nuclear test, ending a worldwide de facto moratorium."], ["1993-10-05T00:00:00", "The papal encyclical Veritatis Splendor is promulgated."], ["1993-10-10T00:00:00", "The South Korean ferry Seohae capsizes off Pusan, South Korea; 292 are killed."], ["1993-10-10T00:00:00", "NTV Russia was lanuched."], ["1993-10-13T00:00:00", "Greek legislative election, 1993: Andreas Papandreou begins his second term as Prime Minister of Greece."], ["1993-10-13T00:00:00", "The fifth summit of the Francophonie opens in Mauritius."], ["1993-11-11T00:00:00", "Microsoft releases Windows for Workgroups 3.11 to manufacturing."], ["1993-11-11T00:00:00", "Sri Lankan Civil War – Battle of Pooneryn: Over 400 Sri Lankan military are killed."], ["1993-11-18T00:00:00", "In a status referendum, Puerto Rico residents vote with a slim margin to maintain Commonwealth status."], ["1993-11-18T00:00:00", "In South Africa, 21 political parties approve a new constitution."], ["1993-11-18T00:00:00", "The first meeting of the Asia-Pacific Economic Cooperation summit opens in Seattle."], ["1993-11-20T00:00:00", "Savings and loan crisis: The United States Senate Ethics Committee issues a stern censure of California senator Alan Cranston for his dealings with savings-and-loan executive Charles Keating."], ["1993-11-20T00:00:00", "An Avioimpex Yakovlev Yak-42D crashes into Mount Trojani near Ohrid, Macedonia. The aircraft was on a flight from Geneva, Switzerland to Skopje, but had been diverted to Ohrid due to poor weather conditions at the Skopje airport. All 8 crew members and 115 of the 116 passengers are killed."], ["1993-12-02T00:00:00", "STS-61: NASA launches the Space Shuttle Endeavour on a mission to repair an optical flaw in the Hubble Space Telescope."], ["1993-12-02T00:00:00", "The September 6 merger between Renault and Volvo fails; Volvo CEO Pehr G. Gyllenhammar resigns."], ["1993-12-07T00:00:00", "Colin Ferguson opens fire with his Ruger 9 mm pistol on a Long Island Rail Road train, killing 6 and injuring 19."], ["1993-12-07T00:00:00", "The 32-member Transitional Executive Committee holds its first meeting in Cape Town, marking the first meeting of an official government body in South Africa with Black members."], ["1993-12-07T00:00:00", "President of Côte d'Ivoire Félix Houphouët-Boigny dies at 88, the oldest African head of state. He is succeeded three days later by Henri Konan Bédié."], ["1993-12-11T00:00:00", "Chilean presidential election, 1993: Eduardo Frei Ruiz-Tagle is elected with 58% of the vote."], ["1993-12-11T00:00:00", "A variety of Soviet space program paraphernalia are put to auction in Sotheby's New York, and sell for a total of US$6.8M. One of the items is Lunokhod 1 and its spacecraft Luna 17; they sell for $68,500."], ["1993-12-11T00:00:00", "One of the three blocks of the Highland Towers near Kuala Lumpur, Malaysia comes down, killing 48."], ["1993-12-13T00:00:00", "Prime Minister of Canada Kim Campbell resigns as leader of the Progressive Conservative Party, and is succeeded as leader by Jean Charest."], ["1993-12-13T00:00:00", "The Majilis of Kazakhstan approves the nuclear Non-Proliferation Treaty, and agrees to dismantle the more than 100 missiles left on its territory by the fall of the USSR."], ["1993-12-15T00:00:00", "Downing Street Declaration: The United Kingdom commits itself to the search for an answer to the problems of Northern Ireland."], ["1993-12-15T00:00:00", "The Uruguay Round of General Agreement on Tariffs and Trade (GATT) talks reach a successful conclusion after seven years."], ["1993-12-20T00:00:00", "The United Nations General Assembly votes unanimously to appoint a U.N. High Commissioner for Human Rights."], ["1993-12-20T00:00:00", "The first corrected images from the Hubble Telescope are taken."], ["1993-12-30T00:00:00", "Israel and the Vatican establish diplomatic relations."], ["1993-12-30T00:00:00", "The Congress Party gains a parliamentary majority in India after the defection of 10 Janata Dal party lawmakers."], ["1993-01-01T00:00:00", "Alengot Oromait, Ugandan MP"], ["1993-01-01T00:00:00", "Jon Flanagan, English footballer"], ["1993-01-04T00:00:00", "Aaryn Doyle, Canadian actress and singer"], ["1993-01-04T00:00:00", "Scott Redding, English Grand Prix motorcycle racer"], ["1993-01-12T00:00:00", "D.O., South Korean singer (EXO)"], ["1993-01-12T00:00:00", "Aika Mitsui, Japanese singer"], ["1993-01-12T00:00:00", "Zayn Malik, former member of One Direction"], ["1993-01-25T00:00:00", "Charlene Almarvez, Filipina model"], ["1993-01-25T00:00:00", "Kylie Padilla, Australian-Filipina actress"], ["1993-02-03T00:00:00", "Getter Jaani, Estonian singer"], ["1993-02-03T00:00:00", "Mishon Ratliff, American singer and actor"], ["1993-02-12T00:00:00", "Benik Afobe, English footballer"], ["1993-02-12T00:00:00", "Rafinha, Brazilian football player"], ["1993-02-12T00:00:00", "Jennifer Stone, American actress"], ["1993-02-12T00:00:00", "Kana Yume, Japanese gravure idol, actress and AV idol"], ["1993-02-17T00:00:00", "AJ Perez, Filipino actor (d. 2011)"], ["1993-02-17T00:00:00", "Marc Márquez, Spanish Grand Prix motorcycle racer"], ["1993-02-17T00:00:00", "Philip Wiegratz, German actor"], ["1993-02-19T00:00:00", "Patrick Johnson, American actor"], ["1993-02-19T00:00:00", "Victoria Justice, American actress and singer"], ["1993-03-05T00:00:00", "Bregje Heinen, Dutch model"], ["1993-03-05T00:00:00", "Anna Orlik, Belarusian tennis player"], ["1993-03-11T00:00:00", "Anthony Davis, American basketball player"], ["1993-03-11T00:00:00", "Demi Harman, Australian actress"], ["1993-03-11T00:00:00", "Daisuke Ssegwanyi, Ugandan swimmer"], ["1993-03-15T00:00:00", "Alia Bhatt, Indian actress"], ["1993-03-15T00:00:00", "Alyssa Reid, Canadian singer/songwriter"], ["1993-03-24T00:00:00", "Grace Cassidy, English actress"], ["1993-03-24T00:00:00", "Ryo Ryusei, Japanese actor"], ["1993-04-01T00:00:00", "Blair Fowler, American YouTube beauty guru"], ["1993-04-01T00:00:00", "Keito Okamoto, Japanese singer (Hey! Say! JUMP)"], ["1993-04-14T00:00:00", "Vivien Cardone, American actress"], ["1993-04-14T00:00:00", "Graham Phillips, American actor and singer"], ["1993-04-14T00:00:00", "Josephine Skriver, Danish model"], ["1993-04-16T00:00:00", "Mirai Nagasu, Japanese-American figure skater"], ["1993-04-16T00:00:00", "Chance the Rapper, American rapper"], ["1993-04-22T00:00:00", "Ryu Hwayoung, Korean rapper, dancer, model and actress"], ["1993-04-22T00:00:00", "Ryu Hyoyoung, Korean model, actress and singer"], ["1993-05-09T00:00:00", "Bonnie Rotten, American pornographic actress and model"], ["1993-05-09T00:00:00", "Ryosuke Yamada, Japanese actor and singer"], ["1993-05-10T00:00:00", "Halston Sage, American actress"], ["1993-05-10T00:00:00", "Mirai Shida, Japanese actress"], ["1993-05-13T00:00:00", "Finn Harries, English vlogger, designer and entrepreneur"], ["1993-05-13T00:00:00", "Debby Ryan, American actress"], ["1993-05-13T00:00:00", "Romelu Lukaku, Belgian football player"], ["1993-05-13T00:00:00", "Minah, South Korean singer (Girl's Day)"], ["1993-06-07T00:00:00", "Miro Aaltonen, Finnish professional ice hockey player"], ["1993-06-07T00:00:00", "George Ezra, English singer-songwriter"], ["1993-06-07T00:00:00", "Park Ji-yeon, South Korean singer and actress"], ["1993-06-15T00:00:00", "Kanna Arihara, Japanese singer"], ["1993-06-15T00:00:00", "Boone Jenner, Canadian ice hockey player"], ["1993-06-22T00:00:00", "Caydee Denney, American pair skater"], ["1993-06-22T00:00:00", "Izzy Miller, American musician"], ["1993-06-28T00:00:00", "Bradley Beal, American basketball player"], ["1993-06-28T00:00:00", "Jung Dae-hyun, South Korean singer"], ["1993-06-29T00:00:00", "James Sanderson, Gibraltarian swimmer"], ["1993-06-29T00:00:00", "Alyssa Valdez, Filipino Volleyball player"], ["1993-07-01T00:00:00", "Brett Ritchie, Canadian ice hockey player"], ["1993-07-01T00:00:00", "Raini Rodriguez, American actress"], ["1993-07-05T00:00:00", "Cody Klop, American actor"], ["1993-07-05T00:00:00", "Hollie Cavanagh, British singer"], ["1993-07-07T00:00:00", "Ally Brooke, American singer"], ["1993-07-07T00:00:00", "Sam Aston, English actor"], ["1993-07-26T00:00:00", "Taylor Momsen, American actress"], ["1993-07-26T00:00:00", "Elizabeth Gillies, American actress (Victorious)"], ["1993-07-28T00:00:00", "Harry Kane, English footballer"], ["1993-07-28T00:00:00", "Cher Lloyd, English singer"], ["1993-08-08T00:00:00", "Ben Breedlove, American Internet personality (d. 2011)"], ["1993-08-08T00:00:00", "Jessie Rogers, Brazilian internet celebrity"], ["1993-08-10T00:00:00", "Yuto Nakajima, Japanese singer (Hey! Say! JUMP)"], ["1993-08-10T00:00:00", "Andre Drummond, American basketball player"], ["1993-08-11T00:00:00", "Alireza Jahanbakhsh, Iranian footballer"], ["1993-08-11T00:00:00", "Alyson Stoner, American actress, singer, and dancer"], ["1993-08-12T00:00:00", "Ewa Farna, Polish singer"], ["1993-08-12T00:00:00", "Luna, South Korean singer and actress"], ["1993-08-12T00:00:00", "Imani Hakim, American actress"], ["1993-08-13T00:00:00", "Yoon Bo-mi, member of A Pink, South Korea"], ["1993-08-17T00:00:00", "Yoo Seung-ho, South Korean actor"], ["1993-08-17T00:00:00", "Sarah Sjöström, Swedish swimmer"], ["1993-08-17T00:00:00", "Madison McReynolds, actress"], ["1993-08-18T00:00:00", "Jung Eun-ji, South Korean singer, member of A Pink and actress"], ["1993-08-18T00:00:00", "Maia Mitchell, Australian actress and singer"], ["1993-08-29T00:00:00", "Lucas Cruikshank, American actor"], ["1993-08-29T00:00:00", "Liam Payne, member of One Direction"], ["1993-09-01T00:00:00", "Alexander Conti, Canadian actor"], ["1993-09-01T00:00:00", "Ilona Mitrecey, French singer"], ["1993-09-01T00:00:00", "Megan Nicole, American singer-songwriter"], ["1993-09-13T00:00:00", "Aisha Dee, Australian actress"], ["1993-09-13T00:00:00", "Niall Horan, member of One Direction"], ["1993-09-23T00:00:00", "Pontus Åberg, Swedish ice hockey player"], ["1993-09-23T00:00:00", "Sam Jackson, English actor"], ["1993-09-26T00:00:00", "Michael Kidd-Gilchrist, American basketball player"], ["1993-09-26T00:00:00", "Joe Bunney, English footballer"], ["1993-10-04T00:00:00", "Aidan Mitchell, American actor"], ["1993-10-04T00:00:00", "Ali Brustofski, American singer-songwriter"], ["1993-10-04T00:00:00", "Sam Earle, Canadian actor"], ["1993-10-06T00:00:00", "Jourdan Miller, American actress"], ["1993-10-06T00:00:00", "Joe Rafferty, English-born Irish footballer"], ["1993-10-08T00:00:00", "Angus T. Jones, American actor"], ["1993-10-08T00:00:00", "Barbara Palvin, Hungarian model"], ["1993-10-08T00:00:00", "Molly C. Quinn, American actress"], ["1993-10-20T00:00:00", "David Bolarinwa, British sprinter"], ["1993-10-20T00:00:00", "Hunter King, American actress"], ["1993-10-29T00:00:00", "India Eisley, American actress"], ["1993-10-29T00:00:00", "Sara Jovanović, Serbian singer, (Moje 3)"], ["1993-12-06T00:00:00", "Elián González, Cuban refugee"], ["1993-12-06T00:00:00", "Wesley Stromberg, American musician"], ["1993-12-18T00:00:00", "Ana Porgras, Romanian former gymnast"], ["1993-12-18T00:00:00", "Riria, Japanese actress"], ["1993-12-22T00:00:00", "Ali Lohan, American actress, model and singer"], ["1993-12-22T00:00:00", "Meghan Trainor, American singer-songwriter, musician and producer"], ["1993-01-06T00:00:00", "Dizzy Gillespie, American jazz trumpeter, bandleader, and composer (b. 1917)"], ["1993-01-06T00:00:00", "Richard Mortensen, Danish painter (b. 1910)"], ["1993-01-06T00:00:00", "Rudolf Nureyev, Russian dancer (b. 1938)"], ["1993-01-21T00:00:00", "Charlie Gehringer, American baseball player (Detroit Tigers) and member of the MLB Hall of Fame (b. 1903)"], ["1993-01-21T00:00:00", "Leo Löwenthal, German sociologist (b. 1900)"], ["1993-01-24T00:00:00", "Gustav Ernesaks, Estonian composer and a choir conductor (b. 1908)"], ["1993-01-24T00:00:00", "Thurgood Marshall, American jurist, First African-American on the Supreme Court (b. 1908)"], ["1993-01-26T00:00:00", "Baron Axel von dem Bussche, German military officer, member of the anti-Hitler Resistance (b. 1919)"], ["1993-01-26T00:00:00", "Robert Jacobsen Danish artist (b. 1912)"], ["1993-01-26T00:00:00", "Jeanne Sauvé, Canadian politician, former Governor General (b. 1922)"], ["1993-02-03T00:00:00", "Tan Shaowen, Chinese politician (b. 1929)"], ["1993-02-03T00:00:00", "Karel Goeyvaerts, Belgian composer (b. 1923)"], ["1993-02-05T00:00:00", "Hans Jonas, German philosopher (b. 1903)"], ["1993-02-05T00:00:00", "Roxanne Kernohan, Canadian actress (b. 1960)"], ["1993-02-05T00:00:00", "Tip Tipping, British actor and stuntman (parachuting accident) (b. 1958)"], ["1993-02-05T00:00:00", "Joseph L. Mankiewicz, American screenwriter and producer (b. 1909)"], ["1993-02-09T00:00:00", "Kate Wilkinson, American stage and television actress (b. 1916)"], ["1993-02-09T00:00:00", "Saburo Okita, former Japanese Foreign Minister (b. 1914)"], ["1993-02-21T00:00:00", "Inge Lehmann, Danish seismologist (b. 1888)"], ["1993-02-21T00:00:00", "Dick White, British intelligence officer (b. 1906)"], ["1993-02-23T00:00:00", "Phillip Terry, American actor (b. 1909)"], ["1993-02-23T00:00:00", "Robert Triffin, Belgian economist (b. 1911)"], ["1993-02-28T00:00:00", "Ruby Keeler, American actress (b. 1909)"], ["1993-02-28T00:00:00", "Ishirō Honda, Japanese film director (b. 1911)"], ["1993-03-03T00:00:00", "Albert Sabin, American biologist, developer of the oral polio vaccine (b. 1906)"], ["1993-03-03T00:00:00", "Carlos Montoya, Spanish flamenco guitarist (b. 1903)"], ["1993-03-05T00:00:00", "Cyril Collard, French filmmaker (b. 1957)"], ["1993-03-05T00:00:00", "Norman F. Douty, Christian author and pastor (b. 1899)"], ["1993-03-16T00:00:00", "Muhammad Khan Junejo, Pakistani politician, former Prime Minister (b. 1932)"], ["1993-03-16T00:00:00", "Ralph Fults, last of America's depression-era outlaws (b. 1910)"], ["1993-03-20T00:00:00", "Polykarp Kusch, German-born physicist, Nobel Prize laureate (b. 1911)"], ["1993-03-20T00:00:00", "Paul László, Hungarian-born architect (b. 1900)"], ["1993-03-27T00:00:00", "Elizabeth Holloway Marston, American psychologist (b. 1893)"], ["1993-03-27T00:00:00", "Kate Reid, Canadian actress (b. 1930)"], ["1993-03-27T00:00:00", "Kamal Hassan Ali, Egyptian politician, former Prime Minister (b. 1921)"], ["1993-03-31T00:00:00", "Brandon Lee, American actor (b. 1965)"], ["1993-03-31T00:00:00", "José María Lemus, Salvadorean politician and military officer, former President of the Republic (b. 1911)"], ["1993-03-31T00:00:00", "Mitchell Parish, American lyricist (b. 1900)"], ["1993-03-31T00:00:00", "Muriel Morley, English speech therapist(b. 1899)"], ["1993-03-31T00:00:00", "Nicanor Zabaleta, Spanish harpist (b. 1907)"], ["1993-04-01T00:00:00", "Juan de Borbón y Battenberg, Spanish royal, Count of Barcelona (b. 1913)"], ["1993-04-01T00:00:00", "Alan Kulwicki, U.S. race car driver (b. 1954)"], ["1993-04-02T00:00:00", "Masaichi Niimi, admiral in the Imperial Japanese Navy during World War II (b. 1887)"], ["1993-04-02T00:00:00", "Eugenie Leontovich, Russian-born actress (b. 1900)"], ["1993-04-03T00:00:00", "Peter J. De Muth, Democratic member of the U.S. House of Representatives from Pennsylvania (b. 1892)"], ["1993-04-03T00:00:00", "Pinky Lee, American comedian (b. 1907)"], ["1993-04-10T00:00:00", "Chris Hani, South African politician (b. 1942)"], ["1993-04-10T00:00:00", "Donald Broadbent, British psychologist (b. 1926)"], ["1993-04-13T00:00:00", "Isaac Rojas, Argentinian admiral and statesman (b. 1906)"], ["1993-04-13T00:00:00", "Wallace Stegner, American writer (b. 1909)"], ["1993-04-15T00:00:00", "John Tuzo Wilson, Canadian geophysicist and geologist (b. 1908)"], ["1993-04-15T00:00:00", "Leslie Charteris, British author (b. 1907)"], ["1993-04-15T00:00:00", "Robert Westall, British author (b. 1929)"], ["1993-04-23T00:00:00", "Guido Carli, Italian politician and economist (b. 1914)"], ["1993-04-23T00:00:00", "Cesar Chavez, Mexican-American civil rights activist (b. 1927)"], ["1993-05-01T00:00:00", "Pierre Bérégovoy, Prime Minister of France (b. 1925)"], ["1993-05-01T00:00:00", "Ranasinghe Premadasa, Sri Lankan statesman, president of the Republic (assassinated) (b. 1924)"], ["1993-05-06T00:00:00", "Ian Mikardo, British labour politician (b. 1908)"], ["1993-05-06T00:00:00", "Ann Todd, English actress (b. 1909)"], ["1993-05-07T00:00:00", "Mary Philbin, American actress (b. 1903)"], ["1993-05-08T00:00:00", "Avram Davidson, American writer (b. 1923)"], ["1993-05-08T00:00:00", "Alwin Nikolais, American choreographer (b. 1912)"], ["1993-05-22T00:00:00", "Alfred Vaucher, French theologian, church historian and bibliographer (b. 1887)"], ["1993-05-22T00:00:00", "Mieczysław Horszowski, Polish pianist (b. 1892)"], ["1993-06-02T00:00:00", "Tahar Djaout, Algerian writer (b. 1954)"], ["1993-06-02T00:00:00", "Johnny Mize, American baseball player (St. Louis Cardinals) and member of the MLB Hall of Fame (b. 1913)"], ["1993-06-08T00:00:00", "René Bousquet, head of the Vichy France Police (b. 1909)"], ["1993-06-08T00:00:00", "Severo Sarduy, Cuban poet (b. 1937)"], ["1993-06-08T00:00:00", "Nolan Bailey Harmon, bishop of The Methodist Church and the United Methodist Church (b. 1892)"], ["1993-06-10T00:00:00", "Arleen Auger, American soprano singer (b. 1939)"], ["1993-06-10T00:00:00", "Les Dawson, English Comedian (b. 1931)"], ["1993-06-10T00:00:00", "Milward L. Simpson, American politician (b. 1897)"], ["1993-06-12T00:00:00", "Manuel Summers, Spanish film director (b. 1935)"], ["1993-06-12T00:00:00", "Binay Ranjan Sen, Indian diplomat, 4th Director General of the Food and Agriculture Organization (FAO) (b. 1898)"], ["1993-06-13T00:00:00", "Deke Slayton, American astronaut (b. 1924)"], ["1993-06-13T00:00:00", "Gérard Côté, Canadian marathon runner (b. 1913)"], ["1993-06-15T00:00:00", "John Connally, American politician (b. 1917)"], ["1993-06-15T00:00:00", "James Hunt, British race car driver (b. 1947)"], ["1993-06-19T00:00:00", "William Golding, English writer, Nobel Prize laureate (b. 1911)"], ["1993-06-19T00:00:00", "Szymon Goldberg, Polish-born violinist (b. 1909)"], ["1993-07-02T00:00:00", "Fred Gwynne, American actor and comedian (b. 1926)"], ["1993-07-02T00:00:00", "Jorge Carpio Nicolle, Guatemalan politician (b. 1932)"], ["1993-07-02T00:00:00", "Edward Dunlop, Australian surgeon (b. 1907)"], ["1993-07-03T00:00:00", "Don Drysdale, American baseball player (Los Angeles Dodgers) and member of the MLB Hall of Fame (b. 1936)"], ["1993-07-03T00:00:00", "Joe DeRita, American comedian (b. 1909)"], ["1993-07-04T00:00:00", "Anne Shirley, American actress (b. 1918)"], ["1993-07-04T00:00:00", "Lola Gaos, Spanish actress (b. 1921)"], ["1993-07-07T00:00:00", "William McElwee Miller, American missionary to Persia, and author of several books (b. 1892)"], ["1993-07-07T00:00:00", "Mia Zapata, American punk musician (b. 1965)"], ["1993-07-15T00:00:00", "David Brian, American actor (b. 1914)"], ["1993-07-15T00:00:00", "Hugo Ballivián, Bolivian general, former President of the Republic (b. 1901)"], ["1993-07-25T00:00:00", "Nan Grey, American actress (b. 1918)"], ["1993-07-25T00:00:00", "Cecilia Parker, American actress (b. 1914)"], ["1993-08-03T00:00:00", "James Donald, Scottish actor (b. 1917)"], ["1993-08-03T00:00:00", "Theodore A. Parker III, American ornithologist (b. 1953)"], ["1993-08-10T00:00:00", "Øystein Aarseth, Norwegian black metal musician (b. 1968)"], ["1993-08-10T00:00:00", "Hendrik G. Stoker, Calvinist philosopher (b. 1899)"], ["1993-08-10T00:00:00", "Irene Sharaff, American costume designer (b. 1910)"], ["1993-08-16T00:00:00", "René Dreyfus French Grand Prix racing driver (b. 1905)"], ["1993-08-16T00:00:00", "Stewart Granger, Anglo-American actor (b. 1913)"], ["1993-09-12T00:00:00", "Raymond Burr, Canadian actor (b. 1917)"], ["1993-09-12T00:00:00", "Charles Lamont, Russian-born film director (b. 1895)"], ["1993-09-22T00:00:00", "Maurice Abravanel, Greek-born conductor (b. 1903)"], ["1993-09-22T00:00:00", "Regina Fryxell, American composer (b. 1899)"], ["1993-09-22T00:00:00", "Nina Berberova, Russian writer (b. 1901)"], ["1993-09-24T00:00:00", "Bruno Pontecorvo, Italian-Soviet nuclear physicist (b.1913)"], ["1993-09-24T00:00:00", "Ian Stuart, singer for white power skinhead band Skrewdriver (b.1957)"], ["1993-10-12T00:00:00", "Leon Ames, American actor (b. 1903)"], ["1993-10-12T00:00:00", "Patrick Holt, English actor (b. 1912)"], ["1993-10-13T00:00:00", "Otmar Gutmann, German television director. Creator of Pingu (b. 1937)."], ["1993-10-21T00:00:00", "James Leo Herlihy, American novelist and playwright (b. 1927)"], ["1993-10-21T00:00:00", "Melchior Ndadaye, President of Burundi (b. 1953)"], ["1993-10-22T00:00:00", "Jiří Hájek, Czech politician and diplomat (b. 1913)"], ["1993-10-22T00:00:00", "Said Mohamed Jaffar, former head of State of Comoros (b. 1918)"], ["1993-10-25T00:00:00", "Vincent Price, American actor (b. 1911)"], ["1993-10-25T00:00:00", "Danny Chan, Hong Konger singer (b. 1958)"], ["1993-10-26T00:00:00", "Albert Hyzler, Maltese statesman, former acting President (b. 1916)"], ["1993-10-26T00:00:00", "Harold Rome, American composer (b. 1908)"], ["1993-10-31T00:00:00", "Federico Fellini, Italian film director (b. 1920)"], ["1993-10-31T00:00:00", "Paul Grégoire, archbishop of Montreal (b. 1911)"], ["1993-10-31T00:00:00", "River Phoenix, American actor (b. 1970)"], ["1993-11-01T00:00:00", "Severo Ochoa, Spanish-born biochemist, recipient of the Nobel Prize in Physiology or Medicine (b. 1905)"], ["1993-11-01T00:00:00", "A. N. Sherwin-White, English historian of Ancient Rome (b. 1911)"], ["1993-11-06T00:00:00", "Ralph Randles Stewart, American botanist (b. 1890)"], ["1993-11-06T00:00:00", "Torsten Fenslau, German DJ and record producer (b. 1964)"], ["1993-11-09T00:00:00", "Joe \"Pegleg\" Morgan, senior member of La Eme (b. 1929)"], ["1993-11-09T00:00:00", "Stanley Myers, British film composer (b. 1930)"], ["1993-11-10T00:00:00", "Alberto Breccia, Argentine comics artist and writer (b. 1919)"], ["1993-11-10T00:00:00", "Wensley Pithey, South African actor (b. 1914)"], ["1993-11-12T00:00:00", "Bill Dickey, American baseball player (New York Yankees) and member of the MLB Hall of Fame (b. 1907)"], ["1993-11-12T00:00:00", "H. R. Haldeman, American political aide and businessman (b. 1926)"], ["1993-11-12T00:00:00", "Anna Sten, Ukrainian-born actress (b. 1908)"], ["1993-11-16T00:00:00", "Achille Zavatta, French circus artist (b. 1915)"], ["1993-11-16T00:00:00", "Lucia Popp, Slovak soprano (b. 1939)"], ["1993-11-22T00:00:00", "Anthony Burgess, English author (b. 1917)"], ["1993-11-22T00:00:00", "Joseph Yodoyman, Chadian politician, former Prime Minister (b. 1950)"], ["1993-11-28T00:00:00", "Kenneth Connor English comedian (b. 1916)"], ["1993-11-28T00:00:00", "Garry Moore, American television host and comedian (b. 1915)"], ["1993-12-05T00:00:00", "Doug Hopkins, American musician (b. 1961)"], ["1993-12-05T00:00:00", "Alexandre Trauner, Hungarian set designer (b. 1906)"], ["1993-12-06T00:00:00", "Don Ameche, American actor (b. 1908)"], ["1993-12-06T00:00:00", "Joe Fowler, rear admiral of the United States Navy (b. 1894)"], ["1993-12-07T00:00:00", "Wolfgang Paul, German physicist, Nobel Prize laureate (b. 1913)"], ["1993-12-07T00:00:00", "Félix Houphouët-Boigny, Ivorian president (b. 1905)"], ["1993-12-09T00:00:00", "Danny Blanchflower, Northern Ireland international footballer and football manager (b. 1926)"], ["1993-12-09T00:00:00", "Mohammad-Reza Golpaygani, Iranian Shia cleric and marja (b. 1898)"], ["1993-12-12T00:00:00", "József Antall, Hungarian Prime Minister (b. 1932)"], ["1993-12-12T00:00:00", "Fritz Bock, Austrian politician (b. 1911)"], ["1993-12-13T00:00:00", "George Bellew, genealogist and armorist (b. 1899)"], ["1993-12-13T00:00:00", "Tommy Sexton, Canadian comedian (b. 1957)"], ["1993-12-15T00:00:00", "Evelyn Venable, American actress (b. 1913)"], ["1993-12-15T00:00:00", "Penaia Ganilau, Fijian president (b. 1918)"], ["1993-12-16T00:00:00", "Charles Willard Moore, American architect (b. 1926)"], ["1993-12-16T00:00:00", "Kakuei Tanaka, former Japanese Prime Minister (b. 1918)"], ["1993-12-16T00:00:00", "Moses Gunn, American actor (b. 1929)"], ["1993-12-16T00:00:00", "Billy Morgan, English professional footballer (b. 1896)"], ["1993-12-18T00:00:00", "Charizma, American hip hop artist (b. 1973)"], ["1993-12-18T00:00:00", "Sam Wanamaker, American film director and actor (b. 1919)"], ["1993-12-22T00:00:00", "Don DeFore, American actor (b. 1917)"], ["1993-12-22T00:00:00", "Alexander Mackendrick, British-American film director (b. 1912)"], ["1993-12-24T00:00:00", "Norman Vincent Peale, American preacher and writer (b. 1898)"], ["1993-12-24T00:00:00", "Yen Chia-kan, former Taiwanese president (b. 1905)"], ["1993-12-24T00:00:00", "Pierre Victor Auger, French physicist (b. 1899)"], ["1993-12-31T00:00:00", "Brandon Teena, American transman (b. 1972)"], ["1993-12-31T00:00:00", "İhsan Sabri Çağlayangil, Turkish politician and diplomat (b. 1908)"], ["1993-12-31T00:00:00", "Zviad Gamsakhurdia, President of Georgia (b. 1939)"]]