[["1944-01-11T00:00:00", "President of the United States Franklin D. Roosevelt proposes a Second Bill of Rights for social and economic security in his State of the Union address."], ["1944-01-11T00:00:00", "Nazi German administration expandend Kraków-Płaszów concentration camp into larger and standalone 'Konzentrationslager Plaszow bei Krakau'."], ["1944-01-15T00:00:00", "WWII: The 27th Polish Home Army Infantry Division is re-created, marking the start of Operation Tempest by the Polish Home Army."], ["1944-01-15T00:00:00", "1944 San Juan earthquake: An earthquake hits San Juan, Argentina, killing an estimated 10,000 people in the worst natural disaster in Argentina's history."], ["1944-02-26T00:00:00", "Kurt Gerron begins shooting the Nazi propaganda film, Theresienstadt in Theresienstadt concentration camp. He and many others who featured in it are transferred to Auschwitz and gassed upon the film's completion."], ["1944-02-26T00:00:00", "First woman appointed to the substantive rank of captain in the United States Navy Nurse Corps, Sue S. Dauser."], ["1944-03-02T00:00:00", "Balvano train disaster: A train stalls inside a railway tunnel outside Salerno, Italy; 521 choke to death."], ["1944-03-02T00:00:00", "The 16th Academy Awards ceremony is held, the first Oscar ceremony held at a large public venue, Grauman's Chinese Theatre in Hollywood. Casablanca (directed by Michael Curtiz), wins the Best Picture award."], ["1944-03-10T00:00:00", "In Britain, the prohibition on married women working as teachers is lifted."], ["1944-03-10T00:00:00", "Resistance leader Joop Westerweel is arrested while returning to the Netherlands having escorted a group of Jewish children to safety in Spain."], ["1944-03-15T00:00:00", "WWII: Battle of Monte Cassino: Allied aircraft bomb the monastery and an assault is staged."], ["1944-03-15T00:00:00", "WWII: The National Council of the French Resistance approves the Resistance programme."], ["1944-03-15T00:00:00", "In Sweden, the 1864 law which had criminalized homosexuality is abolished."], ["1944-04-25T00:00:00", "The Holocaust: SS-Obersturmbannführer Adolf Eichmann opens \"blood for goods\" negotiations with Joel Brand to offer the release of thousands of Jews from eastern Europe to the Hungarian Aid and Rescue Committee in exchange for supplies for the German Eastern Front."], ["1944-04-25T00:00:00", "The United Negro College Fund is incorporated in the U.S."], ["1944-04-26T00:00:00", "Kidnap of General Kreipe on Crete, Greece."], ["1944-04-26T00:00:00", "WWII: 2,649 drown when USS Jack torpedoes Yoshida Maru."], ["1944-06-01T00:00:00", "WWII: The BBC transmits a coded message (the first line of the poem \"Chanson d'automne\" by Paul Verlaine) to the French Resistance, warning that the invasion of Europe is imminent."], ["1944-06-01T00:00:00", "Two K-class blimps of the United States Navy complete the first transatlantic crossing by non-rigid airships, from the U.S. to French Morocco with two stops."], ["1944-07-06T00:00:00", "Hartford circus fire: More than 100 children die in one of the worst fire disasters in the history of the United States."], ["1944-07-06T00:00:00", "WWII: At Camp Hood, Texas, future baseball star and 1st Lt. Jackie Robinson is arrested and later court-martialed for refusing to move to the back of a segregated U.S. Army bus. He is eventually acquitted."], ["1944-07-22T00:00:00", "The Bretton Woods Conference ends with agreements signed to set up the International Bank for Reconstruction and Development, General Agreement on Tariffs and Trade and International Monetary Fund."], ["1944-07-22T00:00:00", "United States v. Masaaki Kuwabara, the only Japanese American draft avoidance case to be dismissed on a due process violation of the U.S. Constitution."], ["1944-07-25T00:00:00", "WWII – Operation Spring: One of the bloodiest days for Canadian forces during the war results in 1,550 casualties, including 450 killed, during the Normandy Campaign."], ["1944-07-25T00:00:00", "WWII – Beginning of the Battle of Tannenberg Line or the \"Battle of the Blue Hills\" in Northeastern Estonia, where the Red Army will result in a Pyrrhic victory by 10 August."], ["1944-09-02T00:00:00", "The Holocaust: Diarist Anne Frank and her family are placed on the last transport train from Westerbork to Auschwitz concentration camp, arriving 3 days later."], ["1944-09-02T00:00:00", "¡Hola! magazine launched in Barcelona."], ["1944-10-07T00:00:00", "Holocaust: Members of the Sonderkommando (Jewish work units) in Auschwitz stage a revolt, killing more than seventy SS men before being massacred themselves."], ["1944-10-07T00:00:00", "Dumbarton Oaks Conference concludes."], ["1944-10-12T00:00:00", "WWII: The Allies land in Athens."], ["1944-10-12T00:00:00", "Canadian Arctic explorer Henry Larsen returns to Vancouver, becoming the first person successfully to navigate the Northwest Passage in both directions, in the Royal Canadian Mounted Police schooner St. Roch. His westbound voyage is the first completed in a single season and the first passage through the Prince of Wales Strait."], ["1944-10-23T00:00:00", "WWII: The Naval Battle of Leyte Gulf in the Philippines begins (lasts until October 26)."], ["1944-10-23T00:00:00", "The Allies recognise Charles de Gaulle's cabinet as the provisional government of France."], ["1944-10-25T00:00:00", "WWII: The Red Army liberates Kirkenes, the first town in Norway to be liberated."], ["1944-10-25T00:00:00", "WWII: USS Tang (the United States Navy submarine credited with sinking more ships than any other American submarine) is sunk in the Formosa Strait by one of her own torpedoes. Medal of Honor-winning submarine ace Richard O'Kane becomes a prisoner of war."], ["1944-10-25T00:00:00", "Florence Foster Jenkins gives a recital in Carnegie Hall."], ["1944-10-30T00:00:00", "The Holocaust: Anne Frank and her sister Margot are deported from Auschwitz to the Bergen-Belsen concentration camp."], ["1944-10-30T00:00:00", "Appalachian Spring, a ballet by Martha Graham with music by Aaron Copland, debuts at the Library of Congress in Washington, D.C., with Graham in the lead role."], ["1944-11-07T00:00:00", "United States presidential election: Franklin D. Roosevelt wins reelection over Republican challenger Thomas E. Dewey, becoming the only U.S. president elected to a fourth term."], ["1944-11-07T00:00:00", "Election day rail accident in Puerto Rico: A passenger train derails at Aguadilla due to excessive speed on a downgrade; 16 are killed, 50 injured."], ["1944-11-18T00:00:00", "The Popular Socialist Youth is founded in Cuba"], ["1944-11-18T00:00:00", "WWII: 3,546 drown when USS Picuda torpedoes Mayasan Maru."], ["1944-11-22T00:00:00", "Conscription Crisis: Prime Minister of Canada William Mackenzie King agrees a one-time conscription levy in Canada for overseas service."], ["1944-11-22T00:00:00", "Laurence Olivier's film Henry V, based on Shakespeare's play, opens in London. It is the most acclaimed and the most successful movie version of a Shakespeare play made up to that time, and the first in Technicolor. Olivier both stars and directs."], ["1944-12-14T00:00:00", "The Soviet government changes Turkish place names to Russian in the Crimea."], ["1944-12-14T00:00:00", "United States release of the film National Velvet, which brings a young Elizabeth Taylor to stardom."], ["1944-12-22T00:00:00", "WWII: Brigadier General Anthony C. McAuliffe, commander of the U.S. forces defending Bastogne, refuses to accept demands for surrender by sending a one-word reply, \"Nuts!\", to the German command."], ["1944-12-22T00:00:00", "The Vietnam People's Army is formed in French Indochina."], ["1944-12-24T00:00:00", "WWII: Troopship SS Léopoldville is sunk in the English Channel by German submarine U-486. Approximately 763 soldiers of the U.S. 66th Infantry Division bound for the Battle of the Bulge drown."], ["1944-12-24T00:00:00", "WWII: German tanks reach the furthest point of the Bulge at Celles."], ["1944-12-24T00:00:00", "WWII: Fifty German V-1 flying bombs, air-launched from Heinkel He 111 bombers flying over the North Sea, target Manchester in England, killing at least 27 and injuring more than 100 in the Oldham area."], ["1944-12-24T00:00:00", "WWII: Bande massacre. 34 men between the ages of 17 and 32 are executed by the Sicherheitsdienst near Bande, Belgium in retaliation for the killing of three German soldiers."], ["1944-12-24T00:00:00", "The first complete U.S. production of Tchaikovsky's ballet The Nutcracker is presented in San Francisco, choreographed by Willam Christensen. It will become an annual tradition there, and for the next ten years, the San Francisco Ballet will be the only company in the United States performing the complete work."], ["1944-12-26T00:00:00", "WWII: American troops repulse German forces at Bastogne."], ["1944-12-26T00:00:00", "The original stage version of The Glass Menagerie by Tennessee Williams premieres in Chicago."], ["1944-12-30T00:00:00", "Edward Stettinius, Jr., becomes the last United States Secretary of State of the Roosevelt administration, filling the seat left by Cordell Hull."], ["1944-12-30T00:00:00", "King George II of Greece declares a regency, leaving his throne vacant."], ["1944-12-30T00:00:00", "\"Stage Door Cartoon\" is the first cartoon produced by Eddie Selzer."], ["1944-01-01T00:00:00", "Omar Hasan Ahmad al-Bashir, President of the Sudan"], ["1944-01-01T00:00:00", "Bob Minor, American actor and stunt performer"], ["1944-01-06T00:00:00", "Bonnie Franklin, American actress and television director (d. 2013)"], ["1944-01-06T00:00:00", "Rolf M. Zinkernagel, Swiss immunologist, recipient of the Nobel Prize in Physiology or Medicine"], ["1944-01-09T00:00:00", "Ian Hornak, American painter, draughtsman and sculptor (d. 2002)"], ["1944-01-09T00:00:00", "Jimmy Page, English guitarist (Led Zeppelin)"], ["1944-01-17T00:00:00", "Jan Guillou, Swedish author"], ["1944-01-17T00:00:00", "Françoise Hardy, French singer"], ["1944-01-25T00:00:00", "Sally Beauman, British writer"], ["1944-01-25T00:00:00", "Anita Pallenberg, Italian model and actress"], ["1944-01-27T00:00:00", "Peter Akinola, Nigerian religious leader"], ["1944-01-27T00:00:00", "Mairead Corrigan, Northern Irish activist, recipient of the Nobel Peace Prize"], ["1944-01-27T00:00:00", "Nick Mason, English rock drummer (Pink Floyd)"], ["1944-01-28T00:00:00", "Susan Howard, American actress"], ["1944-01-28T00:00:00", "John Tavener, English composer of religious music (died 2013)"], ["1944-01-29T00:00:00", "Susana Giménez, TV presenter Argentina"], ["1944-01-29T00:00:00", "Patrick Lipton Robinson, Jamaican judge"], ["1944-01-31T00:00:00", "Connie Booth, American writer and actress"], ["1944-01-31T00:00:00", "Ivo Opstelten, Dutch politician"], ["1944-02-13T00:00:00", "Stockard Channing, American actress"], ["1944-02-13T00:00:00", "Michael Ensign, American actor"], ["1944-02-13T00:00:00", "Jerry Springer, English-born American politician and television personality"], ["1944-02-14T00:00:00", "Carl Bernstein, American journalist"], ["1944-02-14T00:00:00", "Sir Alan Parker, English film director, producer, actor and writer"], ["1944-02-16T00:00:00", "Richard Ford, American writer"], ["1944-02-16T00:00:00", "António Mascarenhas Monteiro, President of Cape Verde"], ["1944-02-22T00:00:00", "Jonathan Demme, American film director, producer and writer"], ["1944-02-22T00:00:00", "Tom Okker, Dutch tennis player"], ["1944-03-01T00:00:00", "John Breaux, U.S. Senator from Louisiana"], ["1944-03-01T00:00:00", "Roger Daltrey, English singer-songwriter and actor (The Who)"], ["1944-03-04T00:00:00", "Harvey Postlethwaite, English engineer and race car designer (d. 1999)"], ["1944-03-04T00:00:00", "Bobby Womack, American singer and songwriter (d. 2014)"], ["1944-03-06T00:00:00", "Dame Kiri Te Kanawa, New Zealand soprano"], ["1944-03-06T00:00:00", "Mary Wilson, American singer (The Supremes)"], ["1944-03-11T00:00:00", "Graham Lyle, Grammy-winning Scottish singer-songwriter and guitarist, known for writing several international hits for Tina Turner"], ["1944-03-11T00:00:00", "Don Maclean, English comedian and broadcaster"], ["1944-03-17T00:00:00", "Pattie Boyd, English model and first wife of George Harrison and Eric Clapton"], ["1944-03-17T00:00:00", "John Sebastian, American singer-songwriter (The Lovin' Spoonful)"], ["1944-03-19T00:00:00", "Said Musa, Prime Minister of Belize"], ["1944-03-19T00:00:00", "Sirhan Sirhan, Palestinian assassin of Robert F. Kennedy"], ["1944-03-28T00:00:00", "Rick Barry, American basketball player"], ["1944-03-28T00:00:00", "Ken Howard, American actor"], ["1944-04-06T00:00:00", "Judith McConnell, American actress"], ["1944-04-06T00:00:00", "Dame Felicity Palmer, English soprano"], ["1944-04-08T00:00:00", "Odd Nerdrum, Norwegian painter"], ["1944-04-08T00:00:00", "Jimmy Walker, American professional basketball player (d. 2007)"], ["1944-04-27T00:00:00", "Michael Fish, British TV weatherman"], ["1944-04-27T00:00:00", "Cuba Gooding, Sr., American actor/singer"], ["1944-05-09T00:00:00", "Richie Furay, American musician (Poco, Buffalo Springfield)"], ["1944-05-09T00:00:00", "Laurence Owen, American figure skater (d. 1961)"], ["1944-05-20T00:00:00", "Joe Cocker, English rock singer (d. 2014)"], ["1944-05-20T00:00:00", "Boudewijn de Groot, Dutch singer"], ["1944-05-20T00:00:00", "Dietrich Mateschitz, Austrian businessman"], ["1944-05-23T00:00:00", "John Newcombe, Australian tennis player"], ["1944-05-23T00:00:00", "Avraham Oz, Israeli theater professor, translator, and political activist"], ["1944-05-28T00:00:00", "Rudy Giuliani, former Mayor of New York City"], ["1944-05-28T00:00:00", "Gladys Knight, American singer"], ["1944-05-28T00:00:00", "Rita MacNeil, Canadian folk singer (d. 2013)"], ["1944-05-28T00:00:00", "Patricia, Lady Stephens (née Quinn), retired Northern Irish actress"], ["1944-06-05T00:00:00", "Tommie Smith, American athlete"], ["1944-06-05T00:00:00", "Colm Wilkinson, Irish actor and singer"], ["1944-06-08T00:00:00", "Mark Belanger, American baseball player (d. 1998)"], ["1944-06-08T00:00:00", "Don Grady, American actor and singer (d. 2012)"], ["1944-06-08T00:00:00", "Marc Ouellet, Canadian cardinal"], ["1944-06-08T00:00:00", "Boz Scaggs, American singer and guitarist"], ["1944-06-24T00:00:00", "Jeff Beck, English rock musician"], ["1944-06-24T00:00:00", "David Mark Berger, American-born Israeli weightlifter, murdered at the Munich Olympics (d. 1972)"], ["1944-06-30T00:00:00", "Terry Funk, American professional wrestler"], ["1944-06-30T00:00:00", "Raymond Moody, American parapsychologist"], ["1944-07-31T00:00:00", "Geraldine Chaplin, English-American actress"], ["1944-07-31T00:00:00", "Robert C. Merton, American economist, Nobel Prize laureate"], ["1944-08-04T00:00:00", "Richard Belzer, American actor and comedian"], ["1944-08-04T00:00:00", "William Frankfather, American actor (d. 1998)"], ["1944-08-04T00:00:00", "Orhan Gencebay, Turkish musician, composer, singer and actor"], ["1944-08-21T00:00:00", "Kari S. Tikka, Finnish Professor of Finance (d. 2006)"], ["1944-08-21T00:00:00", "Peter Weir, Australian film director"], ["1944-09-07T00:00:00", "Earl Manigault, American basketball player (d. 1998)"], ["1944-09-07T00:00:00", "Bora Milutinović, Serbian football coach"], ["1944-09-12T00:00:00", "Leonard Peltier, Native American activist and convicted murderer"], ["1944-09-12T00:00:00", "Barry White, American singer (d. 2003)"], ["1944-09-13T00:00:00", "Carol Barnes, British newsreader (d. 2008)"], ["1944-09-13T00:00:00", "Jacqueline Bisset, English actress"], ["1944-09-13T00:00:00", "Peter Cetera, American singer"], ["1944-09-26T00:00:00", "Veronica Carlson, English actress and model"], ["1944-09-26T00:00:00", "Anne Robinson, British television host"], ["1944-10-09T00:00:00", "John Entwistle, English musician (The Who; d. 2002)"], ["1944-10-09T00:00:00", "Nona Hendryx, singer (Labelle)"], ["1944-10-09T00:00:00", "Peter Tosh, Jamaican singer and musician (d. 1987)"], ["1944-10-15T00:00:00", "Şerif Gören, Turkish film director"], ["1944-10-15T00:00:00", "David Trimble, Northern Irish Unionist political leader; recipient of the Nobel Peace Prize 1998"], ["1944-11-01T00:00:00", "Bobby Heenan, American professional wrestling manager and commentator"], ["1944-11-01T00:00:00", "Oscar Temaru, President of French Polynesia"], ["1944-11-10T00:00:00", "Askar Akayevich Akayev, former President of Kyrgyzstan"], ["1944-11-10T00:00:00", "Silvestre Reyes, American politician"], ["1944-11-12T00:00:00", "Booker T. Jones, American musician, singer and songwriter"], ["1944-11-12T00:00:00", "Al Michaels, American sportscaster"], ["1944-11-17T00:00:00", "Gene Clark, American singer-songwriter (d. 1991)"], ["1944-11-17T00:00:00", "Danny DeVito, American actor, film producer & director"], ["1944-11-17T00:00:00", "Rem Koolhaas, Dutch architect"], ["1944-11-17T00:00:00", "Lorne Michaels, Canadian television and film producer"], ["1944-11-17T00:00:00", "Tom Seaver, American baseball player"], ["1944-11-21T00:00:00", "Richard Durbin, American politician; United States Senator (D-IL)"], ["1944-11-21T00:00:00", "Harold Ramis, American actor, director and comedy writer (d. 2014)"], ["1944-11-24T00:00:00", "Candy Darling, American actress (d. 1974)"], ["1944-11-24T00:00:00", "Ibrahim Gambari, Nigerian scholar and diplomat"], ["1944-12-02T00:00:00", "Cathy Lee Crosby, American actress (That's Incredible!)"], ["1944-12-02T00:00:00", "Ibrahim Rugova, first President of Kosovo (d. 2006)"], ["1944-12-06T00:00:00", "Ron Kenoly, American Christian leader"], ["1944-12-06T00:00:00", "Jonathan King, British music producer"], ["1944-12-07T00:00:00", "Daniel Chorzempa, American organist"], ["1944-12-07T00:00:00", "Georges Coste, French Rugby player and coach"], ["1944-12-09T00:00:00", "Tadashi Irie, Japanese yakuza boss"], ["1944-12-09T00:00:00", "Ki Longfellow, American novelist"], ["1944-12-11T00:00:00", "Lynda Day George, American actress"], ["1944-12-11T00:00:00", "Brenda Lee, American singer"], ["1944-12-12T00:00:00", "Kenneth Cranham, Scottish born actor"], ["1944-12-12T00:00:00", "Cara Duff-MacCormick, Canadian stage actress"], ["1944-12-21T00:00:00", "Bill Atkinson, English footballer"], ["1944-12-21T00:00:00", "Michael Tilson Thomas, American conductor"], ["1944-12-21T00:00:00", "Zheng Xiaoyu, Chinese bureaucrat (d. 2007)"], ["1944-12-23T00:00:00", "Wesley Clark, U.S. general and NATO Supreme Allied Commander"], ["1944-12-23T00:00:00", "Ingar Knudtsen, Norwegian writer"], ["1944-12-26T00:00:00", "Bill Ayers, American education theorist and former radical anti-war activist"], ["1944-12-26T00:00:00", "Jane Lapotaire, British actress"], ["1944-12-26T00:00:00", "Aleksey Mikhalyov, Russian translator"], ["1944-01-01T00:00:00", "Edwin Lutyens, British architect (b. 1869)"], ["1944-01-01T00:00:00", "Charles Turner, Australian cricketer (b. 1862)"], ["1944-01-11T00:00:00", "Gian Galeazzo Ciano, 2nd Count of Cortellazzo and Buccari, Italian aristocrat and diplomat (executed) (b. 1903)"], ["1944-01-11T00:00:00", "Charles King, American actor (b. 1889)"], ["1944-01-11T00:00:00", "Edgard Potier, Belgian spy (suicide) (b. 1903)"], ["1944-01-31T00:00:00", "Jean Giraudoux, French writer (b. 1882)"], ["1944-01-31T00:00:00", "William Allen White, American journalist (b. 1868)"], ["1944-02-12T00:00:00", "Kenneth Gandar-Dower, English sportsman, aviator, explorer and author (b. 1908)"], ["1944-02-12T00:00:00", "Margaret Woodrow Wilson, American singer; Presidential daughter (b. 1886)"], ["1944-04-28T00:00:00", "Frank Knox, American Secretary of the Navy during WWII (b. 1874)"], ["1944-04-28T00:00:00", "Paul Poiret, French couturier (b. 1879)"], ["1944-04-29T00:00:00", "Billy Bitzer, American cinematographer (b. 1874)"], ["1944-04-29T00:00:00", "Bernardino Machado, President of Portugal (b. 1851)"], ["1944-05-12T00:00:00", "Max Brand, American author (b. 1892)"], ["1944-05-12T00:00:00", "Harold Lowe, British sailor, 5th officer of the RMS Titanic (b. 1882)"], ["1944-05-12T00:00:00", "Arthur Quiller-Couch (aka \"Q\"), British writer (b. 1863)"], ["1944-05-20T00:00:00", "Fraser Barron, New Zealand bomber pilot during WWII (b. 1921)"], ["1944-05-20T00:00:00", "Vincent Rose, American musician and band leader (b. 1880)"], ["1944-05-24T00:00:00", "Inigo Campioni, Italian admiral (executed) (b. 1878)"], ["1944-05-24T00:00:00", "Matsuji Ijuin, Japanese admiral (b. 1893)"], ["1944-05-24T00:00:00", "Harold Bell Wright, American writer (b. 1872)"], ["1944-07-06T00:00:00", "Andrée Borrel, French World War II heroine (b. 1919)"], ["1944-07-06T00:00:00", "Vera Leigh, English World War II heroine (b. 1903)"], ["1944-07-06T00:00:00", "Chūichi Nagumo, Japanese admiral (b. 1887)"], ["1944-07-06T00:00:00", "Sonya Olschanezky, German World War II heroine (b. 1923)"], ["1944-07-06T00:00:00", "Diana Rowden, English World War II heroine (b. 1915)"], ["1944-07-08T00:00:00", "George B. Seitz, American director (b. 1888)"], ["1944-07-08T00:00:00", "Takeo Takagi, Japanese admiral (b. 1892)"], ["1944-07-20T00:00:00", "Ludwig Beck, German general and Chief of the German General Staff (b. 1880)"], ["1944-07-20T00:00:00", "Mildred Harris, American actress (b. 1901)"], ["1944-07-25T00:00:00", "Lesley J. McNair, American general (b. 1883)"], ["1944-07-25T00:00:00", "Jakob von Uexküll, Baltic German biologist (b. 1864)"], ["1944-08-12T00:00:00", "Joseph P. Kennedy, Jr., American fighter pilot, oldest son of Joseph P. Kennedy (b. 1915)"], ["1944-08-12T00:00:00", "Suzanne Spaak, Belgian World War II heroine"], ["1944-08-26T00:00:00", "Hans Leesment, Estonian general (b. 1873)"], ["1944-08-26T00:00:00", "Adam von Trott zu Solz, German diplomat (b. 1909)"], ["1944-09-06T00:00:00", "Gustave Biéler, Swiss WWII hero (b. 1904)"], ["1944-09-06T00:00:00", "Jan Franciszek Czartoryski, Polish Roman Catholic priest, executed during the Warsaw Uprising (b. 1897)"], ["1944-09-11T00:00:00", "Yolande Beekman, French WWII heroine (b. 1911)"], ["1944-09-11T00:00:00", "Madeleine Damerment, French WWII heroine (b. 1917)"], ["1944-09-11T00:00:00", "Noor Inayat Khan, Indian WWII heroine (b. 1914)"], ["1944-09-14T00:00:00", "John Kenneth Macalister, Canadian WWII hero (b. 1914)"], ["1944-09-14T00:00:00", "Frank Pickersgill, Canadian WWII hero (b. 1915)"], ["1944-09-14T00:00:00", "Roméo Sabourin, Canadian WWII hero (b. 1923)"], ["1944-10-26T00:00:00", "HRH The Princess Beatrice, youngest and last surviving child of Queen Victoria (b. 1857)"], ["1944-10-26T00:00:00", "Hiroyoshi Nishizawa, Japanese fighter ace (b. 1920)"], ["1944-10-26T00:00:00", "William Temple, Archbishop of Canterbury (b. 1881)"], ["1944-12-13T00:00:00", "Wassily Kandinsky, Russian-born artist (b. 1866)"], ["1944-12-13T00:00:00", "Lupe Vélez, Mexican actress (b. 1908)"]]