[["1976-01-18T00:00:00", "Full diplomatic relations are established between Bangladesh and Pakistan 5 years after the Bangladesh Liberation War."], ["1976-01-18T00:00:00", "The Scottish Labour Party is formed."], ["1976-01-18T00:00:00", "Super Bowl X: The Pittsburgh Steelers defeat the Dallas Cowboys, 21–17, in Miami."], ["1976-01-27T00:00:00", "The United States vetoes a United Nations resolution that calls for an independent Palestinian state."], ["1976-01-27T00:00:00", "The First Battle of Amgala breaks out between Morocco and Algeria in the Spanish Sahara."], ["1976-02-04T00:00:00", "The 1976 Winter Olympics begin in Innsbruck, Austria."], ["1976-02-04T00:00:00", "In Guatemala and Honduras an earthquake kills more than 22,000."], ["1976-03-01T00:00:00", "U.K. Home Secretary Merlyn Rees ends Special Category Status for those sentenced for scheduled terrorist crimes relating to the civil violence in Northern Ireland."], ["1976-03-01T00:00:00", "Burundi recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-04T00:00:00", "The Maguire Seven are found guilty of possessing explosives and subsequently jailed for 14 years."], ["1976-03-04T00:00:00", "The Northern Ireland Constitutional Convention is formally dissolved in Northern Ireland, resulting in direct rule of Northern Ireland from London via the British Parliament."], ["1976-03-16T00:00:00", "Harold Wilson resigns as Prime Minister of the United Kingdom."], ["1976-03-16T00:00:00", "North Korea recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-17T00:00:00", "Rubin \"Hurricane\" Carter is retried in New Jersey."], ["1976-03-17T00:00:00", "Togo recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-24T00:00:00", "Argentina military forces depose president Isabel Perón."], ["1976-03-24T00:00:00", "A general strike takes place in the People's Republic of the Congo."], ["1976-04-01T00:00:00", "Apple Computer Company is formed by Steve Jobs and Steve Wozniak."], ["1976-04-01T00:00:00", "Conrail (Consolidated Rails Corporation) is formed by the U.S. government, to take control of 13 major Northeast Class-1 railroads that had filed for bankruptcy protection. Conrail takes control at midnight, as a government-owned and operated railroad until 1986, when it is sold to the public."], ["1976-04-01T00:00:00", "The Jovian–Plutonian gravitational effect is first reported by astronomer Patrick Moore."], ["1976-04-01T00:00:00", "Rwanda recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-04-05T00:00:00", "James Callaghan becomes Prime Minister of the United Kingdom."], ["1976-04-05T00:00:00", "Tiananmen Incident: Large crowds lay wreaths at Beijing's Monument of the Martyrs to commemorate the death of Premier Zhou Enlai. Poems against the Gang of Four are also displayed, provoking a police crackdown."], ["1976-04-13T00:00:00", "An explosion in an ammunition factory in Lapua, Finland kills 40."], ["1976-04-13T00:00:00", "The United States Treasury Department reintroduces the two-dollar bill as a Federal Reserve Note on Thomas Jefferson's 233rd birthday as part of the United States Bicentennial celebration."], ["1976-05-04T00:00:00", "The first LAGEOS (Laser Geodynamics Satellite) is launched."], ["1976-05-04T00:00:00", "A train crash in Schiedam, the Netherlands, kills 24 people."], ["1976-05-11T00:00:00", "U.S. President Gerald Ford signs the Federal Election Campaign Act."], ["1976-05-11T00:00:00", "An accident involving a tanker truck carrying anhydrous ammonia takes place in Houston, Texas, resulting in the deaths of 7 people."], ["1976-06-02T00:00:00", "A car bomb fatally injures Arizona Republic reporter Don Bolles."], ["1976-06-02T00:00:00", "The Philippine government opens relations with the Soviet Union."], ["1976-06-20T00:00:00", "Hundreds of Western tourists are moved from Beirut and taken to safety in Syria by the U.S. military, following the murder of the U.S. ambassador."], ["1976-06-20T00:00:00", "General elections are held in Italy."], ["1976-06-20T00:00:00", "Czechoslovakia beats West Germany 5–3 on penalties to win Euro 76, when the game had ended 2–2 after extra time."], ["1976-06-27T00:00:00", "G-6 is renamed \"Group of 7\" (G-7)."], ["1976-06-27T00:00:00", "Palestinian militants hijack an Air France plane in Greece with 246 passengers and 12 crew. They take it to Entebbe, Uganda."], ["1976-06-29T00:00:00", "Seychelles gains independence from the United Kingdom."], ["1976-06-29T00:00:00", "The Conference of Communist and Workers Parties of Europe convenes in East Berlin."], ["1976-07-04T00:00:00", "United States Bicentennial: From coast to coast, the United States celebrates the 200th anniversary of the Declaration of Independence."], ["1976-07-04T00:00:00", "Entebbe Raid: Israeli airborne commandos free 103 hostages being held by Palestinian hijackers of an Air France plane at Uganda's Entebbe Airport; Yonatan Netanyahu and several Ugandan soldiers are killed in the raid."], ["1976-07-07T00:00:00", "German left-wing terrorists Monika Berberich, Gabriella Rollnick, Juliane Plambeck and Inge Viett escape from the Lehrter Straße maximum security prison in West Berlin."], ["1976-07-07T00:00:00", "David Steel becomes leader of the UK's Liberal Party in the aftermath of the scandal which forced out Jeremy Thorpe."], ["1976-07-10T00:00:00", "Four mercenaries, three British and one American, are shot by firing squad in Angola."], ["1976-07-10T00:00:00", "An explosion in Seveso, Italy, causes extended pollution to a large area in the neighborhood of Milano, with many evacuations and a large number of people affected by the toxic cloud."], ["1976-07-17T00:00:00", "The 1976 Summer Olympics begin in Montreal, Canada."], ["1976-07-17T00:00:00", "East Timor is declared the 27th province of Indonesia."], ["1976-07-27T00:00:00", "The United Kingdom breaks diplomatic relations with its former colony Uganda in response to the hijacking of Air France Flight 139."], ["1976-07-27T00:00:00", "Delegates attending an American Legion convention at The Bellevue-Stratford Hotel in Philadelphia, US, begin falling ill with a form of pneumonia: this will eventually be recognised as the first outbreak of Legionnaires' disease and will end in the deaths of 29 attendees."], ["1976-07-31T00:00:00", "NASA releases the famous Face on Mars photo, taken by Viking 1."], ["1976-07-31T00:00:00", "The Big Thompson River in northern Colorado floods, destroying more than 400 cars and houses and killing 143 people."], ["1976-08-01T00:00:00", "The Caribbean nation of Trinidad and Tobago becomes a republic, replacing Elizabeth II with President Ellis Clarke as its head of state."], ["1976-08-01T00:00:00", "The Seattle Seahawks play their first football game."], ["1976-08-01T00:00:00", "Racing Champion Niki Lauda suffers serious burns in the German Grand Prix."], ["1976-08-14T00:00:00", "Ten thousand Protestant and Catholic women demonstrate for peace in Northern Ireland."], ["1976-08-14T00:00:00", "The Senegalese political party PAI-Rénovation is legally recognized, becoming the third legal party in the country."], ["1976-08-25T00:00:00", "Jacques Chirac resigns as Prime Minister of France; he is succeeded by Raymond Barre."], ["1976-08-25T00:00:00", "Landslide disaster in Sau Mau Ping, Hong Kong."], ["1976-08-26T00:00:00", "The first known outbreak of Ebola virus occurs in Yambuku, Zaire."], ["1976-08-26T00:00:00", "Prince Bernhard of Lippe-Biesterfeld, husband of Queen Juliana of the Netherlands, resigns from various posts over a scandal involving alleged corruption, in connection with business dealings with the Lockheed Corporation."], ["1976-09-01T00:00:00", "Cigarette and tobacco advertising is banned on Australian television and radio."], ["1976-09-01T00:00:00", "Aparicio Méndez, a jurist, is inaugurated as a civilian de facto President of Uruguay in the framework of a dictatorship."], ["1976-09-01T00:00:00", "The state of emergency, being in force since 1939, is lifted in the Republic of Ireland."], ["1976-09-06T00:00:00", "Cold War: Soviet Air Force pilot Lt. Viktor Belenko lands a MiG-25 jet fighter at Hakodate, on the island of Hokkaidō in Japan, and requests political asylum in the United States."], ["1976-09-06T00:00:00", "Frank Sinatra brings Jerry Lewis's former partner Dean Martin onstage, unannounced, at the 1976 Jerry Lewis MDA Telethon in Las Vegas, reuniting the comedy team for the first (and only) time in over 20 years."], ["1976-09-10T00:00:00", "Zagreb mid-air collision: A British Airways Trident and a Yugoslav DC-9 collide near Zagreb, Yugoslavia (present-day Zagreb, Croatia), killing all 176 aboard."], ["1976-09-10T00:00:00", "Osamu Tezuka begins serialising MW, a manga inspired by the 1974 Kakuei Tanaka government scandal."], ["1976-09-16T00:00:00", "Shavarsh Karapetyan saves 20 people from a trolleybus that had fallen into a Yerevan reservoir."], ["1976-09-16T00:00:00", "Beginning with the Night of the Pencils, a series of kidnappings and forced disappearances followed by torture, rape, and murder of students under the Argentine dictatorship takes place."], ["1976-09-21T00:00:00", "The Seychelles join the United Nations."], ["1976-09-21T00:00:00", "Orlando Letelier is assassinated in Washington, D.C. by agents of Chilean dictator Augusto Pinochet."], ["1976-10-06T00:00:00", "Cubana de Aviación Flight 455 crashes due to a bomb placed by anti-Fidel Castro terrorists, after taking off from Bridgetown, Barbados; all 73 people on board are killed."], ["1976-10-06T00:00:00", "Students gathering at Thammasat University in Bangkok, Thailand are massacred, while protesting the return of ex-dictator Thanom Kittikachorn by a coalition of right-wing paramilitary and government forces, triggering the return of the military to government."], ["1976-10-06T00:00:00", "In San Francisco, during his second televised debate with Jimmy Carter, U.S. President Gerald Ford stumbles when he declares that \"there is no Soviet domination of Eastern Europe\" (there is at the time)."], ["1976-10-06T00:00:00", "The Cultural Revolution in China concludes upon the capture of the Gang of Four."], ["1976-10-08T00:00:00", "Thorbjörn Fälldin replaces Olof Palme as Prime Minister of Sweden ."], ["1976-10-19T00:00:00", "The Copyright Act of 1976 extends copyright duration for an additional 20 years in the United States."], ["1976-10-19T00:00:00", "The Battle of Aishiya is fought in Lebanon."], ["1976-10-19T00:00:00", "The Chimpanzee (Pan troglodytes) is placed on the list of endangered species."], ["1976-11-26T00:00:00", "Microsoft is officially registered with the Office of the Secretary of the State of New Mexico."], ["1976-11-26T00:00:00", "The Warsaw Treaty Organization joint secretariat is established."], ["1976-12-01T00:00:00", "Angola joins the United Nations."], ["1976-12-01T00:00:00", "José López Portillo takes office as President of Mexico."], ["1976-12-01T00:00:00", "The Sex Pistols achieve public notoriety, as they unleash several 4-letter words live on Bill Grundy's early evening TV show."], ["1976-12-01T00:00:00", "Sir Douglas Nicholls is appointed the 28th Governor of South Australia, the first Australian Aboriginal appointed to vice-regal office."], ["1976-12-03T00:00:00", "Bob Marley and his manager Don Taylor are shot in an assassination attempt in Kingston, Jamaica."], ["1976-12-03T00:00:00", "Patrick Hillery is elected unopposed as the 6th President of Ireland."], ["1976-12-08T00:00:00", "The Congressional Hispanic Caucus is established by the 5 Latinos in the United States Congress: Herman Badillo of the Bronx, E. de la Garza and Henry B. Gonzalez of Texas, Edward R. Roybal of California, and the nonvoting Resident Commissioner of Puerto Rico, Baltasar Corrada del Río."], ["1976-12-08T00:00:00", "Hotel California by the Eagles is released."], ["1976-12-10T00:00:00", "The United Nations General Assembly adopts the Convention on the Prohibition of Military or Any Other Hostile Use of Environmental Modification Techniques."], ["1976-12-10T00:00:00", "The 9th Congress of the Sammarinese Communist Party convenes."], ["1976-12-15T00:00:00", "Samoa joins the United Nations."], ["1976-12-15T00:00:00", "Denis Healey announces to the British Parliament that he has successfully negotiated a £2.3bn loan from the International Monetary Fund."], ["1976-01-02T00:00:00", "Cletidus Hunt, American football player"], ["1976-01-02T00:00:00", "Mahée Paiement, Canadian actress"], ["1976-01-02T00:00:00", "Phil Radford, American environmental, clean energy and democracy leader, Greenpeace Executive Director"], ["1976-01-02T00:00:00", "Paz Vega, Spanish actress"], ["1976-01-07T00:00:00", "Éric Gagné, Canadian baseball player"], ["1976-01-07T00:00:00", "Alfonso Soriano, Dominican baseball player"], ["1976-01-13T00:00:00", "Ross McCall, Scottish actor"], ["1976-01-13T00:00:00", "Michael Peña, American actor"], ["1976-01-13T00:00:00", "Bic Runga, New Zealand singer/songwriter"], ["1976-01-13T00:00:00", "Mario Yepes, Colombian football player"], ["1976-01-20T00:00:00", "Kirsty Gallacher, Scottish TV presenter"], ["1976-01-20T00:00:00", "Gretha Smit, Dutch speed skater"], ["1976-01-20T00:00:00", "Anastasia Volochkova, Russian prima ballerina"], ["1976-01-20T00:00:00", "Michael Myers, former NFL defensive tackle"], ["1976-01-22T00:00:00", "James Dearth, American football player"], ["1976-01-22T00:00:00", "Mikko Luoma, Finnish ice-hockey player"], ["1976-01-23T00:00:00", "Angelica Lee, Taiwanese actress and singer"], ["1976-01-23T00:00:00", "Nigel McGuinness, English professional wrestler"], ["1976-01-31T00:00:00", "Buddy Rice, American race car driver"], ["1976-01-31T00:00:00", "Paul Scheer, American actor and comedian"], ["1976-02-02T00:00:00", "Carlos Coste, Venezuelan free-diver"], ["1976-02-02T00:00:00", "Lori Beth Denberg, American comedian"], ["1976-02-02T00:00:00", "James Hickman, British swimmer"], ["1976-02-05T00:00:00", "Abhishek Bachchan, Indian actor"], ["1976-02-05T00:00:00", "Tony Jaa, Thai martial art film actor/choreographer/director"], ["1976-02-05T00:00:00", "Brian Moorman, American football player"], ["1976-02-12T00:00:00", "Jenni Falconer, British TV presenter"], ["1976-02-12T00:00:00", "Silvia Saint, Czech actress"], ["1976-02-20T00:00:00", "Johanna Beisteiner, Austrian guitarist"], ["1976-02-20T00:00:00", "Chris Cillizza, American journalist"], ["1976-02-20T00:00:00", "Gail Kim, Canadian professional wrestler"], ["1976-02-28T00:00:00", "Ali Larter, American actress and model"], ["1976-02-28T00:00:00", "Guillaume Lemay-Thivierge, Canadian actor"], ["1976-03-04T00:00:00", "Robbie Blake, English footballer"], ["1976-03-04T00:00:00", "Hiram Bocachica, Puerto Rican baseball player"], ["1976-03-04T00:00:00", "Sean Covel, American film producer"], ["1976-03-04T00:00:00", "Tommy Jönsson, Swedish football player"], ["1976-03-04T00:00:00", "Regi Penxten, Belgian DJ and record producer"], ["1976-03-04T00:00:00", "Thierry Renaer, Belgian field hockey player"], ["1976-03-08T00:00:00", "Sergej Ćetković, Montenegrin singer"], ["1976-03-08T00:00:00", "Gaz Coombes, English musician and singer-songwriter (Supergrass)"], ["1976-03-08T00:00:00", "Freddie Prinze, Jr., American actor"], ["1976-03-10T00:00:00", "Miroslav Kostadinov, Bulgarian singer and songwriter"], ["1976-03-10T00:00:00", "Haifa Wehbe, Lebanese model, actress and singer"], ["1976-03-16T00:00:00", "Kim Johnsson, Swedish hockey player"], ["1976-03-16T00:00:00", "Blu Cantrell, American R&B singer"], ["1976-03-16T00:00:00", "Zhu Chen, Chinese chess grandmaster"], ["1976-03-17T00:00:00", "Álvaro Recoba, Uruguayan footballer"], ["1976-03-17T00:00:00", "Stephen Gately, Irish singer (Boyzone) (d. 2009)"], ["1976-03-19T00:00:00", "Rachel Blanchard, Canadian actress"], ["1976-03-19T00:00:00", "Alessandro Nesta, Italian football player"], ["1976-03-22T00:00:00", "Teun de Nooijer, Dutch field hockey player"], ["1976-03-22T00:00:00", "Reese Witherspoon, American actress"], ["1976-03-22T00:00:00", "Wayne Turner, American basketball player"], ["1976-03-23T00:00:00", "Keri Russell, American actress"], ["1976-03-23T00:00:00", "Sir Chris Hoy, Scottish cyclist"], ["1976-03-24T00:00:00", "Aaron Brooks, American football player"], ["1976-03-24T00:00:00", "Peyton Manning, American football player"], ["1976-03-30T00:00:00", "Ty Conklin, American ice-hockey player"], ["1976-03-30T00:00:00", "Jessica Cauffiel, American actress and singer"], ["1976-03-30T00:00:00", "Ayako Kawasumi, Japanese voice actress"], ["1976-04-02T00:00:00", "Lucy Diakovska, German-Bulgarian pop singer"], ["1976-04-02T00:00:00", "Rory Sabbatini, South African golfer"], ["1976-04-15T00:00:00", "Jason Bonsignore, Canadian ice-hockey player"], ["1976-04-15T00:00:00", "Brock Huard, former American football player"], ["1976-04-15T00:00:00", "Steve Williams, British rower"], ["1976-04-18T00:00:00", "Melissa Joan Hart, American actress"], ["1976-04-18T00:00:00", "Sean Maguire, British actor and singer"], ["1976-04-25T00:00:00", "Tim Duncan, American basketball player"], ["1976-04-25T00:00:00", "Rainer Schüttler, German tennis player"], ["1976-04-25T00:00:00", "Kim Jong-kook, South Korean singer, TV personality"], ["1976-05-03T00:00:00", "Beto, Portuguese footballer"], ["1976-05-03T00:00:00", "Jeff Halpern, American ice hockey player"], ["1976-05-07T00:00:00", "Michael P. Murphy, U.S. Navy SEAL, First recipient of the Medal of Honor in the Afghanistan War"], ["1976-05-07T00:00:00", "Mariana van Zeller, Portuguese journalist and National Geographic correspondent"], ["1976-05-08T00:00:00", "Martha Wainwright, Canadian-American folk-pop singer"], ["1976-05-08T00:00:00", "Ian Watkins, Welsh singer (Steps) and actor"], ["1976-05-15T00:00:00", "Tyler Walker, American baseball player"], ["1976-05-15T00:00:00", "Jacek Krzynówek, Polish footballer"], ["1976-05-15T00:00:00", "Ryan Leaf, American former football quarterback"], ["1976-05-22T00:00:00", "Chris Brazzell, Canadian and American Football player"], ["1976-05-22T00:00:00", "Daniel Erlandsson, Swedish drummer"], ["1976-05-25T00:00:00", "Stefan Holm, Swedish high jumper"], ["1976-05-25T00:00:00", "Miguel Tejada, Dominican baseball player"], ["1976-05-25T00:00:00", "Cillian Murphy, Irish actor"], ["1976-05-25T00:00:00", "J. Michael Tatum, American voice actor"], ["1976-05-28T00:00:00", "Alexei Nemov, Russian gymnast"], ["1976-05-28T00:00:00", "Liam O'Brien, American actor"], ["1976-05-31T00:00:00", "Roar Ljøkelsøy, Norwegian ski jumper"], ["1976-05-31T00:00:00", "Colin Farrell, Irish actor"], ["1976-06-02T00:00:00", "Antônio Rodrigo Nogueira, Brazilian mixed martial artist"], ["1976-06-02T00:00:00", "Tim Rice-Oxley, English rock musician/composer (Keane)"], ["1976-06-02T00:00:00", "Queen 'Masenate Mohato Seeiso of Lesotho"], ["1976-06-06T00:00:00", "Emilie-Claire Barlow, Canadian actress and singer"], ["1976-06-06T00:00:00", "Geoff Rowley, English skateboarder"], ["1976-06-10T00:00:00", "Freddy García, Venezuelan baseball player"], ["1976-06-10T00:00:00", "Esther Ouwehand, Dutch politician, parliamentarian for the Party for the Animals"], ["1976-06-10T00:00:00", "Mariana Seoane, Mexican actress"], ["1976-06-13T00:00:00", "Kym Marsh, British singer (Hear'Say) and actress"], ["1976-06-13T00:00:00", "Jason \"J\" Brown, British singer (5ive)"], ["1976-06-23T00:00:00", "Brandon Stokley, American football player"], ["1976-06-23T00:00:00", "Emmanuelle Vaugier, Canadian actress"], ["1976-06-23T00:00:00", "Patrick Vieira, French footballer"], ["1976-07-01T00:00:00", "Justin Lo, Hong Kong singer and actor"], ["1976-07-01T00:00:00", "Patrick Kluivert, Dutch footballer"], ["1976-07-01T00:00:00", "Ruud van Nistelrooy, Dutch footballer"], ["1976-07-01T00:00:00", "Lina Rafn, Danish singer"], ["1976-07-01T00:00:00", "Kellie Bright, English actress"], ["1976-07-03T00:00:00", "Shane Lynch, Irish singer (Boyzone)"], ["1976-07-03T00:00:00", "Wanderlei Silva, Brazilian mixed martial artist"], ["1976-07-09T00:00:00", "Shelton Benjamin, American professional wrestler"], ["1976-07-09T00:00:00", "Mickey He, Chinese actor and singer"], ["1976-07-09T00:00:00", "Fred Savage, American actor and director"], ["1976-07-10T00:00:00", "Ludovic Giuly, French footballer"], ["1976-07-10T00:00:00", "Adrian Grenier, American actor, musician, and director"], ["1976-07-16T00:00:00", "Anna Smashnova, Israeli tennis player"], ["1976-07-16T00:00:00", "Bobby Lashley, American professional wrestler"], ["1976-07-17T00:00:00", "Luke Bryan, American country music singer-songwriter"], ["1976-07-17T00:00:00", "Marcos Senna, Brazilian footballer"], ["1976-07-19T00:00:00", "Benedict Cumberbatch, English actor"], ["1976-07-19T00:00:00", "Eric Prydz, Swedish DJ and producer"], ["1976-07-20T00:00:00", "Alex Yoong, Malaysian race car driver"], ["1976-07-25T00:00:00", "Mauricio Aspe, Mexican actor"], ["1976-07-25T00:00:00", "Timur Mutsurayev, Chechen bard"], ["1976-07-25T00:00:00", "Stéphane Rideau, French actor"], ["1976-07-31T00:00:00", "Annie Parisse, American actress"], ["1976-07-31T00:00:00", "Mela Lee, American singer and voice actress"], ["1976-08-01T00:00:00", "Nwankwo Kanu, Nigerian Football player"], ["1976-08-01T00:00:00", "Amar Upadhyay, Indian television actor and model"], ["1976-08-06T00:00:00", "Soleil Moon Frye, American actress"], ["1976-08-06T00:00:00", "Melissa George, Australian actress"], ["1976-08-08T00:00:00", "Drew Lachey, American singer (98 Degrees)"], ["1976-08-08T00:00:00", "JC Chasez, American singer ('N Sync)"], ["1976-08-09T00:00:00", "Aled Haydn Jones, Welsh radio producer and presenter"], ["1976-08-09T00:00:00", "Mark Priestley, Australian actor (d. 2008)"], ["1976-08-09T00:00:00", "Audrey Tautou, French actress"], ["1976-08-12T00:00:00", "Mikko Lindström, Finnish rock guitarist"], ["1976-08-12T00:00:00", "Antoine Walker, American basketball player"], ["1976-08-12T00:00:00", "Wednesday 13, American rock musician"], ["1976-08-14T00:00:00", "Alex Albrecht, American television personality"], ["1976-08-14T00:00:00", "Maya Nasri, Lebanese actress and singer"], ["1976-08-18T00:00:00", "Bryan Volpenhein, American rower"], ["1976-08-18T00:00:00", "Lee Seung-yeop, South Korean baseball player"], ["1976-08-23T00:00:00", "Scott Caan, American actor"], ["1976-08-27T00:00:00", "Carlos Moyá, Spanish tennis player"], ["1976-08-27T00:00:00", "Mark Webber, Australian race car driver"], ["1976-08-27T00:00:00", "Sarah Chalke, Canadian actress"], ["1976-08-30T00:00:00", "Lillo Brancato, Jr., American actor"], ["1976-08-30T00:00:00", "Cristian Gonzáles, Uruguayan-born Indonesian footballer"], ["1976-09-01T00:00:00", "Marcos Ambrose Australian race car driver"], ["1976-09-01T00:00:00", "Ivano Brugnetti, Italian race walker"], ["1976-09-03T00:00:00", "Jevon Kearse, American football player"], ["1976-09-03T00:00:00", "Vivek Oberoi, Indian actor"], ["1976-09-17T00:00:00", "Kristian Kiehling, German-Latvian actor"], ["1976-09-19T00:00:00", "Isha Koppikar, Indian actress"], ["1976-09-19T00:00:00", "Alison Sweeney, American actress"], ["1976-09-20T00:00:00", "Yui Horie, Japanese voice actress"], ["1976-09-20T00:00:00", "Enuka Okuma, Canadian actress"], ["1976-09-25T00:00:00", "Chauncey Billups, American basketball player"], ["1976-09-25T00:00:00", "Chiara Siracusa, Maltese singer, Eurovision Song Contest 2005 runner-up"], ["1976-10-04T00:00:00", "Alicia Silverstone, American actress"], ["1976-10-04T00:00:00", "Mauro Camoranesi, Italian footballer"], ["1976-10-06T00:00:00", "Barbie Hsu, Taiwanese actress and singer"], ["1976-10-06T00:00:00", "Freddy García, Venezuelan baseball player"], ["1976-10-07T00:00:00", "Pekka Kuusisto, Finnish violinist"], ["1976-10-07T00:00:00", "Taylor Hicks, American singer"], ["1976-10-07T00:00:00", "Gilberto Silva, Brazilian football player"], ["1976-10-09T00:00:00", "Nick Swardson, American actor and stand-up comedian"], ["1976-10-10T00:00:00", "Bob Burnquist, Brazilian skateboarder"], ["1976-10-10T00:00:00", "Shane Doan, Canadian ice hockey player"], ["1976-10-19T00:00:00", "Ryuji Imada, Japanese golfer"], ["1976-10-19T00:00:00", "Dan Smith, Canadian ice-hockey player"], ["1976-10-19T00:00:00", "Michael Young, American baseball player"], ["1976-10-19T00:00:00", "Desmond Harrington, American actor"], ["1976-10-20T00:00:00", "Plamen Goranov, Bulgarian photographer, mountain climber and a Varna-based local protest leader (d. 2013)"], ["1976-10-23T00:00:00", "Cat Deeley, British television presenter"], ["1976-10-23T00:00:00", "Ryan Reynolds, Canadian actor"], ["1976-10-26T00:00:00", "Miikka Kiprusoff, Finnish hockey player"], ["1976-10-26T00:00:00", "Jeremy Wotherspoon, Canadian speed skater"], ["1976-11-06T00:00:00", "Pat Tillman, American footballer (d. 2004)"], ["1976-11-06T00:00:00", "Troy Hambrick, American football player"], ["1976-11-06T00:00:00", "Wiley Wiggins, American actor"], ["1976-11-19T00:00:00", "Jack Dorsey, American software architect, businessman, creator of Twitter"], ["1976-11-19T00:00:00", "Jun Shibata, Japanese singer and songwriter"], ["1976-11-19T00:00:00", "Robin Dunne, Canadian actress"], ["1976-11-20T00:00:00", "Laura Harris, Canadian actress"], ["1976-11-20T00:00:00", "Dominique Dawes, African-American Olympic gymnast"], ["1976-11-22T00:00:00", "Torsten Frings, German footballer"], ["1976-11-22T00:00:00", "Ville Valo, Finnish rock singer (HIM)"], ["1976-11-24T00:00:00", "Chen Lu, Chinese figure skater"], ["1976-11-24T00:00:00", "Christian Laflamme, Canadian ice-hockey player"], ["1976-12-03T00:00:00", "Cornelius Griffin, American football player"], ["1976-12-03T00:00:00", "Marcos Denner, Brazilian footballer"], ["1976-12-18T00:00:00", "Antti Koivumäki, Finnish poet and keyboardist (Aavikko) (d. 2002)"], ["1976-12-18T00:00:00", "Koyuki, Japanese actress"], ["1976-12-25T00:00:00", "Tuomas Holopainen, Finnish metal keyboardist (Nightwish)"], ["1976-12-25T00:00:00", "Armin van Buuren, Dutch music producer and DJ"], ["1976-01-26T00:00:00", "Luis Alberti, Dominican Republic musician (b. 1906)"], ["1976-01-26T00:00:00", "João Branco Núncio, Portuguese bullfighter (b. 1901)"], ["1976-01-30T00:00:00", "Mance Lipscomb, American singer (b. 1895)"], ["1976-01-30T00:00:00", "Ernest Gold (meteorologist), British meteorologist and educated at St John's College, Cambridge (b. 1881)"], ["1976-02-01T00:00:00", "Werner Heisenberg, German physicist, Nobel Prize laureate (b. 1901)"], ["1976-02-01T00:00:00", "Hans Richter, German artist (b. 1888)"], ["1976-02-01T00:00:00", "George Whipple, American scientist, recipient of the Nobel Prize in Physiology or Medicine (b. 1878)"], ["1976-02-11T00:00:00", "Lee J. Cobb, American actor (b. 1911)"], ["1976-02-11T00:00:00", "Alexander Lippisch, German aerodynamicist (b. 1894)"], ["1976-02-11T00:00:00", "Charlie Naughton, Scottish actor (b. 1886)"], ["1976-02-17T00:00:00", "Jean Servais, Belgian actor (b. 1910)"], ["1976-02-17T00:00:00", "Marjorie Muir Worthington, American writer (b. 1900)"], ["1976-02-20T00:00:00", "René Cassin, French judge, recipient of the Nobel Peace Prize (b. 1887)"], ["1976-02-20T00:00:00", "Kathryn Kuhlman, American evangelist and faith healer (b. 1907)"], ["1976-03-05T00:00:00", "Charles Lederer, American screenwriter (b. 1910)"], ["1976-03-05T00:00:00", "Otto Tief, Estonian politician and military commander (b. 1889)"], ["1976-03-06T00:00:00", "Mary Petty, American illustrator (b. 1899)"], ["1976-03-06T00:00:00", "Max 'Slapsie Maxie' Rosenbloom, American boxer and actor (b. 1907)"], ["1976-03-07T00:00:00", "Wright Patman, American politician (b. 1893)"], ["1976-03-07T00:00:00", "Adolphe Reymond, Swiss football (b. 1896)"], ["1976-03-10T00:00:00", "Andris Andreiko, Latvian draughts player (b. 1942)"], ["1976-03-10T00:00:00", "Salomon Smolianoff, Russian counterfeiter and Holocaust survivor (b. 1899)"], ["1976-03-10T00:00:00", "Haddon Sundblom, Swedish illustrator and American artist (b. 1899)"], ["1976-03-19T00:00:00", "Paul Kossoff, British rock guitarist (Free) (b. 1950)"], ["1976-03-19T00:00:00", "Stuart Cloete, South African novelist, essayist, biographer and short story writer (b. 1897)"], ["1976-03-24T00:00:00", "Bernard Montgomery, British field marshal (b. 1887)"], ["1976-03-24T00:00:00", "E. H. Shepard, English artist and book illustrator (b. 1879)"], ["1976-03-24T00:00:00", "Francis Dominic Murnaghan (mathematician), Irish mathematician (b. 1893)"], ["1976-04-09T00:00:00", "Dagmar Nordstrom, American composer, pianist (Nordstrom Sisters) (b. 1903)"], ["1976-04-09T00:00:00", "Phil Ochs, American folk singer and political activist (Outside of a Small Circle of Friends) (b. 1940)"], ["1976-04-12T00:00:00", "Miriam Cooper, American actress (b. 1891)"], ["1976-04-12T00:00:00", "Paul Ford, American actor (b. 1901)"], ["1976-04-25T00:00:00", "Carol Reed, English film director (b. 1906)"], ["1976-04-25T00:00:00", "Markus Reiner, Israeli scientist (b. 1886)"], ["1976-04-25T00:00:00", "Naum Shusterman, Soviet military engineer (b. 1912)"], ["1976-05-09T00:00:00", "Jens Bjørneboe, Norwegian author (b. 1920)"], ["1976-05-09T00:00:00", "Ulrike Meinhof, German terrorist (b. 1934)"], ["1976-05-20T00:00:00", "Royal E. Ingersoll, American admiral (b. 1883)"], ["1976-05-20T00:00:00", "Zelmar Michelini, Uruguayan politician, member of the Christian-Democrat party (disappeared) (b. 1924)"], ["1976-05-20T00:00:00", "Héctor Gutiérrez Ruiz, Uruguayan politician (assassinated) (b. 1934)"], ["1976-05-26T00:00:00", "Martin Heidegger, German philosopher (b. 1889)"], ["1976-05-26T00:00:00", "Juan Maino, Chilean leader of MAPU, \"disappeared\""], ["1976-05-30T00:00:00", "Max Carey, American baseball player (Pittsburgh Pirates) and a member in the MLB Hall of Fame (b. 1890)"], ["1976-05-30T00:00:00", "Mitsuo Fuchida, Japanese aviator, naval officer, and Christian evangelist (b. 1902)"], ["1976-05-31T00:00:00", "Martha Beall Mitchell, American wife of John N. Mitchell (b. 1918)"], ["1976-05-31T00:00:00", "Jacques Monod, French biologist, recipient of the Nobel Prize in Physiology or Medicine (b. 1910)"], ["1976-06-02T00:00:00", "Juan José Torres, former President of Bolivia (assassinated in the frame of Operation Condor) (b. 1920)"], ["1976-06-02T00:00:00", "Don Bolles, American newspaper reporter (assassinated) (b. 1928)"], ["1976-06-06T00:00:00", "J. Paul Getty, American industrialist, founder of Getty Oil (b. 1892)"], ["1976-06-06T00:00:00", "Victor Varconi, Hungarian actor (b. 1891)"], ["1976-06-07T00:00:00", "Bobby Hackett, American jazz musician (b. 1915)"], ["1976-06-07T00:00:00", "Shigetarō Shimada, admiral in the Imperial Japanese Navy during World War II (b. 1883)"], ["1976-06-11T00:00:00", "Chief Red Fox, nephew of famed Sioux war leader, Crazy Horse (b. 1870)"], ["1976-06-11T00:00:00", "Toots Mondt, American WWF promoter (b. 1886)"], ["1976-06-30T00:00:00", "Firpo Marberry, American baseball player (b. 1898)"], ["1976-06-30T00:00:00", "Alberta Ramage Neely, the wife of former Governor of West Virginia Matthew M. Neely (b. 1880)"], ["1976-07-01T00:00:00", "Zhang Wentian, General Secretary of the Communist Party of China (b. 1900)"], ["1976-07-01T00:00:00", "Anneliese Michel, German Catholic woman who was believed to be possessed by demons (b. 1952)"], ["1976-07-04T00:00:00", "Antoni Słonimski, Polish poet and writer (b. 1895)"], ["1976-07-04T00:00:00", "Yonatan Netanyahu, Israeli commando leader (b. 1946)"], ["1976-07-07T00:00:00", "Norman Foster, American film director (b. 1900)"], ["1976-07-07T00:00:00", "Walter Lowenfels, American poet, journalist, and member of the Communist Party USA (b. 1897)"], ["1976-07-07T00:00:00", "Walter Giesler, American soccer coach (b. 1910)"], ["1976-07-12T00:00:00", "James Wong Howe, American cinematographer (b. 1899)"], ["1976-07-12T00:00:00", "Ted Mack, American radio and television host (b. 1904)"], ["1976-07-13T00:00:00", "Joachim Peiper, German military leader (b. 1915)"], ["1976-07-13T00:00:00", "Frederick Hawksworth, GWR Chief mechanical engineer (b. 1884)"], ["1976-08-02T00:00:00", "Cecilia, Spanish singer-songwriter (b. 1948)"], ["1976-08-02T00:00:00", "Fritz Lang, Austrian-German-American filmmaker, screenwriter and occasional film producer (b. 1890)"], ["1976-08-03T00:00:00", "Vladimir Vranić, Croatian mathematician (b. 1896)"], ["1976-08-03T00:00:00", "Valery Sablin, Soviet mutineer (executed) (b. 1939)"], ["1976-08-06T00:00:00", "Gregor Piatigorsky, Russian cellist (b. 1903)"], ["1976-08-06T00:00:00", "Hans Edmund Nicola Burgeff, German botanist (b.1883)"], ["1976-08-06T00:00:00", "William Mervyn, English actor (b.1912)"], ["1976-08-06T00:00:00", "Charles Broad, British Army General during World War II (b.1882)"], ["1976-08-10T00:00:00", "Ray \"Crash\" Corrigan, American actor (b. 1902)"], ["1976-08-10T00:00:00", "Robert L. May, Creator of Rudolph the Red-Nosed Reindeer (b. 1905)"], ["1976-08-26T00:00:00", "Warner Anderson, American actor (b. 1911)"], ["1976-08-26T00:00:00", "Lotte Lehmann, German soprano (b. 1888)"], ["1976-08-26T00:00:00", "John Grimes (priest), Archdeacon of Northampton from 1941 to 1959 (b. 1881)"], ["1976-09-09T00:00:00", "Yehezkel Abramsky, Russian-born rabbi, head of the London Beth Din for 17 years (b. 1886)"], ["1976-09-09T00:00:00", "Mao Zedong, Chinese communist revolutionary, guerrilla warfare strategist, author, political theorist, and leader of the Chinese Revolution (b. 1893)"], ["1976-10-05T00:00:00", "Barbara Nichols, American actress (b. 1929)"], ["1976-10-05T00:00:00", "Lars Onsager, Norwegian chemist, Nobel Prize laureate (b. 1903)"], ["1976-10-11T00:00:00", "Connee Boswell, American singer (b. 1907)"], ["1976-10-11T00:00:00", "Alfredo Bracchi, Italian author (b. 1897)"], ["1976-11-28T00:00:00", "Rosalind Russell, American actress (b. 1907)"], ["1976-11-28T00:00:00", "Albert Caquot, considered as the \"best living French engineer\" (b. 1881)"], ["1976-11-29T00:00:00", "Godfrey Cambridge, American actor (b. 1933)"], ["1976-11-29T00:00:00", "Judith Lowry, American actress (b. 1890)"], ["1976-12-03T00:00:00", "Angelo Iachino, Italian admiral (b. 1889)"], ["1976-12-03T00:00:00", "Mary Nash, American actress (b. 1884)"], ["1976-12-03T00:00:00", "Louis E. Eliasberg, American financier and numismatist (b. 1896)"], ["1976-12-04T00:00:00", "Benjamin Britten, English composer (b. 1913)"], ["1976-12-04T00:00:00", "Tommy Bolin, American guitarist (b. 1951)"], ["1976-12-25T00:00:00", "Frankie Darro, American actor (b. 1917)"], ["1976-12-25T00:00:00", "Irving Lerner, American cinematographer and director (b. 1909)"]]