[["2004-02-26T00:00:00", "The United States lifts a 1981 travel ban upon Libya."], ["2004-02-26T00:00:00", "Macedonian President Boris Trajkovski is killed in a plane crash near Mostar, Bosnia and Herzegovina."], ["2004-02-27T00:00:00", "2004 SuperFerry 14 bombing: The Abu Sayyaf guerrilla group is blamed for the deadliest terrorist attack at sea in world history, which kills 116 in the Philippines."], ["2004-02-27T00:00:00", "The John Jay Report into Catholic sex abuse cases in the United States has its initial release."], ["2004-03-29T00:00:00", "The Republic of Ireland bans smoking in all enclosed work places, including restaurants, pubs and bars."], ["2004-03-29T00:00:00", "The largest expansion of NATO to date takes place, allowing Bulgaria, Estonia, Latvia, Lithuania, Romania, Slovakia and Slovenia into the organization."], ["2004-07-01T00:00:00", "The Cassini–Huygens spacecraft arrives at Saturn."], ["2004-07-01T00:00:00", "Vatican City gains full membership rights in the United Nations except voting."], ["2004-07-04T00:00:00", "Groundbreaking for the Freedom Tower begins at Ground Zero in New York City."], ["2004-07-04T00:00:00", "The Greek national football team wins the 2004 UEFA European Championship in Portugal."], ["2004-08-01T00:00:00", "A supermarket fire in Asunción, Paraguay, kills about 400 and leaves over 100 missing."], ["2004-08-01T00:00:00", "A bomb attack occurs in front of Prague's Casino Royal."], ["2004-08-03T00:00:00", "The Statue of Liberty reopens after security improvements."], ["2004-08-03T00:00:00", "NASA's MESSENGER is launched (it is captured into Mercury's orbit on March 18, 2011)."], ["2004-09-17T00:00:00", "The 2004 Summer Paralympics commence in Athens, Greece."], ["2004-09-17T00:00:00", "Mexico and Japan finish 2-year-long negotiations and sign a Free Trade Agreement in Mexico City."], ["2004-10-20T00:00:00", "The Ubuntu operating system is first released."], ["2004-10-20T00:00:00", "Corporate Airlines Flight 5966 crashes in Missouri, killing 13 people and injuring 2."], ["2004-11-16T00:00:00", "The European Space Agency probe SMART-1 passes from Earth orbit into the orbit of the Moon."], ["2004-11-16T00:00:00", "NASA's hypersonic Scramjet breaks a record by reaching a velocity of about 7,000 mph in an unmanned experimental flight. It obtains a speed of Mach 9.6, almost 10 times the speed of sound."], ["2004-11-16T00:00:00", "Half Life 2 was released."], ["2004-12-31T00:00:00", "Taipei 101, at the time tallest skyscraper in the world, standing at a height of 1,670 feet (509 metres), officially opens."], ["2004-12-31T00:00:00", "Simón Trinidad, high-profile FARC leader, is extradited to the United States, following the second extradition of a high drug dealer in a month and in 2004."], ["2004-01-14T00:00:00", "Terje Bakken, Norwegian musician (b. 1978)"], ["2004-01-14T00:00:00", "Uta Hagen, German actress (b. 1919)"], ["2004-01-22T00:00:00", "Ann Miller, American dancer and actress (b. 1923)"], ["2004-01-22T00:00:00", "Chea Vichea, Cambodian labor leader (unknown birthdate)"], ["2004-01-25T00:00:00", "Fanny Blankers-Koen, Dutch athlete (b. 1918)"], ["2004-01-25T00:00:00", "Miklós Fehér, Hungarian footballer (b. 1979)"], ["2004-02-26T00:00:00", "Boris Trajkovski, President of the Republic of Macedonia (b. 1956)"], ["2004-02-26T00:00:00", "Adolf Ehrnrooth, Finnish general (b. 1905)"], ["2004-05-17T00:00:00", "Tony Randall, American actor (b. 1920)"], ["2004-05-17T00:00:00", "Ezzedine Salim, President of the Iraqi Governing Council (b. 1943)"], ["2004-07-05T00:00:00", "Hugh Shearer, Jamaican politician, 3rd Prime Minister of Jamaica (b. 1923)"], ["2004-07-05T00:00:00", "Rodger Ward, American race car driver (b. 1921)"], ["2004-07-21T00:00:00", "Edward B. Lewis, American geneticist, recipient of the Nobel Prize in Physiology or Medicine (b. 1918)"], ["2004-07-21T00:00:00", "Jerry Goldsmith, American composer (b. 1929)"], ["2004-10-03T00:00:00", "Jacques Benveniste, French immunologist (b. 1935)"], ["2004-10-03T00:00:00", "Janet Leigh, American actress (b. 1927)"], ["2004-10-05T00:00:00", "Rodney Dangerfield, American comedian and actor (b. 1921)"], ["2004-10-05T00:00:00", "Maurice Wilkins, New Zealand-born physicist, recipient of the Nobel Prize in Physiology or Medicine (b. 1916)"], ["2004-11-02T00:00:00", "Theo van Gogh, Dutch film director (b. 1957)"], ["2004-11-02T00:00:00", "Zayed bin Sultan Al Nahyan, ruler of Abu Dhabi and President of the United Arab Emirates (b. 1918)"], ["2004-11-07T00:00:00", "Howard Keel, American singer and actor (b. 1919)"], ["2004-11-07T00:00:00", "Eddie Charlton, Australian snooker player (b. 1929)"], ["2004-12-19T00:00:00", "Herbert C. Brown, English-born chemist, Nobel Prize laureate (b. 1912)"], ["2004-12-19T00:00:00", "Renata Tebaldi, Italian soprano (b. 1922)"], ["2004-12-28T00:00:00", "Jerry Orbach, American actor (b. 1935)"], ["2004-12-28T00:00:00", "Susan Sontag, American writer and activist (b. 1933)"]]