[["1962-01-01T00:00:00", "Western Samoa becomes independent from New Zealand."], ["1962-01-01T00:00:00", "The United States Navy SEALs are activated. SEAL Team One is commissioned in the Pacific Fleet and SEAL Team Two in the Atlantic Fleet."], ["1962-01-01T00:00:00", "The Beatles audition for Decca Records."], ["1962-01-01T00:00:00", "NBC introduces the Laramie peacock before a midnight showing of Laramie."], ["1962-01-24T00:00:00", "The East German government readopts conscription."], ["1962-01-24T00:00:00", "The Organisation de l'armée secrète (OAS) bombs the French Foreign Ministry."], ["1962-02-07T00:00:00", "The United States Government bans all U.S.-related Cuban imports and exports."], ["1962-02-07T00:00:00", "A coal mine explosion in Saarland, West Germany kills 299."], ["1962-03-01T00:00:00", "American Airlines Flight 1 (a Boeing 707) crashes on takeoff at New York International Airport, after a rudder malfunction causes an uncontrolled roll, resulting in the loss of control of the aircraft, with the loss of all 95 on board."], ["1962-03-01T00:00:00", "The S. S. Kresge Company opens its first Kmart discount store in Garden City, Michigan."], ["1962-03-02T00:00:00", "A military coup in Burma brings General Ne Win to power."], ["1962-03-02T00:00:00", "Wilt Chamberlain's 100-point game: Wilt Chamberlain scores 100 points in a single National Basketball Association basketball game."], ["1962-03-18T00:00:00", "Évian Accords: France and Algeria sign an agreement in Évian-les-Bains ending the Algerian War."], ["1962-03-18T00:00:00", "Un premier amour, sung by Isabelle Aubret (music by Claude-Henri Vic, text by Roland Stephane Valade), wins the Eurovision Song Contest 1962 for France."], ["1962-03-19T00:00:00", "An armistice begins in Algeria; however, the OAS continues its terrorist attacks against Algerians."], ["1962-03-19T00:00:00", "Bob Dylan releases his debut album, Bob Dylan, in the United States."], ["1962-03-21T00:00:00", "Taco Bell is founded by Glen Bell in Downey, California."], ["1962-03-26T00:00:00", "France shortens the term for military service from 26 months to 18."], ["1962-03-26T00:00:00", "Baker v. Carr: The U.S. Supreme Court rules that federal courts can order state legislatures to reapportion seats."], ["1962-04-06T00:00:00", "Belgium reestablishes diplomatic relations with the Congo."], ["1962-04-06T00:00:00", "Leonard Bernstein causes controversy with his remarks before a concert featuring Glenn Gould with the New York Philharmonic, when he (Bernstein) announces that although he disagrees with Gould's style of playing the Brahms First Piano Concerto, he finds Gould's ideas fascinating and will conduct the piece anyway. Bernstein's action receives a withering review from New York Times music critic Harold C. Schonberg."], ["1962-05-01T00:00:00", "Norwich City wins the English League Cup, beating Rochdale in the final."], ["1962-05-01T00:00:00", "Dayton Hudson Corporation opens the first of its Target discount stores in Roseville, Minnesota."], ["1962-05-02T00:00:00", "An OAS bomb explodes in Algeria – this and other attacks kill 110 and injure 147."], ["1962-05-02T00:00:00", "Benfica beats Barcelona 5-3 at Olympisch Stadion, Amsterdam and wins the 1961-62 European Cup (football)."], ["1962-05-14T00:00:00", "Juan Carlos of Spain marries the Greek Princess Sophia in Athens."], ["1962-05-14T00:00:00", "Milovan Djilas, former vice-president of Yugoslavia, is given further sentence for publishing Conversations with Stalin."], ["1962-05-23T00:00:00", "Drilling for the new Montreal subway commences."], ["1962-05-23T00:00:00", "Raoul Salan, founder of the French terrorist Organisation armée secrète, is sentenced to life imprisonment in France."], ["1962-06-11T00:00:00", "President John F. Kennedy gives the commencement address at Yale University."], ["1962-06-11T00:00:00", "Frank Morris, John Anglin and Clarence Anglin escape from the Alcatraz Island prison; the men are never heard from again."], ["1962-06-17T00:00:00", "The OAS signs a truce with the FLN in Algeria, but a day later announces that it will continue the fight on behalf of French Algerians."], ["1962-06-17T00:00:00", "Brazil beats Czechoslovakia 3–1 to win the 1962 FIFA World Cup."], ["1962-06-25T00:00:00", "Engel v. Vitale: The United States Supreme Court rules that mandatory prayers in public schools are unconstitutional."], ["1962-06-25T00:00:00", "MANual Enterprises v. Day: The United States Supreme Court rules that photographs of nude men are not obscene, decriminalizing nude male pornographic magazines."], ["1962-06-25T00:00:00", "İsmet İnönü of CHP forms the new government of Turkey (27th government, coalition partners; YTP and CKMP)"], ["1962-07-01T00:00:00", "Rwanda and Burundi gain independence."], ["1962-07-01T00:00:00", "Supporters of Algerian independence win 99% majority in a referendum."], ["1962-07-01T00:00:00", "A heavy smog develops over London."], ["1962-07-01T00:00:00", "Treaty of Nordic Cooperation of Helsinki (23 Mar 1962 signed) in force."], ["1962-07-02T00:00:00", "Charles de Gaulle accepts Algerian independence; France recognizes it the next day."], ["1962-07-02T00:00:00", "The first Walmart store, then known as Wal-Mart (which is still the corporate name), opens for business in Rogers, Arkansas."], ["1962-07-23T00:00:00", "Telstar relays the first live trans-Atlantic television signal."], ["1962-07-25T00:00:00", "The first armed helicopter company of the U.S. Army is formed at Okinawa, Japan."], ["1962-07-25T00:00:00", "The International Agreement on the Neutrality of Laos is signed in Geneva, Switzerland."], ["1962-07-31T00:00:00", "Algeria proclaims independence; Ahmed Ben Bella is the first President."], ["1962-07-31T00:00:00", "A crowd assaults the rally of Sir Oswald Mosley's right-wing Union Movement in London."], ["1962-08-05T00:00:00", "Marilyn Monroe found dead from an overdose of sleeping pills and chloral hydrate, officially ruled a \"probable suicide\". However, the exact cause of her death has been disputed."], ["1962-08-05T00:00:00", "The South African government arrests Nelson Mandela in Howick, and charges him with incitement to rebellion."], ["1962-08-16T00:00:00", "Beatles drummer Pete Best is fired and replaced by Ringo Starr."], ["1962-08-16T00:00:00", "Algeria joins the Arab League."], ["1962-09-01T00:00:00", "A referendum in Singapore supports the Malayan Federation."], ["1962-09-01T00:00:00", "Typhoon Wanda strikes Hong Kong, killing at least 130 and wounding more than 600."], ["1962-09-21T00:00:00", "A border conflict between China and India erupts into fighting."], ["1962-09-21T00:00:00", "New Musical Express, a British music magazine, publishes a story about two 13-year-old schoolgirls, Sue and Mary, releasing a disc on Decca and adds \"A Liverpool group, The Beatles, have recorded 'Love Me Do' for Parlophone Records, set for October 5 release.\""], ["1962-09-27T00:00:00", "A flash flood in Barcelona, Spain, kills more than 440 people."], ["1962-09-27T00:00:00", "Rachel Carson's book Silent Spring is released, giving rise to the modern environmentalist movement."], ["1962-10-01T00:00:00", "The first black student, James Meredith, registers at the University of Mississippi, escorted by Federal Marshals."], ["1962-10-01T00:00:00", "Johnny Carson takes over as permanent host of NBC's Tonight Show, a post he would hold for 30 years."], ["1962-10-01T00:00:00", "Lucille Ball and Vivian Vance return to television with The Lucy Show, two years after I Love Lucy ended. Vance became the first person to portray a divorcée on a weekly series."], ["1962-10-05T00:00:00", "The French National Assembly censures the proposed referendum to sanction presidential elections by popular mandate; Prime Minister Georges Pompidou resigns, but President de Gaulle asks him to stay in office."], ["1962-10-05T00:00:00", "Dr. No, the first James Bond film, premieres in UK theaters."], ["1962-10-05T00:00:00", "The Beatles release their first single for EMI, Love Me Do."], ["1962-10-08T00:00:00", "The German magazine Der Spiegel publishes an article about the Bundeswehr's poor preparedness; the Spiegel scandal erupts."], ["1962-10-08T00:00:00", "Algeria is accepted into the United Nations."], ["1962-10-12T00:00:00", "The infamous Columbus Day Storm strikes the U.S. Pacific Northwest with wind gusts up to 170 mph (270 km/h); 46 are killed, 11 billion board feet (26 million m³) of timber is blown down, with $230 million U.S. in damages."], ["1962-10-12T00:00:00", "Jazz bassist/composer Charles Mingus presents a disastrous concert  at Town Hall in New York City; it will become known as the worst moment of his career."], ["1962-10-28T00:00:00", "Cuban Missile Crisis ends: Soviet Union leader Nikita Khrushchev announces that he has ordered the removal of Soviet missile bases in Cuba. In a secret deal between Kennedy and Khrushchev, Kennedy agrees to the withdrawal of U.S. missiles from Turkey. The fact that this deal is not made public makes it look like the Soviets have backed down."], ["1962-10-28T00:00:00", "A referendum in France favors the election of the president by universal suffrage."], ["1962-11-01T00:00:00", "The Soviets begin dismantling their missiles in Cuba."], ["1962-11-01T00:00:00", "The first issue of Diabolik is published in Italy."], ["1962-11-05T00:00:00", "Franz Josef Strauß, the West German defense minister, is relieved of his duties over the Spiegel scandal, due to his alleged involvement in police action against the magazine."], ["1962-11-05T00:00:00", "Saudi Arabia breaks off diplomatic relations with Egypt, following a period of unrest partly caused by the defection of several Saudi princes to Egypt."], ["1962-11-05T00:00:00", "A coal mining disaster in Ny-Ålesund kills 21 people. The Norwegian government is forced to resign in the aftermath of this accident in August 1963."], ["1962-11-26T00:00:00", "Spiegel scandal: German police end their occupation of Der Spiegel's offices."], ["1962-11-26T00:00:00", "Mies Bouwman starts presenting the first live TV-marathon fundraising show (Open Het Dorp), which lasts 23 hours non-stop."], ["1962-12-08T00:00:00", "The first period of the Second Vatican Council closes."], ["1962-12-08T00:00:00", "The North Kalimantan National Army revolts in Brunei, in the first stirrings of the Indonesian Confrontation."], ["1962-12-08T00:00:00", "The 1962–63 New York City newspaper strike begins, affecting all of the city's major newspapers; It will last for 114 days."], ["1962-12-08T00:00:00", "Former Dutch queen Wilhelmina, who died on November 28, is buried at the New Church in Delft."], ["1962-12-09T00:00:00", "Tanganyika (modern-day Tanzania) becomes a republic within the Commonwealth, with Julius Nyerere as president."], ["1962-12-09T00:00:00", "MGM's The Wizard of Oz receives its last of four December telecasts on CBS. It will skip a telecast in 1963, so beginning in 1964, first on CBS, then on NBC, and finally again on CBS, it will nearly always be telecast during the early part of the year until Turner Entertainment buys the rights to the film in the 1990s."], ["1962-12-11T00:00:00", "In West Germany, a coalition government of Christian Democrats, Christian Socialists, and Free Democrats is formed."], ["1962-12-11T00:00:00", "The last execution by hanging in Canada takes place."], ["1962-12-14T00:00:00", "U.S. spacecraft Mariner 2 flies by Venus, becoming the first probe to transmit data successfully from another planet."], ["1962-12-14T00:00:00", "Leonardo da Vinci's early 16th-century painting the Mona Lisa is assessed for insurance purposes at US$100 million before touring the United States for several months, the highest insurance value for a painting in history. However, the Louvre, its owner, chooses to spend the money that would have been spent on the insurance premium on security instead."], ["1962-12-30T00:00:00", "United Nations troops occupy the last rebel positions in Katanga; Moise Tshombe moves to South Rhodesia."], ["1962-12-30T00:00:00", "An unexpected storm buries Maine under five feet of snow, forcing the Bangor Daily News to miss a publication date for the only time in history. The same day, also the Netherlands are covered with several feet of snow."], ["1962-01-20T00:00:00", "IKKO, Japanese make-up artist"], ["1962-01-20T00:00:00", "Sakiko Tamagawa, Japanese voice actress"], ["1962-01-20T00:00:00", "Sophie Thompson, English actress"], ["1962-01-21T00:00:00", "Tyler Cowen, American economist"], ["1962-01-21T00:00:00", "Marie Trintignant, French actress (d. 2003)"], ["1962-01-22T00:00:00", "Mizan Zainal Abidin, current Yang di-Pertuan Agong of Malaysia"], ["1962-01-22T00:00:00", "Lyudmila Dzhigalova, Russian athlete"], ["1962-01-23T00:00:00", "Stephen Keshi, Nigerian football manager and former footballer"], ["1962-01-23T00:00:00", "Richard Roxburgh, Australian actor"], ["1962-01-28T00:00:00", "Creflo Dollar, African-American evangelist"], ["1962-01-28T00:00:00", "Sam Phillips, American singer"], ["1962-02-03T00:00:00", "Michele Greene, American actress"], ["1962-02-03T00:00:00", "Marty Jannetty, American professional wrestler"], ["1962-02-07T00:00:00", "Garth Brooks, American country musician"], ["1962-02-07T00:00:00", "David Bryan, American keyboardist (Bon Jovi)"], ["1962-02-07T00:00:00", "Eddie Izzard, British actor and comedian"], ["1962-02-09T00:00:00", "Lolo Ferrari, French actress (d. 2000)"], ["1962-02-10T00:00:00", "Cliff Burton, American bassist (Metallica) (d. 1986)"], ["1962-02-10T00:00:00", "Bobby Czyz, American boxer"], ["1962-02-12T00:00:00", "Nana Ioseliani, Georgian chess player"], ["1962-02-12T00:00:00", "Jimmy Kirkwood, Irish-born field hockey player"], ["1962-02-21T00:00:00", "Vanessa Feltz, British television presenter"], ["1962-02-21T00:00:00", "Chuck Palahniuk, American author"], ["1962-02-21T00:00:00", "David Foster Wallace, American writer (d. 2008)"], ["1962-02-22T00:00:00", "Steve Irwin, Australian herpetologist and television personality (d. 2006)"], ["1962-02-22T00:00:00", "Lenda Murray, American bodybuilder"], ["1962-03-02T00:00:00", "Jon Bon Jovi, American singer, songwriter"], ["1962-03-02T00:00:00", "Raimo Summanen, Finnish ice hockey player and coach"], ["1962-03-03T00:00:00", "Jackie Joyner-Kersee, African-American athlete"], ["1962-03-03T00:00:00", "Herschel Walker, American football player"], ["1962-03-04T00:00:00", "Simon Bisley, British comic book artist"], ["1962-03-06T00:00:00", "Andreas Felder, Austrian ski jumper"], ["1962-03-06T00:00:00", "Erika Hess, Swiss alpine skier"], ["1962-03-18T00:00:00", "Thomas Ian Griffith, American actor"], ["1962-03-18T00:00:00", "Mike Rowe, American television host"], ["1962-03-21T00:00:00", "Matthew Broderick, American actor"], ["1962-03-21T00:00:00", "Rosie O'Donnell, American comedian, actress, and talk-show host"], ["1962-03-23T00:00:00", "Steve Redgrave, English rower"], ["1962-03-23T00:00:00", "Jenny Wright, American actress"], ["1962-03-27T00:00:00", "Jann Arden, Canadian singer"], ["1962-03-27T00:00:00", "John O'Farrell, British author and broadcaster"], ["1962-03-30T00:00:00", "Bil Dwyer, American actor"], ["1962-03-30T00:00:00", "MC Hammer (Stanley Kirk Burrell), African-American rapper"], ["1962-04-01T00:00:00", "Samboy Lim, Filipino basketball player"], ["1962-04-01T00:00:00", "Phillip Schofield, British TV presenter"], ["1962-04-10T00:00:00", "Rick Florian, American former Christian musician and real estate agent"], ["1962-04-10T00:00:00", "Steve Tasker, American football player"], ["1962-04-12T00:00:00", "Carlos Sainz, Spanish rally driver"], ["1962-04-12T00:00:00", "Nobuhiko Takada, Japanese mixed martial arts fighter and professional wrestler"], ["1962-04-15T00:00:00", "Nawal El Moutawakel, Moroccan hurdler"], ["1962-04-15T00:00:00", "Nick Kamen, English singer, songwriter, musician and model"], ["1962-04-26T00:00:00", "Colin Anderson, English footballer"], ["1962-04-26T00:00:00", "Michael Damian, American singer and actor"], ["1962-05-02T00:00:00", "Elizabeth Berridge, American actress"], ["1962-05-02T00:00:00", "Jimmy White, British snooker player"], ["1962-05-13T00:00:00", "Paul McDermott, Australian comedian"], ["1962-05-13T00:00:00", "Eduardo Palomo, Mexican actor (d. 2003)"], ["1962-05-14T00:00:00", "Ian Astbury, English singer"], ["1962-05-14T00:00:00", "Danny Huston, American actor and film director"], ["1962-05-17T00:00:00", "Lise Lyng Falkenberg, Danish writer"], ["1962-05-17T00:00:00", "Craig Ferguson, Scottish actor and comedian"], ["1962-05-17T00:00:00", "Kim Mulkey, American basketball player/coach"], ["1962-05-28T00:00:00", "Brandon Cruz, American child actor and punk rocker"], ["1962-05-28T00:00:00", "François-Henri Pinault, French businessman"], ["1962-05-28T00:00:00", "James Michael Tyler, American actor"], ["1962-05-29T00:00:00", "Perry Fenwick, English actor"], ["1962-05-31T00:00:00", "Corey Hart, Canadian singer"], ["1962-05-31T00:00:00", "Noriko Hidaka, Japanese voice actress"], ["1962-05-31T00:00:00", "Sebastian Koch, German actor"], ["1962-06-04T00:00:00", "Paul Baloche, American Christian worship leader"], ["1962-06-04T00:00:00", "John P. Kee, American gospel singer"], ["1962-06-10T00:00:00", "Gina Gershon, American actress and musician"], ["1962-06-10T00:00:00", "Carolyn Hennesy, American actress"], ["1962-06-11T00:00:00", "Olga Charvátová, Czech alpine skier"], ["1962-06-11T00:00:00", "Erika Salumäe, Estonian cyclist"], ["1962-06-11T00:00:00", "Toshihiko Seki, Japanese voice actor"], ["1962-06-12T00:00:00", "Camilla Scott, Canadian actress"], ["1962-06-12T00:00:00", "Jodi Thelen, American actress"], ["1962-06-13T00:00:00", "Ally Sheedy, American actress"], ["1962-06-13T00:00:00", "Hannah Storm, American television personality"], ["1962-06-15T00:00:00", "Thomas Mikal Ford, American actor"], ["1962-06-15T00:00:00", "Andrea Rost, Hungarian lyric soprano"], ["1962-06-17T00:00:00", "Bap Kennedy, Northern Irish singer-songwriter"], ["1962-06-17T00:00:00", "Lio, Belgian singer/actress"], ["1962-06-18T00:00:00", "Mitsuharu Misawa, Japanese professional wrestler (d. 2009)"], ["1962-06-18T00:00:00", "Lisa Randall, American theoretical physicist"], ["1962-06-21T00:00:00", "Pipilotti Rist, Swiss video artist"], ["1962-06-21T00:00:00", "Viktor Tsoi, Soviet underground singer and songwriter (d. 1990)"], ["1962-06-22T00:00:00", "Stephen Chow, Hong Kong actor and director"], ["1962-06-22T00:00:00", "Clyde Drexler, American basketball player"], ["1962-06-26T00:00:00", "Bussunda, Brazilian comedian (d. 2006)"], ["1962-06-26T00:00:00", "Ollanta Humala, President of Peru"], ["1962-06-27T00:00:00", "Michael Ball, British stage actor and singer"], ["1962-06-27T00:00:00", "Tony Leung Chiu-wai, Hong Kong actor"], ["1962-06-29T00:00:00", "Amanda Donohoe, English actress"], ["1962-06-29T00:00:00", "George Zamka, American astronaut"], ["1962-06-30T00:00:00", "Tony Fernández, Dominican baseball player"], ["1962-06-30T00:00:00", "Deirdre Lovejoy, American actress"], ["1962-06-30T00:00:00", "Julianne Regan, British singer/songwriter (All About Eve)"], ["1962-07-03T00:00:00", "Tom Cruise, American actor"], ["1962-07-03T00:00:00", "Thomas Gibson, American actor"], ["1962-07-04T00:00:00", "Neil Morrissey, British actor"], ["1962-07-04T00:00:00", "Pam Shriver, American tennis player"], ["1962-07-12T00:00:00", "Dan Murphy, American rock guitarist (Soul Asylum)"], ["1962-07-12T00:00:00", "Dean Wilkins, English football manager"], ["1962-07-13T00:00:00", "Tom Kenny, American voice actor and comedian"], ["1962-07-13T00:00:00", "Zlata Petrović, Serbian pop singer"], ["1962-07-18T00:00:00", "Lee Arenberg, American actor"], ["1962-07-18T00:00:00", "Jack Irons, American drummer"], ["1962-07-20T00:00:00", "Carlos Alazraqui, American actor & comedian"], ["1962-07-20T00:00:00", "Giovanna Amati, Italian race car driver"], ["1962-07-26T00:00:00", "Galina Chistyakova, Ukrainian athlete"], ["1962-07-26T00:00:00", "Sergey Kiriyenko, former Prime Minister of Russia"], ["1962-07-30T00:00:00", "Alton Brown, American television host and chef"], ["1962-07-30T00:00:00", "Lavinia Greenlaw, British poet and novelist"], ["1962-07-31T00:00:00", "Damien Frawley, Australian rugby union player"], ["1962-07-31T00:00:00", "Wesley Snipes, African-American actor"], ["1962-08-08T00:00:00", "Yūji Machi, Japanese voice actor"], ["1962-08-08T00:00:00", "Mike Zanier, Canadian ice hockey player"], ["1962-08-16T00:00:00", "Christian Cameron, Canadian-American writer"], ["1962-08-16T00:00:00", "Steve Carell, American actor and comedian"], ["1962-08-20T00:00:00", "Sophie Aldred, British actress and television presenter"], ["1962-08-20T00:00:00", "James Marsters, American actor"], ["1962-08-21T00:00:00", "Tsutomu Miyazaki, Japanese serial killer (d. 2008)"], ["1962-08-21T00:00:00", "Gilberto Santa Rosa, Puerto Rican salsa singer"], ["1962-08-24T00:00:00", "Craig Kilborn, American talk show host"], ["1962-08-24T00:00:00", "Mary Ellen Weber, American astronaut"], ["1962-08-26T00:00:00", "Princess Lalla Meryem of Morocco"], ["1962-08-26T00:00:00", "Bob Mionske, American cyclist and attorney"], ["1962-08-29T00:00:00", "Ian James Corlett, Canadian voice actor"], ["1962-08-29T00:00:00", "Jutta Kleinschmidt, German rally driver"], ["1962-08-29T00:00:00", "Lycia Naff, American actress/journalist"], ["1962-08-31T00:00:00", "Dee Bradley Baker, American comedian, announcer and voice actor"], ["1962-08-31T00:00:00", "Mark L. Walberg, American television host and presenter"], ["1962-09-11T00:00:00", "Kristy McNichol, American actress"], ["1962-09-11T00:00:00", "Victoria Poleva, Ukrainian composer"], ["1962-09-12T00:00:00", "Dino Merlin, Bosnian singer-songwriter, musician, and producer"], ["1962-09-12T00:00:00", "Amy Yasbeck, American actress"], ["1962-09-15T00:00:00", "François Bloemhof, South African author"], ["1962-09-15T00:00:00", "Scott McNeil, Australian voice actor"], ["1962-09-24T00:00:00", "Jack Dee, British comedian"], ["1962-09-24T00:00:00", "Rosamund Kwan, Hong Kong actress"], ["1962-09-24T00:00:00", "Ally McCoist, Scottish footballer and TV pundit"], ["1962-09-26T00:00:00", "Melissa Sue Anderson, American actress"], ["1962-09-26T00:00:00", "Gregory Crewdson, American photographer"], ["1962-09-26T00:00:00", "Steve Moneghetti, Australian long-distance runner"], ["1962-09-26T00:00:00", "Al Pitrelli, American guitarist"], ["1962-09-26T00:00:00", "Jacky Wu, Taiwanese talk show host, singer, and actor"], ["1962-10-12T00:00:00", "Branko Crvenkovski, former President of Macedonia"], ["1962-10-12T00:00:00", "Deborah Foreman, American actress"], ["1962-10-13T00:00:00", "T'Keyah Crystal Keymáh, American actress and comedian"], ["1962-10-13T00:00:00", "Margareth Menezes, Brazilian singer"], ["1962-10-13T00:00:00", "Kelly Preston, American actress"], ["1962-10-13T00:00:00", "Jerry Rice, American football player"], ["1962-10-16T00:00:00", "Manute Bol, Sudanese basketball player and activist (d. 2010)"], ["1962-10-16T00:00:00", "Flea, American rock bassist (Red Hot Chili Peppers)"], ["1962-10-16T00:00:00", "Dmitri Hvorostovsky, Russian baritone"], ["1962-10-16T00:00:00", "Tamara McKinney, American alpine skier"], ["1962-10-19T00:00:00", "Tracy Chevalier, American author"], ["1962-10-19T00:00:00", "Evander Holyfield, American boxer"], ["1962-10-23T00:00:00", "Doug Flutie, American football player"], ["1962-10-23T00:00:00", "Mike Tomczak, American football player"], ["1962-10-25T00:00:00", "Nick Hancock, British actor and television presenter"], ["1962-10-25T00:00:00", "Darlene Vogel, American actress"], ["1962-10-27T00:00:00", "Jun'ichi Kanemaru, Japanese voice actor"], ["1962-10-27T00:00:00", "Ang Peng Siong, Singaporean sportsman"], ["1962-11-01T00:00:00", "Sharron Davies, British swimmer/television presenter"], ["1962-11-01T00:00:00", "Anthony Kiedis, American rock singer (Red Hot Chili Peppers)"], ["1962-11-03T00:00:00", "Gabe Newell, American business executive"], ["1962-11-03T00:00:00", "Jacqui Smith, UK Home Secretary"], ["1962-11-11T00:00:00", "Mic Michaeli, Swedish keyboardist"], ["1962-11-11T00:00:00", "Demi Moore, American actress"], ["1962-11-11T00:00:00", "James Morrison, Australian musician"], ["1962-11-11T00:00:00", "Nicole P. Stott, American astronaut"], ["1962-11-12T00:00:00", "Neal Shusterman, American author"], ["1962-11-12T00:00:00", "Naomi Wolf, American feminist author and political consultant"], ["1962-11-14T00:00:00", "Jessica Straus, American voice actress"], ["1962-11-14T00:00:00", "Atsuko Tanaka, Japanese voice actress"], ["1962-11-19T00:00:00", "Jodie Foster, American actress and director"], ["1962-11-19T00:00:00", "Sean Parnell, American politician"], ["1962-11-30T00:00:00", "Bo Jackson, African-American football and baseball player"], ["1962-11-30T00:00:00", "Daniel Keys Moran, American writer"], ["1962-12-01T00:00:00", "Sylvie Daigle, Canadian speed skater"], ["1962-12-01T00:00:00", "Shōzō Hayashiya IX, Japanese rakugoka, tarento and voice actor"], ["1962-12-04T00:00:00", "Julie Lemieux, Canadian voice actress"], ["1962-12-04T00:00:00", "Anna Walker, British television presenter"], ["1962-12-09T00:00:00", "Albert Grajales, INTERPOL Director of Puerto Rico and martial artist"], ["1962-12-09T00:00:00", "Felicity Huffman, American actress"], ["1962-12-11T00:00:00", "Denise Biellmann, Swiss figure skater"], ["1962-12-11T00:00:00", "Ben Browder, American actor"], ["1962-12-12T00:00:00", "Tracy Austin, American tennis player"], ["1962-12-12T00:00:00", "Arturo Barrios, Mexican long-distance runner"], ["1962-12-17T00:00:00", "Paul Dobson, English footballer"], ["1962-12-17T00:00:00", "Richard Jewell, American security guard and media figure (d. 2007)"], ["1962-12-17T00:00:00", "Galina Malchugina, Russian athlete"], ["1962-12-17T00:00:00", "Rocco Mediate, American golfer"], ["1962-12-27T00:00:00", "Mark Few, American basketball coach"], ["1962-12-27T00:00:00", "Bill Self, American basketball coach"], ["1962-12-27T00:00:00", "Sherri Steinhauer, American golfer"], ["1962-12-28T00:00:00", "Michelle Cameron, Canadian synchronised swimmer"], ["1962-12-28T00:00:00", "Choi Soo-jong, South Korean actor"], ["1962-02-06T00:00:00", "Roy Atwell, American actor, comedian, and composer (b. 1878)"], ["1962-02-06T00:00:00", "Cândido Portinari, Brazilian painter (b. 1903)"], ["1962-02-17T00:00:00", "Joseph Kearns, American actor (b. 1907)"], ["1962-02-17T00:00:00", "Bruno Walter, German conductor (b. 1876)"], ["1962-02-19T00:00:00", "James Barton, American actor (b. 1890)"], ["1962-02-19T00:00:00", "Georgios Papanikolaou, Greek inventor (b. 1883)"], ["1962-03-01T00:00:00", "Roscoe Ates, American actor (b. 1895)"], ["1962-03-01T00:00:00", "Richard L. Conolly, American admiral (b. 1892)"], ["1962-03-01T00:00:00", "W. Alton Jones, American industrialist and philanthropist (b. 1891)"], ["1962-03-01T00:00:00", "Arnold Kirkeby, American hotelier, art collector, and real estate investor (b. 1901)"], ["1962-03-01T00:00:00", "Louise Lindner Eastman, American wife of Lee Eastman and mother of Linda McCartney (b. 1911)"], ["1962-03-01T00:00:00", "Emelyn Whiton, American Olympic sailor (b. 1916)"], ["1962-03-24T00:00:00", "Jean Goldkette, Greek-born jazz musician (b. 1899)"], ["1962-03-24T00:00:00", "Auguste Piccard, Swiss physicist and explorer (b. 1884)"], ["1962-04-10T00:00:00", "Michael Curtiz, Austrian-born film director (b. 1886)"], ["1962-04-10T00:00:00", "Manton S. Eddy, U.S. general (b. 1892)"], ["1962-04-10T00:00:00", "Stuart Sutcliffe, English artist and rock musician (The Beatles; b. 1940)"], ["1962-04-15T00:00:00", "Clara Blandick, American actress (b. 1880)"], ["1962-04-15T00:00:00", "Arsenio Lacson, Filipino politician and sportswriter (b. 1911)"], ["1962-05-13T00:00:00", "Henry Trendley Dean, American dental researcher (b. 1893)"], ["1962-05-13T00:00:00", "Franz Kline, American painter (b. 1910)"], ["1962-05-31T00:00:00", "Henry Fountain Ashurst, American politician (b. 1874)"], ["1962-05-31T00:00:00", "Adolf Eichmann, Nazi war criminal (b. 1906)"], ["1962-06-06T00:00:00", "Yves Klein, French painter (b. 1928)"], ["1962-06-06T00:00:00", "Guinn Williams, American actor (b. 1899)"], ["1962-06-19T00:00:00", "Frank Borzage, American film director (b. 1894)"], ["1962-06-19T00:00:00", "Will Wright, American character actor (b. 1891)"], ["1962-07-06T00:00:00", "Paul Boffa, Maltese politician, 5th Prime Minister of Malta (1947–1950) (b. 1890)"], ["1962-07-06T00:00:00", "William Faulkner, American writer, Nobel Prize laureate (b. 1897)"], ["1962-07-06T00:00:00", "Archduke Joseph August of Austria, Austrian field marshal (b. 1872)"], ["1962-09-07T00:00:00", "Karen Blixen, Danish writer (b. 1885)"], ["1962-09-07T00:00:00", "Morris Louis, American painter (b. 1912)"], ["1962-09-07T00:00:00", "Graham Walker, British motorcycle racer (b. 1896)"], ["1962-09-24T00:00:00", "Sam McDaniel, African-American actor (b. 1886)"], ["1962-09-24T00:00:00", "Charles Reisner, American silent actor and film director (b. 1887)"], ["1962-10-02T00:00:00", "Henry Louis Larsen, American Marine Corps general; Governor of American Samoa and Governor of Guam (b. 1890)"], ["1962-10-02T00:00:00", "Frank Lovejoy, American actor (b. 1912)"], ["1962-11-28T00:00:00", "K. C. Dey, Indian singer, composer, actor and teacher (b. 1893)"], ["1962-11-28T00:00:00", "Queen Wilhelmina of the Netherlands, (b. 1880)"]]