[["1994-01-01T00:00:00", "The North American Free Trade Agreement (NAFTA) is established."], ["1994-01-01T00:00:00", "The Zapatista Army of National Liberation begins their war in Chiapas, Mexico."], ["1994-01-11T00:00:00", "The Irish government announces the end of a 15-year broadcasting ban on the Provisional Irish Republican Army and its political arm Sinn Féin."], ["1994-01-11T00:00:00", "The Superhighway Summit is held at UCLA's Royce Hall. It is the first conference to discuss the growing information superhighway and is presided over by U.S. Vice President Al Gore."], ["1994-02-01T00:00:00", "In Portland, Oregon, Tonya Harding's ex-husband Jeff Gillooly pleads guilty for his role in attacking figure skater Nancy Kerrigan. He accepts a plea bargain, admitting to racketeering charges in exchange for testimony against Harding."], ["1994-02-01T00:00:00", "Punk rock band Green Day releases their album Dookie, which will eventually sell over 20 million copies worldwide."], ["1994-02-03T00:00:00", "William J. Perry is sworn in as the United States Secretary of Defense."], ["1994-02-03T00:00:00", "In the aftermath of the Chadian–Libyan conflict, the International Court of Justice rules that the Aouzou Strip belongs to the Republic of Chad."], ["1994-02-12T00:00:00", "Edvard Munch's painting \"The Scream\" is stolen in Oslo (it is recovered on May 7)."], ["1994-02-12T00:00:00", "The 1994 Winter Olympics begin in Lillehammer."], ["1994-03-01T00:00:00", "A lone terrorist kills Ari Halberstam during an attack on 14 Jewish students on the Brooklyn Bridge in New York City."], ["1994-03-01T00:00:00", "South Africa cedes Walvis Bay to Namibia."], ["1994-03-01T00:00:00", "Mary Ellen Withrow begins her term of office as Treasurer of the United States, serving under President Bill Clinton."], ["1994-03-12T00:00:00", "A photo by Marmaduke Wetherell, previously touted as \"proof\" of the Loch Ness Monster, is confirmed to be a hoax."], ["1994-03-12T00:00:00", "The Church of England ordains its first female priests."], ["1994-03-27T00:00:00", "TV tycoon Silvio Berlusconi's right-wing coalition wins the Italian general election."], ["1994-03-27T00:00:00", "The biggest tornado outbreak in 1994 occurs in the southeastern United States; 1 tornado kills 22 people at the Goshen United Methodist Church in Piedmont, Alabama."], ["1994-04-07T00:00:00", "The Rwandan Genocide begins in Kigali, Rwanda."], ["1994-04-07T00:00:00", "Federal Express Flight 705 experiences an attempted suicidal hijacking. The crew manages to subdue the attacker and land at the airport."], ["1994-04-08T00:00:00", "Michelangelo's Universal Judgement is reopened to the public after 10 years of restorations."], ["1994-04-08T00:00:00", "Kurt Cobain, songwriter and frontman for the band Nirvana, is found dead at his Lake Washington home, apparently of a single self-inflicted gunshot wound."], ["1994-04-25T00:00:00", "Sultan Azlan Muhibbudin Shah ibni Almarhum Sultan Yusuff Izzudin Shah Ghafarullahu-lahu ends his term as the 9th Yang di-Pertuan Agong of Malaysia."], ["1994-04-25T00:00:00", "The largest high school arson ever in the United States is started at Burnsville High School, in Burnsville, Minnesota, resulting in over 15 million dollars in damages. The same arsonist also goes on to set arsons at Edina High School and Minnetonka High School."], ["1994-04-26T00:00:00", "Tuanku Jaafar ibni Almarhum Tuanku Abdul Rahman, Yang di-Pertuan Besar of Negeri Sembilan, becomes the 10th Yang di-Pertuan Agong of Malaysia."], ["1994-04-26T00:00:00", "China Airlines Flight 140, an Airbus A300, crashes while landing at Nagoya, Japan, killing 264 people."], ["1994-05-10T00:00:00", "Nelson Mandela is inaugurated as South Africa's first black president."], ["1994-05-10T00:00:00", "Illinois executes serial killer John Wayne Gacy by lethal injection for the murder of 33 young men and boys between 1972 and 1978."], ["1994-05-10T00:00:00", "An annular eclipse of the Sun is visible across much of North America."], ["1994-06-17T00:00:00", "NFL star O. J. Simpson and his friend Al Cowlings flee from police in his white Ford Bronco. The low-speed chase ends at Simpson's Brentwood, Los Angeles mansion, where he surrenders."], ["1994-06-17T00:00:00", "The 1994 FIFA World Cup starts in the United States."], ["1994-06-24T00:00:00", "U.S. Air Force pilot Bud Holland crashes a B-52 at Fairchild Air Force Base, as a result of pilot error. It's unclear whether the event of 4 days previous (above) was a contributing factor."], ["1994-06-24T00:00:00", "The Lion King, the highest grossing hand-drawn animated feature, is released by Walt Disney Pictures."], ["1994-06-25T00:00:00", "Cold War: The last Russian troops leave Germany."], ["1994-07-18T00:00:00", "In Buenos Aires, a terrorist attack destroys a building housing several Jewish organizations, killing 85 and injuring many more (see AMIA Bombing)."], ["1994-07-18T00:00:00", "Rwandan Patriotic Front troops capture Gisenyi, forcing the interim government into Zaire and ending the Rwandan Genocide."], ["1994-08-01T00:00:00", "Fire destroys the Norwich Central Library in the United Kingdom, including most of its historical records."], ["1994-08-01T00:00:00", "The University of London founds the School of Advanced Study, a group of postgraduate research institutes."], ["1994-08-12T00:00:00", "The 1994–95 Major League Baseball strike is called, ending the 1994 MLB Season."], ["1994-08-12T00:00:00", "Woodstock '94 begins in Saugerties, New York. It is the 25-year anniversary of Woodstock in 1969."], ["1994-08-31T00:00:00", "The Provisional Irish Republican Army announces a \"complete cessation of military operations\"."], ["1994-08-31T00:00:00", "The Russian army leaves Estonia and Latvia, ending the last traces of Eastern Europe's Soviet occupation."], ["1994-10-01T00:00:00", "In Slovakia, populist leader Vladimír Mečiar wins the general election."], ["1994-10-01T00:00:00", "Palau gains independence from the United Nations Trusteeship Council"], ["1994-10-15T00:00:00", "After 3 years of U.S. exile, Haiti's president Aristide returns to his country."], ["1994-10-15T00:00:00", "Iraq disarmament crisis: Following threats by the U.N. Security Council and the U.S., Iraq withdraws troops from its border with Kuwait."], ["1994-10-31T00:00:00", "American Eagle Flight 4184 ATR 72 crashes in Roselawn, Indiana, after circling in icy weather, killing 64 passengers."], ["1994-10-31T00:00:00", "The Duke of Edinburgh attends a ceremony in Israel, where his late mother, Princess Alice of Battenberg (Princess Andrew of Greece), is honoured as \"Righteous Among the Nations\" for sheltering Jewish families from the Nazis in Athens, during World War II."], ["1994-11-03T00:00:00", "A French magazine publishes photo of President François Mitterrand's secret daughter."], ["1994-11-03T00:00:00", "The Criminal Justice and Public Order Act 1994 is enacted in the UK. The whole of Part V, which covers collective trespass and nuisance on land, includes sections against raves, including the \"succession of repetitive beats\" definition."], ["1994-11-04T00:00:00", "San Francisco: The first conference devoted entirely to the subject of the commercial potential of the World Wide Web opens. Featured speakers include Marc Andreessen of Netscape, Mark Graham of Pandora Systems, and Ken McCarthy of E-Media."], ["1994-11-04T00:00:00", "Sydney's third runway opens, ensuring protests about noise levels."], ["1994-11-05T00:00:00", "A letter by former U.S. President Ronald Reagan, announcing that he has Alzheimer's disease, is released."], ["1994-11-05T00:00:00", "George Foreman wins the WBA and IBF World Heavyweight Championships by KO'ing Michael Moorer becoming the oldest heavyweight champion in history."], ["1994-11-05T00:00:00", "Johan Heyns, an influential Afrikaner theologian and critic of apartheid, is assassinated."], ["1994-11-13T00:00:00", "Voters in Sweden decide to join the European Union in a referendum."], ["1994-11-13T00:00:00", "The first passengers travel through the Channel Tunnel."], ["1994-11-13T00:00:00", "Michael Schumacher wins his first Formula One World Championship in controversial circumstances at the Australian Grand Prix."], ["1994-11-28T00:00:00", "Voters in Norway decide not to join the European Union in a referendum."], ["1994-11-28T00:00:00", "The Milwaukee Cannibal Jeffrey Dahmer is beaten to death by a fellow inmate at the prison where he was incarcerated."], ["1994-12-11T00:00:00", "Russian president Boris Yeltsin orders troops into Chechnya."], ["1994-12-11T00:00:00", "A small bomb explodes on Philippine Airlines Flight 434, killing a Japanese businessman. The bombing was a field test done by Ramzi Yousef to test explosives that would have been used in Project Bojinka."], ["1994-12-13T00:00:00", "The trial of former President Mengistu begins in Ethiopia."], ["1994-12-13T00:00:00", "Fred West, 53, a builder living in Gloucester, is remanded in custody, charged with murdering 12 people (including two of his own daughters) whose bodies are mostly found buried at his house in Cromwell Street. His wife Rose West, 41, is charged with 10 murders. Police believe that the murders took place between 1967 and 1987, and suspect that they may have killed up to 30 people."], ["1994-12-14T00:00:00", "A Learjet piloted by Richard Anderson and Brad Sexton misses an elementary school and crashes into an apartment complex in Fresno, California, killing both pilots and injuring several apartment residents."], ["1994-12-14T00:00:00", "A runaway Santa Fe freight train rear ends a Union Pacific train at the bottom of Cajon Pass, California."], ["1994-12-14T00:00:00", "British Home Secretary Michael Howard announces that Myra Hindley will serve a whole life tariff for the Moors murders of the 1960s."], ["1994-12-14T00:00:00", "Construction commences on the Three Gorges Dam, at Sandouping, China."], ["1994-12-19T00:00:00", "A planned exchange rate correction of the Mexican peso to the US dollar, becomes a massive financial meltdown in Mexico, unleashing the 'Tequila' effect on global financial markets. This prompts a US$50 billion \"bailout\" by the Clinton Administration."], ["1994-12-19T00:00:00", "The Whitewater scandal investigation begins in Washington, D.C."], ["1994-12-19T00:00:00", "Civil unions between homosexuals are legalized in Sweden."], ["1994-02-14T00:00:00", "Allie Grant, American actress"], ["1994-02-14T00:00:00", "Paul Butcher, American actor"], ["1994-02-23T00:00:00", "Dakota Fanning, American actress"], ["1994-04-12T00:00:00", "Oh Sehun, South Korean singer"], ["1994-04-12T00:00:00", "Saoirse Ronan, Irish actress"], ["1994-04-12T00:00:00", "Airi Suzuki, Japanese singer"], ["1994-06-11T00:00:00", "Ivana Baquero, Spanish actress"], ["1994-06-11T00:00:00", "Jessica Fox, French-born Australian canoeist"], ["1994-09-01T00:00:00", "Bianca Ryan, American singer"], ["1994-09-01T00:00:00", "Jasmine, American singer"], ["1994-01-01T00:00:00", "Arthur Espie Porritt, New Zealand politician and athlete (b. 1900)"], ["1994-01-01T00:00:00", "Cesar Romero, Cuban-American actor (b. 1907)"], ["1994-01-01T00:00:00", "Edward Arthur Thompson, British historian (b. 1914)"], ["1994-01-05T00:00:00", "Tip O'Neill, American Democrat politician, former speaker of the House of Representatives (b. 1912)"], ["1994-01-05T00:00:00", "Elmar Lipping, Estonian statesman and soldier (b. 1906)"], ["1994-01-05T00:00:00", "Brian Johnston, British cricket commentator (b. 1912)"], ["1994-01-09T00:00:00", "Madge Ryan, Australian actress (b. 1919)"], ["1994-01-09T00:00:00", "Johnny Temple, American baseball player (b. 1927)"], ["1994-01-14T00:00:00", "Esther Ralston, American actress (b. 1902)"], ["1994-01-14T00:00:00", "Delio Rodríguez, Spanish cyclist (b. 1916)"], ["1994-01-14T00:00:00", "Zino Davidoff, Ukrainian tobacco entrepreneur (b. 1906)"], ["1994-01-14T00:00:00", "Federica Montseny, Spanish anarchist politician (b. 1905)"], ["1994-01-17T00:00:00", "Helen Stephens, American runner (b. 1918)"], ["1994-01-17T00:00:00", "Chung Il-kwon, South Korean politician and soldier, former Prime Minister (b. 1917)"], ["1994-01-20T00:00:00", "Matt Busby, Scottish football manager (b. 1909)"], ["1994-01-20T00:00:00", "Jaramogi Oginga Odinga, Kenyan politician (b. 1911)"], ["1994-01-22T00:00:00", "Jean-Louis Barrault, French actor and director (b. 1910)"], ["1994-01-22T00:00:00", "Telly Savalas, American actor (b. 1922)"], ["1994-01-23T00:00:00", "Brian Redhead, British journalist and broadcaster (b. 1929)"], ["1994-01-23T00:00:00", "Nikolai Ogarkov, Soviet marshal (b. 1917)"], ["1994-01-29T00:00:00", "Ulrike Maier, Austrian alpine skier (b. 1967)"], ["1994-01-29T00:00:00", "Nick Cravat, American actor and acrobat (b. 1912)"], ["1994-01-30T00:00:00", "Bahjat Talhouni, Jordanian politician, former Prime Minister (b. 1913)"], ["1994-01-30T00:00:00", "Pierre Boulle, French author (b. 1912)"], ["1994-02-06T00:00:00", "Joseph Cotten, American actor (b. 1905)"], ["1994-02-06T00:00:00", "Jack Kirby, American comic book writer and illustrator (b. 1917)"], ["1994-02-07T00:00:00", "Witold Lutosławski, Polish composer (b. 1913)"], ["1994-02-07T00:00:00", "Arnold Smith, Canadian diplomat, the first Commonwealth Secretary-General (b. 1915)"], ["1994-02-11T00:00:00", "Neil Bonnett, American race car driver (b. 1946)"], ["1994-02-11T00:00:00", "Sorrell Booke, American actor (b. 1930)"], ["1994-02-11T00:00:00", "William Conrad, American actor (b. 1920)"], ["1994-02-24T00:00:00", "Jean Sablon, French singer (b. 1906)"], ["1994-02-24T00:00:00", "Dinah Shore, American actress and singer (b. 1916)"], ["1994-02-24T00:00:00", "Henry Milton Taylor, 3rd Governor-General of the Bahamas (b. 1903)"], ["1994-02-25T00:00:00", "Baruch Goldstein, American-born mass murder (b. 1956)"], ["1994-02-25T00:00:00", "Jersey Joe Walcott, American boxer (b. 1914)"], ["1994-03-06T00:00:00", "Ray Arcel, American boxing trainer (b. 1899)"], ["1994-03-06T00:00:00", "Melina Mercouri, Greek actress and politician (b. 1920)"], ["1994-03-09T00:00:00", "Charles Bukowski, American writer (b. 1920)"], ["1994-03-09T00:00:00", "Fernando Rey, Spanish actor (b. 1917)"], ["1994-03-09T00:00:00", "Lawrence E. Spivak, American journalist (b. 1900)"], ["1994-03-17T00:00:00", "Ellsworth Vines, American tennis champion (b. 1911)"], ["1994-03-17T00:00:00", "Mai Zetterling, Swedish actor and director (b. 1925)"], ["1994-03-20T00:00:00", "Lewis Grizzard, American writer and humorist (b. 1946)"], ["1994-03-21T00:00:00", "Macdonald Carey, American actor (b. 1913)"], ["1994-03-21T00:00:00", "Dack Rambo, American actor (b. 1941)"], ["1994-03-23T00:00:00", "Álvaro del Portillo, Spanish Roman Catholic bishop, prelate of Opus Dei (b. 1914)"], ["1994-03-23T00:00:00", "Luis Donaldo Colosio, Mexican politician, presidential candidate of the PRI party (assassinated) (b. 1950)"], ["1994-03-23T00:00:00", "Giulietta Masina, Italian actress (b. 1921)"], ["1994-03-28T00:00:00", "Eugène Ionesco, Romanian-born playwright (b. 1909)"], ["1994-03-28T00:00:00", "Ira Murchison, American athlete (b. 1933)"], ["1994-04-01T00:00:00", "Léon Degrelle, Walloon Belgian Rexist and Nazi politician (b. 1906)"], ["1994-04-01T00:00:00", "Robert Doisneau, French Photographer (b. 1912)"], ["1994-04-06T00:00:00", "Juvénal Habyarimana, President of Rwanda (assassinated) (b. 1937)"], ["1994-04-06T00:00:00", "Cyprien Ntaryamira, President of Burundi (assassinated) (b. 1956)"], ["1994-04-07T00:00:00", "Agathe Uwilingiyimana, Prime Minister of Rwanda (assassinated) (b. 1953)"], ["1994-04-07T00:00:00", "Albert Guðmundsson, Icelandic footballer and politician (b. 1923)"], ["1994-04-07T00:00:00", "Golo Mann, German historian (b. 1909)"], ["1994-04-10T00:00:00", "Sam B. Hall, American politician (b. 1924)"], ["1994-04-10T00:00:00", "Viktor Afanasyev, Soviet journalist (b. 1922)"], ["1994-04-29T00:00:00", "Russell Kirk, American political philosopher (b. 1918)"], ["1994-04-29T00:00:00", "Sak Sutsakhan, Cambodian politician (b. 1928)"], ["1994-04-30T00:00:00", "Roland Ratzenberger, Austrian Formula One driver (b. 1960)"], ["1994-04-30T00:00:00", "Richard Scarry, American author (b. 1919)"], ["1994-04-30T00:00:00", "Sorie Ibrahim Koroma, Former Prime Minister and Vice President of Sierra Leone (b. 1930)"], ["1994-05-02T00:00:00", "William Albertini, English cricketer (b. 1913)"], ["1994-05-02T00:00:00", "Dorothy Marie Donnelly, American poet (b. 1908)"], ["1994-05-12T00:00:00", "Erik Erikson, Danish-American developmental psychologist (b. 1902)"], ["1994-05-12T00:00:00", "John Smith, Scottish politician, leader of the British Labour Party (b. 1938)"], ["1994-05-12T00:00:00", "Roy J. Plunkett, American chemist (b. 1910)"], ["1994-05-15T00:00:00", "Royal Dano, American actor (b. 1922)"], ["1994-05-15T00:00:00", "Gilbert Roland, Mexican-born actor (b. 1905)"], ["1994-05-19T00:00:00", "Jacqueline Kennedy Onassis, First Lady of the United States (b. 1929)"], ["1994-05-19T00:00:00", "Henry Morgan, American comedian (b. 1915)"], ["1994-05-19T00:00:00", "Luis Ocaña, Spanish bicycle racer (b. 1945)"], ["1994-05-21T00:00:00", "Giovanni Goria, Italian politician, former Prime Minister (b. 1943)"], ["1994-05-21T00:00:00", "Masayoshi Ito, Japanese politician, former acting Prime Minister (b. 1913)"], ["1994-05-21T00:00:00", "Ralph Miliband, Polish-born British academic (b. 1924)"], ["1994-05-21T00:00:00", "Johan Hendrik Weidner, Belgian World War II resistance fighter (b. 1912)"], ["1994-05-30T00:00:00", "Juan Carlos Onetti, Uruguayan novelist (b. 1909)"], ["1994-05-30T00:00:00", "Marcel Bich, French manufacturer and co-founder of Bic (b. 1914)"], ["1994-05-30T00:00:00", "Ezra Taft Benson, American religious leader, thirteenth president of The Church of Jesus Christ of Latter-day Saints (LDS Church) (b. 1899)"], ["1994-06-04T00:00:00", "Benedict J. Semmes, Jr., American admiral (b. 1913)"], ["1994-06-04T00:00:00", "Peter Thorneycroft, British Conservative politician (b. 1909)"], ["1994-06-04T00:00:00", "Massimo Troisi, Italian actor (b. 1953)"], ["1994-06-12T00:00:00", "Menachem Mendel Schneerson, the Lubavitcher Rebbe (b. 1902)"], ["1994-06-12T00:00:00", "Nicole Brown Simpson, former wife of O. J. Simpson (b. 1959)"], ["1994-06-12T00:00:00", "Chris Latta, American voice actor & Comedian (b. 1949)"], ["1994-06-15T00:00:00", "Kristen Pfaff, American bassist (b. 1967)"], ["1994-06-15T00:00:00", "Manos Hatzidakis, Greek composer (b. 1925)"], ["1994-07-02T00:00:00", "Roberto Balado, Cuban boxer, 1992 Gold medalist (b. 1969)"], ["1994-07-02T00:00:00", "Maung Maung, former President of Myanmar (b. 1925)"], ["1994-07-07T00:00:00", "Friedrich August Freiherr von der Heydte, German Luftwaffe Officer (b. 1907)"], ["1994-07-07T00:00:00", "Cameron Mitchell, American actor (b. 1918)"], ["1994-07-07T00:00:00", "Anita Garvin. American Actress (b. 1907), Famous (Laurel & Hardy) Co-star"], ["1994-07-08T00:00:00", "Dick Sargent, American actor (b. 1930)"], ["1994-07-08T00:00:00", "Kim Il-sung, President of North Korea (b. 1912)"], ["1994-07-08T00:00:00", "Christian-Jaque, French film director (b. 1904)"], ["1994-07-16T00:00:00", "Patricio Carvajal, Chilean admiral, minister and diplomat (b. 1916)"], ["1994-07-16T00:00:00", "Julian Schwinger, American physicist, recipient of the Nobel Prize in Physics (b. 1918)"], ["1994-07-21T00:00:00", "Marijac, French cartoonist"], ["1994-07-21T00:00:00", "Pere Calders, Spanish writer and cartoonist (b. 1912)"], ["1994-08-07T00:00:00", "Larry Martyn, comedy actor (b. 1934)"], ["1994-08-07T00:00:00", "Rosa Chacel, Spanish writer (b. 1898)"], ["1994-08-21T00:00:00", "Anita Lizana, Chilean tennis champion (b. 1915)"], ["1994-08-21T00:00:00", "Michael Peters, American choreographer (b. 1948)"], ["1994-09-06T00:00:00", "Nicky Hopkins, British musician (b. 1944)"], ["1994-09-06T00:00:00", "Duccio Tessari, Italian director and screenwriter (b. 1926)"], ["1994-09-06T00:00:00", "Paul Xuereb, Maltese politician, former acting President (b. 1923)"], ["1994-09-07T00:00:00", "James Clavell, British writer (b. 1921)"], ["1994-09-07T00:00:00", "Dennis Morgan, American actor and singer (b. 1908)"], ["1994-09-07T00:00:00", "Terence Young, American film director (b. 1915)"], ["1994-09-12T00:00:00", "Tom Ewell, American actor (b. 1909)"], ["1994-09-12T00:00:00", "Boris Yegorov, Russian cosmonaut (b. 1937)"], ["1994-09-15T00:00:00", "Moana Pozzi, Italian porn actress (b. 1961)"], ["1994-09-15T00:00:00", "Mark Stevens, American actor (b. 1916)"], ["1994-09-17T00:00:00", "Vitas Gerulaitis, American tennis champion (b. 1954)"], ["1994-09-17T00:00:00", "Karl Popper, Austrian and British philosopher (b. 1902)"], ["1994-09-19T00:00:00", "Alberto Closas, Spanish actor (b. 1921)"], ["1994-09-19T00:00:00", "Joseph Iléo, Congolese politician, former Prime Minister of the Democratic Republic of the Congo (b. 1921)"], ["1994-09-20T00:00:00", "Abioseh Nicol, Sierra Leonean diplomat, UN official and author (b. 1924)"], ["1994-09-20T00:00:00", "Jule Styne, British-born songwriter (b. 1905)"], ["1994-09-30T00:00:00", "André Michel Lwoff, French microbiologist, recipient of the Nobel Prize in Physiology or Medicine (b. 1902)"], ["1994-09-30T00:00:00", "Roberto Eduardo Viola, former military president of Argentina (b. 1924)"], ["1994-10-03T00:00:00", "Tim Asch, Anthropologist, photographer and ethnographic filmmaker (b. 1932)"], ["1994-10-03T00:00:00", "Dub Taylor, American actor (b. 1907)"], ["1994-10-07T00:00:00", "Niels Kaj Jerne, English immunologist, recipient of the Nobel Prize in Physiology or Medicine (b. 1911)"], ["1994-10-07T00:00:00", "James Hill), British film and TV director (b. 1919)"], ["1994-10-20T00:00:00", "Sergei Bondarchuk, Russian film director (b. 1920)"], ["1994-10-20T00:00:00", "Burt Lancaster, American actor (b. 1913)"], ["1994-10-24T00:00:00", "Raúl Juliá, Puerto Rican actor (b. 1940)"], ["1994-10-24T00:00:00", "Gamini Dissanayake, Sri Lankan opposition leader and presidential candidate (assassinated) (b. 1942)"], ["1994-11-16T00:00:00", "Doris Speed, English actress (b. 1899)"], ["1994-11-16T00:00:00", "Dino Valente, American musician (b. 1937)"], ["1994-11-18T00:00:00", "Cab Calloway, American jazz singer and bandleader (b. 1908)"], ["1994-11-18T00:00:00", "Peter Ledger, Australian artist (b. 1945)"], ["1994-11-28T00:00:00", "Jeffrey Dahmer, American serial killer (b. 1960)"], ["1994-11-28T00:00:00", "Buster Edwards, English Great train robber (b. 1932)"], ["1994-11-30T00:00:00", "Guy Debord, French Marxist theorist, writer, filmmaker (b. 1931)"], ["1994-11-30T00:00:00", "Lionel Stander, American actor (b. 1908)"], ["1994-12-11T00:00:00", "Philip Phillips, American archaeologist (b. 1900)"], ["1994-12-11T00:00:00", "Carl Marzani, American political documentary filmmaker, author, editor and publisher (b. 1912)"], ["1994-12-12T00:00:00", "Donna J. Stone, American poet and philanthropist (b. 1933)"], ["1994-12-12T00:00:00", "Stuart Roosa, American astronaut (b. 1933)"], ["1994-12-20T00:00:00", "Hans Herlin, German novelist (b. 1925)"], ["1994-12-20T00:00:00", "Dean Rusk, 54th United States Secretary of State (b. 1909)"], ["1994-12-24T00:00:00", "John Boswell, American historian (b. 1947)"], ["1994-12-24T00:00:00", "Rossano Brazzi, Italian actor (b. 1916)"], ["1994-12-24T00:00:00", "John Osborne, English playwright (b. 1929)"], ["1994-12-27T00:00:00", "Fanny Cradock, British television chef and restaurant critic (b. 1909)"], ["1994-12-27T00:00:00", "Peter May, English cricketer (b. 1929)"], ["1994-12-27T00:00:00", "J. B. L. Reyes, Filipino jurist (b. 1902)"]]