[["2000-01-14T00:00:00", "A United Nations tribunal sentences 5 Bosnian Croats to up to 25 years in prison for the 1993 killing of over 100 Bosnian Muslims in a Bosnian village."], ["2000-01-14T00:00:00", "The Dow Jones Industrial Average closes at 11,722.98 (at the peak of the Dot-com bubble)."], ["2000-01-31T00:00:00", "Alaska Airlines Flight 261 crashes off the California coast into the Pacific Ocean, killing 88."], ["2000-01-31T00:00:00", "Dr. Harold Shipman is found guilty of murdering 15 patients between 1995 and 1998 at Hyde, Greater Manchester, and sentenced to life imprisonment."], ["2000-03-01T00:00:00", "The Constitution of Finland is rewritten."], ["2000-03-01T00:00:00", "Jorge Batlle, a son, grandnephew and great-grandson of former presidents, is sworn in as President of Uruguay."], ["2000-03-21T00:00:00", "Pope John Paul II begins the first official visit by a Roman Catholic pontiff to Israel."], ["2000-03-21T00:00:00", "The U.S. Supreme Court rules the FDA lacks authority to regulate tobacco as an addictive drug, throwing out the Clinton Administration's main anti-smoking initiative."], ["2000-03-26T00:00:00", "Vladimir Putin is elected President of Russia."], ["2000-03-26T00:00:00", "The Seattle Kingdome is demolished by implosion."], ["2000-05-04T00:00:00", "After originating in the Philippines, the ILOVEYOU computer virus spreads quickly throughout the world."], ["2000-05-04T00:00:00", "An earthquake hits Banggai, Indonesia, leaving 54 dead."], ["2000-05-11T00:00:00", "The billionth living person in India is born."], ["2000-05-11T00:00:00", "Effective date of Canada's first modern-day treaty – The Nisga'a Final Agreement."], ["2000-05-13T00:00:00", "A fireworks factory disaster in Enschede, Netherlands, kills 23."], ["2000-05-13T00:00:00", "Millennium Force opens at Cedar Point amusement park in Sandusky, Ohio as the world's tallest and fastest roller coaster."], ["2000-07-02T00:00:00", "France defeats Italy 2-1 after extra time in the final of the European Championships, becoming the first team to win the World Cup and European Championships consecutively."], ["2000-07-02T00:00:00", "Vicente Fox is elected President of Mexico, as candidate of the rightist PAN (National Action Party), ending 71 years of PRI (Institutional Revolutionary Party) rule."], ["2000-07-10T00:00:00", "In southern Nigeria, a leaking petroleum pipeline explodes, killing about 250 villagers who were scavenging gasoline."], ["2000-07-10T00:00:00", "Bashar al-Assad is confirmed as Syria's leader in a national referendum following the death of his father, Hafez al-Assad."], ["2000-08-14T00:00:00", "Tsar Nicholas II and his family are canonized by the synod of the Russian Orthodox Church."], ["2000-08-14T00:00:00", "Dora the Explorer, one of Nickelodeon's most popular shows, debuts."], ["2000-09-08T00:00:00", "Albania officially joins the World Trade Organization."], ["2000-09-08T00:00:00", "The United Nations Millennium Declaration is made in New York."], ["2000-09-16T00:00:00", "Ukrainian journalist Georgiy Gongadze is last seen alive; this day is taken as the commemoration date of his death."], ["2000-09-16T00:00:00", "Peru's president Alberto Fujimori calls for new elections in which he will not run."], ["2000-09-26T00:00:00", "The Greek ferry Express Samina sinks off the coast of the island of Paros; 80 out of a total of over 500 passengers perish in one of Greece's worst sea disasters."], ["2000-09-26T00:00:00", "Anti-globalization protests in Prague (some 15,000 protesters) turn violent during the IMF and World Bank summits."], ["2000-10-11T00:00:00", "Jim Wallace becomes Acting First Minister of Scotland."], ["2000-10-11T00:00:00", "250 million US gallons (950,000 m3) of coal sludge spill in Martin County, Kentucky (considered a greater environmental disaster than the Exxon Valdez oil spill)."], ["2000-10-27T00:00:00", "Pacific Islands Forum (PIF)."], ["2000-10-27T00:00:00", "Henry McLeish becomes First Minister of Scotland."], ["2000-11-01T00:00:00", "Serbia is admitted to the United Nations as the 190th member."], ["2000-11-07T00:00:00", "In London, a criminal gang raids the Millennium Dome to steal the Millennium Star diamond, but police surveillance catches them in the act."], ["2000-11-07T00:00:00", "Hillary Rodham Clinton is elected to the United States Senate, becoming the first First Lady of the United States to win public office."], ["2000-11-07T00:00:00", "United States presidential election, 2000: Republican Governor of Texas George W. Bush defeats Democratic Vice President Al Gore in the U.S. presidential election but there is a miscount in Florida resulting in a recount of the votes."], ["2000-11-17T00:00:00", "A catastrophic landslide in Log pod Mangartom, Slovenia, kills 7, and causes millions of SIT of damage. It is one of the worst catastrophes in Slovenia in the past 100 years."], ["2000-11-17T00:00:00", "Alberto Fujimori is removed from office as president of Peru."], ["2000-12-15T00:00:00", "Disney's Paradise Pier Hotel opens at the Disneyland Resort."], ["2000-12-15T00:00:00", "The third and final reactor at the Chernobyl Nuclear Power Plant is shut down and the station is shut down completely."], ["2000-02-26T00:00:00", "Alexa Ilacad, Filipina actress"], ["2000-01-19T00:00:00", "Bettino Craxi, Prime Minister of Italy (b. 1934)"], ["2000-01-19T00:00:00", "Hedy Lamarr, Austrian actress (b. 1913)"], ["2000-02-05T00:00:00", "Claude Autant-Lara, French film director (b. 1901)"], ["2000-02-05T00:00:00", "Ward Cornell, Canadian radio/TV broadcaster & educator (b. 1924)"], ["2000-02-07T00:00:00", "Doug Henning, Canadian magician (b. 1947)"], ["2000-02-07T00:00:00", "Big Pun, American rapper (b. 1971)"], ["2000-02-07T00:00:00", "Shiho Niiyama, Japanese voice actress (b. 1970)"], ["2000-02-08T00:00:00", "Bob Collins, American broadcaster (b. 1942)"], ["2000-02-08T00:00:00", "Sid Abel, Canadian ice hockey player (b. 1918)"], ["2000-02-08T00:00:00", "Derrick Thomas, American football player (b. 1967)"], ["2000-02-12T00:00:00", "Tom Landry, American football coach (b. 1924)"], ["2000-02-12T00:00:00", "Charles M. Schulz, American comic strip artist (Peanuts) (b. 1922)"], ["2000-02-12T00:00:00", "Oliver, American pop singer (b. 1945)"], ["2000-02-12T00:00:00", "Screamin' Jay Hawkins, African-American rock singer and performer (b. 1929)"], ["2000-02-23T00:00:00", "Sir Stanley Matthews, English footballer (b. 1915)"], ["2000-02-23T00:00:00", "Ofra Haza, Israeli singer (b. 1957)"], ["2000-05-01T00:00:00", "Steve Reeves, American actor and bodybuilder (b. 1926)"], ["2000-05-01T00:00:00", "Jukka Tapanimäki, Finnish game programmer (b. 1961)"], ["2000-05-10T00:00:00", "Craig Stevens, American actor (b. 1918)"], ["2000-05-10T00:00:00", "Kaneto Shiozawa, Japanese voice actor (b. 1954)"], ["2000-05-21T00:00:00", "Dame Barbara Cartland, English novelist (b. 1901)"], ["2000-05-21T00:00:00", "Sir John Gielgud, English actor (b. 1904)"], ["2000-05-27T00:00:00", "Maurice Richard, Canadian hockey player (b. 1921)"], ["2000-05-27T00:00:00", "Kazimierz Leski, Polish engineer, fighter pilot, and Home Army's intelligence and counter-intelligence officer (b. 1912)"], ["2000-05-27T00:00:00", "Erich Mielke, German secret police official (b. 1907)"], ["2000-06-10T00:00:00", "Hafez al-Assad, President of Syria (b. 1930)"], ["2000-06-10T00:00:00", "Frank Patterson, Irish tenor (b. 1938)"], ["2000-07-10T00:00:00", "Vakkom Majeed, Indian freedom fighter, Travancore-Cochin Legislative member (b. 1909)"], ["2000-07-10T00:00:00", "Denis O'Conor Don, hereditary chief of the O'Conor Don sept of Ireland (b. 1912)"], ["2000-08-05T00:00:00", "Sir Alec Guinness, English actor and writer (b. 1914)"], ["2000-08-05T00:00:00", "Otto Buchsbaum, writer and ecological activist (b. 1920)"], ["2000-08-12T00:00:00", "Loretta Young, American actress (b. 1913)"], ["2000-08-12T00:00:00", "Dave Edwards, American musician (b. 1941)"], ["2000-09-02T00:00:00", "Elvera Sanchez, American dancer (b. 1905)"], ["2000-09-02T00:00:00", "Curt Siodmak, American novelist and screenwriter (b. 1902)"], ["2000-09-28T00:00:00", "Peter Gennaro, American dancer and choreographer (b. 1919)"], ["2000-09-28T00:00:00", "Pierre Trudeau, 15th Prime Minister of Canada (b. 1919)"], ["2000-10-13T00:00:00", "Jean Peters, American actress (b. 1926)"], ["2000-10-13T00:00:00", "Tony Roper, American NASCAR driver (b. 1964)"], ["2000-11-05T00:00:00", "David Brower, American environmental activist (b. 1912)"], ["2000-11-05T00:00:00", "Roger Peyrefitte, French writer and diplomat (b. 1907)"], ["2000-11-07T00:00:00", "C Subramaniam, Indian politician (b. 1910)"], ["2000-11-07T00:00:00", "Ingrid of Sweden, Queen consort of Frederick IX of Denmark (b. 1910)"], ["2000-11-22T00:00:00", "Sir Cyril Astley Clarke, British physician, geneticist and entomologist, former President of the Royal College of Physicians (b. 1907)"], ["2000-11-22T00:00:00", "Christian Marquand, French actor and director (b. 1927)"], ["2000-12-10T00:00:00", "Paul Avery, American journalist (b. 1934)"], ["2000-12-10T00:00:00", "Marie Windsor, American actress (b. 1919)"], ["2000-12-23T00:00:00", "Billy Barty, American actor (b. 1924)"], ["2000-12-23T00:00:00", "Victor Borge, Danish-born comedian and pianist (b. 1909)"]]