[["1923-01-01T00:00:00", "The Grouping: All major British railway companies are grouped into four larger companies, under terms of the Railways Act 1921."], ["1923-01-09T00:00:00", "Lithuania begins the Klaipėda Revolt to annex the Klaipėda Region (Memel Territory)."], ["1923-01-10T00:00:00", "Poland annexes the Republic of Central Lithuania"], ["1923-01-11T00:00:00", "Despite strong British protests, troops from France and Belgium occupy the Ruhr area to force Germany to make reparation payments."], ["1923-01-17T00:00:00", "Juan de la Cierva invents the autogyro, a rotary-winged aircraft with an unpowered rotor."], ["1923-01-18T00:00:00", "Elon College's campus in North Carolina is destroyed by a fire."], ["1923-02-09T00:00:00", "Billy Hughes resigns as Prime Minister of Australia, after the Country Party refuses to govern in coalition with him as the leader of the Nationalist Party. Hughes is succeeded by his Treasurer, Stanley Bruce."], ["1923-02-23T00:00:00", "Albert Einstein visits Barcelona, Spain, at the invitation of scientist Esteban Terradas i Illa."], ["1923-03-01T00:00:00", "The USS Connecticut is decommissioned."], ["1923-03-01T00:00:00", "Greece adopts the Gregorian calendar."], ["1923-03-03T00:00:00", "This is the cover date of the first issue of Time magazine. Retired U.S. Speaker of the House Joseph G. Cannon appears on the first cover."], ["1923-03-09T00:00:00", "Vladimir Lenin suffers his third stroke, which renders him bedridden and unable to speak; consequently he retires from his position as Chairman of the Soviet government."], ["1923-03-14T00:00:00", "Pete Parker calls the play-by-play of the first ice hockey game ever broadcast on the radio in its entirety, between the Regina Capitals and the Edmonton Eskimos of the Western Canada Hockey League."], ["1923-03-28T00:00:00", "Regia Aeronautica, the air force of Fascist Italy, is founded."], ["1923-04-04T00:00:00", "Warner Bros. film studio is formally incorporated in the United States as Warner Brothers Pictures, Inc."], ["1923-04-06T00:00:00", "Louis Armstrong makes his first recording, \"Chimes Blues\", with King Oliver's Creole Jazz Band."], ["1923-04-06T00:00:00", "The first Prefects Board in Southeast Asia is formed in Victoria Institution, Federated Malay States."], ["1923-04-12T00:00:00", "Kandersteg International Scout Centre comes into existence in Switzerland."], ["1923-04-18T00:00:00", "Yankee Stadium opens its doors as the home park of the New York Yankees baseball team in The Bronx."], ["1923-04-19T00:00:00", "Hjalmar Branting leaves office as Prime Minister of Sweden, after the Swedish Riksdag has rejected a government proposal regarding unemployment benefits."], ["1923-04-19T00:00:00", "Right-wing academic and jurist Ernst Trygger becomes Prime Minister of Sweden."], ["1923-04-19T00:00:00", "Egyptian Constitution of 1923 adopted, introducing a parliamentary system of democracy in the country."], ["1923-04-23T00:00:00", "The Gdynia seaport is inaugurated on the Polish Corridor."], ["1923-04-26T00:00:00", "The Prince Albert, Duke of York (later George VI, King of the United Kingdom) marries Lady Elizabeth Bowes-Lyon (later Queen Elizabeth The Queen Mother) in Westminster Abbey."], ["1923-04-28T00:00:00", "The original Wembley Stadium opened its doors for the first time to the British public staging the FA Cup Final between Bolton Wanderers and West Ham Utd."], ["1923-05-01T00:00:00", "Rahula College is established in Ceylon with the name of \"Parakramabhahu Vidyalaya\"."], ["1923-05-09T00:00:00", "Southeastern Michigan receives a record 6 inches (15 cm) of snow after temperatures plummeted from 62 to 34 degrees between 1 and 6 pm on the previous day."], ["1923-05-09T00:00:00", "The premiere of Bertolt Brecht's play In the Jungle (Im Dickicht) at the Residenztheater in Munich is interrupted by Nazi demonstrators."], ["1923-05-23T00:00:00", "Belgium's Sabena Airlines is created."], ["1923-05-24T00:00:00", "The Irish Civil War ends."], ["1923-05-26T00:00:00", "The first 24 Hours of Le Mans motor race is held, and is won by André Lagache and René Léonard."], ["1923-05-27T00:00:00", "The Ku Klux Klan in the United States defies a law requiring publication of its members."], ["1923-06-09T00:00:00", "A military coup in Bulgaria ousts prime minister Aleksandar Stamboliyski (he is killed June 14)."], ["1923-06-12T00:00:00", "William Walton's Façade is performed for the first time."], ["1923-06-13T00:00:00", "President Li Yuanhong of China abandons his residence because a warlord has commanded forces to surround the mansion and cut off its water and electric supplies, in order to force him to abandon his post."], ["1923-06-16T00:00:00", "The storming of Ayan in Siberia concludes the Yakut Revolt and the Russian Civil War."], ["1923-06-18T00:00:00", "Mount Etna erupts in Italy, making 60,000 homeless."], ["1923-06-25T00:00:00", "FC Rapid București is formed on the initiative of the Grivița railroad workers (first named CFR București)."], ["1923-07-10T00:00:00", "Large hailstones kill 23 in Rostov, Soviet Union."], ["1923-07-13T00:00:00", "The Hollywood Sign is inaugurated in California (originally reading Hollywoodland)."], ["1923-07-13T00:00:00", "American explorer Roy Chapman Andrews discovers the first dinosaur eggs near Flaming Cliffs, Mongolia."], ["1923-07-20T00:00:00", "Pancho Villa is assassinated at Hidalgo del Parral, Chihuahua."], ["1923-07-24T00:00:00", "The Treaty of Lausanne, settling the boundaries of the modern Republic of Turkey, is signed in Switzerland by Greece, Bulgaria and other countries that fought in the First World War, bringing an end to the Ottoman Empire after 624 years."], ["1923-08-02T00:00:00", "U.S. President Warren G. Harding, dies of a heart attack and is succeeded by Vice President Calvin Coolidge as President of the United States."], ["1923-08-13T00:00:00", "The first major seagoing ship arrives at Gdynia, the newly constructed Polish seaport."], ["1923-08-13T00:00:00", "Gustav Stresemann is named Chancellor of Germany and founds a coalition government for the Weimar Republic, where hyperinflation means that more than 4,600,000 marks are now needed to buy a single American dollar."], ["1923-08-21T00:00:00", "Necaxa football club is founded by engineer William H. Frasser."], ["1923-08-30T00:00:00", "Hurricane season begins, with a tropical storm northeast of the Turks and Caicos Islands."], ["1923-09-01T00:00:00", "The Great Kantō earthquake devastates Tokyo and Yokohama, killing an estimated 142,807 people, but according to a Japanese construction research center report in 2005, 105,000 are confirmed dead."], ["1923-09-04T00:00:00", "The United States Navy's first home-built rigid airship USS Shenandoah (ZR-1) makes her first flight at Naval Air Station Lakehurst (New Jersey); she contains most of the world's extracted reserves of helium at this time."], ["1923-09-06T00:00:00", "The Italian navy occupies Corfu in retaliation for the murder of an Italian officer. The League of Nations protests and they leave on September 29."], ["1923-09-07T00:00:00", "At the International Police Conference in Vienna, the International Criminal Police Commission (ICPC), better known as Interpol, is set up."], ["1923-09-08T00:00:00", "Honda Point disaster: Nine United States Navy destroyers run aground off the California coast."], ["1923-09-09T00:00:00", "Turkish head of state Mustafa Kemal Atatürk founds the Republican People's Party (CHP)."], ["1923-09-10T00:00:00", "The Irish Free State joins the League of Nations."], ["1923-09-13T00:00:00", "Military coup in Spain: Miguel Primo de Rivera takes over, setting up a dictatorship. Trade unions are prohibited for 10 years."], ["1923-09-17T00:00:00", "1923 Berkeley Fire: A major fire in Berkeley, California, erupts, consuming some 640 structures, including 584 homes in the densely built neighborhoods north of the campus of the University of California."], ["1923-09-24T00:00:00", "Second storm of the Atlantic hurricane season, a major hurricane north of Hispaniola."], ["1923-09-26T00:00:00", "In Bavaria, Gustav Ritter von Kahr takes dictatorial powers."], ["1923-09-29T00:00:00", "The British Mandate for Palestine (1922) comes into effect, officially creating the protectorates of Palestine as a homeland for the Jewish people under British administration and Transjordan as a separate emirate under Abdullah I."], ["1923-09-30T00:00:00", "Outside Berlin, Major Ernst von Buchrucker, the leader of the Black Reichswehr attempts a putsch by seizing several forts."], ["1923-10-02T00:00:00", "After two days of siege, Major Buckrucker and his men surrender."], ["1923-10-06T00:00:00", "The great powers of World War I withdraw from Constantinople."], ["1923-10-13T00:00:00", "Ankara replaces Constantinople as the capital of Turkey."], ["1923-10-13T00:00:00", "The first recorded example of a storm crossing from the Eastern Pacific into the Atlantic, occurred in Oaxaca."], ["1923-10-14T00:00:00", "Fourth tropical storm of the year, formed just north of Panama."], ["1923-10-15T00:00:00", "Fifth tropical storm of the year, formed north of the Leeward Islands."], ["1923-10-16T00:00:00", "A sixth tropical storm develops in the Gulf of Mexico; a rare occurrence, it consists of four active tropical storms simultaneously."], ["1923-10-16T00:00:00", "Roy and Walt Disney found The Walt Disney Company."], ["1923-10-23T00:00:00", "In Germany, the Communists attempt a \"putsch\" in Hamburg, which results in street battles in that city for the next two days, when it ends unsuccessfully."], ["1923-10-26T00:00:00", "In Persia, Reza Khan becomes Ahmad Shah Qajar's prime minister."], ["1923-10-27T00:00:00", "In Germany, General Hans von Seeckt orders the Reichswehr to dissolve the Social Democratic-Communist government of Saxony, which is refusing to accept the authority of the Reich government."], ["1923-10-29T00:00:00", "Turkey becomes a republic following the dissolution of the Ottoman Empire. Kemal Atatürk is elected as first president."], ["1923-10-30T00:00:00", "İsmet İnönü is appointed as the first prime minister of Turkey."], ["1923-11-01T00:00:00", "The Finnish flag carrier Finnair airline is started in Aero Oy."], ["1923-11-08T00:00:00", "Beer Hall Putsch: In Munich, Adolf Hitler leads the Nazis in an unsuccessful attempt to overthrow the Bavarian government; police and troops crush the attempt the next day."], ["1923-11-11T00:00:00", "Adolf Hitler is arrested for his leading role in the Beer Hall Putsch, two days after the Putsch was crushed by the government."], ["1923-11-12T00:00:00", "Her Highness Princess Maud of Fife marries Captain Charles Alexander Carnegie in Wellington Barracks, London."], ["1923-11-15T00:00:00", "Hyperinflation in the Weimar Republic: Hyperinflation in Germany reaches its height. One United States dollar is worth 4,200,000,000,000 Papiermark (4.2 trillion on the short scale). Gustav Stresemann abolishes the old currency and replaces it with the Rentenmark at an exchange rate of one Rentenmark to 1,000,000,000,000 (one trillion on the short scale) Papiermark with effect from November 20."], ["1923-11-23T00:00:00", "Gustav Stresemann's coalition government collapses in Germany."], ["1923-12-10T00:00:00", "Sigma Alpha Kappa (the first social fraternity at a Jesuit college in the United States) is founded as a fraternal organization until the ban on social fraternities is lifted."], ["1923-12-12T00:00:00", "In Italy, the Po River dam bursts, killing 600."], ["1923-12-20T00:00:00", "BEGGARS Fraternity (the second social fraternity at a Jesuit college in the United States) is founded by nine men who have secured permission to do so from the Pope."], ["1923-12-21T00:00:00", "The Nepal-Britain Treaty is the first to define the international status of Nepal as an independent sovereign country."], ["1923-12-27T00:00:00", "The crown prince of Japan survives an assassination attempt in Tokyo."], ["1923-12-29T00:00:00", "Vladimir K. Zworykin files his first patent (in the United States) for \"television systems\"."]]