[["1941-01-22T00:00:00", "WWII: Battle of Tobruk: Australian and British forces capture Tobruk from the Italians."], ["1941-01-22T00:00:00", "In Sweden, Victor Hasselblad registers the Hasselblad camera company."], ["1941-02-12T00:00:00", "WWII: Erwin Rommel arrives in Tripoli."], ["1941-02-12T00:00:00", "Reserve Constable Albert Alexander, a patient at the Radcliffe Infirmary in Oxford, becomes the first person treated with penicillin intravenously, by Howard Florey's team. He reacts positively but there is insufficient supply of the drug to reverse his terminal infection. A successful treatment is achieved during May."], ["1941-03-01T00:00:00", "WWII: Bulgaria signs the Tripartite Pact, thus joining the Axis powers."], ["1941-03-01T00:00:00", "W47NV begins operations in Nashville, Tennessee, becoming the first FM radio station."], ["1941-03-01T00:00:00", "Arthur L. Bristol becomes Rear Admiral for the United States Navy's Support Force, Atlantic Fleet."], ["1941-03-17T00:00:00", "In Washington, D.C., the National Gallery of Art is officially opened by President Franklin D. Roosevelt."], ["1941-03-17T00:00:00", "British Minister of Labour Ernest Bevin calls for women to fill vital jobs."], ["1941-05-01T00:00:00", "The breakfast cereal Cheerios is introduced as CheeriOats by General Mills."], ["1941-05-01T00:00:00", "Orson Welles' film Citizen Kane premieres in New York City."], ["1941-05-01T00:00:00", "The first Defense Bonds and Defense Savings Stamps go on sale in the United States, to help fund the greatly increased production of military equipment."], ["1941-05-10T00:00:00", "WWII: The British House of Commons is damaged by the Luftwaffe in an air raid."], ["1941-05-10T00:00:00", "Rudolf Hess parachutes into Scotland, claiming to be on a peace mission."], ["1941-05-15T00:00:00", "The first British jet aircraft, the Gloster E.28/39, is flown."], ["1941-05-15T00:00:00", "Joe DiMaggio's 56-game hitting streak begins as the New York Yankees' center fielder goes one for four against Chicago White Sox Pitcher Eddie Smith."], ["1941-05-24T00:00:00", "WWII: In the North Atlantic, German battleship Bismarck sinks battlecruiser HMS Hood, killing all but 3 crewmen from a total of 1,418 aboard the pride of the Royal Navy."], ["1941-05-24T00:00:00", "The British submarine HMS Upholder torpedoes and sinks the Italian ocean liner SS Conte Rosso."], ["1941-05-27T00:00:00", "WWII: Franklin D. Roosevelt, President of the United States, proclaims an \"unlimited national emergency.\""], ["1941-05-27T00:00:00", "WWII: German battleship Bismarck is sunk in the North Atlantic, killing 2,300. It is eventually found in 1989."], ["1941-05-27T00:00:00", "The Swiss Socialist Federation is banned."], ["1941-06-05T00:00:00", "Four thousand Chongqing residents are asphyxiated in a bomb shelter during the Bombing of Chongqing."], ["1941-06-05T00:00:00", "A Serbian ammunition depot explodes at Smederevo on the outskirts of Belgrade, Serbia, killing 2,500, and injuring over 4,500."], ["1941-06-14T00:00:00", "Soviet officials deport about 65,000 people from Estonia, Latvia and Lithuania to Siberia."], ["1941-06-14T00:00:00", "All German and Italian assets in the United States are frozen."], ["1941-06-16T00:00:00", "All German and Italian consulates in the United States are ordered closed and their staffs to leave the country by July 10."], ["1941-06-16T00:00:00", "WWII: British Fleet Air Arm aircraft sink the Vichy French ship Chevalier Paul."], ["1941-06-20T00:00:00", "United States Army Air Corps becomes the Army Air Forces."], ["1941-06-20T00:00:00", "Walt Disney's live-action animated feature, The Reluctant Dragon, is released."], ["1941-06-22T00:00:00", "WWII and Operation Barbarossa: Germany invades the Soviet Union."], ["1941-06-22T00:00:00", "WWII: Winston Churchill promises all possible British assistance to the Soviet Union in a worldwide broadcast: \"Any man or state who fights against Nazidom will have our aid. Any man or state who marches with Hitler is our foe.\""], ["1941-06-22T00:00:00", "WWII: Italy and Romania declare war on the Soviet Union."], ["1941-06-22T00:00:00", "WWII: The First Sisak Partisan Brigade, the first anti-fascist armed unit in occupied Europe, is founded by Yugoslav partisans near Sisak, Croatia."], ["1941-06-22T00:00:00", "WWII: June Uprising in Lithuania and establishment of a Provisional Government of Lithuania begun by the Lithuanian Activist Front in an attempt to liberate Lithuania from Soviet occupation."], ["1941-07-01T00:00:00", "Commercial TV authorized by the FCC."], ["1941-07-01T00:00:00", "NBC television begins commercial operation on WNBT on channel 1. The world's first legal TV commercial, for Bulova watches, occurs at 2:29 PM over WNBT before a baseball game between the Brooklyn Dodgers and Philadelphia Phillies. The 10-second spot displayed a picture of a clock superimposed on a map of the United States, accompanied by the voice-over \"America runs on Bulova time.\"  As a one-off special, the first quiz show called \"Uncle Bee\" was telecast on WNBT's inaugural broadcast day, followed later the same day by Ralph Edwards hosting the second game show broadcast on United States television, Truth or Consequences, as simulcast on radio and TV and sponsored by Ivory soap. Weekly broadcasts of the show commenced in 1956, with Bob Barker."], ["1941-07-01T00:00:00", "CBS television begins commercial operation on New York station WCBW (now WCBS-TV) on channel 2."], ["1941-07-19T00:00:00", "WWII: A BBC broadcast by \"Colonel Britton\" calls on the people of occupied Europe to resist the Nazis under the slogan \"V for Victory\"."], ["1941-07-19T00:00:00", "The first episode The Midnight Snack in which Tom and Jerry are officially named, more than a year after their first production Puss Gets the Boot"], ["1941-08-28T00:00:00", "WWII: German troops capture Tallinn, Estonia from the Soviet Union, while attacks on the evacuating Soviet ships leave more than 12,000 dead in one of the bloodiest naval battles of World War II. German forces will capture the entire Estonian territory by 6 December."], ["1941-08-28T00:00:00", "WWII: The Soviet Union announces blowing up of the massive Dnieper Hydroelectric Station and dam at Zaporizhia to prevent its capture by the Germans."], ["1941-10-01T00:00:00", "The Holocaust: The Nazi German Majdanek concentration camp (Konzentrationslager Lublin) opens in occupied Poland on the outskirts of the town Lublin. Between October 1941 and July 1944 at least 200,000 people will be killed in the camp."], ["1941-10-01T00:00:00", "New Zealand Division of the Royal Navy becomes the Royal New Zealand Navy"], ["1941-10-31T00:00:00", "WWII: The destroyer USS Reuben James is torpedoed by a German U-boat near Iceland, killing more than 100 United States Navy sailors."], ["1941-10-31T00:00:00", "Last day of carving on Mount Rushmore in South Dakota."], ["1941-11-14T00:00:00", "WWII: - The British aircraft carrier HMS Ark Royal sinks under tow off Gibraltar after being torpedoed the previous day by German submarine U-81."], ["1941-11-14T00:00:00", "WWII: - The Holocaust: In Slonim (Byelorussian SSR), German forces engaged in Operation Barbarossa murder 9000 Jews this day."], ["1941-11-27T00:00:00", "WWII: Germans reach their closest approach to Moscow. They are subsequently frozen by cold weather and attacks by the Soviets."], ["1941-11-27T00:00:00", "A group of young men stop traffic on U.S. Highway 99 south of Yreka, California, handing out fliers proclaiming the establishment of the State of Jefferson."], ["1941-12-08T00:00:00", "WWII: The Battle of Hong Kong begins shortly after 8:00 a.m. (local time), less than eight hours after the attack on Pearl Harbor, when Japanese forces invade Hong Kong, which is defended by British, Canadian and local troops. The United Kingdom officially declares war on the Empire of Japan."], ["1941-12-08T00:00:00", "WWII: Japanese Invasion of Shanghai International Settlement, Began to occupy the British and the American sectors after the attack on Pearl Harbor."], ["1941-12-08T00:00:00", "WWII: The Japanese occupation of the Philippines begins ten hours after the attack on Pearl Harbor when Japanese forces invade Luzon and destroy U.S. aircraft on Clark Field."], ["1941-12-08T00:00:00", "WWII: President of the United States Franklin D. Roosevelt delivers his \"Infamy Speech\" to a Joint session of the United States Congress at 12:30 p.m. EST (17.30 GMT). Transmitted live over all four major national networks it attracts the largest audience ever for an American radio broadcast, over 81% of homes. Within an hour, Congress agrees to the President's request for a United States declaration of war upon Japan and he signs it at 4:10 p.m."], ["1941-12-08T00:00:00", "WWII: Australia, New Zealand, The Netherlands, the Free French, Yugoslavia, Costa Rica, Cuba, El Salvador Guatemala and Honduras also officially declare war on Japan, and the Republic of China declares war on the Axis powers."], ["1941-12-08T00:00:00", "WWII: Japanese also attack British Malaya and Thailand."], ["1941-12-08T00:00:00", "WWII: The German advance on Moscow (Operation Typhoon) is suspended for the winter."], ["1941-12-08T00:00:00", "The Holocaust: the Nazi German Chełmno extermination camp opens in occupied Poland near the village of Chełmno nad Nerem. Between December 1941-April 1943 and June 1944-January 1945 at least 153,000 people will be killed in the camp."], ["1941-12-21T00:00:00", "Thailand and Japan sign a military alliance."], ["1941-12-21T00:00:00", "The Holocaust: Stanisławów Ghetto established."], ["1941-01-07T00:00:00", "Iona Brown, British violinist and conductor (d. 2004)"], ["1941-01-07T00:00:00", "Manfred Schellscheidt, German American soccer coach"], ["1941-01-07T00:00:00", "John E. Walker, English chemist, Nobel Prize laureate"], ["1941-01-11T00:00:00", "Dave Edwards, American musician (d. 2000)"], ["1941-01-11T00:00:00", "Jimmy Velvit, American singer/songwriter"], ["1941-01-14T00:00:00", "Faye Dunaway, American actress"], ["1941-01-14T00:00:00", "David Johnston, retired Australian newsreader"], ["1941-01-14T00:00:00", "Milan Kučan, Slovenian politician and statesman"], ["1941-01-21T00:00:00", "Plácido Domingo, Spanish-born tenor"], ["1941-01-21T00:00:00", "Richie Havens, American musician (d. 2013)"], ["1941-01-24T00:00:00", "Neil Diamond, American singer-songwriter"], ["1941-01-24T00:00:00", "Aaron Neville, American singer"], ["1941-01-24T00:00:00", "Dan Shechtman, Israeli scientist; recipient of the Nobel Prize in Chemistry"], ["1941-01-26T00:00:00", "Scott Glenn, American actor"], ["1941-01-26T00:00:00", "Henry Jaglom, English film director"], ["1941-01-30T00:00:00", "Dick Cheney, American politician (R-WY); 46th Vice President of the United States"], ["1941-01-30T00:00:00", "Tineke Lagerberg, Dutch swimmer"], ["1941-01-31T00:00:00", "Lynne Abraham, American lawyer; former District Attorney of Philadelphia (1991–2010)"], ["1941-01-31T00:00:00", "Dick Gephardt, American politician"], ["1941-01-31T00:00:00", "Eugène Terre'Blanche, South African pro-apartheid politician, farmer (d. 2010)"], ["1941-01-31T00:00:00", "Jessica Walter, American actress"], ["1941-02-05T00:00:00", "Stephen J. Cannell, American director and producer (d. 2010)"], ["1941-02-05T00:00:00", "David Selby, American actor"], ["1941-02-05T00:00:00", "Kaspar Villiger, Swiss politician"], ["1941-02-13T00:00:00", "David Jeremiah, American televangelist"], ["1941-02-13T00:00:00", "Sigmar Polke, German painter"], ["1941-03-04T00:00:00", "John Aprea, American actor"], ["1941-03-04T00:00:00", "Adrian Lyne, English film director"], ["1941-03-16T00:00:00", "Robert Guéï, military ruler of Côte d'Ivoire (d. 2002)"], ["1941-03-16T00:00:00", "Chuck Woolery, American game show host"], ["1941-03-28T00:00:00", "Philip Fang, Hong Kong simultaneous interpretation specialist, United Nations official (d. 2013)"], ["1941-03-28T00:00:00", "Jim Turner, American football player"], ["1941-04-03T00:00:00", "Eric Braeden, German-born American actor"], ["1941-04-03T00:00:00", "Jorma Hynninen, Finnish baritone"], ["1941-04-03T00:00:00", "Philippé Wynne, American musician (d. 1984)"], ["1941-04-23T00:00:00", "Paavo Lipponen, Prime Minister of Finland"], ["1941-04-23T00:00:00", "Ed Stewart, English disc jockey"], ["1941-04-24T00:00:00", "Richard Holbrooke, American diplomat (d. 2010)"], ["1941-04-24T00:00:00", "John Williams, Australian guitarist"], ["1941-04-28T00:00:00", "Ann-Margret, Swedish-born American actress, singer and dancer"], ["1941-04-28T00:00:00", "K. Barry Sharpless, American chemist, Nobel Prize laureate"], ["1941-04-28T00:00:00", "Iryna Zhylenko, Ukrainian poet"], ["1941-05-13T00:00:00", "Senta Berger, Austrian actress"], ["1941-05-13T00:00:00", "Ritchie Valens, American singer (d. 1959)"], ["1941-05-19T00:00:00", "Bobby Burgess, American dancer and singer"], ["1941-05-19T00:00:00", "Nora Ephron, American film, producer, director, and screenwriter (d. 2012)"], ["1941-06-02T00:00:00", "Stacy Keach, American actor"], ["1941-06-02T00:00:00", "Charlie Watts, English musician (The Rolling Stones)"], ["1941-06-05T00:00:00", "Martha Argerich, Argentine pianist"], ["1941-06-05T00:00:00", "Spalding Gray, American actor and screenwriter (d. 2004)"], ["1941-06-08T00:00:00", "Robert Bradford, Northern Irish politician (d. 1981)"], ["1941-06-08T00:00:00", "Fuzzy Haskins, American musician (P-Funk)"], ["1941-06-10T00:00:00", "Mickey Jones, American actor and musician"], ["1941-06-10T00:00:00", "James A. Paul, American writer and non-profit executive"], ["1941-06-10T00:00:00", "Valeri Zolotukhin, Soviet/Russian actor"], ["1941-06-19T00:00:00", "Conchita Carpio-Morales, Filipino Supreme Court jurist"], ["1941-06-19T00:00:00", "Václav Klaus, President of the Czech Republic"], ["1941-06-22T00:00:00", "Ed Bradley, American journalist (d. 2006)"], ["1941-06-22T00:00:00", "Michael Lerner, American actor"], ["1941-06-22T00:00:00", "Terttu Savola, Finnish politician"], ["1941-06-24T00:00:00", "Bill Reardon, American politician and educator"], ["1941-06-24T00:00:00", "Charles Whitman, American mass murderer (d. 1966)"], ["1941-06-28T00:00:00", "Joseph Goguen, American computer scientist (d. 2006)"], ["1941-06-28T00:00:00", "David Johnston, 28th Governor General of Canada"], ["1941-06-30T00:00:00", "Larry Henley, American singer-songwriter"], ["1941-06-30T00:00:00", "Otto Sander, German actor (d. 2013)"], ["1941-07-01T00:00:00", "Alfred G. Gilman, American scientist, recipient of the Nobel Prize in Physiology or Medicine"], ["1941-07-01T00:00:00", "Myron Scholes, American economist, Nobel Prize laureate"], ["1941-07-07T00:00:00", "Michael Howard, Baron Howard of Lympne, Welsh politician"], ["1941-07-07T00:00:00", "Bill Oddie, English writer, composer, musician, comedian"], ["1941-07-12T00:00:00", "John Lahr, American drama critic"], ["1941-07-12T00:00:00", "Benny Parsons, American race car driver (d. 2007)"], ["1941-07-14T00:00:00", "Maulana Karenga, American author and activist"], ["1941-07-14T00:00:00", "Andreas Khol, Austrian politician"], ["1941-07-19T00:00:00", "Vikki Carr, American singer"], ["1941-07-19T00:00:00", "Neelie Kroes, Dutch politician"], ["1941-07-28T00:00:00", "Peter Cullen, Canadian voice actor"], ["1941-07-28T00:00:00", "Riccardo Muti, Italian conductor"], ["1941-07-29T00:00:00", "Jennifer Dunn, American politician (d. 2007)"], ["1941-07-29T00:00:00", "David Warner, English actor"], ["1941-08-14T00:00:00", "David Crosby, American musician"], ["1941-08-14T00:00:00", "Connie Smith, American singer"], ["1941-08-16T00:00:00", "Théoneste Bagosora, former Rwandan army officer and alleged planner of the Rwandan Genocide"], ["1941-08-16T00:00:00", "David Dickinson, British antiques expert and television presenter"], ["1941-08-17T00:00:00", "Ibrahim Babangida, former President of Nigeria"], ["1941-08-17T00:00:00", "Lothar Bisky, German politician (d. 2013)"], ["1941-09-02T00:00:00", "David Bale, South African-born businessman; father of actor Christian Bale and husband of feminist activist Gloria Steinem (d. 2003)"], ["1941-09-02T00:00:00", "Jyrki Otila, Finnish quiz show judge and Member of the European Parliament (d. 2003)"], ["1941-09-02T00:00:00", "John Thompson, American basketball coach"], ["1941-09-09T00:00:00", "Otis Redding, American musician (d. 1967)"], ["1941-09-09T00:00:00", "Dennis Ritchie, American computer scientist (d. 2011)"], ["1941-09-10T00:00:00", "Christopher Hogwood, English conductor and harpsichordist (d. 2014)"], ["1941-09-10T00:00:00", "Gunpei Yokoi, Japanese computer game producer (d. 1997)"], ["1941-09-13T00:00:00", "Tadao Ando, Japanese architect"], ["1941-09-13T00:00:00", "Ahmet Necdet Sezer, former President of Turkey"], ["1941-09-15T00:00:00", "Mirosław Hermaszewski, first Polish cosmonaut in space"], ["1941-09-15T00:00:00", "George Saimes, American football player"], ["1941-09-24T00:00:00", "Guy Hovis, American singer"], ["1941-09-24T00:00:00", "Linda McCartney, American activist, musician and photographer (d. 1998)"], ["1941-09-28T00:00:00", "Edmund Stoiber, German politician"], ["1941-09-28T00:00:00", "Sam Zell, American publisher and investor"], ["1941-10-04T00:00:00", "Roy Blount, Jr., American writer and comedian"], ["1941-10-04T00:00:00", "Elizabeth Eckford, American activist"], ["1941-10-04T00:00:00", "Anne Rice, American writer"], ["1941-10-25T00:00:00", "Helen Reddy, Australian singer and actress"], ["1941-10-25T00:00:00", "Anne Tyler, American novelist"], ["1941-10-28T00:00:00", "John Hallam, Irish actor"], ["1941-10-28T00:00:00", "Jochen Hasenmayer, German cave diver"], ["1941-10-28T00:00:00", "Hank Marvin, British guitarist, singer and songwriter (The Shadows)"], ["1941-11-01T00:00:00", "Marina Baura, Spanish-Venezuelan film and television actress"], ["1941-11-01T00:00:00", "Nigel Dempster, British journalist, author, broadcaster and diarist (d. 2007)"], ["1941-11-01T00:00:00", "Robert Foxworth, American actor"], ["1941-11-25T00:00:00", "Ralph Haben, American politician, former Speaker of the Florida House of Representatives"], ["1941-11-25T00:00:00", "Riaz Ahmed Gohar Shahi, Sufi, author, poet"], ["1941-12-06T00:00:00", "Vittorio Mezzogiorno, Italian actor (d. 1994)"], ["1941-12-06T00:00:00", "Richard Speck, American mass murderer (d. 1991)"], ["1941-12-19T00:00:00", "Lee Myung-bak, 17th President of South Korea"], ["1941-12-19T00:00:00", "Maurice White, American singer, songwriter, musician, record producer,founder of Earth, Wind & Fire"], ["1941-12-23T00:00:00", "Ron Bushy, American rock musician"], ["1941-12-23T00:00:00", "Tim Hardin, American musician (d. 1980)"], ["1941-01-04T00:00:00", "Henri Bergson, French philosopher, recipient of the Nobel Prize in Literature (b. 1859)"], ["1941-01-04T00:00:00", "Blanche Bates, American actress (b. 1873)"], ["1941-01-10T00:00:00", "Frank Bridge, English composer (b. 1879)"], ["1941-01-10T00:00:00", "Sir John Lavery, Anglo-Irish artist (b. 1856)"], ["1941-01-10T00:00:00", "Joe Penner, Hungarian-born American comedic actor (b. 1904)"], ["1941-03-28T00:00:00", "Kavasji Jamshedji Petigara, Indian police commissioner (b. 1887)"], ["1941-03-28T00:00:00", "Virginia Woolf, English writer (b. 1882)"], ["1941-10-08T00:00:00", "Gus Kahn, German songwriter (b. 1886)"], ["1941-10-08T00:00:00", "Valentine O'Hara, Irish author (b. 1875)"], ["1941-10-26T00:00:00", "Arkady Gaidar, Russian writer (b. 1904)"], ["1941-10-26T00:00:00", "Victor Schertzinger, American composer and director (b. 1888)"], ["1941-11-18T00:00:00", "Émile Nelligan, Canadian poet (b. 1879)"], ["1941-11-18T00:00:00", "Walther Nernst, German chemist, Nobel Prize laureate (b. 1864)"], ["1941-11-18T00:00:00", "Chris Watson, 3rd Prime Minister of Australia (b. 1867)"]]