[["1903-01-01T00:00:00", "Edward VII is proclaimed Emperor of India."], ["1903-01-19T00:00:00", "The first west-east transatlantic radio broadcast is made from the United States to England (the first east-west broadcast having been made in 1901)."], ["1903-02-11T00:00:00", "The Oxnard Strike of 1903 becomes the first time in U.S. history that a labor union is formed from members of different races."], ["1903-02-15T00:00:00", "Morris and Rose Michtom introduce the first teddy bear in the United States."], ["1903-02-17T00:00:00", "El Yunque National Forest in Puerto Rico becomes part of the United States National Forest System as the Luquillo Forest Reserve."], ["1903-02-23T00:00:00", "Cuba leases Guantánamo Bay to the United States \"in perpetuity\" under the terms of the Cuban-American Treaty."], ["1903-03-02T00:00:00", "In New York City, the Martha Washington Hotel, the first hotel exclusively for women, opens."], ["1903-03-03T00:00:00", "The British Admiralty announces plans to build a naval base at Rosyth."], ["1903-03-05T00:00:00", "The Ottoman Empire and the German Empire sign an agreement to build the Constantinople-Baghdad Railway."], ["1903-03-12T00:00:00", "The University of Puerto Rico is founded."], ["1903-03-14T00:00:00", "The Hay-Herrán Treaty, granting the United States the right to build the Panama Canal, is ratified by the United States Senate. The Colombian Senate later rejects the treaty."], ["1903-04-29T00:00:00", "A 30-million-m3 landslide kills 70-90 in Frank, Alberta."], ["1903-04-29T00:00:00", "A strong earthquake destroys the town of Melazhgerd, Van Province, Armenia. Over 2,000 people killed."], ["1903-05-04T00:00:00", "The leading Macedonian Bulgarian revolutionary Gotse Delchev is killed in a skirmish with the Turkish army."], ["1903-05-18T00:00:00", "The port of Burgas, Bulgaria opens."], ["1903-05-22T00:00:00", "The White Star Liner, SS Ionic, is launched."], ["1903-05-24T00:00:00", "The Paris-Madrid race begins, during which at least eight people are killed."], ["1903-06-11T00:00:00", "Serbian King Alexander Obrenović and Queen Draga are assassinated."], ["1903-06-14T00:00:00", "The town of Heppner, Oregon, is nearly destroyed by a cloud burst that resulted in a flash flood that kills an estimated 238 people."], ["1903-07-07T00:00:00", "The British take over the Fulani Empire."], ["1903-07-23T00:00:00", "Dr. Ernst Pfenning of Chicago becomes the first owner of a Ford Model A."], ["1903-07-29T00:00:00", "Explosion of a United States Cartridge Company magazine destroys 70 homes killing 22 residents of Tewksbury, Massachusetts."], ["1903-08-02T00:00:00", "The Ilinden-Preobrazhenie Uprising, organized by the Secret Macedonian-Adrianople Revolutionary Organization, breaks out in the Ottoman provinces of Macedonia and Adrianople."], ["1903-08-04T00:00:00", "Pope Pius X succeeds Pope Leo XIII as the 257th pope."], ["1903-08-10T00:00:00", "Paris Métro train fire takes place."], ["1903-08-25T00:00:00", "The Judiciary Act is passed in the Australian parliament."], ["1903-09-11T00:00:00", "The first stock car event is held at the Milwaukee Mile."], ["1903-09-14T00:00:00", "Joseph Chamberlain resigns as British Colonial Secretary, in order to campaign publicly for Imperial Preference."], ["1903-09-15T00:00:00", "Grêmio Foot-Ball Porto Alegrense is founded in Porto Alegre, Brazil"], ["1903-09-24T00:00:00", "Edmund Barton steps down as Prime Minister of Australia and is succeeded by Alfred Deakin."], ["1903-09-27T00:00:00", "The Wreck of the Old 97 Fast Mail train at Stillhouse Trestle near Danville, Virginia kills 11 people and inspires a ballad."], ["1903-09-29T00:00:00", "Prussia becomes the first locality to require mandatory driver's licenses for operators of motor vehicles."], ["1903-10-01T00:00:00", "First modern World Series: The Boston Red Sox defeat the Pittsburgh Pirates."], ["1903-10-06T00:00:00", "The High Court of Australia sits for the first time."], ["1903-10-10T00:00:00", "The Women's Social and Political Union is founded in the UK."], ["1903-11-03T00:00:00", "With the encouragement of the United States, Panama proclaims itself independent from Colombia."], ["1903-11-13T00:00:00", "The United States recognizes the independence of Panama."], ["1903-11-17T00:00:00", "The Russian Social Democratic Labour Party splits into two groups; the Bolsheviks (Russian for \"majority\") and Mensheviks (Russian for \"minority\")."], ["1903-11-18T00:00:00", "The Hay-Bunau-Varilla Treaty is signed by the United States and Panama, giving the U.S. exclusive rights over the Panama Canal Zone."], ["1903-11-23T00:00:00", "Colorado Governor James Hamilton Peabody sends the state militia into the town of Cripple Creek to break up a miners' strike."], ["1903-12-16T00:00:00", "The Taj Mahal Palace Hotel hotel in Bombay opens its doors to guests."], ["1903-12-17T00:00:00", "Orville Wright flies an aircraft with a petrol engine at Kitty Hawk, North Carolina in the first documented, successful, controlled, powered, heavier-than-air flight."], ["1903-12-30T00:00:00", "Iroquois Theatre fire in Chicago kills 600."]]