[["1987-01-01T00:00:00", "Frobisher Bay, Northwest Territories, changes its name to Iqaluit."], ["1987-01-02T00:00:00", "Chadian-Libyan conflict - Battle of Fada: The Chadian army destroys a Libyan armoured brigade."], ["1987-01-03T00:00:00", "Aretha Franklin becomes the first woman inducted into the Rock and Roll Hall of Fame."], ["1987-01-04T00:00:00", "1987 Maryland train collision: An Amtrak train en route from Washington, D.C. to Boston collides with Conrail engines at Chase, Maryland, killing 16."], ["1987-01-05T00:00:00", "U.S. President Ronald Reagan undergoes prostate surgery, causing speculation about his physical fitness to continue in office."], ["1987-01-08T00:00:00", "The Dow Jones Industrial Average closes for the first time above 2,000, gaining 8.30 to close at 2,002.25."], ["1987-01-13T00:00:00", "New York mafiosi Anthony \"Fat Tony\" Salerno and Carmine Peruccia are sentenced to 100 years in prison for racketeering."], ["1987-01-15T00:00:00", "Hu Yaobang, General Secretary of the Communist Party of China, is forced into retirement by political conservatives"], ["1987-01-16T00:00:00", "León Febres Cordero, president of Ecuador, is kidnapped by followers of imprisoned general Frank Vargas, who successfully demand the latter's release."], ["1987-01-20T00:00:00", "Terry Waite, the special envoy of the Archbishop of Canterbury in Lebanon, is kidnapped in Beirut (released November 1991)."], ["1987-01-22T00:00:00", "Pennsylvania Treasurer Budd Dwyer shoots and kills himself with a revolver during a televised press conference after being found guilty on charges of bribery, fraud, conspiracy, and racketeering."], ["1987-01-29T00:00:00", "William J. Casey ends his term as Director of the Central Intelligence Agency."], ["1987-01-31T00:00:00", "The last Ohrbach's department store closes in New York City after 64 years of operation."], ["1987-02-11T00:00:00", "British Airways is privatised and listed on the London Stock Exchange."], ["1987-02-11T00:00:00", "The new Constitution of the Philippines goes into effect. This new constitution adds Spanish and Arabic as optional languages of the Philippines."], ["1987-02-20T00:00:00", "A second Unabomber bomb explodes at a Salt Lake City computer store, injuring the owner."], ["1987-02-23T00:00:00", "SN 1987A, the first \"naked-eye\" supernova since 1604, is observed."], ["1987-02-25T00:00:00", "Beginning of the Phosphorite War protest movement in Estonian SSR."], ["1987-02-25T00:00:00", "St. Kitts and Nevis recognizes the Sahrawi Arab Democratic Republic."], ["1987-02-26T00:00:00", "Iran-Contra affair: The Tower Commission rebukes U.S. President Ronald Reagan for not controlling his National Security Council staff."], ["1987-02-27T00:00:00", "Antigua and Barbuda recognizes the Sahrawi Arab Democratic Republic."], ["1987-03-02T00:00:00", "American Motors is acquired by the Chrysler Corporation."], ["1987-03-04T00:00:00", "U.S. President Ronald Reagan addresses the American people on the Iran-Contra affair, acknowledging that his overtures to Iran had 'deteriorated' into an arms-for-hostages deal."], ["1987-03-06T00:00:00", "Zeebrugge disaster: Roll-on/roll-off cross-channel ferry MS Herald of Free Enterprise capsizes off Zeebrugge harbor in Belgium; 180 drown."], ["1987-03-09T00:00:00", "The Irish rock band U2 releases their studio album The Joshua Tree."], ["1987-03-18T00:00:00", "Woodstock of physics: The marathon session of the American Physical Society’s meeting features 51 presentations concerning the science of high-temperature superconductors."], ["1987-03-20T00:00:00", "AZT is approved by the United States Food and Drug Administration for use in the treatment of HIV/AIDS."], ["1987-03-24T00:00:00", "Michael Eisner, CEO of The Walt Disney Company, and French Prime Minister and future President of France, Jacques Chirac, sign the agreement to construct the 4,800 acres (19 km2) Euro Disney Resort (now called Disneyland Paris) and to develop the Val d'Europe area of the new town Marne-la-Vallée in Paris, France."], ["1987-03-29T00:00:00", "The World Wrestling Federation (later WWE) produces WrestleMania III from the Pontiac Silverdome in Pontiac, Michigan. The event is particularly notable for the record attendance of 93,173, the largest recorded attendance for a live indoor sporting event in North America until February 14, 2010, when the 2010 NBA All-Star Game has an attendance of 108,713 at AT&T Stadium."], ["1987-03-31T00:00:00", "Margaret Thatcher, Prime Minister of the United Kingdom, is given a 45-minute interview on television in the Soviet Union."], ["1987-04-03T00:00:00", "Showboat Casino Hotel first opens in Atlantic City, New Jersey."], ["1987-04-13T00:00:00", "The governments of the Portuguese Republic and the People's Republic of China sign an agreement in which Macau will be returned to China in 1999."], ["1987-04-19T00:00:00", "The Simpsons cartoon first appears as a series of shorts on The Tracey Ullman Show."], ["1987-04-27T00:00:00", "The United States Department of Justice declares incumbent Austrian president Kurt Waldheim an \"undesirable alien\"."], ["1987-04-30T00:00:00", "Canadian Prime Minister Brian Mulroney and the Provincial Premiers agree on principle to the Meech Lake Accord which would bring Quebec into the constitution."], ["1987-05-09T00:00:00", "A Soviet-made Ilyushin Il-62 airliner, operated by LOT Polish Airlines, crashes into a forest just outside Warsaw, killing all 183 people on board."], ["1987-05-11T00:00:00", "Klaus Barbie goes on trial in Lyon for war crimes committed during World War II."], ["1987-05-14T00:00:00", "Lieutenant Colonel Sitiveni Rabuka executes a bloodless coup in Fiji."], ["1987-05-17T00:00:00", "USS Stark is hit by two Iraqi-owned Exocet AM39 air-to-surface missiles killing 47 sailors."], ["1987-05-22T00:00:00", "The Hashimpura massacre occurs in Meerut, India."], ["1987-05-22T00:00:00", "The first ever Rugby World Cup kicks off with New Zealand playing Italy at Eden Park, Auckland."], ["1987-05-28T00:00:00", "Eighteen-year-old West German pilot Mathias Rust evades Soviet air defenses and lands a private plane on Red Square in Moscow. He is immediately detained (released on August 3, 1988)."], ["1987-06-03T00:00:00", "The Vanuatu Labour Party is founded."], ["1987-06-08T00:00:00", "The New Zealand Nuclear Free Zone, Disarmament, and Arms Control Act is passed, the first of its kind in the world."], ["1987-06-11T00:00:00", "The Conservative Party of the United Kingdom, led by Margaret Thatcher, is re-elected for a third term at the 1987 general election."], ["1987-06-12T00:00:00", "During a visit to Berlin, Germany, U.S. President Ronald Reagan challenges Soviet Premier Mikhail Gorbachev to tear down the Berlin Wall."], ["1987-06-17T00:00:00", "With the death of the last individual, the dusky seaside sparrow becomes extinct."], ["1987-06-19T00:00:00", "Teddy Seymour is officially designated the first black man to sail around the world, when he completes his solo sailing circumnavigation in Frederiksted, St. Croix, of the United States Virgin Islands."], ["1987-06-19T00:00:00", "Edwards v. Aguillard: The Supreme Court of the United States rules that a Louisiana law requiring that creation science be taught in public schools whenever evolution is taught is unconstitutional."], ["1987-06-27T00:00:00", "A commercial HS 748 (Philippine Airlines Flight 206) crashes near Baguio City, Philippines, killing 50."], ["1987-06-28T00:00:00", "Iraqi warplanes drop mustard-gas bombs on the Iranian town of Sardasht in two separate bombing rounds, on four residential areas. This is the first time a civilian town was targeted by chemical weapons."], ["1987-06-28T00:00:00", "An accidental explosion at the Hohenfels Training Area in West Germany kills 3 U.S. troops."], ["1987-06-29T00:00:00", "South Korean president Roh Tae-woo makes a speech promising a wide program of nationwide reforms, the result of the June Democracy Movement."], ["1987-06-30T00:00:00", "Canada introduces a one-dollar coin, nicknamed the \"Loonie\"."], ["1987-07-01T00:00:00", "The Single European Act is passed by the European Community."], ["1987-07-01T00:00:00", "U.S. President Ronald Reagan nominates former Solicitor General Robert Bork to the Supreme Court. The nomination is later rejected by the Senate."], ["1987-07-03T00:00:00", "In the Soviet Union, Vladimir Nikolayev is sentenced to death for cannibalism."], ["1987-07-03T00:00:00", "Greater Manchester Police recover the body of 16-year-old Pauline Reade from Saddleworth Moor, after her killers Ian Brady and Myra Hindley help them in their search, almost exactly 24 years since Pauline was last seen alive."], ["1987-07-04T00:00:00", "A court in Lyon sentences former Gestapo boss Klaus Barbie to life imprisonment for crimes against humanity."], ["1987-07-11T00:00:00", "Australian Prime Minister Robert Hawke's government is re-elected for a third term."], ["1987-07-11T00:00:00", "World population is estimated to have reached five billion people, according to the United Nations."], ["1987-07-12T00:00:00", "Konami releases Metal Gear (video game) in Japan for the MSX2."], ["1987-07-17T00:00:00", "The Dow Jones Industrial Average closes above the 2,500 mark for the first time, at 2,510.04."], ["1987-07-22T00:00:00", "Palestinian cartoonist Naji Salim al-Ali is shot in London; he dies August 28."], ["1987-07-25T00:00:00", "The East Lancashire Railway, a heritage railway in the North West of England, is opened between Bury and Ramsbottom."], ["1987-07-25T00:00:00", "United States Secretary of Commerce Malcolm Baldrige, Jr. dies in a rodeo accident at a California ranch."], ["1987-07-31T00:00:00", "Four hundred Iranian pilgrims are killed in clashes with Saudi Arabian security forces in Mecca."], ["1987-07-31T00:00:00", "Docklands Light Railway in London, the first driverless railway in Great Britain, is formally opened by Elizabeth II."], ["1987-07-31T00:00:00", "An F4-rated tornado devastates eastern Edmonton, Alberta; hardest hit are an industrial park and a trailer park. 27 people are killed and hundreds injured, with hundreds more left homeless and jobless."], ["1987-08-04T00:00:00", "The World Commission on Environment and Development, also known as the Brundtland Commission, publishes its report, Our Common Future."], ["1987-08-04T00:00:00", "The Federal Communications Commission rescinds the Fairness Doctrine, which had required radio and television stations to \"fairly\" present controversial issues."], ["1987-08-07T00:00:00", "The Colombian frigate Caldas enters Venezuelan waters near the Los Monjes Archipelago, sparking the Caldas frigate crisis between both nations."], ["1987-08-09T00:00:00", "Hoddle Street massacre in Australia: Julian Knight, 19, goes on a shooting rampage in the Melbourne suburb of Clifton Hill, Victoria, killing 7 people and injuring 19 before surrendering to police."], ["1987-08-14T00:00:00", "All the children held at Kia Lama, a rural property on Lake Eildon, Australia, run by the Santiniketan Park Association, are released after a police raid."], ["1987-08-16T00:00:00", "Northwest Airlines Flight 255 (a McDonnell Douglas MD-82) crashes on takeoff from Detroit Metropolitan Airport in Romulus, Michigan just west of Detroit killing all but one (4-year old Cecelia Cichan) of the 156 people on board."], ["1987-08-16T00:00:00", "The followers of the Harmonic Convergence claim it was observed around the world."], ["1987-08-17T00:00:00", "Rudolf Hess is found dead in his cell in Spandau Prison. Hess, 93, is believed to have committed suicide by hanging himself with an electrical flex. He was the last remaining prisoner at the complex, which is soon demolished."], ["1987-08-23T00:00:00", "The Hirvepark meeting is organized as the first unsanctioned political meeting in Estonian SSR, in commemoration of the Molotov-Ribbentrop Pact."], ["1987-08-31T00:00:00", "Michael Jackson releases his hit album Bad."], ["1987-09-02T00:00:00", "In Moscow, the trial begins for 19-year-old pilot Mathias Rust, who flew his Cessna airplane into Red Square in May."], ["1987-09-03T00:00:00", "In a coup d'état in Burundi, President Jean-Baptiste Bagaza is deposed by Major Pierre Buyoya."], ["1987-09-07T00:00:00", "September 21 - The world's first conference on artificial life is held at Los Alamos National Laboratory."], ["1987-09-13T00:00:00", "Scavengers open an old radiation source abandoned in a hospital in Goiânia, causing the worst radiation accident ever in an urban area."], ["1987-09-17T00:00:00", "At a small rally in New York City's Harlem district, televangelist Pat Robertson announces his candidacy for the 1988 Republican presidential nomination."], ["1987-09-28T00:00:00", "The second Star Trek TV series The Next Generation premieres in syndication."], ["1987-10-03T00:00:00", "The Canada-United States Free Trade Agreement is reached but still requires ratification. This agreement would be a precursor to NAFTA."], ["1987-10-07T00:00:00", "Sikh nationalists declares the independence of Khalistan from India."], ["1987-10-11T00:00:00", "The first National Coming Out Day is held in celebration of the second National March on Washington for Lesbian and Gay Rights."], ["1987-10-19T00:00:00", "Black Monday: Stock market levels fall sharply on Wall Street and around the world."], ["1987-10-19T00:00:00", "U.S. warships destroy 2 Iranian oil platforms in the Persian Gulf."], ["1987-10-19T00:00:00", "Two commuter trains collide head-on on the outskirts of Jakarta, Indonesia; 102 are killed."], ["1987-10-22T00:00:00", "The pilot of a British Aerospace BAE Harrier GR5 registered ZD325 accidentally ejects from his aircraft. The jet continues to fly until it runs out of fuel and crashes into the Irish Sea."], ["1987-10-23T00:00:00", "Champion English jockey Lester Piggott is jailed for 3 years after being convicted of tax evasion."], ["1987-10-23T00:00:00", "On a vote of 58-42, the United States Senate rejects President Ronald Reagan's nomination of Robert Bork to the Supreme Court because of the Saturday Night Massacre in 1973."], ["1987-10-26T00:00:00", "The Dow Jones Industrial Average goes down 156.83 points."], ["1987-11-01T00:00:00", "InterCity 125 breaks world diesel powered train speed record reaching 238 km/h (147.88 mph)."], ["1987-11-07T00:00:00", "Zine El Abidine Ben Ali assumes the Presidency of Tunisia."], ["1987-11-07T00:00:00", "Lynne Cox swims between the Diomede Islands from the American Little Diomede Island to the Soviet Big Diomede Island."], ["1987-11-08T00:00:00", "Enniskillen bombing: Eleven people are killed by a Provisional Irish Republican Army bomb at a Remembrance Day service at Enniskillen."], ["1987-11-12T00:00:00", "The first Kentucky Fried Chicken restaurant in Mainland China opens in Beijing, near Tiananmen Square."], ["1987-11-15T00:00:00", "In Brașov, Romania, workers rebel against the communist regime led by Nicolae Ceaușescu."], ["1987-11-16T00:00:00", "The Parlatino Treaty of Institutionalization is signed."], ["1987-11-17T00:00:00", "A tsunami hits the Gulf of Alaska."], ["1987-11-18T00:00:00", "The King's Cross fire on the London Underground kills 31 people and injures a further 100."], ["1987-11-18T00:00:00", "Iran-Contra affair: U.S. Senate and House panels release reports charging President Ronald Reagan with 'ultimate responsibility' for the affair."], ["1987-11-22T00:00:00", "Max Headroom broadcast signal intrusion - unknown perpetrators hijack the signal of WGN-TV for about 20 seconds, and WTTW for about 90 seconds, and displays a strange video of a man in a Max Headroom mask."], ["1987-11-25T00:00:00", "Category 5 Typhoon Nina smashes the Philippines with 165 miles per hour (266 km/h) winds and a devastating storm surge, causing destruction and 1,036 deaths."], ["1987-11-28T00:00:00", "South African Airways Flight 295 crashes into the Indian ocean off Mauritius, due to a fire in the cargo hold; the 159 passengers and crew perish."], ["1987-11-29T00:00:00", "Korean Air Flight 858 is blown up over the Andaman Sea, killing 115 crew and passengers. North Korean agents are responsible for the bombing."], ["1987-12-01T00:00:00", "NASA announces the names of 4 companies awarded contracts to help build Space Station Freedom: Boeing Aerospace, General Electric's Astro-Space Division, McDonnell Douglas, and the Rocketdyne Division of Rockwell."], ["1987-12-01T00:00:00", "Queensland: Following a week of turmoil from his National Party of Australia colleagues, Joh Bjelke-Petersen resigns as Premier of Queensland. He is replaced by Mike Ahern, the only premier never to contest an election as premier."], ["1987-12-02T00:00:00", "Hustler Magazine v. Falwell is argued before the U.S. Supreme Court."], ["1987-12-07T00:00:00", "Pacific Southwest Airlines Flight 1771 crashes near Paso Robles, California, killing all 43 on board, after a disgruntled passenger shoots his ex-supervisor on the flight, then shoots both pilots."], ["1987-12-08T00:00:00", "Israeli-Palestinian conflict: The First Intifada begins in the Gaza Strip and West Bank."], ["1987-12-08T00:00:00", "Queen Street massacre: In Melbourne, Australia, 22-year-old Frank Vitkovic kills 8 and injures another 5 in a Post Office building before committing suicide by jumping from the eleventh floor."], ["1987-12-08T00:00:00", "The Intermediate-Range Nuclear Forces Treaty is signed in Washington, D.C. by U.S. President Ronald Reagan and Soviet leader Mikhail Gorbachev."], ["1987-12-08T00:00:00", "Alianza Lima air disaster: A Peruvian Navy Fokker F27 crashes near Ventanilla, Peru, killing 43."], ["1987-12-09T00:00:00", "General Rahimuddin Khan retires from the Pakistan Army, along with the cabinet of the country's military dictatorship."], ["1987-12-09T00:00:00", "Microsoft releases Windows 2.0."], ["1987-12-17T00:00:00", "Gustáv Husák resigns as General Secretary of the Communist Party of Czechoslovakia."], ["1987-12-17T00:00:00", "Mega Man is released in Japan."], ["1987-12-18T00:00:00", "Square Co., Ltd. releases Final Fantasy in Japan for the Famicom."], ["1987-12-18T00:00:00", "The Perl programming language is created by Larry Wall."], ["1987-12-20T00:00:00", "In history's worst peacetime sea disaster, the passenger ferry MV Doña Paz sinks after colliding with the oil tanker Vector 1 in the Tablas Strait in the Philippines, killing an estimated 4,000 people (1,749 official)."], ["1987-12-21T00:00:00", "Turgut Özal of ANAP forms the new government of Turkey (46th government)."], ["1987-12-30T00:00:00", "Pope John Paul II issues the encyclical Sollicitudo rei socialis (On Social Concern)."]]