[["2000-01-06T00:00:00", "The last natural Pyrenean ibex is found dead, apparently killed by a falling tree."], ["2000-01-10T00:00:00", "America Online announces an agreement to purchase Time Warner for $162 billion (the largest-ever corporate merger)."], ["2000-01-11T00:00:00", "The armed wing of the Islamic Salvation Front concludes its negotiations with the government for an amnesty and disbands in Algeria (see Algerian Civil War#GIA destroyed, GSPC discontinues)."], ["2000-01-14T00:00:00", "A United Nations tribunal sentences 5 Bosnian Croats to up to 25 years in prison for the 1993 killing of over 100 Bosnian Muslims in a Bosnian village."], ["2000-01-14T00:00:00", "The Dow Jones Industrial Average closes at 11,722.98 (at the peak of the Dot-com bubble)."], ["2000-01-18T00:00:00", "The Tagish Lake meteorite impacts the Earth."], ["2000-01-24T00:00:00", "God's Army, a Karen militia group led by twins Johnny and Luther Htoo, takes 700 hostages at a Thai hospital near the Burmese border."], ["2000-01-30T00:00:00", "Kenya Airways Flight 431 crashes off the coast of Côte d'Ivoire into the Atlantic Ocean, killing 169."], ["2000-01-31T00:00:00", "Alaska Airlines Flight 261 crashes off the California coast into the Pacific Ocean, killing 88."], ["2000-01-31T00:00:00", "Dr. Harold Shipman is found guilty of murdering 15 patients between 1995 and 1998 at Hyde, Greater Manchester, and sentenced to life imprisonment."], ["2000-02-04T00:00:00", "German extortionist Klaus-Peter Sabotta is jailed for life for attempted murder and extortion, in connection with the sabotage of German railway lines."], ["2000-02-06T00:00:00", "Tarja Halonen is elected the first female president of Finland."], ["2000-02-07T00:00:00", "Stipe Mesić is elected president of Croatia."], ["2000-02-08T00:00:00", "Radio broadcaster Bob Collins' plane collides with that of a student pilot over Zion, Illinois."], ["2000-02-09T00:00:00", "Torrential rains in Africa lead to the worst flooding in Mozambique in 50 years, which lasts until March and kills 800 people."], ["2000-02-13T00:00:00", "The final original Peanuts comic strip is published, following the death of its creator, Charles M. Schulz."], ["2000-02-21T00:00:00", "UNESCO holds the inaugural celebration of International Mother Language Day."], ["2000-02-29T00:00:00", "a rare century leap year date occurs. Usually, 00 years are not leap years due to not being exactly divisible by 400. 2000 is the first such year to have a February 29 since the year 1600, making it only the second such occasion since leap years were introduced in the late 16th century. The next such leap year will not occur until 2400."], ["2000-03-01T00:00:00", "The Constitution of Finland is rewritten."], ["2000-03-01T00:00:00", "Jorge Batlle, a son, grandnephew and great-grandson of former presidents, is sworn in as President of Uruguay."], ["2000-03-04T00:00:00", "The PlayStation 2 is released in Japan. Several months later, it becomes the best-selling game console of all time."], ["2000-03-08T00:00:00", "Tokyo train disaster: A sideswipe collision of 2 Tokyo Metro trains kills 5 people."], ["2000-03-10T00:00:00", "The NASDAQ Composite Index reaches an all-time high of 5,048. Two weeks later, the NASDAQ-100, S&P 500, and Wilshire 5000 reach their peaks prior to the Dot-com bubble, ending a bull market run that lasted over 17 years."], ["2000-03-12T00:00:00", "Pope John Paul II apologizes for the wrongdoings by members of the Roman Catholic Church throughout the ages."], ["2000-03-13T00:00:00", "The United States dollar becomes the official currency of Ecuador, replacing the Ecuadorian sucre."], ["2000-03-21T00:00:00", "Pope John Paul II begins the first official visit by a Roman Catholic pontiff to Israel."], ["2000-03-21T00:00:00", "The U.S. Supreme Court rules the FDA lacks authority to regulate tobacco as an addictive drug, throwing out the Clinton Administration's main anti-smoking initiative."], ["2000-03-26T00:00:00", "Vladimir Putin is elected President of Russia."], ["2000-03-26T00:00:00", "The Seattle Kingdome is demolished by implosion."], ["2000-03-27T00:00:00", "The Phillips explosion of 2000 kills 1 and injures 71 in Pasadena, Texas."], ["2000-03-28T00:00:00", "A tornado hits Fort Worth, Texas, damaging the downtown area."], ["2000-04-01T00:00:00", "The 2000 United States Census begins. 281,421,906 residents are living in the United States."], ["2000-04-03T00:00:00", "United States v. Microsoft Corp.: Microsoft is ruled to have violated United States antitrust laws by keeping \"an oppressive thumb\" on its competitors."], ["2000-04-16T00:00:00", "An American anti-globalization protest is held in Washington, D.C."], ["2000-04-17T00:00:00", "Tuanku Syed Sirajuddin becomes Raja of Perlis."], ["2000-04-22T00:00:00", "In a predawn raid, federal agents seize 6-year-old Elián González from his relatives' home in Miami and fly him to his Cuban father in Washington, D.C., ending one of the most publicized custody battles in U.S. history."], ["2000-05-01T00:00:00", "A new class of composite material is fabricated, which has a combination of physical properties never before seen in a natural or man-made material."], ["2000-05-03T00:00:00", "In San Antonio, Texas, computer pioneer Datapoint files for Chapter 11 bankruptcy."], ["2000-05-04T00:00:00", "After originating in the Philippines, the ILOVEYOU computer virus spreads quickly throughout the world."], ["2000-05-04T00:00:00", "An earthquake hits Banggai, Indonesia, leaving 54 dead."], ["2000-05-05T00:00:00", "A rare conjunction of 7 celestial bodies (Sun, Moon, planets Mercury-Saturn) occurs during the new moon."], ["2000-05-11T00:00:00", "The billionth living person in India is born."], ["2000-05-11T00:00:00", "Effective date of Canada's first modern-day treaty - The Nisga'a Final Agreement."], ["2000-05-12T00:00:00", "The Tate Modern Gallery opens in London."], ["2000-05-13T00:00:00", "A fireworks factory disaster in Enschede, Netherlands, kills 23."], ["2000-05-13T00:00:00", "Millennium Force opens at Cedar Point amusement park in Sandusky, Ohio as the world's tallest and fastest roller coaster."], ["2000-05-16T00:00:00", "The Grand National Assembly of Turkey elects Ahmet Necdet Sezer as the tenth President of Turkey."], ["2000-05-17T00:00:00", "A bomb in Glorietta Mall in Makati City, Philippines injures 13."], ["2000-05-20T00:00:00", "Taiwanese (ROC) president Chen Shui-bian makes the Four Noes and One Without pledge to Taiwan."], ["2000-05-25T00:00:00", "Israel withdraws IDF forces from southern Lebanon after 22 years."], ["2000-06-04T00:00:00", "An earthquake hits Bengkulu, Indonesia, leaving 94 dead."], ["2000-06-05T00:00:00", "405 The Movie, the first short film widely distributed on the Internet, is released."], ["2000-06-13T00:00:00", "South Korean President Kim Dae-jung visits North Korea to participate in the first North-South presidential summit."], ["2000-06-17T00:00:00", "A centennial earthquake (6.5 on the Richter scale) hits Iceland on its national day."], ["2000-06-21T00:00:00", "Section 28, a law preventing the promotion of homosexuality, is repealed by the Scottish Parliament."], ["2000-06-26T00:00:00", "A preliminary draft of genomes, as part of the Human Genome Project, is finished. It is announced at the White House by President Clinton."], ["2000-06-28T00:00:00", "Elián González returns to Cuba with his father, Juan Miguel González, ending a protracted custody battle."], ["2000-06-30T00:00:00", "At the Roskilde Festival near Copenhagen, Denmark, 9 die and 26 are injured on a set while the rock group Pearl Jam performs."], ["2000-07-01T00:00:00", "Øresund Bridge between Denmark and Sweden opens."], ["2000-07-02T00:00:00", "France defeats Italy 2-1 after extra time in the final of the European Championships, becoming the first team to win the World Cup and European Championships consecutively."], ["2000-07-02T00:00:00", "Vicente Fox is elected President of Mexico, as candidate of the rightist PAN (National Action Party), ending 71 years of PRI (Institutional Revolutionary Party) rule."], ["2000-07-10T00:00:00", "In southern Nigeria, a leaking petroleum pipeline explodes, killing about 250 villagers who were scavenging gasoline."], ["2000-07-10T00:00:00", "Bashar al-Assad is confirmed as Syria's leader in a national referendum following the death of his father, Hafez al-Assad."], ["2000-07-14T00:00:00", "A powerful solar flare, later named the Bastille Day event, causes a geomagnetic storm on Earth."], ["2000-07-18T00:00:00", "Alex Salmond resigns as the leader of the Scottish National Party."], ["2000-07-25T00:00:00", "Air France Flight 4590, a Concorde aircraft, crashes into a hotel in Gonesse just after takeoff from Paris, killing all 109 aboard and 4 in the hotel."], ["2000-07-30T00:00:00", "Venezuela's president Hugo Chávez is reelected with 59% of the vote."], ["2000-08-03T00:00:00", "Rioting erupts on the Paulsgrove estate in Portsmouth, Hampshire, England, after more than 100 people besiege the home of a block of flats allegedly housing a convicted paedophile. This is the latest vigilante violence against suspected sex offenders since the beginning of the \"naming and shaming\" anti-paedophile campaign by the tabloid newspaper News of the World."], ["2000-08-08T00:00:00", "The Confederate submarine H. L. Hunley is raised to the surface after 136 years on the ocean floor."], ["2000-08-12T00:00:00", "The Russian submarine Kursk sinks in the Barents Sea during one of the largest Russian naval exercises since the 1991 dissolution of the Soviet Union, resulting in the deaths of all 118 men on board."], ["2000-08-14T00:00:00", "Tsar Nicholas II and his family are canonized by the synod of the Russian Orthodox Church."], ["2000-08-14T00:00:00", "Dora the Explorer, one of Nickelodeon's most popular shows, debuts."], ["2000-08-23T00:00:00", "John Anthony Kaiser, a Roman Catholic priest, is murdered in Morendat, Kenya."], ["2000-08-24T00:00:00", "The Nintendo GameCube is revealed."], ["2000-09-05T00:00:00", "Tuvalu joins the United Nations."], ["2000-09-06T00:00:00", "The last wholly Swedish-owned arms manufacturer, Bofors, is sold to American arms manufacturer United Defense."], ["2000-09-08T00:00:00", "Albania officially joins the World Trade Organization."], ["2000-09-08T00:00:00", "The United Nations Millennium Declaration is made in New York."], ["2000-09-13T00:00:00", "Steve Jobs introduces the public beta of Mac OS X for US$29.95."], ["2000-09-16T00:00:00", "Ukrainian journalist Georgiy Gongadze is last seen alive; this day is taken as the commemoration date of his death."], ["2000-09-16T00:00:00", "Peru's president Alberto Fujimori calls for new elections in which he will not run."], ["2000-09-26T00:00:00", "The Greek ferry Express Samina sinks off the coast of the island of Paros; 80 out of a total of over 500 passengers perish in one of Greece's worst sea disasters."], ["2000-09-26T00:00:00", "Anti-globalization protests in Prague (some 15,000 protesters) turn violent during the IMF and World Bank summits."], ["2000-09-28T00:00:00", "Israeli opposition leader Ariel Sharon visits the Temple Mount, protected by a several-hundred-strong Israeli police force. Palestinian riots erupt, leading to a full-fledged armed uprising (called the Al-Aqsa Intifada by sympathizers and the Oslo War by opponents)."], ["2000-09-29T00:00:00", "The Long Kesh prison in Northern Ireland is closed."], ["2000-10-01T00:00:00", "The 2000 Summer Olympics close in Sydney, Australia."], ["2000-10-05T00:00:00", "President Slobodan Milošević leaves office after widespread demonstrations throughout Serbia."], ["2000-10-06T00:00:00", "The last Mini is produced in Longbridge."], ["2000-10-11T00:00:00", "Jim Wallace becomes Acting First Minister of Scotland."], ["2000-10-11T00:00:00", "250 million US gallons (950,000 m3) of coal sludge spill in Martin County, Kentucky (considered a greater environmental disaster than the Exxon Valdez oil spill)."], ["2000-10-12T00:00:00", "In Aden, Yemen, USS Cole is badly damaged by two Al-Qaeda suicide bombers, who place a small boat laden with explosives alongside the United States Navy destroyer, killing 17 crew members and wounding at least 39."], ["2000-10-21T00:00:00", "Fifteen Arab leaders convene in Cairo, Egypt, for their first summit in 4 years; the Libyan delegation walks out, angry over signs the summit will stop short of calling for breaking ties with Israel."], ["2000-10-22T00:00:00", "The Mainichi Shimbun newspaper exposes Japanese archeologist Shinichi Fujimura as a fraud; Japanese archaeologists had based their treatises on his findings."], ["2000-10-23T00:00:00", "Madeleine Albright holds talks with North Korean dictator Kim Jong-il."], ["2000-10-26T00:00:00", "Pakistani authorities announce that their police have found an apparently ancient mummy of a Persian Princess in the province of Balochistan. Iran, Pakistan and the Taliban all claim the mummy until Pakistan announces it is a modern-day fake on April 17, 2001."], ["2000-10-27T00:00:00", "Pacific Islands Forum (PIF)."], ["2000-10-27T00:00:00", "Henry McLeish becomes First Minister of Scotland."], ["2000-10-30T00:00:00", "This is the final date during which there is no human presence in space; on October 31, Soyuz TM-31 launches, carrying the first resident crew to the International Space Station. The ISS has been continuously crewed since."], ["2000-10-31T00:00:00", "Singapore Airlines Flight 006 collides with construction equipment in the Chiang Kai Shek International Airport, resulting in 83 deaths."], ["2000-11-01T00:00:00", "Serbia is admitted to the United Nations as the 190th member."], ["2000-11-02T00:00:00", "The first resident crew enters the International Space Station."], ["2000-11-03T00:00:00", "Widespread flooding occurs throughout England and Wales after days of heavy rain."], ["2000-11-07T00:00:00", "In London, a criminal gang raids the Millennium Dome to steal the Millennium Star diamond, but police surveillance catches them in the act."], ["2000-11-07T00:00:00", "Hillary Rodham Clinton is elected to the United States Senate, becoming the first First Lady of the United States to win public office."], ["2000-11-07T00:00:00", "United States presidential election, 2000: Republican Governor of Texas George W. Bush defeats Democratic Vice President Al Gore in the U.S. presidential election but there is a miscount in Florida resulting in a recount of the votes."], ["2000-11-11T00:00:00", "Kaprun disaster, Austria: A funicular fire in an Alpine tunnel kills 155 skiers and snowboarders."], ["2000-11-15T00:00:00", "A new Indian state called Jharkhand is formed, carving out the South Chhota Nagpur area from Bihar in India."], ["2000-11-16T00:00:00", "Bill Clinton becomes the first sitting U.S. President to visit Vietnam since the end of the Vietnam War in 1975."], ["2000-11-17T00:00:00", "A catastrophic landslide in Log pod Mangartom, Slovenia, kills 7, and causes millions of SIT of damage. It is one of the worst catastrophes in Slovenia in the past 100 years."], ["2000-11-17T00:00:00", "Alberto Fujimori is removed from office as president of Peru."], ["2000-11-27T00:00:00", "Jean Chrétien is re-elected as Prime Minister of Canada, as the Liberal Party of Canada increases its majority in the House of Commons of Canada."], ["2000-11-28T00:00:00", "Ukrainian politician Oleksandr Moroz touches off the Cassette Scandal by publicly accusing President Leonid Kuchma of involvement in the murder of journalist Georgiy Gongadze. The accusation creates the Orange Revolution in 2004."], ["2000-12-01T00:00:00", "Vicente Fox takes office as President of Mexico."], ["2000-12-07T00:00:00", "Kadisoka temple discovered in Sleman, Yogyakarta, Indonesia."], ["2000-12-12T00:00:00", "Bush v. Gore: The U.S. Supreme Court stops the Florida presidential recount, effectively giving the state, and the Presidency, to George W. Bush."], ["2000-12-15T00:00:00", "Disney's Paradise Pier Hotel opens at the Disneyland Resort."], ["2000-12-15T00:00:00", "The third and final reactor at the Chernobyl Nuclear Power Plant is shut down and the station is shut down completely."], ["2000-12-24T00:00:00", "Christmas Eve 2000 Indonesia bombings: 18 people are killed in multiple Islamist bomb attacks on churches across Indonesia."], ["2000-12-25T00:00:00", "A shopping center fire at Luoyang, Henan, China, kills 309."], ["2000-12-30T00:00:00", "Rizal Day bombings: A series of bombs explode in various places in Metro Manila, Philippines, within a span of a few hours, killing 22 and injuring about 100."], ["2000-12-31T00:00:00", "The Millennium Dome closes its doors one year to the day of its opening."]]