[["1918-01-18T00:00:00", "Russian Constituent Assembly meets."], ["1918-01-18T00:00:00", "The Historic Concert for the Benefit of Widows and Orphans of Austrian and Hungarian Soldiers at the Konzerthaus, Vienna."], ["1918-02-24T00:00:00", "Estonia declares its independence from Russia after seven centuries of foreign rule. German forces capture Tallinn on the next day."], ["1918-02-24T00:00:00", "Armenia, Azerbaijan, and Georgia declare their independence from Russia as the Transcaucasian Democratic Federative Republic."], ["1918-03-06T00:00:00", "The Finnish Army Corps of Aviation is founded, forerunner of the Finnish Air Force to be established on 4 May 1928. The blue swastika is adopted as its symbol as a tribute to the Swedish explorer and aviator Eric von Rosen, who donated the first plane. Von Rosen had painted the Viking symbol on the plane as his personal lucky insignia."], ["1918-03-06T00:00:00", "The first pilotless drone, the Hewitt-Sperry Automatic Airplane developed by Elmer Sperry and Peter Cooper Hewitt, is test-flown in Long Island, New York, but development is scrapped in 1925 after its guidance system proves unreliable."], ["1918-03-23T00:00:00", "WWI: The giant German cannon, the 'Paris Gun' (Kaiser Wilhelm Geschütz), begins to shell Paris from 114 km (71 mi) away."], ["1918-03-23T00:00:00", "In London at the Wood Green Empire, Chung Ling Soo (William E. Robinson, U.S.-born magician) dies during his trick where he is supposed to \"catch\" two separate bullets – but one of them perforates his lung. He dies the following morning in a hospital."], ["1918-03-25T00:00:00", "The Belarusian People's Republic declares independence."], ["1918-03-25T00:00:00", "Dr. Karl Muck, music director of the Boston Symphony Orchestra, is arrested under the Alien Enemies Act and imprisoned for the duration of WWI."], ["1918-03-25T00:00:00", "French composer Claude Debussy dies of colorectal cancer in Paris."], ["1918-05-15T00:00:00", "End of the Finnish Civil War."], ["1918-05-15T00:00:00", "The United States Post Office Department begins the world's third regular airmail service, between New York City, Philadelphia and Washington, D.C.."], ["1918-06-12T00:00:00", "Grand Duke Michael of Russia is murdered, thereby becoming the first of the Romanovs to be murdered by the Bolsheviks."], ["1918-06-12T00:00:00", "WWI: First airplane bombing raid by an American unit in France."], ["1918-07-18T00:00:00", "Shooting of the Romanov family: By order of the Bolshevik Party and carried out by the Cheka, former emperor Nicholas II, his wife Alexandra Feodorovna, their children, Olga, Tatiana, Maria, Anastasia, and Alexei, and retainers are executed at the Ipatiev House in Ekaterinburg, Russia."], ["1918-07-18T00:00:00", "WWI: RMS Carpathia is torpedoed and sunk off the east coast of Ireland by Imperial German Navy submarine U-55; 218 of the 223 on board are rescued."], ["1918-08-30T00:00:00", "20,000 London policemen strike for increased pay and union recognition."], ["1918-08-30T00:00:00", "Russian Revolution: Vladimir Lenin is shot by Fanny Kaplan, but survives. Moisei Uritsky, the Petrograd head of the Cheka, is assassinated the same day."], ["1918-10-03T00:00:00", "Kaiser Wilhelm II of Germany appoints Max von Baden Chancellor of Germany."], ["1918-10-03T00:00:00", "King Ferdinand I of Bulgaria abdicates in the wake of the Bulgarian military collapse in WWI. He is succeeded by his son, Boris III."], ["1918-10-03T00:00:00", "WWI: Pursuit to Haritan by Desert Mounted Corps begins."], ["1918-10-04T00:00:00", "Wilhelm II of Germany forms a new more liberal government to sue for peace."], ["1918-10-04T00:00:00", "The T. A. Gillespie Company Shell Loading Plant explosion in New Jersey kills 100+ and destroys enough ammunition to supply the Western Front for 6 months."], ["1918-10-25T00:00:00", "WWI: Aleppo captured by Prince Feisal's Sheifial Forces."], ["1918-10-25T00:00:00", "The steamer Princess Sophia sinks on Vanderbilt Reef near Juneau, Alaska; 353 people die in the greatest maritime disaster in the Pacific Northwest."], ["1918-10-28T00:00:00", "Czechoslovakia declares its independence from Austria-Hungary."], ["1918-10-28T00:00:00", "A new Polish government is declared in Western Galicia (Eastern Europe)."], ["1918-10-30T00:00:00", "The Martin Declaration is published, including Slovakia in the formation of the Czecho-Slovak state."], ["1918-10-30T00:00:00", "The Armistice of Mudros ends conflicts between the Ottoman Empire and the Allies of World War I."], ["1918-10-30T00:00:00", "The Mutawakkilite Kingdom of Yemen is granted independence from the Ottoman Empire by the Armistice of Mudros."], ["1918-11-01T00:00:00", "Polish–Ukrainian War inaugurated by proclamation of the West Ukrainian People's Republic in Galicia with a capital at Lwów."], ["1918-11-01T00:00:00", "Malbone Street Wreck: The worst rapid transit accident in world history occurs under the intersection of Malbone Street and Flatbush Avenue, in Brooklyn, New York City, with at least 93 dead."], ["1918-11-03T00:00:00", "WWI: Austria-Hungary enters an armistice with the Allies in Padua."], ["1918-11-03T00:00:00", "Poland declares its independence from Russia."], ["1918-11-03T00:00:00", "German Revolution: Sailors in the German fleet at Kiel mutiny and throughout northern Germany soldiers and workers begin to establish revolutionary councils on the Russian soviet model."], ["1918-11-09T00:00:00", "Kaiser Wilhelm II of Germany abdicates and chooses to live in exile in the Netherlands."], ["1918-11-09T00:00:00", "Proclamation of German Republic by Philipp Scheidemann in Berlin on the Reichstag balcony."], ["1918-11-09T00:00:00", "Provisional National Council Minister-President Kurt Eisner declares Bavaria to be a republic."], ["1918-11-09T00:00:00", "British battleship HMS Britannia is sunk by a German submarine off Trafalgar with the loss of around fifty lives, the last major naval engagement of WWI."], ["1918-11-11T00:00:00", "End of WWI and Armistice with Germany (Compiègne): Germany signs an armistice agreement with the Allies between 5:12 AM and 5:20 AM in Marshal Foch's railroad car in Compiègne Forest in France. It becomes official on the 11th hour of the 11th day of the 11th month."], ["1918-11-11T00:00:00", "Poland regains independence after 123 years of partitions. Józef Piłsudski is appointed Commander-in-Chief."], ["1918-11-11T00:00:00", "Emperor Charles I of Austria gives up his absolute power but does not abdicate."], ["1918-11-13T00:00:00", "Allied Occupation of Constantinople."], ["1918-11-13T00:00:00", "Frederick II, Grand Duke of Baden, relinquishes all governing duties."], ["1918-11-14T00:00:00", "The provisional government of Baden proclaims the Freie Volksrepublik Baden (\"Free Peoples' Republic of Baden\")."], ["1918-11-14T00:00:00", "Czechoslovakia becomes a republic."], ["1918-11-14T00:00:00", "Józef Piłsudski is appointed head of state of Poland."], ["1918-11-22T00:00:00", "The Spartacist League founds the German Communist Party."], ["1918-11-22T00:00:00", "The Belgian royal family returns to Brussels after the war, King Albert I having commanded the Allied Army group in the autumn Courtrai offensive which liberated his country."], ["1918-11-22T00:00:00", "Frederick II, Grand Duke of Baden, abdicates; the Grand Duchy of Baden gives way to the Republic of Baden."], ["1918-12-01T00:00:00", "Iceland regains independence, but remains in personal union with the King of Denmark, who also becomes the King of Iceland until 1944."], ["1918-12-01T00:00:00", "New voting laws in Sweden makes votes no longer dependent on taxable assets, each adult having one vote."], ["1918-12-01T00:00:00", "The Union of Alba Iulia is proclaimed: Following the March 27 incorporation of Bessarabia and Bucovina, Transylvania unites with the Kingdom of Romania."], ["1918-12-01T00:00:00", "The Kingdom of Serbs, Croats and Slovenes (which later becomes the Kingdom of Yugoslavia) is proclaimed."], ["1918-01-15T00:00:00", "João Figueiredo, former President of Brazil (d. 1999)"], ["1918-01-15T00:00:00", "Gamal Abdel Nasser, 2nd President of Egypt (d. 1970)"], ["1918-01-16T00:00:00", "Nel Benschop, Dutch poet (d. 2005)"], ["1918-01-16T00:00:00", "Allan Ekelund, Swedish film producer (d. 2009)"], ["1918-01-16T00:00:00", "Stirling Silliphant, American writer and producer (d. 1996)"], ["1918-01-19T00:00:00", "Peter Hobbs, American actor (d. 2011)"], ["1918-01-19T00:00:00", "John H. Johnson, American publisher (d. 2005)"], ["1918-01-20T00:00:00", "Juan García Esquivel, Mexican bandleader (d. 2002)"], ["1918-01-20T00:00:00", "Nevin S. Scrimshaw, American clinical (d. 2013)"], ["1918-01-21T00:00:00", "Chichay, Filipino actress (d. 1993)"], ["1918-01-21T00:00:00", "Richard D. Winters, U.S. Army officer (d. 2011)"], ["1918-01-26T00:00:00", "Nicolae Ceaușescu, Romanian dictator (d. 1989)"], ["1918-01-26T00:00:00", "Philip José Farmer, American writer (d. 2009)"], ["1918-01-26T00:00:00", "Vito Scotti, American character actor (d. 1996)"], ["1918-01-27T00:00:00", "Skitch Henderson, English-born musician and bandleader (d. 2005)"], ["1918-01-27T00:00:00", "Elmore James, American musician (d. 1963)"], ["1918-01-29T00:00:00", "Luis Aguilar, Mexican actor and singer (d. 1997)"], ["1918-01-29T00:00:00", "John Forsythe, American actor (Dynasty) (d. 2010)"], ["1918-02-03T00:00:00", "Joey Bishop, American entertainer, member of the Rat Pack (d. 2007)"], ["1918-02-03T00:00:00", "Helen Stephens, American runner (d. 1994)"], ["1918-02-22T00:00:00", "Charlie Finley, American owner of the Oakland A's 1960–80 (d. 1996)"], ["1918-02-22T00:00:00", "Don Pardo, American TV announcer (Saturday Night Live) (d. 2014)"], ["1918-02-22T00:00:00", "Robert Pershing Wadlow, American tallest man record-holder (d. 1940)"], ["1918-02-25T00:00:00", "Barney Ewell, American athlete (d. 1996)"], ["1918-02-25T00:00:00", "Bobby Riggs, American tennis player (d. 1995)"], ["1918-02-26T00:00:00", "Otis R. Bowen, American politician (d. 2013)"], ["1918-02-26T00:00:00", "Theodore Sturgeon, American writer (d. 1985)"], ["1918-03-01T00:00:00", "Roger Delgado, British actor (d. 1973)"], ["1918-03-01T00:00:00", "João Goulart, President of Brazil (d. 1976)"], ["1918-03-03T00:00:00", "Arthur Kornberg, American biochemist, recipient of the Nobel Prize in Physiology or Medicine (d. 2007)"], ["1918-03-03T00:00:00", "Fritz Thiedemann, German equestrian (d. 2000)"], ["1918-03-05T00:00:00", "Shlomo Lorincz, member of Israeli Knesset for Agudat Yisrael (d. 2009)"], ["1918-03-05T00:00:00", "James Tobin, American economist, Nobel Prize laureate (d. 2002)"], ["1918-03-09T00:00:00", "George Lincoln Rockwell, American Nazi leader (d. 1967)"], ["1918-03-09T00:00:00", "Mickey Spillane, American writer (d. 2006)"], ["1918-03-29T00:00:00", "Pearl Bailey, African-American singer and actress (d. 1990)"], ["1918-03-29T00:00:00", "Shirley Jameson, American female baseball player (d. 1993)"], ["1918-03-29T00:00:00", "Sam Walton, founder of Wal-Mart (d. 1992)"], ["1918-04-18T00:00:00", "Gabriel Axel, Danish film director (d. 2014)"], ["1918-04-18T00:00:00", "Shinobu Hashimoto, Japanese screenwriter"], ["1918-04-18T00:00:00", "Clifton Hillegass, American author, founder of CliffsNotes (d. 2001)"], ["1918-04-20T00:00:00", "Edward L. Beach, Jr., American naval officer and author (d. 2002)"], ["1918-04-20T00:00:00", "Kai Siegbahn, Swedish physicist, Nobel Prize laureate (d. 2007)"], ["1918-04-22T00:00:00", "Mickey Vernon, American baseball player (d. 2008)"], ["1918-04-22T00:00:00", "William Jay Smith, American poet"], ["1918-05-09T00:00:00", "Orville Freeman, American politician (d. 2003)"], ["1918-05-09T00:00:00", "Mike Wallace, American journalist (d. 2012)"], ["1918-05-09T00:00:00", "Russell M. Carneal, American politician and judge (d. 1998)"], ["1918-05-10T00:00:00", "T. Berry Brazelton, American pediatrician"], ["1918-05-10T00:00:00", "George Welch, American aviator (d. 1954)"], ["1918-05-15T00:00:00", "Eddy Arnold, American country music singer (d. 2008)"], ["1918-05-15T00:00:00", "Joseph Wiseman, Canadian actor (d. 2009)"], ["1918-05-17T00:00:00", "A. C. Lyles, American film producer (d. 2013)"], ["1918-05-17T00:00:00", "Birgit Nilsson, Swedish soprano (d. 2005)"], ["1918-06-18T00:00:00", "Jerome Karle, American chemist, Nobel Prize laureate (d. 2013)"], ["1918-06-18T00:00:00", "Franco Modigliani, Italian-born economist, Nobel Prize laureate (d. 2003)"], ["1918-07-04T00:00:00", "Ann Landers, American advice columnist (d. 2002)"], ["1918-07-04T00:00:00", "Pauline Phillips, American advice columnist, popularly known as Abigail Van Buren (d. 2013)"], ["1918-07-04T00:00:00", "Tāufaʻāhau Tupou IV, King of Tonga (d. 2006)"], ["1918-07-16T00:00:00", "Bayani Casimiro, Filipino dancer and actor (d. 1989)"], ["1918-07-16T00:00:00", "John Everitt Frost DFC & Bar, World War II SAAF fighter pilot (MIA 16 June 1942)"], ["1918-07-31T00:00:00", "Paul D. Boyer, American chemist, Nobel Prize laureate"], ["1918-07-31T00:00:00", "Hank Jones, American pianist (d. 2010)"], ["1918-09-04T00:00:00", "Paul Harvey, American radio broadcaster (d. 2009)"], ["1918-09-04T00:00:00", "Gerald Wilson, American jazz trumpeter (d. 2014)"], ["1918-09-28T00:00:00", "Ángel Labruna, Argentine soccer player and manager (d. 1983)"], ["1918-09-28T00:00:00", "Arnold Stang, American comic actor (d. 2009)"], ["1918-10-18T00:00:00", "Konstantinos Mitsotakis, former Greek Prime Minister"], ["1918-10-18T00:00:00", "Bobby Troup, American singer-songwriter and actor (Emergency!) (d. 1999)"], ["1918-10-27T00:00:00", "Mihkel Mathiesen, Estonian statesman (d. 2003)"], ["1918-10-27T00:00:00", "Teresa Wright, American actress (d. 2005)"], ["1918-11-03T00:00:00", "Bob Feller, American baseball player (d. 2010)"], ["1918-11-03T00:00:00", "Elizabeth P. Hoisington, American Brigadier General (d. 2007)"], ["1918-11-03T00:00:00", "Russell B. Long, U.S. Senator from Louisiana (d. 2003)"], ["1918-11-03T00:00:00", "Dean Riesner, American film and television screenwriter (d. 2002)"], ["1918-11-04T00:00:00", "Art Carney, American actor (The Honeymooners) (d. 2003)"], ["1918-11-04T00:00:00", "Cameron Mitchell, American actor (The High Chaparral) (d. 1994)"], ["1918-11-07T00:00:00", "Paul Aussaresses, French general (d. 2013)"], ["1918-11-07T00:00:00", "Billy Graham, American evangelist, spiritual adviser to several U.S. Presidents"], ["1918-12-21T00:00:00", "Donald Regan, American Treasury Secretary and White House Chief of Staff (d. 2003)"], ["1918-12-21T00:00:00", "Kurt Waldheim, President of Austria and Secretary-General of the United Nations (d. 2007)"], ["1918-12-23T00:00:00", "José Greco, Italian-born flamenco dancer (d. 2001)"], ["1918-12-25T00:00:00", "Bertie Mee, English football player and manager (d. 2001)"], ["1918-12-25T00:00:00", "Anwar Sadat, President of Egypt, recipient of the Nobel Peace Prize (d. 1981)"], ["1918-01-08T00:00:00", "Johannes Pääsuke, Estonian photographer and filmmaker (b. 1892)"], ["1918-01-08T00:00:00", "Ellis H. Roberts, American politician (b. 1827)"], ["1918-01-09T00:00:00", "Max Ritter von Müller, German World War I fighter ace (killed in action) (b. 1887)"], ["1918-01-09T00:00:00", "Émile Reynaud, French inventor (b. 1844)"], ["1918-02-10T00:00:00", "Abdul Hamid II, former Sultan of the Ottoman Empire (b. 1842)"], ["1918-02-10T00:00:00", "Ernesto Teodoro Moneta, Italian pacifist, Nobel Prize laureate (b. 1833)"], ["1918-03-25T00:00:00", "Claude Debussy, French composer (b. 1862)"], ["1918-03-25T00:00:00", "Walter Tull, First Black infantry officer to serve in the British Army (b. 1888)"], ["1918-03-27T00:00:00", "Henry Adams, American historian (b. 1838)"], ["1918-03-27T00:00:00", "Martin Sheridan, Irish athlete (b. 1881)"], ["1918-04-01T00:00:00", "Paul von Rennenkampf, Russian general (executed) (b. 1854)"], ["1918-04-01T00:00:00", "Isaac Rosenberg, British war poet (killed in action) (b. 1890)"], ["1918-04-20T00:00:00", "Karl Ferdinand Braun, German phyicist, Nobel Prize laureate (b. 1850)"], ["1918-04-20T00:00:00", "Paul Gautsch von Frankenthurn, Austrian statesman, former Prime Minister (b. 1851)"], ["1918-07-22T00:00:00", "Indra Lal Roy, Indian fighter pilot (b. 1898)"], ["1918-07-22T00:00:00", "Manuel González Prada, Peruvian politician and author (b. 1844)"], ["1918-07-30T00:00:00", "Joyce Kilmer, American journalist and poet (killed in action) (b. 1886)"], ["1918-07-30T00:00:00", "Frank Linke-Crawford, Austro-Hungarian fighter pilot (killed in action) (b. 1893)"], ["1918-08-01T00:00:00", "John Riley Banister, American policeman and cowboy (b. 1854)"], ["1918-08-01T00:00:00", "Gabriel Guérin, French World War I fighter ace (air crash) (b. 1892)"], ["1918-08-10T00:00:00", "Jean Brillant, Canadian soldier (b. 1890)"], ["1918-08-10T00:00:00", "Erich Löwenhardt, German World War I fighter ace (b. 1897)"], ["1918-08-10T00:00:00", "Aleksander Uurits, Estonian painter and graphic artist (b. 1888)"], ["1918-09-28T00:00:00", "True Boardman, American actor (b. 1882)"], ["1918-09-28T00:00:00", "Georg Simmel, German sociologist and philosopher (b. 1858)"], ["1918-09-28T00:00:00", "Freddie Stowers, American soldier (b. 1896)"], ["1918-10-05T00:00:00", "Roland Garros, French fighter pilot (killed in action) (b. 1888)"], ["1918-10-05T00:00:00", "Robbie Ross, British writer (b. 1869)"], ["1918-11-04T00:00:00", "Wilfred Owen, British poet and soldier (killed in action) (b. 1893)"], ["1918-11-04T00:00:00", "Andrew Dickson White, American academic, diplomat, and co-founder of Cornell University (b. 1832)"], ["1918-11-09T00:00:00", "Guillaume Apollinaire, French poet (b. 1880)"], ["1918-11-09T00:00:00", "Albert Ballin, German-Jewish shipping magnate (b. 1857)"], ["1918-11-09T00:00:00", "Peter Lumsden, British general in Indian army (b. 1829)"]]