[["1996-01-19T00:00:00", "The North Cape oil spill occurs as an engine fire forces the tugboat Scandia ashore on Moonstone Beach in South Kingstown, Rhode Island. The North Cape Barge is pulled along with it and leaks 820,000 gallons of home heating oil."], ["1996-01-19T00:00:00", "An Indonesian ferry sinks off the northern tip of Sumatra, drowning more than 100 people."], ["1996-01-29T00:00:00", "President Jacques Chirac announces a \"definitive end\" to French nuclear testing."], ["1996-01-29T00:00:00", "Fire destroys La Fenice, Venice's opera house."], ["1996-01-31T00:00:00", "Colombo Central Bank bombing: an explosives-filled truck rams into the gates of the Central Bank in Colombo, Sri Lanka, killing at least 86 and injuring 1,400."], ["1996-01-31T00:00:00", "An explosion in Shaoyang, China kills 122 and injures over 400 when 10 tons of dynamite in an illegal explosives warehouse underneath an apartment building detonate."], ["1996-02-10T00:00:00", "Chess computer \"Deep Blue\" defeats world chess champion Garry Kasparov for the first time."], ["1996-02-10T00:00:00", "Bosnian Serbs break off contact with the Bosnian government and with representatives of Ifor, the NATO localised force, in reaction to the arrest of several Bosnian Serb war criminals."], ["1996-02-15T00:00:00", "In southwest Wales, the oil tanker Sea Empress runs aground, spilling 73,000 tonnes of crude oil, killing many birds."], ["1996-02-15T00:00:00", "The U.S. Embassy in Athens, Greece, comes under mortar fire."], ["1996-02-15T00:00:00", "A Long March 3 rocket at the Xichang Satellite Launch Center in China crashes into a rural village after liftoff, killing as many as 50."], ["1996-02-15T00:00:00", "Begum Khaleda Zia is reelected as prime minister of Bangladesh. The country's second democratic election is marred by low voter turnout, due to several boycotts and pre-election violence, which result in at least 13 deaths."], ["1996-02-15T00:00:00", "The UK government publishes the Scott Report."], ["1996-02-17T00:00:00", "In Philadelphia, Garry Kasparov beats \"Deep Blue\" in a second chess match."], ["1996-02-17T00:00:00", "In Irian Jaya, an earthquake of magnitude 7.5 and associated tidal waves kills 102 people and causes widespread devastation."], ["1996-02-29T00:00:00", "In Lumberton, North Carolina, Daniel Green is convicted of the murder of James Jordan, the father of basketball star Michael Jordan."], ["1996-02-29T00:00:00", "Faucett Flight 251 en route from Lima to Rodriguez Ballon airport crashes into a mountain near Arequipa; all 123 people on board are killed."], ["1996-02-29T00:00:00", "At least 81 people drown when a boat capsizes 120 kilometres east of Kampala, Uganda."], ["1996-02-29T00:00:00", "The Bosnian government declares the end of the Siege of Sarajevo."], ["1996-03-02T00:00:00", "Ranabima Royal College is established in Sri Lanka."], ["1996-03-02T00:00:00", "The Australian federal election, 1996 is held; Labor's Paul Keating loses to Liberal leader John Howard."], ["1996-03-06T00:00:00", "Mesut Yılmaz, of ANAP forms the new government of Turkey (53rd government)."], ["1996-03-06T00:00:00", "A boat carrying market traders capsizes outside Freetown harbour, in Sierra Leone, killing at least 86."], ["1996-03-06T00:00:00", "Chechen rebels attack the Russian government headquarters in Grozny; 70 Russian soldiers and policemen and 130 Chechen fighters are killed."], ["1996-03-22T00:00:00", "Sweden`s Finance Minister Göran Persson becomes his homeland`s new Prime Minister."], ["1996-03-24T00:00:00", "Islamists clash with security forces in Kashmir, killing 11."], ["1996-03-24T00:00:00", "The devastating Marcopper mining disaster on the island of Marinduque, Philippines takes place."], ["1996-03-25T00:00:00", "An 81-day-long standoff begins between antigovernment Freemen and federal officers in Jordan, Montana."], ["1996-03-25T00:00:00", "The 68th Academy Awards, hosted by Whoopi Goldberg, are held at the Dorothy Chandler Pavilion in Los Angeles with Braveheart winning Best Picture."], ["1996-03-28T00:00:00", "Fire breaks out at the Pasar Anyar shopping centre in Bogor, West Java. The first death toll estimate is 78 until rescuers notice that 68 of them are mannequins."], ["1996-03-28T00:00:00", "Three British soldiers are found guilty of the manslaughter of Danish tour guide Louise Jensen in Cyprus. Allan Ford, Justin Fowler and Geoffrey Pernell receive life sentences for the September, 1994 rape/murder."], ["1996-04-03T00:00:00", "A Boeing 737 military jet crashes into a mountain north of Dubrovnik, Croatia. All 35 people on board die, including United States Secretary of Commerce Ron Brown (see 1996 Croatia USAF CT-43 crash)."], ["1996-04-03T00:00:00", "Suspected \"Unabomber\" Theodore Kaczynski is arrested at his Montana cabin."], ["1996-04-03T00:00:00", "Massacres of Hutus by Tutsis in Burundi take place, with more than 450 killed in a few days."], ["1996-04-06T00:00:00", "Fighting breaks out in Monrovia, Liberia, between various rebel factions struggling for power in the country's interrupted civil war. Several foreign nationals leave the nation."], ["1996-04-06T00:00:00", "Major League Soccer kicks off in front of an overflow crowd of 31,683 packed in Spartan Stadium, to witness the historic first game. San Jose Clash forward Eric Wynalda scores the league's first goal in a 1–0 victory over D.C. United."], ["1996-04-06T00:00:00", "Turkish authorities begin Operation Hawk, an army offensive against rebels from the Kurdish Worker's Party in southeastern Turkey."], ["1996-04-11T00:00:00", "The Israeli government launches Operation Grapes of Wrath, consisting of massive attacks on Lebanon, in retaliation for prior terrorist attacks, and sparking off a violent series of retaliations."], ["1996-04-11T00:00:00", "At Düsseldorf International Airport, smouldering polystyrene evolves into a major fire, killing 17 people inside the terminal building."], ["1996-04-18T00:00:00", "Qana Massacre: Over 100 Lebanese civilians are killed after Israel shells the United Nations compound in Qana."], ["1996-04-18T00:00:00", "In reaction to the Qana Massacre, an Islamist group in Egypt open fire on a hotel, killing 18 Greek tourists and injuring 17 others."], ["1996-04-28T00:00:00", "Port Arthur massacre: Martin Bryant kills 35 people at the Port Arthur, Tasmania tourist site, Australia."], ["1996-04-28T00:00:00", "A bomb explodes in Bhaiperu, Pakistan, killing more than 60 people."], ["1996-05-09T00:00:00", "South Africa's National Party pulls out of the 2-year-old coalition government, and the African National Congress assumes full political control."], ["1996-05-09T00:00:00", "Ugandan president Yoweri Museveni wins a landslide victory in the country's first direct presidential elections, securing 75% of the vote."], ["1996-05-10T00:00:00", "1996 Everest disaster: A sudden storm engulfs Mount Everest with several climbing teams high on the mountain, leaving 8 dead. By the end of the month, at least 4 other climbers die in the worst season of fatalities on the mountain to date."], ["1996-05-10T00:00:00", "The Australian government introduces a nationwide ban on the private possession of both automatic and semi-automatic rifles, in response to the Port Arthur massacre."], ["1996-05-10T00:00:00", "Vietnamese Vietnamese boat people in Hong Kong, facing forced repatriation due to their classification as economic migrants rather than refugees, stage a protest at the Whitehead Detention Centre."], ["1996-05-21T00:00:00", "The MV Bukoba sinks in Tanzanian waters in Lake Victoria, killing nearly 1,000 in one of Africa's worst maritime disasters."], ["1996-05-21T00:00:00", "The Trappist Martyrs of Atlas are executed."], ["1996-05-23T00:00:00", "Swede Göran Kropp reaches the Mount Everest summit alone without oxygen, after having bicycled there from Sweden."], ["1996-05-23T00:00:00", "Members of the Armed Islamic Group in Algeria kill 7 French Trappist monks, after talks with French government concerning the imprisonment of several GIA sympathisers break down."], ["1996-05-30T00:00:00", "The Likud Party, led by Benjamin Netanyahu, wins a narrow victory in the Israeli general election."], ["1996-05-30T00:00:00", "The Hoover Institution releases an optimistic report that global warming will probably reduce mortality in the United States and provide Americans with valuable benefits."], ["1996-06-08T00:00:00", "The 10th European Football Championship (UEFA Euro 96) begins in England."], ["1996-06-08T00:00:00", "Steffi Graf defeats Arantxa Sánchez Vicario in the longest ever women's final at the French Open, to win her 19th Grand Slam title."], ["1996-06-11T00:00:00", "An explosion in a São Paulo suburban shopping centre kills 44 and injures more than 100."], ["1996-06-11T00:00:00", "A peace convoy carrying Chechen separatist leaders and international diplomats is targeted by a series of remotely controlled land mines; 8 are killed."], ["1996-06-23T00:00:00", "The Nintendo 64 video game system is released in Japan."], ["1996-06-23T00:00:00", "Archbishop Desmond Tutu is given an official farewell at his retirement service."], ["1996-06-28T00:00:00", "A new government is formed in Turkey, with Necmettin Erbakan of Refah Partisi becoming prime minister of the coalition government, and deputy and foreign minister Tansu Çiller of the True Path Party succeeding him after 2 years."], ["1996-06-28T00:00:00", "The Constitution of Ukraine is signed into law."], ["1996-06-29T00:00:00", "The Prince's Trust concert is held in Hyde Park, London, and is attended by 150,000 people. The Who headlines the event in their first performance since 1989."], ["1996-06-29T00:00:00", "An explosion in a firecrackers factory in Sichuan Province, China kills at least 36 people and injures another 52."], ["1996-06-30T00:00:00", "Costas Simitis is elected President of the Panhellenic Socialist Movement of Greece."], ["1996-06-30T00:00:00", "Bosnian Serb leader Radovan Karadžić reliquishes power to his deputy, Biljana Plavšić."], ["1996-06-30T00:00:00", "Germany defeats the Czech Republic 2-1 after extra time in the final of the European Championships."], ["1996-07-17T00:00:00", "The Community of Portuguese Language Countries (Comunidade dos Países de Língua Portuguesa) is constituted."], ["1996-07-17T00:00:00", "Paris and Rome-bound TWA Flight 800 (Boeing 747) explodes off the coast of Long Island, New York, killing all 230 on board."], ["1996-07-17T00:00:00", "Joe Klein admits that he is \"Anonymous\", the author of Primary Colors."], ["1996-07-19T00:00:00", "An F3 tornado 5.5 miles (8.9 km) away from the Westminster, Maryland city center injures 3 people and causes $5 million in damages."], ["1996-07-19T00:00:00", "The 1996 Summer Olympics in Atlanta, United States, begin."], ["1996-07-19T00:00:00", "Bosnian Serb President Radovan Karadžić resigns from public office in Republika Srpska after being indicted for war crimes."], ["1996-08-01T00:00:00", "Sarah Balabagan returns to the Philippines."], ["1996-08-01T00:00:00", "A pro-democracy demonstration supporting Megawati Sukarnoputri in Indonesia is broken up by riot police."], ["1996-08-06T00:00:00", "NASA announces that the Allan Hills 84001 meteorite, thought to originate from Mars, may contain evidence of primitive lifeforms."], ["1996-08-06T00:00:00", "The Australian census is conducted."], ["1996-08-06T00:00:00", "The American punk rock band the Ramones play their last show."], ["1996-08-16T00:00:00", "Brookfield Zoo, Chicago. After a 3-year-old boy falls into the 20-foot (6.1 m) deep gorilla enclosure, Binti Jua, a female silverback gorilla sits with the injured boy until his rescue. Video of the ape's actions make her world famous."], ["1996-08-16T00:00:00", "After having spent 378 days in a Taliban prison, the crew of Russian Il-76TD manage to overpower their guards, board their aircraft and fly to freedom (see: 1995 Airstan incident)."], ["1996-08-21T00:00:00", "Former president of South Africa, F. W. de Klerk, makes an official apology for crimes committed under Apartheid to the Truth and Reconciliation Commission in Cape Town."], ["1996-08-21T00:00:00", "In Britain Queen Elizabeth II issues letters patent on divorced former wives of British princes, taking away from the ex-wives the attribute and style of Royal Highness. With that Sarah, Duchess of York as well as Diana, Princess of Wales legally cease to be Royals, but they remain as non-royal Duchess and Princess. Still they are allowed to keep these titles for their children are in line to the throne."], ["1996-08-26T00:00:00", "Chun Doo-hwan is sentenced to death, after being found guilty of mutiny and treason."], ["1996-08-26T00:00:00", "Bill Clinton signs welfare reform into law."], ["1996-08-26T00:00:00", "Iraqi expatriates seeking refuge hijack a Sudanese airliner en route from Khartoum to Amman."], ["1996-08-29T00:00:00", "U.S. President Bill Clinton and Vice President Al Gore are renominated at the Democratic National Convention in Chicago."], ["1996-08-29T00:00:00", "A Russian Tupolev 154 jetliner crashes into a mountain as it approaches the airport at Spitsbergen, Norway, killing all 141 people on board."], ["1996-08-31T00:00:00", "Iraq disarmament crisis: Iraqi forces launch an offensive into the northern No-Fly Zone and capture Arbil."], ["1996-08-31T00:00:00", "The Big 12 Conference is inaugurated with a football game between Kansas State University and Texas Tech University in Manhattan, Kansas."], ["1996-09-12T00:00:00", "Ricardo López (stalker) sends a package, containing an acid bomb, to Icelandic singer Björk with the intention to kill or disfigure her, and then commits suicide. The package is intercepted by the Scotland Yard four days later, before doing any harm."], ["1996-10-02T00:00:00", "The Electronic Freedom of Information Act Amendments are signed by U.S. President Bill Clinton."], ["1996-10-02T00:00:00", "The former prime minister of Bulgaria, Andrey Lukanov, is assassinated."], ["1996-10-02T00:00:00", "An Aeroperú Boeing 757 crashes into the Pacific Ocean when the instruments fail just after takeoff from Lima Airport, killing all 70 on board."], ["1996-11-07T00:00:00", "A devastating category 4 cyclone strikes Andhra Pradesh, India. The storm surge sweeps fishing villages out to sea, over 2,000 people die. 95 percent of the crops are completely destroyed."], ["1996-11-07T00:00:00", "NASA launches the Mars Global Surveyor."], ["1996-11-17T00:00:00", "A bomb explosion in Kaspiysk, Russia, kills 32 people."], ["1996-11-17T00:00:00", "Emil Constantinescu is elected president of Romania."], ["1996-11-18T00:00:00", "World-renowned bird expert Tony Silva is sentenced to 7 years in prison without parole, for leading an illegal parrot smuggling ring."], ["1996-11-18T00:00:00", "Frederick Chiluba is reelected president of Zambia."], ["1996-11-19T00:00:00", "Martin Bryant is sentenced to 35 consecutive sentences of life imprisonment plus 1035 years without parole for murdering 35 people in a shooting spree in Tasmania earlier this year."], ["1996-11-19T00:00:00", "Preparatory Commission for the Comprehensive Nuclear Test Ban Organization (CTBTO) established."], ["1996-11-19T00:00:00", "STS-80: Space Shuttle Columbia conducts the longest mission of the Space Shuttle program."], ["1996-11-21T00:00:00", "A propane explosion at the Humberto Vidal shoe store and office building in San Juan, Puerto Rico kills 33."], ["1996-11-21T00:00:00", "Demonstrators in Zagreb demand the survival of Radio 101."], ["1996-11-23T00:00:00", "The Republic of Angola officially joins the World Trade Organization, as Angola."], ["1996-11-23T00:00:00", "Ethiopian Airlines Flight 961 is hijacked, then crashes into the Indian Ocean off the coast of Comoros after running out of fuel, killing 125."], ["1996-11-25T00:00:00", "An ice storm strikes the U.S., killing 26 directly, hundreds more from accidents. A powerful windstorm blasts Florida; winds gust to 90 mph."], ["1996-11-25T00:00:00", "The U.S. stock market, especially the Dow Jones Industrial Average, gains at an incredibly fast pace following the 1996 Presidential election. It gains 10 days in a row during the month."], ["1996-11-25T00:00:00", "The APEC Summit opens in the Philippines."], ["1996-12-02T00:00:00", "U.S. President Bill Clinton signs the Electronic Freedom of Information Act Amendments."], ["1996-12-02T00:00:00", "Widespread student pro-democracy protests are broken up in Burma."], ["1996-12-30T00:00:00", "In the Indian state of Assam, a passenger train is bombed by Bodo separatists, killing 26."], ["1996-12-30T00:00:00", "Proposed budget cuts by Benjamin Netanyahu spark protests from 250,000 workers, who shut down services across Israel."], ["1996-12-31T00:00:00", "Bill Watterson's comic Calvin and Hobbes releases its final strip, marking the end of a decade-long run with a total of 3,150 strips in total."], ["1996-12-31T00:00:00", "The Atchison, Topeka and Santa Fe Railway is merged with the Burlington Northern Railroad to form the BNSF Railway, making it one of the largest railroad mergers in U.S. history."], ["1996-12-31T00:00:00", "The Hacienda in Las Vegas is imploded to make way for the Mandalay Bay."], ["1996-02-07T00:00:00", "Mai Hagiwara, Japanese singer"], ["1996-02-07T00:00:00", "Aaron Ekblad, Canadian ice hockey player"], ["1996-07-22T00:00:00", "Jane Oineza, Filipina actress"], ["1996-07-23T00:00:00", "Danielle Bradbery, American singer"], ["1996-07-23T00:00:00", "Rachel G. Fox, American actor"], ["1996-01-01T00:00:00", "Malladihalli Sri Raghavendra Swamiji, founder of Anatha Sevashrama Trust, Malladihalli (b. 1890)"], ["1996-01-01T00:00:00", "Moshe Aryeh Freund, Chief Rabbi (av beis din) of the Edah HaChareidis in Jerusalem (b. 1894)"], ["1996-01-01T00:00:00", "Arleigh Burke, U.S Navy Admiral and Chief of Naval Operations (b. 1901)"], ["1996-01-05T00:00:00", "Yahya Ayyash, Palestinian terrorist (b. 1966)"], ["1996-01-05T00:00:00", "Lincoln Kirstein, American writer and impresario (b. 1907)"], ["1996-01-05T00:00:00", "Richard Versalle, American operatic tenor (b. 1932)"], ["1996-01-09T00:00:00", "Fearless Nadia, Indian actress and stuntwoman (b. 1908)"], ["1996-01-09T00:00:00", "Sultan Rahi, Pakistani film actor (b. 1938)"], ["1996-01-11T00:00:00", "Harold Walter Bailey, English scholar of Khotanese, Sanskrit, and the comparative study of Iranian languages (b. 1899)"], ["1996-01-11T00:00:00", "Eric Hebborn, art forger (b. 1934)"], ["1996-01-15T00:00:00", "Les Baxter, American musician and composer (b. 1922)"], ["1996-01-15T00:00:00", "Paramount Chief Moshoeshoe II of Lesotho (b. 1938)"], ["1996-01-18T00:00:00", "Leonor Fini, Argentine artist (b. 1908)"], ["1996-01-18T00:00:00", "Endel Puusepp, Soviet Estonian World War II pilot (b. 1909)"], ["1996-01-18T00:00:00", "Nandamuri Taraka Rama Rao, Indian (Telugu) film actor (b. 1923)"], ["1996-01-18T00:00:00", "Rudolf Wanderone, American pocket billiards player also known as Minnesota Fats (b. 1913)"], ["1996-01-19T00:00:00", "A. G. Gaston, American businessman (b. 1892)"], ["1996-01-19T00:00:00", "Don Simpson, American film producer (b. 1943)"], ["1996-01-28T00:00:00", "Joseph Brodsky, Russian-born poet, Nobel Prize laureate (b. 1940)"], ["1996-01-28T00:00:00", "Jerry Siegel, American cartoonist (b. 1914)"], ["1996-02-02T00:00:00", "Fred S. Keller, pioneer in experimental psychology (b. 1899)"], ["1996-02-02T00:00:00", "Gene Kelly, American actor and dancer (b. 1912)"], ["1996-02-09T00:00:00", "Adolf Galland, German general and World War II fighter ace (b. 1912)"], ["1996-02-09T00:00:00", "Albert Jean Amateau, Turkish rabbi, businessman, lawyer and social activist (b. 1889)"], ["1996-02-11T00:00:00", "Kebby Musokotwane, Prime Minister of Zambia (b. 1946)"], ["1996-02-11T00:00:00", "Cyril Poole, English cricketer (b. 1921)"], ["1996-02-11T00:00:00", "Phil Regan, American actor (b. 1906)"], ["1996-02-11T00:00:00", "Amelia Rosselli, Italian poet (b. 1930)"], ["1996-02-12T00:00:00", "Bob Shaw, Irish science fiction writer (b. 1931)"], ["1996-02-12T00:00:00", "Ryōtarō Shiba, Japanese novelist (b. 1923)"], ["1996-02-14T00:00:00", "Eva Hart, British survivor of RMS Titanic (b. 1905)"], ["1996-02-14T00:00:00", "Bob Paisley, English football manager (b. 1919)"], ["1996-02-15T00:00:00", "Tommy Rettig, American actor (b. 1941)"], ["1996-02-15T00:00:00", "McLean Stevenson, American actor (b. 1929)"], ["1996-02-16T00:00:00", "Roger Bowen, American actor (b. 1932)"], ["1996-02-16T00:00:00", "Pat Brown, Governor of California (b. 1905)"], ["1996-02-16T00:00:00", "Brownie McGhee, American musician (b. 1915)"], ["1996-02-20T00:00:00", "Audrey Munson, American artist's model and film actress (b. 1891)"], ["1996-02-20T00:00:00", "Tōru Takemitsu, Japanese composer (b. 1930)"], ["1996-02-27T00:00:00", "Sarah Palfrey Cooke, American tennis player (b. 1912)"], ["1996-02-27T00:00:00", "Pat Smythe, British showjumper and author (b. 1928)"], ["1996-03-17T00:00:00", "René Clément, French film director (b. 1913)"], ["1996-03-17T00:00:00", "Elsa Respighi, Italian composer (b. 1894)"], ["1996-03-26T00:00:00", "Edmund Muskie, American politician (b. 1914)"], ["1996-03-26T00:00:00", "David Packard, American engineer (b. 1912)"], ["1996-04-03T00:00:00", "Herk Harvey, American film director (b. 1924)"], ["1996-04-03T00:00:00", "Carl Stokes, American politician (b. 1927)"], ["1996-04-06T00:00:00", "John D. Bulkeley, U.S. Navy Vice Admiral, and Medal of Honor recipient (b. 1911)"], ["1996-04-06T00:00:00", "Greer Garson, British-born American actress (b. 1904)"], ["1996-04-08T00:00:00", "Lorna Fitzgerald, English actress"], ["1996-04-08T00:00:00", "George W. Jenkins, American businessman and founder of Publix (b. 1907)"], ["1996-04-08T00:00:00", "Rush Limbaugh, Sr., American ambassador, lawyer, legislator, jurist and grandfather of Rush Limbaugh (b. 1891)"], ["1996-04-26T00:00:00", "Milt Gaston, American baseball player (b. 1896)"], ["1996-04-26T00:00:00", "Stirling Silliphant, American screenwriter and producer (b. 1918)"], ["1996-05-11T00:00:00", "Nnamdi Azikiwe, President of Nigeria (b. 1904)"], ["1996-05-11T00:00:00", "Rob Hall, New Zealand mountaineer (b. 1961)"], ["1996-05-21T00:00:00", "Paul Delph, American musician and producer (b. 1957)"], ["1996-05-21T00:00:00", "Lash LaRue, American actor (b. 1917)"], ["1996-05-24T00:00:00", "Jacob Druckman, American composer (b. 1928)"], ["1996-05-24T00:00:00", "Joseph Mitchell, American writer (b. 1908)"], ["1996-05-24T00:00:00", "Enrique Álvarez Félix, Mexican actor (b. 1934)"], ["1996-06-02T00:00:00", "John Alton, American cinematographer (b. 1901)"], ["1996-06-02T00:00:00", "Ray Combs, American game show host, and comedian (b. 1956)"], ["1996-06-02T00:00:00", "Leon Garfield, English children's author (b. 1921)"], ["1996-06-02T00:00:00", "Pilar Lorengar, Spanish soprano (b. 1928)"], ["1996-06-06T00:00:00", "Kusuo Kitamura, Japanese Olympic swimmer (b. 1917)"], ["1996-06-06T00:00:00", "George Davis Snell, American geneticist, recipient of the Nobel Prize in Physiology or Medicine (b. 1903)"], ["1996-06-06T00:00:00", "Merle Curti, leading American historian (b. 1897)"], ["1996-06-10T00:00:00", "Marie-Louise von Motesiczky, Austrian painter (b. 1906)"], ["1996-06-10T00:00:00", "Jo Van Fleet, American actress (b. 1914)"], ["1996-06-11T00:00:00", "Chesley Bonestell, American painter (b. 1888)"], ["1996-06-11T00:00:00", "Brigitte Helm, German actress (b. 1908)"], ["1996-06-19T00:00:00", "G. David Schine, American businessman (b. 1927)"], ["1996-06-19T00:00:00", "Edvin Wide, Swedish middle-distance and long-distance runner (b. 1896)"], ["1996-06-19T00:00:00", "Hillevi Rombin, Miss Universe 1955 (b. 1933)"], ["1996-07-01T00:00:00", "William T. Cahill, America politician (b. 1912)"], ["1996-07-01T00:00:00", "Margaux Hemingway, American fashion model and actress (b. 1954)"], ["1996-07-12T00:00:00", "John Chancellor, American journalist (b. 1927)"], ["1996-07-12T00:00:00", "Jonathan Melvoin, American musician (b. 1961)"], ["1996-07-20T00:00:00", "Stuart Clarence Graham, Australian army general (b. 1920)"], ["1996-07-20T00:00:00", "František Plánička, Czech footballer (b. 1904)"], ["1996-07-30T00:00:00", "Claudette Colbert, American actress (b. 1903)"], ["1996-07-30T00:00:00", "Arihiro Hase, Japanese actor and voice actor (b. 1965)"], ["1996-08-11T00:00:00", "Rafael Kubelík, Czech-born conductor (b. 1914)"], ["1996-08-11T00:00:00", "Vanga, Bulgarian prophet, mystic, clairvoyant and herbalist (b. 1911)"], ["1996-09-01T00:00:00", "Vagn Holmboe, Danish composer (b. 1909)"], ["1996-09-01T00:00:00", "Karl Kehrle, Benedictine monk, beekeeper (b. 1898)"], ["1996-09-07T00:00:00", "Bibi Besch, Austrian-American actress (b. 1940)"], ["1996-09-07T00:00:00", "Arda Bowser, professional football player (b. 1899)"], ["1996-09-10T00:00:00", "Joanne Dru, American actress (b. 1922)"], ["1996-09-10T00:00:00", "Hans List, Austrian inventor and automotive pioneer (b. 1896)"], ["1996-09-10T00:00:00", "Juanita Wright, WWE wrestling figure (b. 1934)"], ["1996-09-14T00:00:00", "Helen Cohan, American stage dancer and film actress, daughter of George M. Cohan (b. 1910)"], ["1996-09-14T00:00:00", "Juliet Prowse, American dancer and actress (b. 1936)"], ["1996-09-20T00:00:00", "Paul Erdős, Hungarian mathematician (b. 1911)"], ["1996-09-20T00:00:00", "Max Manus, Norwegian resistance fighter during World War II (b. 1914)"], ["1996-09-21T00:00:00", "Pierre Costantini, French soldier, journalist, writer and Bonapartist militant (b. 1889)"], ["1996-09-21T00:00:00", "Henri Nouwen, Dutch Catholic priest and author (b. 1932)"], ["1996-09-21T00:00:00", "Sabine Zlatin, Polish-born French Resistance member (b. 1918)"], ["1996-09-23T00:00:00", "Fujiko F. Fujio, Japanese cartoonist (b. 1933)"], ["1996-09-23T00:00:00", "Gottfried Freiherr von Banfield, Austro-Hungarian naval aeroplane pilot in the First World War (b. 1890)"], ["1996-09-28T00:00:00", "Mohammad Najibullah, former President of Afghanistan (b. 1947)"], ["1996-09-28T00:00:00", "Geoffrey Wilkinson, English chemist, Nobel Prize laureate (b. 1926)"], ["1996-10-24T00:00:00", "Artur Axmann, Nazi German Hitler Youth leader (b. 1913)"], ["1996-10-24T00:00:00", "George P. Oslin, reporter, executive at Western Union (b. 1899)"], ["1996-11-03T00:00:00", "Abdullah Çatlı, Turkish nationalist (b. 1956)"], ["1996-11-03T00:00:00", "Jean-Bédel Bokassa of Central African Republic/Empire (b. 1921)"], ["1996-11-10T00:00:00", "Imam Alimsultanov, Chechen bard (b. 1957)"], ["1996-11-10T00:00:00", "Yafeu Fula (aka Yaki Kadafi), rapper from Tupac Shakur's group Outlawz (b. 1977)"], ["1996-11-21T00:00:00", "Abdus Salam, Pakistani physicist, Nobel Prize laureate (b. 1926)"], ["1996-11-21T00:00:00", "Gail Stanton, Playboy centerfold June 1978 (b. 1954)"], ["1996-11-22T00:00:00", "María Casares, French-Spanish actress (b. 1922)"], ["1996-11-22T00:00:00", "Mark Lenard, American actor (b. 1924)"], ["1996-12-09T00:00:00", "Mary Leakey, British archaeologist (b. 1913)"], ["1996-12-09T00:00:00", "Diana Morgan, British playwright and screenwriter (b. 1908)"], ["1996-12-09T00:00:00", "James Basil Wilkie Roberton, New Zealand soldier, doctor, historian and writer (b. 1896)"], ["1996-12-13T00:00:00", "Edward Blishen, English author (b. 1920)"], ["1996-12-13T00:00:00", "Clarence Wijewardena, Sri Lankan musician (b. 1943)"], ["1996-12-30T00:00:00", "Lew Ayres, American actor (b. 1908)"], ["1996-12-30T00:00:00", "Jack Nance, American actor (b. 1943)"]]