[["1975-01-01T00:00:00", "Stevie Nicks and Lindsey Buckingham join Fleetwood Mac."], ["1975-01-01T00:00:00", "Watergate scandal (United States): John N. Mitchell, H. R. Haldeman and John Ehrlichman are found guilty of the Watergate cover-up."], ["1975-01-01T00:00:00", "Malawi changes its capital city from Zomba to Lilongwe."], ["1975-01-02T00:00:00", "The Federal Rules of Evidence are approved by the United States Congress."], ["1975-01-02T00:00:00", "Bangladesh revolutionary leader Siraj Sikder is killed by police while in custody."], ["1975-01-05T00:00:00", "Tasman Bridge disaster: The Tasman Bridge in Hobart, Tasmania, Australia, is struck by the bulk ore carrier MV Lake Illawarra, killing 12 people."], ["1975-01-06T00:00:00", "United States television debuts: - Game show Wheel of Fortune premieres on NBC."], ["1975-01-06T00:00:00", "United States television debuts: - AM America makes its television debut on ABC."], ["1975-01-07T00:00:00", "OPEC agrees to raise crude oil prices by 10%."], ["1975-01-08T00:00:00", "Ella Grasso becomes Governor of Connecticut, the first female U.S. governor who does not succeed her husband."], ["1975-01-08T00:00:00", "U.S. President Gerald Ford appoints Vice President Nelson Rockefeller to head a special commission looking into alleged domestic abuses by the CIA."], ["1975-01-14T00:00:00", "Heiress Lesley Whittle, 17, is kidnapped from her home in Shropshire, England by Donald Neilson."], ["1975-01-15T00:00:00", "Alvor Agreement: Portugal announces that it will grant independence to Angola on November 11."], ["1975-01-15T00:00:00", "International Women's Year is launched in Britain by Princess Alexandra and Barbara Castle."], ["1975-01-15T00:00:00", "Steel roller coaster Space Mountain (Magic Kingdom) opens at Walt Disney World in Florida, becoming one of the park's most popular attractions into the 21st century."], ["1975-01-18T00:00:00", "The United States Atomic Energy Commission is divided between the Energy Research and Development Administration and the Nuclear Regulatory Commission, partly in response to the 1973 oil crisis."], ["1975-01-19T00:00:00", "1975 Kinnaur earthquake: An earthquake strikes Himachal Pradesh, India."], ["1975-01-20T00:00:00", "In Hanoi, North Vietnam, the Politburo approves the final military offensive against South Vietnam."], ["1975-01-20T00:00:00", "American talent agent Michael Ovitz founds the Creative Artists Agency."], ["1975-01-20T00:00:00", "Work is abandoned on the British end of the Channel Tunnel."], ["1975-01-24T00:00:00", "Jazz pianist Keith Jarrett plays the solo improvisation 'The Köln Concert' at the Cologne Opera, which, recorded live, becomes the best-selling piano recording in history."], ["1975-01-26T00:00:00", "Immaculata University defeats the University of Maryland 80-48 in the first nationally televised women's basketball game in the United States."], ["1975-01-29T00:00:00", "The Weather Underground radical student group bombs the United States Department of State main office in Washington, D.C."], ["1975-02-01T00:00:00", "The Intercontinental Broadcasting Corporation is launched in the Philippines."], ["1975-02-04T00:00:00", "The Haicheng earthquake, the first successfully predicted earthquake, kills 2,041 and injures 27,538 in Haicheng, Liaoning, China."], ["1975-02-06T00:00:00", "A crucial by-election is held in Kankesanthurai, Sri Lanka."], ["1975-02-09T00:00:00", "The Soyuz 17 crew (Georgy Grechko, Aleksei Gubarev) returns to Earth after 1 month aboard the Salyut 4 space station."], ["1975-02-11T00:00:00", "Margaret Thatcher defeats Edward Heath for the leadership of the opposition UK Conservative Party. Thatcher, 49, is Britain's first female leader of any political party."], ["1975-02-11T00:00:00", "Colonel Richard Ratsimandrava, President of Madagascar, is assassinated."], ["1975-02-13T00:00:00", "A \"Turkish Federated State of North Cyprus\" is declared as an unsuccessful first step to international recognition of a Turkish Cypriot separatist state in Cyprus."], ["1975-02-13T00:00:00", "A fire breaks out in the World Trade Center."], ["1975-02-21T00:00:00", "Watergate scandal: Former United States Attorney General John N. Mitchell, and former White House aides H. R. Haldeman and John Ehrlichman, are sentenced to between 30 months and 8 years in prison."], ["1975-02-23T00:00:00", "In response to the energy crisis, daylight saving time commences nearly 2 months early in the United States."], ["1975-02-26T00:00:00", "A fleeing Provisional Irish Republican Army member shoots and kills off-duty London police officer Stephen Tibble, 22, as he gives chase."], ["1975-02-27T00:00:00", "The 2 June Movement kidnaps West German politician Peter Lorenz. He is released on March 4 after most of the kidnappers' demands are met."], ["1975-02-28T00:00:00", "A major tube train crash at Moorgate station, London kills 43 people."], ["1975-02-28T00:00:00", "In Lomé, Togo, the European Economic Community and 46 African, Caribbean and Pacific countries sign a financial and economic treaty, known as the first Lomé Convention."], ["1975-03-01T00:00:00", "Aston Villa win the Football League Cup at Wembley, beating Norwich City 1-0 in the final."], ["1975-03-01T00:00:00", "Australian television switches to colour."], ["1975-03-04T00:00:00", "Charlie Chaplin is knighted by Elizabeth II."], ["1975-03-04T00:00:00", "A Canadian parliamentary committee is televised for the first time."], ["1975-03-06T00:00:00", "Algiers Accord: Iran and Iraq announce a settlement in their border dispute."], ["1975-03-06T00:00:00", "A bomb explodes in the Paris offices of the Springer Press. The 6 March Group (connected to the Red Army Faction) demands amnesty for the Baader-Meinhof Group."], ["1975-03-07T00:00:00", "The body of teenage heiress Lesley Whittle, kidnapped 7 weeks earlier by the \"Black Panther\", is discovered in Staffordshire, England."], ["1975-03-08T00:00:00", "The United Nations proclaims International Women's Day."], ["1975-03-09T00:00:00", "Construction of the Trans-Alaska Pipeline System begins."], ["1975-03-10T00:00:00", "Vietnam War: North Vietnamese troops attack Ban Mê Thuột, South Vietnam, on their way to capturing Saigon."], ["1975-03-10T00:00:00", "The Rocky Horror Show opens on Broadway in New York City; closed after 3 previews and 45 performances."], ["1975-03-10T00:00:00", "An extended portion of Sanyō Shinkansen between Okayama Station and Hakata Station opens, thus making Shinkansen reach the second island, Kyushu, Japan."], ["1975-03-11T00:00:00", "The leftist military government in Portugal defeats a rightist coup attempt."], ["1975-03-13T00:00:00", "Vietnam War: South Vietnam President Nguyễn Văn Thiệu orders the Central Highlands evacuated. This turns into a mass exodus involving troops and civilians (the Convoy of Tears)."], ["1975-03-15T00:00:00", "In Brazil, Guanabara State merges into the state of Rio de Janeiro. The state's capital moves from the city of Niterói to the city of Rio de Janeiro."], ["1975-03-22T00:00:00", "Ding-a-dong by Teach-In (music by Dick Bakker, text by Will Luikinga and Eddy Ouwens) wins the 20th Eurovision Song Contest 1975 for the Netherlands."], ["1975-03-25T00:00:00", "King Faisal of Saudi Arabia is shot and killed by his nephew; the killer is beheaded on June 18. (King Khalid succeeds Faisal.)"], ["1975-03-28T00:00:00", "A fire in the maternity wing at Kucic Hospital in Rijeka, former Yugoslavia, kills 25 people."], ["1975-03-31T00:00:00", "Süleyman Demirel of AP forms the new government of Turkey (39th government, a four-party coalition, so-called First National Front (Turkish: Milliyetçi cephe))."], ["1975-03-31T00:00:00", "In his final game on the sideline, John Wooden coaches UCLA to its 10th national championship in 12 seasons when the Bruins defeat Kentucky 92-85 in the title game at San Diego."], ["1975-04-03T00:00:00", "Bobby Fischer refuses to play in a chess match against Anatoly Karpov, giving Karpov the title."], ["1975-04-04T00:00:00", "Vietnam War: The first military Operation Babylift flight, C5A 80218, crashes 27 minutes after takeoff, killing 138 on board; 176 survive the crash."], ["1975-04-04T00:00:00", "Bill Gates and Paul Allen found Microsoft in Albuquerque, New Mexico."], ["1975-04-05T00:00:00", "The Soviet manned space mission Soyuz 18a ends in failure during its ascent into orbit when a critical malfunction occurs in the second and third stages of the booster rocket during staging, resulting in the cosmonauts and their Soyuz spacecraft having to be ripped free from the vehicle. Both cosmonauts survive."], ["1975-04-09T00:00:00", "Asia's first professional basketball league, the Philippine Basketball Association, plays its first game at the Araneta Coliseum."], ["1975-04-09T00:00:00", "Eight people in South Korea, who are involved in the People's Revolutionary Party Incident, are hanged."], ["1975-04-13T00:00:00", "Bus massacre: The Kataeb militia kills 27 Palestinians during an attack on their bus in Ain El Remmeneh, Lebanon, triggering the Lebanese Civil War which lasts until 1990."], ["1975-04-13T00:00:00", "A coup d'état in Chad led by the military overthrows and kills President François Tombalbaye."], ["1975-04-17T00:00:00", "The Khmer Republic surrenders, when the Communist Khmer Rouge guerilla forces capture Phnom Penh ending the Cambodian Civil War, with mass evacuation of American troops and Cambodian civilians."], ["1975-04-18T00:00:00", "The Khmer Rouge beings prompting a forcible mass evacuation of the city and starting the genocide."], ["1975-04-24T00:00:00", "Six Red Army Faction terrorists take over the West German embassy in Stockholm, take 11 hostages and demand the release of the group's jailed members; shortly after, they are captured by Swedish police (See West German Embassy siege)."], ["1975-04-25T00:00:00", "Vietnam War: As North Vietnamese Army forces close in on the South Vietnamese capital Saigon, the Australian Embassy is closed and evacuated, almost 10 years to the day since the first Australian troop commitment to South Vietnam."], ["1975-04-30T00:00:00", "The Vietnam War ends with the Fall of Saigon: The Vietnam War concludes as Communist forces from North Vietnam take Saigon, resulting in mass evacuation of the remaining American troops and South Vietnam civilians. As the capital is taken, South Vietnam surrenders unconditionally."], ["1975-05-01T00:00:00", "The Cold War between Cambodia and Vietnam begins, which eventually leads to the Cambodian-Vietnamese War."], ["1975-05-03T00:00:00", "West Ham United win the FA Cup at Wembley, beating Fulham 2-0 in the final. Both goals are scored by Alan Taylor. West Ham legend Bobby Moore, appears for Fulham."], ["1975-05-05T00:00:00", "The Busch Gardens Williamsburg theme park opens in Virginia."], ["1975-05-12T00:00:00", "Mayaguez incident: Khmer Rouge forces in Cambodia seize the United States merchant ship Mayaguez in international waters."], ["1975-05-15T00:00:00", "Mayaguez incident: The American merchant ship Mayaguez, seized by Cambodian forces, is rescued by the U.S. Navy and Marines; 38 Americans are killed."], ["1975-05-16T00:00:00", "Sikkim accedes to India after a referendum and abolishes the Chogyal, its monarchy."], ["1975-05-16T00:00:00", "Junko Tabei becomes the first woman to reach the summit of Mount Everest."], ["1975-05-27T00:00:00", "The Dibbles Bridge coach crash near Grassington, North Yorkshire, England results in 32 deaths (the highest ever toll in a United Kingdom road accident)."], ["1975-05-28T00:00:00", "Fifteen West African countries sign the Treaty of Lagos, creating the Economic Community of West African States."], ["1975-06-05T00:00:00", "The Suez Canal opens for the first time since the Six-Day War."], ["1975-06-05T00:00:00", "The United Kingdom votes yes in a referendum to stay in the European Community."], ["1975-06-06T00:00:00", "The Georgetown Agreement, formally creating the ACP Group, is signed."], ["1975-06-09T00:00:00", "The Order of Australia is awarded for the first time."], ["1975-06-10T00:00:00", "In Washington, D.C., the Rockefeller Commission issues its report on CIA abuses, recommending a joint congressional oversight committee on intelligence."], ["1975-06-19T00:00:00", "Richard Bingham, 7th Earl of Lucan is found guilty in absentia of the murder of nanny Sandra Rivett."], ["1975-06-23T00:00:00", "Markus Zusak, writer of the Book Thief and Messenger is born."], ["1975-06-25T00:00:00", "Prime Minister Indira Gandhi declares a state of emergency in India, suspending civil liberties and elections."], ["1975-06-25T00:00:00", "Mozambique gains independence from Portugal."], ["1975-06-26T00:00:00", "Two FBI agents and 1 AIM member die in a shootout, at the Pine Ridge Indian Reservation in South Dakota."], ["1975-07-01T00:00:00", "The Postmaster-General's Department is disaggregated into the Australian Telecommunications Commission (trading as Telecom Australia) and the Australian Postal Commission (trading as Australia Post)."], ["1975-07-04T00:00:00", "Sydney newspaper publisher Juanita Nielsen disappears, and is presumed to have been murdered."], ["1975-07-05T00:00:00", "Cape Verde gains independence after 500 years of Portuguese rule."], ["1975-07-06T00:00:00", "The Comoros declares and is granted their independence from France."], ["1975-07-06T00:00:00", "Ruffian, an American champion thoroughbred racehorse breaks down in a match race against Kentucky Derby winner, Foolish Pleasure; she has to be euthanized the following day."], ["1975-07-09T00:00:00", "The National Assembly of Senegal passes a law that will pave way for a multi-party system (albeit highly restricted)."], ["1975-07-12T00:00:00", "São Tomé and Príncipe declare independence from Portugal."], ["1975-07-17T00:00:00", "Apollo-Soyuz Test Project: A manned American Apollo spacecraft and the manned Soviet Soyuz spacecraft for the Soyuz 19 mission, docks in orbit, marking the first such link-up between spacecraft from the 2 nations."], ["1975-07-30T00:00:00", "In Detroit, former Teamsters Union president Jimmy Hoffa is reported missing."], ["1975-08-01T00:00:00", "The Helsinki Accords, which officially recognize Europe's national borders and respect for human rights, are signed in Finland."], ["1975-08-03T00:00:00", "The Louisiana Superdome opens in New Orleans."], ["1975-08-05T00:00:00", "U.S. President Ford posthumously restores the U.S. citizenship of General Robert E. Lee, military leader of the Confederate States of America during the American Civil War."], ["1975-08-08T00:00:00", "The Banqiao Dam, in China's Henan Province, fails after a freak typhoon; over 200,000 people perish."], ["1975-08-08T00:00:00", "Samuel Bronfman II, son of the president of Seagram's, is kidnapped in Purchase, New York."], ["1975-08-11T00:00:00", "British Leyland Motor Corporation comes under British government control."], ["1975-08-11T00:00:00", "Governor Mário Lemos Pires of Portuguese East Timor abandons the capital Dili, following a UDT coup and the outbreak of civil war between UDT and Fretilin."], ["1975-08-15T00:00:00", "The Birmingham Six are wrongfully sentenced to life imprisonment in Great Britain (they are released 1991)."], ["1975-08-15T00:00:00", "Founder President Sheikh Mujibur Rahman of Bangladesh is killed during a coup led by Major Syed Faruque Rahman."], ["1975-08-20T00:00:00", "Viking program: NASA launches the Viking 1 planetary probe toward Mars."], ["1975-08-24T00:00:00", "Officers responsible for the military coup in Greece in 1967 are sentenced to death in Athens. The sentences are later commuted to life imprisonment."], ["1975-09-05T00:00:00", "In Sacramento, California, Lynette Fromme, a follower of jailed cult leader Charles Manson, attempts to assassinate U.S. President Gerald Ford, but is thwarted by a Secret Service agent."], ["1975-09-05T00:00:00", "The London Hilton Hotel is bombed by the Provisional Irish Republican Army; 2 people are killed and 63 injured."], ["1975-09-06T00:00:00", "A Richter scale 6.7 magnitude earthquake kills at least 2,085 in Diyarbakır and Lice, Turkey."], ["1975-09-09T00:00:00", "Riverfront Coliseum opens in Cincinnati."], ["1975-09-14T00:00:00", "Elizabeth Seton is canonized, becoming the first American Roman Catholic saint."], ["1975-09-14T00:00:00", "Rembrandt's painting \"The Night Watch\" is slashed a dozen times at the Rijksmuseum in Amsterdam."], ["1975-09-15T00:00:00", "The French department of \"Corse\", comprising the entire island of Corsica, is divided into two departments: Haute-Corse (Upper Corsica) and Corse-du-Sud (Southern Corsica)."], ["1975-09-16T00:00:00", "Papua New Guinea gains its independence from Australia."], ["1975-09-18T00:00:00", "Fugitive Patty Hearst is captured in San Francisco."], ["1975-09-19T00:00:00", "General Vasco Gonçalves is ousted as Prime Minister of Portugal."], ["1975-09-19T00:00:00", "The British comedy sitcom Fawlty Towers airs on BBC 2."], ["1975-09-20T00:00:00", "The term of Tuanku Al-Mutassimu Billahi Muhibbudin Sultan Abdul Halim Al-Muadzam Shah ibni Almarhum Sultan Badlishah, as the 5th Yang di-Pertuan Agong of Malaysia, ends."], ["1975-09-21T00:00:00", "Sultan Yahya Petra ibni Almarhum Sultan Ibrahim Petra of Kelantan, becomes the 6th Yang di-Pertuan Agong of Malaysia."], ["1975-09-22T00:00:00", "U.S. President Gerald Ford survives a second assassination attempt, this time by Sara Jane Moore in San Francisco."], ["1975-09-24T00:00:00", "Dougal Haston and Doug Scott on the 1975 British Mount Everest Southwest Face expedition become the first people to reach the summit of Mount Everest by any of its faces and the first Britons to reach the summit by any route."], ["1975-09-27T00:00:00", "Francoist Spain executes 5 ETA and FRAP members, the last executions in Spain to date."], ["1975-09-27T00:00:00", "The Norwood Football Club beats the Glenelg Football Club in the South Australian National Football League (SANFL) Australian rules football Grand Final."], ["1975-09-28T00:00:00", "The Spaghetti House siege takes place in London."], ["1975-09-30T00:00:00", "The Hughes Helicopters (later McDonnell-Douglas, now Boeing IDS) AH-64 Apache makes its first flight."], ["1975-10-01T00:00:00", "Thrilla in Manila: Muhammad Ali defeats Joe Frazier in a boxing match in Manila, Philippines."], ["1975-10-02T00:00:00", "A blast at an explosives factory kills 6 in Beloeil, Quebec."], ["1975-10-09T00:00:00", "A bomb explosion outside the Green Park tube station near Piccadilly in London kills 1 and injures 20."], ["1975-10-11T00:00:00", "NBC airs the first episode of Saturday Night Live (George Carlin is the first host; Billy Preston and Janis Ian the first musical guests)."], ["1975-10-16T00:00:00", "Five Australian-based journalists are killed at Balibo by Indonesian forces, during their incursion into Portuguese Timor."], ["1975-10-16T00:00:00", "The last naturally occurring case of smallpox was diagnosed and treated, the victim being two-year-old Rahima Banu."], ["1975-10-21T00:00:00", "1975 World Series: The Cincinnati Reds are defeated by the Boston Red Sox in Game Six off Carlton Fisk's 12th-inning home run to cap off what many consider to be the best World Series game ever played."], ["1975-10-22T00:00:00", "The Reds defeat the Red Sox 4 games to 3 in a broadcast that breaks records for a televised sporting event."], ["1975-10-27T00:00:00", "Robert Poulin kills 1 and wounds 5 at St. Pius X High School in Ottawa, Canada before shooting himself."], ["1975-10-30T00:00:00", "Peter Sutcliffe (the \"Yorkshire Ripper\") commits his first murder, that of Wilma McCann."], ["1975-10-30T00:00:00", "Juan Carlos I of Spain becomes acting head of state after dictator Francisco Franco concedes that he is too ill to govern."], ["1975-11-03T00:00:00", "An independent audit of Mattel, one of the United States' largest toy manufacturers, reveals that company officials fabricated press releases and financial information to \"maintain the appearance of continued corporate growth.\""], ["1975-11-03T00:00:00", "The first petroleum pipeline opens from Cruden Bay to Grangemouth, Scotland."], ["1975-11-03T00:00:00", "The long-running television game show The Price Is Right expands from 30 minutes to its current hour-long format on CBS."], ["1975-11-06T00:00:00", "The Green March begins: 300,000 unarmed Moroccans converge on the southern city of Tarfaya and wait for a signal from King Hassan II of Morocco to cross into Western Sahara."], ["1975-11-06T00:00:00", "The Sex Pistols play their first gig at Saint Martins College, London."], ["1975-11-07T00:00:00", "A vapor cloud explosion at a petroleum cracking facility in Geleen, Netherlands leaves 14 dead and 109 injured, with fires lasting for 5 days."], ["1975-11-10T00:00:00", "United Nations General Assembly Resolution 3379: By a vote of 72-35 (with 32 abstentions), the United Nations General Assembly approves a resolution equating Zionism with racism. The resolution provokes an outcry among Jews around the world. It is repealed in 1991."], ["1975-11-10T00:00:00", "The 729-foot (222 m)-long freighter SS Edmund Fitzgerald sinks during a storm 17 miles (27 km) from the entrance to Whitefish Bay on Lake Superior, killing all 29 crew members on board (an event immortalized in song by Gordon Lightfoot)."], ["1975-11-10T00:00:00", "Lev Leshchenko revives \"Den Pobedy\", one of the most popular World War II songs in the USSR."], ["1975-11-11T00:00:00", "Angola becomes independent from Portugal; civil war soon erupts."], ["1975-11-11T00:00:00", "Australian constitutional crisis of 1975: Governor-General of Australia Sir John Kerr dismisses the government of Gough Whitlam and commissions Malcolm Fraser as Prime Minister."], ["1975-11-11T00:00:00", "The first annual Vogalonga rowing \"race\" is held in Venice, Italy."], ["1975-11-14T00:00:00", "Spain abandons Western Sahara."], ["1975-11-15T00:00:00", "The \"Group of 6\" (G-6) industrialized nations is formed."], ["1975-11-16T00:00:00", "Beginning of the Third Cod War between UK and Iceland, which lasts until June 1976."], ["1975-11-20T00:00:00", "Former California Governor Ronald Reagan enters the race for the Republican presidential nomination, challenging incumbent President Gerald Ford."], ["1975-11-20T00:00:00", "Spanish dictator Francisco Franco dies in Madrid, effectively marking the end of the dictatorship established following the Spanish Civil War and the beginning of Spain's transition to democracy."], ["1975-11-22T00:00:00", "Juan Carlos is declared King of Spain following the death of dictator Francisco Franco; he would reign until his abdication in 2014."], ["1975-11-25T00:00:00", "Suriname gains independence from the Kingdom of the Netherlands."], ["1975-11-25T00:00:00", "The Provisional Irish Republican Army is outlawed in the United Kingdom."], ["1975-11-26T00:00:00", "The 1975 cult classic movie The Rocky Horror Picture Show is released in America."], ["1975-11-27T00:00:00", "Ross McWhirter, co-founder of the Guinness Book of Records, is shot dead by the Provisional Irish Republican Army for offering reward money to informers."], ["1975-11-28T00:00:00", "Portuguese Timor declares its independence from Portugal as East Timor."], ["1975-11-29T00:00:00", "The name \"Micro-soft\" (for microcomputer software) is used by Bill Gates in a letter to Paul Allen for the first time (Microsoft becomes a registered trademark on November 26, 1976)."], ["1975-11-29T00:00:00", "While disabled, the submarine tender USS Proteus discharges radioactive coolant water into Apra Harbor, Guam. A Geiger counter at two of the harbor's public beaches shows 100 millirems/hour, 50 times the allowable dose."], ["1975-12-02T00:00:00", "In Laos, the communist party of the Pathet Lao takes over Vientiane and defeats the Kingdom of Laos, forcing King Sisavang Vatthana to abdicate and creating the Lao People's Democratic Republic. This ends the Laotian Civil War, with mass evacuation of American troops and Laotian civilians."], ["1975-12-03T00:00:00", "The ongoing Insurgency in Laos begins with the Pathet Lao fighting the Hmongs, Royalist-in-exile and the Right-wings. - - The 1916 wreck of HMHS Britannic is found in the Kea Channel by Jacques Cousteau."], ["1975-12-08T00:00:00", "New York City is approved for bailout of 2.3 billion each year through to 1978 - 6.9 billion total."]]