[["1969-01-02T00:00:00", "Australian media baron Rupert Murdoch purchases the largest selling British Sunday newspaper, The News of the World."], ["1969-01-02T00:00:00", "People's Democracy begins a march from Belfast to Derry City, Northern Ireland to gain publicity and to promote its cause."], ["1969-01-02T00:00:00", "Ohio State defeats USC in the Rose Bowl to win the national title for the 1968 season."], ["1969-01-04T00:00:00", "The Government of Spain hands over Ifni to Morocco."], ["1969-01-05T00:00:00", "The Soviet Union launches Venera 5 toward Venus."], ["1969-01-06T00:00:00", "The final passenger train traverses the Waverley Line, which subsequently closes to passengers."], ["1969-01-10T00:00:00", "the Soviet Union launches Venera 6 toward Venus."], ["1969-01-12T00:00:00", "Led Zeppelin, the first Led Zeppelin album, is released."], ["1969-01-12T00:00:00", "Martial law is declared in Madrid, as the University is closed and over 300 students are arrested."], ["1969-01-12T00:00:00", "The New York Jets upset the Baltimore Colts in Super Bowl III, 16-7. Joe Namath is the MVP of the game."], ["1969-01-14T00:00:00", "An explosion aboard the USS Enterprise near Hawaii kills 27 and injures 314."], ["1969-01-14T00:00:00", "The Soviet Union launches Soyuz 4."], ["1969-01-15T00:00:00", "The Soviet Union launches Soyuz 5, which docks with Soyuz 4 for a transfer of crew."], ["1969-01-16T00:00:00", "Student Jan Palach sets himself on fire in Prague's Wenceslas Square to protest the Soviet invasion of Czechoslovakia; 3 days later he dies."], ["1969-01-18T00:00:00", "In Washington, D.C., the Smithsonian displays the art of Winslow Homer for 6 weeks."], ["1969-01-20T00:00:00", "Richard Milhous Nixon succeeds Lyndon Baines Johnson as the 37th President of the United States of America.\n\n"], ["1969-01-20T00:00:00", "After 147 years, the last issue of The Saturday Evening Post is published (publication resumed in 1971)."], ["1969-01-26T00:00:00", "Elvis Presley steps into American Studios in Memphis, Tennessee, recording \"Long Black Limousine\", thus beginning the recording of what becomes his landmark comeback sessions for the albums From Elvis in Memphis and Back in Memphis. The sessions yield the popular and critically acclaimed singles \"Suspicious Minds\", \"In the Ghetto\", and \"Kentucky Rain\"."], ["1969-01-27T00:00:00", "Fourteen men, 9 of them Jews, are executed in Baghdad for spying for Israel."], ["1969-01-27T00:00:00", "Reverend Ian Paisley, Northern Irish Unionist leader and founder of the Free Presbyterian Church of Ulster is jailed for three months for illegal assembly."], ["1969-01-27T00:00:00", "The present-day Hetch Hetchy Moccasin Powerhouse, rated at 100,000 KVA, is completed and placed in operation."], ["1969-01-28T00:00:00", "A blow-out on Union Oil's Platform spills 80,000 to 100,000 barrels of crude oil into a channel and onto the beaches of Santa Barbara County in Southern California, inspiring Wisconsin Senator Gaylord Nelson to organize the first Earth Day in 1970."], ["1969-01-30T00:00:00", "The Beatles give their last public performance, filming several tracks on the roof of Apple Records, London."], ["1969-02-02T00:00:00", "Two cosmonauts transfer from Soyuz 5 to Soyuz 4 via a spacewalk while the two craft are docked together, the first time such a transfer takes place. The two spacecraft undock. Soyuz 4 will reenter Earth's atmosphere and land February 17 while Soyuz 5 will have a hard landing February 18."], ["1969-02-02T00:00:00", "Ten paintings are defaced in New York's Metropolitan Museum of Art."], ["1969-02-04T00:00:00", "In Cairo, Yasser Arafat is elected Palestine Liberation Organization leader at the Palestinian National Congress."], ["1969-02-05T00:00:00", "A huge oil spill off the coast of Santa Barbara, California, closes the city's harbor."], ["1969-02-07T00:00:00", "The original Hetch Hetchy Moccasin Powerhouse is removed from service."], ["1969-02-08T00:00:00", "The Allende meteorite explodes over Mexico."], ["1969-02-08T00:00:00", "The last issue of The Saturday Evening Post hits magazine stands."], ["1969-02-09T00:00:00", "The Boeing 747 makes its maiden flight."], ["1969-02-13T00:00:00", "FLQ terrorists bomb the Stock Exchange in Montreal."], ["1969-02-14T00:00:00", "Pope Paul VI issues a motu proprio deleting many names from the Roman calendar of saints (including Valentine, who was celebrated on that day)."], ["1969-02-17T00:00:00", "Aquanaut Berry L. Cannon dies of carbon dioxide poisoning while attempting to repair the SEALAB III habitat off San Clemente Island, California."], ["1969-02-24T00:00:00", "The Mariner 6 Mars probe is launched."], ["1969-02-24T00:00:00", "Tinker v. Des Moines Independent Community School District: The U.S. Supreme Court rules that the First Amendment applies to public schools."], ["1969-03-02T00:00:00", "In Toulouse, France the first Concorde test flight is conducted."], ["1969-03-02T00:00:00", "Soviet and Chinese forces clash at a border outpost on the Ussuri River."], ["1969-03-03T00:00:00", "In a Los Angeles court, Sirhan Sirhan admits that he killed presidential candidate Robert F. Kennedy."], ["1969-03-03T00:00:00", "Apollo program: NASA launches Apollo 9 (James McDivitt, David Scott, Rusty Schweickart) to test the lunar module."], ["1969-03-03T00:00:00", "The United States Navy establishes the Navy Fighter Weapons School (also known as Top Gun) at Naval Air Station Miramar."], ["1969-03-04T00:00:00", "Jim Morrison is arrested in Florida for indecent exposure during a Doors-concert three days earlier."], ["1969-03-10T00:00:00", "In Memphis, Tennessee, James Earl Ray pleads guilty to assassinating Martin Luther King Jr. (he later retracts his guilty plea)."], ["1969-03-10T00:00:00", "The novel The Godfather by Mario Puzo is published."], ["1969-03-13T00:00:00", "Apollo program: Apollo 9 returns safely to Earth after testing the Lunar Module."], ["1969-03-17T00:00:00", "The Longhope lifeboat is lost after answering a mayday call during severe storms in the Pentland Firth; the entire crew of 8 die."], ["1969-03-17T00:00:00", "Golda Meir becomes the first female prime minister of Israel."], ["1969-03-18T00:00:00", "Operation Breakfast, the secret bombing of Cambodia, begins."], ["1969-03-19T00:00:00", "British paratroopers and Marines land on the island of Anguilla."], ["1969-03-19T00:00:00", "A 385 metres (1,263 ft) tall TV mast at Emley Moor, UK, collapses due to ice build-up."], ["1969-03-20T00:00:00", "John Lennon and Yoko Ono are married at Gibraltar, and proceed to their honeymoon \"Bed-In\" for peace in Amsterdam."], ["1969-03-22T00:00:00", "The landmark art exhibition When Attitudes become Form, curated by Harald Szeemann, opens at the Kunsthalle Bern in Bern, Switzerland."], ["1969-03-29T00:00:00", "The Eurovision Song Contest 1969 is held in Madrid, and results in four co-winners, with 18 votes each, from Spain, the United Kingdom, the Netherlands, and France."], ["1969-03-30T00:00:00", "The body of former United States General and President Dwight D. Eisenhower is brought by caisson to the United States Capitol to lie in state in the Capitol Rotunda; Eisenhower had died two days earlier, after a long illness, in the Walter Reed Army Medical Center, Washington, D.C."], ["1969-04-01T00:00:00", "The Hawker Siddeley Harrier enters service with the Royal Air Force."], ["1969-04-04T00:00:00", "Dr. Denton Cooley implants the first temporary artificial heart."], ["1969-04-09T00:00:00", "The Harvard University Administration Building is seized by close to 300 students, mostly members of the Students for a Democratic Society. Before the takeover ends, 45 will be injured and 184 arrested."], ["1969-04-09T00:00:00", "Fermín Monasterio Pérez is murdered by the ETA in Biscay, Spain; the 4th victim in the name of Basque nationalism."], ["1969-04-13T00:00:00", "Queensland: The Brisbane Tramways end service after 84 years of operation."], ["1969-04-15T00:00:00", "The EC-121 shootdown incident: North Korea shoots down the aircraft over the Sea of Japan, killing all 31 on board."], ["1969-04-20T00:00:00", "British troops arrive in Northern Ireland to reinforce the Royal Ulster Constabulary."], ["1969-04-20T00:00:00", "A grassroots movement of Berkeley community members seizes an empty lot owned by the University of California, to begin the formation of \"People's Park\"."], ["1969-04-22T00:00:00", "Robin Knox-Johnston becomes the first person to sail around the world solo without stopping."], ["1969-04-24T00:00:00", "Recently formed British Leyland launches their first new model, the Austin Maxi in Portugal."], ["1969-04-28T00:00:00", "Charles de Gaulle steps down as president of France after suffering defeat in a referendum the day before."], ["1969-05-10T00:00:00", "Zip to Zap, a harbinger of the Woodstock Concert, ends with the dispersal and eviction of youths and young adults at Zap, North Dakota by the National Guard."], ["1969-05-10T00:00:00", "The Battle of Dong Ap Bia, also known as Hamburger Hill, begins during the Vietnam War."], ["1969-05-13T00:00:00", "May 13 Incident: Race riots occur in Kuala Lumpur, Malaysia."], ["1969-05-14T00:00:00", "Colonel Muammar Gaddafi visits Mecca, Saudi Arabia."], ["1969-05-15T00:00:00", "An American teenager known as 'Robert R.' dies in St. Louis, Missouri, of a baffling medical condition. In 1984 it will be identified as the first confirmed case of HIV/AIDS in North America."], ["1969-05-16T00:00:00", "Venera program: Venera 5, a Soviet spaceprobe, lands on Venus."], ["1969-05-17T00:00:00", "Venera program: Soviet probe Venera 6 begins to descend into Venus' atmosphere, sending back atmospheric data before being crushed by pressure."], ["1969-05-18T00:00:00", "Apollo program: Apollo 10 (Tom Stafford, Gene Cernan, John Young) is launched, on the full dress-rehearsal for the Moon landing."], ["1969-05-20T00:00:00", "United States National Guard helicopters spray skin-stinging powder on anti-war protesters in California."], ["1969-05-21T00:00:00", "Rosariazo: Civil unrest breaks out in Rosario, Argentina, following the death of a 15-year-old student."], ["1969-05-22T00:00:00", "Apollo program: Apollo 10's lunar module flies to within 15,400 m of the Moon's surface."], ["1969-05-25T00:00:00", "Midnight Cowboy, an X-rated, Oscar-winning John Schlesinger film, is released."], ["1969-05-26T00:00:00", "The Andean Pact (Andean Group) is established."], ["1969-05-26T00:00:00", "Apollo program: Apollo 10 returns to Earth, after a successful 8-day test of all the components needed for the upcoming first manned Moon landing."], ["1969-05-29T00:00:00", "Cordobazo: A general strike and civil unrest break out in Córdoba, Argentina."], ["1969-05-29T00:00:00", "Guided tours begin at the Kremlin and other government sites in Moscow."], ["1969-05-30T00:00:00", "Riots in Curaçao mark the start of an Afro-Caribbean civil rights movement on the island."], ["1969-06-03T00:00:00", "While operating at sea on SEATO maneuvers, the Australian aircraft carrier HMAS Melbourne accidentally rams and slices in two the American destroyer USS Frank E. Evans in the South China Sea, killing 74 American seamen."], ["1969-06-05T00:00:00", "An international communist conference begins in Moscow."], ["1969-06-07T00:00:00", "The rock group Blind Faith plays its first gig in front of 100,000 people in London's Hyde Park."], ["1969-06-08T00:00:00", "U.S. President Richard Nixon and South Vietnamese President Nguyễn Văn Thiệu meet at Midway Island. Nixon announces that 25,000 U.S. troops will be withdrawn by September."], ["1969-06-17T00:00:00", "After a 23-game match, Boris Spassky defeats Tigran Petrosian to become the World Chess Champion in Moscow."], ["1969-06-20T00:00:00", "Georges Pompidou is elected President of France."], ["1969-06-22T00:00:00", "The Cuyahoga River fire helps spur an avalanche of water pollution control activities resulting in the Clean Water Act, Great Lakes Water Quality Agreement and the creation of the federal Environmental Protection Agency."], ["1969-06-22T00:00:00", "Judy Garland dies of a drug overdose in her London home."], ["1969-06-23T00:00:00", "Warren E. Burger is sworn in as Chief Justice of the United States by retiring Chief Justice Earl Warren."], ["1969-06-24T00:00:00", "The United Kingdom and Rhodesia sever diplomatic ties."], ["1969-06-28T00:00:00", "The Stonewall riots in New York City mark the start of the modern gay rights movement in the U.S."], ["1969-07-01T00:00:00", "Charles, Prince of Wales, is invested with his title at Caernarfon."], ["1969-07-01T00:00:00", "David Simonsen, longterm council member of the European Democratic Education Community was born"], ["1969-07-03T00:00:00", "Brian Jones, musician and founder of The Rolling Stones, drowns in his swimming pool at his home in Sussex, England."], ["1969-07-04T00:00:00", "Michael Mageau and Darlene Ferrin are shot at Blue Rock Springs in California. They are the second (known) victims of the Zodiac Killer. Mageau survives the attack while Ferrin is pronounced dead-on-arrival at Kaiser Foundation Hospital - Richmond."], ["1969-07-05T00:00:00", "Tom Mboya, Kenyan Minister of Development, is assassinated."], ["1969-07-06T00:00:00", "Francisco Franco orders the closing of the border and communications between Gibraltar and Spain in response to the 1967 Gibraltar sovereignty referendum."], ["1969-07-07T00:00:00", "French is made equal to English throughout the Canadian national government."], ["1969-07-08T00:00:00", "Vietnam War: The very first U.S. troop withdrawals are made."], ["1969-07-10T00:00:00", "Donald Crowhurst's trimaran Teignmouth Electron is found drifting and unoccupied. It is assumed that Crowhurst might have committed suicide."], ["1969-07-14T00:00:00", "Football War: After Honduras loses a soccer game against El Salvador, rioting breaks out in Honduras against Salvadoran migrant workers. Of the 300,000 Salvadoran workers in Honduras, tens of thousands are expelled, prompting a brief Salvadoran invasion of Honduras. The OAS works out a cease-fire on July 18, which takes effect on July 20."], ["1969-07-14T00:00:00", "The Act of Free Choice commences in Merauke, West Irian."], ["1969-07-14T00:00:00", "The United States' $500, $1,000, $5,000 and $10,000 bills are officially withdrawn from circulation."], ["1969-07-16T00:00:00", "Apollo program: Apollo 11 (Neil Armstrong, Buzz Aldrin, Michael Collins) lifts off toward the first landing on the Moon."], ["1969-07-18T00:00:00", "Chappaquiddick incident - Edward M. Kennedy drives off a bridge on his way home from a party on Chappaquiddick Island, Massachusetts. Mary Jo Kopechne, a former campaign aide to his brother, dies in the early morning hours of July 19 in the submerged car."], ["1969-07-19T00:00:00", "Gloria Diaz of the Philippines was crowned Miss Universe by the Martha Vasconcellos of Brazil. Diaz became the first Filipina and third Asian to win the pageant, beating 60 other contestants from all around the world."], ["1969-07-19T00:00:00", "John Fairfax lands in Hollywood Beach, Florida near Miami and becomes the first person to row across an ocean solo, after 180 days spent at sea on board 25' ocean rowboat 'Britannia' (left Gran Canaria on January 20, 1969)."], ["1969-07-20T00:00:00", "Apollo program: The lunar module Eagle lands on the lunar surface. An estimated 500 million people worldwide watch in awe as Neil Armstrong takes his historic first steps on the Moon at 10:56 pm ET (02:56 am UTC July 21), the largest television audience for a live broadcast at that time."], ["1969-07-22T00:00:00", "Spanish dictator and head of state Francisco Franco appoints Prince Juan Carlos his successor."], ["1969-07-24T00:00:00", "The Apollo 11 astronauts return from the first successful Moon landing, and are placed in biological isolation for several days, on the chance they may have brought back lunar germs. The airless lunar environment is later determined to preclude microscopic life."], ["1969-07-24T00:00:00", "The Soviet Union returns Gerald Brooke to the United Kingdom in exchange for spies Peter and Helen Kroger (Morris and Lona Cohen)."], ["1969-07-25T00:00:00", "Vietnam War: U.S. President Richard Nixon declares the Nixon Doctrine, stating that the United States now expects its Asian allies to take care of their own military defense. This starts the \"Vietnamization\" of the war."], ["1969-07-26T00:00:00", "The New York Chapter of the Young Lords is founded."], ["1969-07-30T00:00:00", "Vietnam War: U.S. President Richard Nixon makes an unscheduled visit to South Vietnam, meeting with President Nguyễn Văn Thiệu and U.S. military commanders."], ["1969-07-31T00:00:00", "The halfpenny ceases to be legal tender in the UK."], ["1969-08-04T00:00:00", "Vietnam War: At the apartment of French intermediary Jean Sainteny in Paris, U.S. representative Henry Kissinger and North Vietnamese representative Xuan Thuy begin secret peace negotiations. They eventually fail since both sides cannot agree to any terms."], ["1969-08-05T00:00:00", "Mariner program: Mariner 7 makes its closest fly-by of Mars (3,524 kilometers) and proto-punk band The Stooges releases their homonym debut album."], ["1969-08-08T00:00:00", "The Beatles at 11:30 have photographer Iain Macmillan take their photo on a zebra crossing on Abbey Road."], ["1969-08-08T00:00:00", "A fire breaks out in Bannerman's Castle in the Hudson River; most of the roof collapses and crashes down to the lower levels."], ["1969-08-09T00:00:00", "The Haunted Mansion attraction opens at Disneyland California. Later versions open in Florida, Tokyo and Paris."], ["1969-08-09T00:00:00", "Followers of Charles Manson murder Sharon Tate, (who was 8 months pregnant), and her friends: Folgers coffee heiress Abigail Folger, Wojciech Frykowski, and Hollywood hairstylist Jay Sebring at the home of Tate and her husband, Roman Polanski, in Los Angeles. Also killed is Steven Parent, leaving from a visit to the Polanski's caretaker. More than 100 stab wounds are found on the victims, except for Parent, who had been shot almost as soon as the Manson Family entered the property."], ["1969-08-10T00:00:00", "The Manson Family kills Leno and Rosemary LaBianca, wealthy Los Angeles businesspeople."], ["1969-08-12T00:00:00", "Violence erupts after the Apprentice Boys of Derry march in Derry, Northern Ireland, resulting in a three-day communal riot known as the Battle of the Bogside."], ["1969-08-13T00:00:00", "Serious border clashes occur between the Soviet Union and the People's Republic of China."], ["1969-08-14T00:00:00", "British troops are deployed in Northern Ireland following the three-day Battle of the Bogside."], ["1969-08-15T00:00:00", "Captain D's is founded as \"Mr. D’s Seafood and Hamburgers\" by Ray Danner with its first location opening in Donelson, Tennessee."], ["1969-08-17T00:00:00", "Category 5 Hurricane Camille, the most powerful tropical cyclonic system at landfall in history, hits the Mississippi coast, killing 248 people and causing US$1.5 billion in damage (1969 dollars)."], ["1969-08-20T00:00:00", "Florissant Fossil Beds National Monument is established in Florissant, CO, USA"], ["1969-08-21T00:00:00", "Donald and Doris Fisher open the first Gap store on Ocean Avenue in San Francisco."], ["1969-08-21T00:00:00", "Australian Denis Michael Rohan sets the Al-Aqsa Mosque on fire."], ["1969-08-21T00:00:00", "Strong violence on demonstration in Prague and Brno, Czechoslovakia. Military force contra citizens. Prague spring finally beaten."], ["1969-09-01T00:00:00", "A coup in Libya ousts King Idris, and brings Colonel Muammar Gaddafi to power."], ["1969-09-02T00:00:00", "The first automatic teller machine in the United States is installed in Rockville Centre, New York."], ["1969-09-02T00:00:00", "Ho Chi Minh, former president of the Democratic Republic of Vietnam, dies."], ["1969-09-05T00:00:00", "Lieutenant William Calley is charged with 6 counts of premeditated murder, for the 1968 My Lai Massacre deaths of 109 Vietnamese civilians in My Lai, Vietnam."], ["1969-09-09T00:00:00", "Allegheny Airlines Flight 853 DC-9 collides in flight with a Piper PA-28, and crashes near Fairland, Indiana, killing all 83 persons in both aircraft."], ["1969-09-13T00:00:00", "The first-ever episode of Scooby-Doo, Where Are You! is broadcast on CBS: \"What a Night for a Knight\"."], ["1969-09-20T00:00:00", "The very last theatrical Warner Bros. cartoon is released: the Merrie Melodies short Injun Trouble."], ["1969-09-22T00:00:00", "San Francisco Giant Willie Mays becomes the first player since Babe Ruth to hit 600 career home runs."], ["1969-09-22T00:00:00", "September 25 - An Islamic conference in Rabat, Morocco, following the al-Aqsa Mosque fire (August 21), condemns the Israeli claim of ownership of Jerusalem."], ["1969-09-23T00:00:00", "China carries out an underground nuclear bomb test."], ["1969-09-23T00:00:00", "Butch Cassidy and the Sundance Kid (directed by George Roy Hill and starring Paul Newman and Robert Redford) opens to limited release in the U.S."], ["1969-09-24T00:00:00", "The Chicago Eight trial begins in Chicago, Illinois."], ["1969-09-25T00:00:00", "The Organisation of the Islamic Conference is founded."], ["1969-09-26T00:00:00", "The Beatles release their Abbey Road album, receiving critical praise and enormous commercial success."], ["1969-09-26T00:00:00", "The Brady Bunch is broadcast for the first time on ABC."], ["1969-09-28T00:00:00", "The Social Democrats and the Free Democrats receive a majority of votes in the German parliamentary elections, and decide to form a common government."], ["1969-10-01T00:00:00", "In Sweden, Olof Palme is elected Leader of the Social Democratic Worker`s Party, replacing Tage Erlander as Prime Minister on October 14."], ["1969-10-01T00:00:00", "The Beijing Subway begins operation."], ["1969-10-02T00:00:00", "A 1.2 megaton thermonuclear device is tested at Amchitka Island, Alaska. This test is code-named Project Milrow, the 11th test of the Operation Mandrel 1969-1970 underground nuclear test series. This test is known as a \"calibration shot\" to test if the island is fit for larger underground nuclear detonations."], ["1969-10-05T00:00:00", "Monty Python's Flying Circus first airs on BBC One."], ["1969-10-05T00:00:00", "Sazae-san first airs on Fuji Television."], ["1969-10-15T00:00:00", "Vietnam War: Hundreds of thousands of people take part in Moratorium to End the War in Vietnam demonstrations across the United States."], ["1969-10-17T00:00:00", "Willard S. Boyle and George Smith invent the CCD at Bell Laboratories (30 years later, this technology is widely used in digital cameras)."], ["1969-10-17T00:00:00", "Fourteen black athletes are kicked off the University of Wyoming football team for wearing black armbands into their coach's office."], ["1969-10-21T00:00:00", "Willy Brandt becomes Chancellor of West Germany."], ["1969-10-21T00:00:00", "General Siad Barre comes to power in Somalia in a coup, 6 days after the assassination of President Abdirashid Ali Shermarke."], ["1969-10-22T00:00:00", "Led Zeppelin release Led Zeppelin II to critical acclaim and commercial success."], ["1969-10-25T00:00:00", "Pink Floyd release their Ummagumma album."], ["1969-10-29T00:00:00", "The first message is sent over ARPANET, the forerunner of the internet."], ["1969-10-31T00:00:00", "Wal-Mart incorporates as Wal-Mart Stores, Inc."], ["1969-11-03T00:00:00", "Vietnam War: U.S. President Richard Nixon addresses the nation on television and radio, asking the \"silent majority\" to join him in solidarity with the Vietnam War effort, and to support his policies. Vice President Spiro Agnew denounces the President's critics as 'an effete corps of impudent snobs' and 'nattering nabobs of negativism'."], ["1969-11-03T00:00:00", "Süleyman Demirel of AP forms the new government of Turkey (31st government)."], ["1969-11-09T00:00:00", "A group of American Indians, led by Richard Oakes, seizes Alcatraz Island for 19 months, inspiring a wave of renewed Indian pride and government reform."], ["1969-11-10T00:00:00", "Sesame Street is broadcast for the first time, on the National Educational Television (NET) network."], ["1969-11-12T00:00:00", "Vietnam War - My Lai Massacre: Independent investigative journalist Seymour Hersh breaks the My Lai story."], ["1969-11-14T00:00:00", "Apollo program: NASA launches Apollo 12 (Pete Conrad, Richard Gordon, Alan Bean), the second manned mission to the Moon."], ["1969-11-15T00:00:00", "Cold War: The Soviet submarine K-19 collides with the American submarine USS Gato in the Barents Sea."], ["1969-11-15T00:00:00", "Vietnam War: In Washington, D.C., 250,000-500,000 protesters stage a peaceful demonstration against the war, including a symbolic \"March Against Death\"."], ["1969-11-15T00:00:00", "Regular colour television broadcasts begin on BBC1 and ITV in the United Kingdom."], ["1969-11-15T00:00:00", "Dave Thomas opens his first restaurant in a former steakhouse in downtown Columbus, Ohio. He names the chain Wendy's after his 8-year-old daughter, Melinda Lou (nicknamed \"Wendy\" by her siblings)."], ["1969-11-17T00:00:00", "Cold War: Negotiators from the Soviet Union and the United States meet in Helsinki, to begin the SALT I negotiations aimed at limiting the number of strategic weapons on both sides."], ["1969-11-19T00:00:00", "Apollo program: Apollo 12 astronauts Charles Conrad and Alan Bean land at Oceanus Procellarum (\"Ocean of Storms\"), becoming the third and fourth humans to walk on the Moon."], ["1969-11-19T00:00:00", "Soccer great Pelé scores his 1,000th goal."], ["1969-11-20T00:00:00", "Vietnam War: The Plain Dealer publishes explicit photographs of dead villagers from the My Lai Massacre in Vietnam."], ["1969-11-20T00:00:00", "Richard Oakes returns with 90 followers and offers to buy Alcatraz for $24 (he leaves the island January 1970)."], ["1969-11-21T00:00:00", "U.S. President Richard Nixon and Japanese Premier Eisaku Satō agree in Washington, D.C. to the return of Okinawa to Japanese control in 1972. Under the terms of the agreement, the U.S. retains rights to military bases on the island, but they must be nuclear-free."], ["1969-11-21T00:00:00", "The first ARPANET link is established (the progenitor of the global Internet)."], ["1969-11-21T00:00:00", "The United States Senate votes down the Supreme Court nomination of Clement Haynsworth, the first such rejection since 1930."], ["1969-11-24T00:00:00", "Apollo program: The Apollo 12 spacecraft splashes down safely in the Pacific Ocean, ending the second manned mission to the Moon."], ["1969-11-25T00:00:00", "John Lennon returns his MBE medal to protest the British government's involvement in the Nigerian Civil War."], ["1969-12-01T00:00:00", "Vietnam War: The first draft lottery in the United States is held since World War II (on January 4, 1970, The New York Times will run a long article, \"Statisticians Charge Draft Lottery Was Not Random\")."], ["1969-12-02T00:00:00", "The Boeing 747 jumbo jet makes its first passenger flight. It carries 191 people, most of them reporters and photographers, from Seattle, to New York City."], ["1969-12-04T00:00:00", "Black Panther Party members Fred Hampton and Mark Clark are shot dead in their sleep during a raid by 14 Chicago police officers."], ["1969-12-05T00:00:00", "The Rolling Stones release Let it Bleed."], ["1969-12-06T00:00:00", "The Altamont Free Concert is held at the Altamont Speedway in northern California. Hosted by The Rolling Stones, it is an attempt at a \"Woodstock West\" and is best known for the uproar of violence that occurred. It is viewed by many as the \"end of the sixties.\""], ["1969-12-12T00:00:00", "The Piazza Fontana bombing in Italy (Strage di Piazza Fontana) takes place."], ["1969-12-14T00:00:00", "The murder of Diane Maxwell takes place, when the 25-year-old phone operator is found sexually assaulted and killed (the case remains unsolved until 2003)."], ["1969-12-24T00:00:00", "Charles Manson is allowed to defend himself at the Tate-LaBianca murder trial."], ["1969-12-27T00:00:00", "The Liberal Democratic Party wins 47.6% of the votes in the Japanese general election, 1969. Future prime ministers Yoshirō Mori and Tsutomu Hata and future kingmaker Ichirō Ozawa are elected for the first time."], ["1969-12-28T00:00:00", "The Young Lords take over the First Spanish Methodist Church in East Harlem."], ["1969-12-30T00:00:00", "The Linwood bank robbery leaves two police officers dead."]]