[["1924-01-10T00:00:00", "The British submarine L-24 sinks in the English Channel; 43 are lost."], ["1924-01-12T00:00:00", "Gopinath Saha shoots a man he erroneously thinks is Sir Charles Tegart, the police commissioner of Calcutta, and is arrested soon after."], ["1924-01-21T00:00:00", "Following the death of Vladimir Lenin, Joseph Stalin immediately begins to purge his rivals to clear the way for his leadership."], ["1924-01-22T00:00:00", "Ramsay MacDonald becomes the first Labour Prime Minister of the United Kingdom."], ["1924-01-23T00:00:00", "The Soviet Union officially declares that Lenin died January 21."], ["1924-01-25T00:00:00", "The 1924 Winter Olympics open in Chamonix, in the French Alps."], ["1924-01-26T00:00:00", "Petrograd (Saint Petersburg) is renamed Leningrad. It reverts to Saint Petersburg in 1991."], ["1924-01-27T00:00:00", "Lenin is buried in Lenin's Mausoleum in Moscow's Red Square."], ["1924-02-01T00:00:00", "The United Kingdom recognizes the Soviet Union."], ["1924-02-05T00:00:00", "GMT: A radio time signal is broadcast for the first time from the Royal Greenwich Observatory."], ["1924-02-07T00:00:00", "Capital punishment: The first state execution using gas in the United States takes place in Nevada."], ["1924-02-12T00:00:00", "Rhapsody in Blue, by George Gershwin, is first performed in New York City at Aeolian Hall."], ["1924-02-14T00:00:00", "The Computing Tabulating Recording Company (CTR), based in the U.S. state of New York, is renamed International Business Machines (IBM)."], ["1924-02-22T00:00:00", "Treaty of Rome: Agreement for the Kingdom of Italy to annexe the Free State of Fiume and for the Kingdom of Serbs, Croats and Slovenes to absorb Sušak."], ["1924-02-22T00:00:00", "Calvin Coolidge becomes the first President of the United States to deliver a radio broadcast from the White House."], ["1924-03-03T00:00:00", "The 1,400-year-old Islamic caliphate is abolished when Caliph Abdülmecid II of the Ottoman Empire is deposed. The last remnant of the old regime gives way to the reformed Turkey of President Kemal Atatürk."], ["1924-03-06T00:00:00", "İsmet İnönü forms a new government in Turkey. (2nd government)"], ["1924-03-08T00:00:00", "The Castle Gate Mine disaster kills 172 coal miners in Utah, United States."], ["1924-03-25T00:00:00", "Greece proclaims itself a republic."], ["1924-03-29T00:00:00", "The Third Ministry of Raymond Poincaré starts in France."], ["1924-04-01T00:00:00", "Adolf Hitler is sentenced to 5 years in jail for his participation in the Beer Hall Putsch (he serves only 8 months)."], ["1924-04-01T00:00:00", "The first revenue flight for Belgium's Sabena Airlines takes place."], ["1924-04-06T00:00:00", "Fascists win the elections in Italy with a ⅔ majority."], ["1924-04-13T00:00:00", "A referendum in Greece favors the formation of the Second Hellenic Republic."], ["1924-04-13T00:00:00", "The A.E.K. is founded in Greece."], ["1924-04-16T00:00:00", "American media company Metro-Goldwyn-Mayer (MGM) is founded in Los Angeles."], ["1924-04-23T00:00:00", "British Empire Exhibition opens. It was the largest colonial exhibition with 58 countries of the empire dramatically represented."], ["1924-04-26T00:00:00", "Harry Grindell Matthews demonstrates his \"death ray\" in London but fails to convince the British War Office."], ["1924-04-27T00:00:00", "A group of Alawites kill several nuns in Syria; French troops march against them."], ["1924-04-28T00:00:00", "An explosion in a mine at the Wheeling Steel Corporation in Benwood, West Virginia kills 119 men."], ["1924-05-03T00:00:00", "The Aleph Zadik Aleph, the oldest Jewish youth fraternity, is founded in Omaha, Nebraska."], ["1924-05-04T00:00:00", "The 1924 Summer Olympics opening ceremonies are held in Paris, France."], ["1924-05-08T00:00:00", "Lithuania signs the Klaipėda Convention with the nations of the Conference of Ambassadors, taking the Klaipėda Region from East Prussia and making it into an autonomous region."], ["1924-05-10T00:00:00", "J. Edgar Hoover is appointed head of the Bureau of Investigation."], ["1924-05-11T00:00:00", "Mercedes-Benz is formed by the merging companies owned by Gottlieb Daimler and Karl Benz."], ["1924-05-21T00:00:00", "University of Chicago students Richard Loeb and Nathan Leopold, Jr. murder 14-year-old Bobby Franks in a thrill killing."], ["1924-05-24T00:00:00", "The Immigration Act of 1924 is signed into law in the United States, including the Asian Exclusion Act."], ["1924-06-01T00:00:00", "Harry Grindell Matthews returns from Paris to London; he tries to use a Pathé film to demonstrate that his death ray works."], ["1924-06-02T00:00:00", "U.S. President Calvin Coolidge signs the Indian Citizenship Act into law, granting citizenship to all Native Americans born within the territorial limits of the United States."], ["1924-06-05T00:00:00", "Ernst Alexanderson sends the first facsimile across the Atlantic Ocean (to his father in Sweden)."], ["1924-06-08T00:00:00", "George Mallory and Andrew Irvine are last seen \"going strong for the top\" of Mount Everest by teammate Noel Odell at 12:50 P.M. The two mountaineers are never seen alive again."], ["1924-06-10T00:00:00", "Fascists kidnap and kill Italian socialist leader Giacomo Matteotti in Rome."], ["1924-06-12T00:00:00", "Rondout Heist: Six men of the Egan's Rats gang rob a mail train in Rondout, Illinois; the robbery is later found to have been an inside job."], ["1924-06-13T00:00:00", "In Hungary, a most devastating tornado called \"Wildkansas\" struck, and left a 500-1500m wide and 70 km long path of destruction, landed at Bia, and after 3 hours it ended near Vác, destroyed a village called Páty completely, and left many people homeless, killed 9 people, and 50 people got wounded. This was one of the strongest tornadoes ever not only in Hungary but in Europe also. It was estimated to be an F4."], ["1924-06-16T00:00:00", "Whampoa Military Academy is founded in China."], ["1924-06-23T00:00:00", "American airman Russell Maughan flies from New York to San Francisco in 21 hours and 48 minutes on a dawn-to-dusk flight in a Curtiss pursuit."], ["1924-06-28T00:00:00", "A tornado touches down in Lorain, Ohio and kills 78 people."], ["1924-07-04T00:00:00", "Supposed invention of Caesar salad by Caesar Cardini in Tijuana."], ["1924-07-09T00:00:00", "John W. Davis of West Virginia is nominated by the Democrats to oppose Calvin Coolidge in the presidential election."], ["1924-07-19T00:00:00", "The Napalpí massacre occurs in Argentina."], ["1924-07-20T00:00:00", "The Soviet sports newspaper Sovetsky Sport is founded."], ["1924-08-16T00:00:00", "The Dawes Plan is accepted."], ["1924-08-18T00:00:00", "France begins to withdraw its troops from Germany."], ["1924-08-28T00:00:00", "August Uprising: Georgia rises against rule by the Soviet Union in an abortive rebellion in which several thousands die."], ["1924-09-09T00:00:00", "The Hanapepe massacre occurs on Kauai, Hawaii."], ["1924-09-09T00:00:00", "The 8-hour work day is introduced in Belgium."], ["1924-09-28T00:00:00", "U.S. Army pilots John Harding and Erik Nelson complete the first aerial circumnavigation. It has taken them 175 days and 74 stops before their return to Seattle."], ["1924-10-02T00:00:00", "The Geneva Protocol is adopted by the League of Nations Assembly as a means to strengthen the League, but later fails to be ratified."], ["1924-10-10T00:00:00", "Voting in federal elections becomes compulsory in Australia, after a private member's bill proposed by Tasmanian Nationalist senator Herbert Payne results in the passing of the Commonwealth Electoral (Compulsory Voting) Act 1924."], ["1924-10-10T00:00:00", "The Alpha Delta Gamma fraternity is founded at the Lake Shore Campus of Loyola University, Chicago."], ["1924-10-15T00:00:00", "The first Surrealist Manifesto is published, in which André Breton defines the movement as \"pure psychic automatism\"."], ["1924-10-18T00:00:00", "Sweden`s Prime Minister Ernst Trygger resigns with his cabinet, and is replaced by Hjalmar Branting who forms his third and last government."], ["1924-10-19T00:00:00", "Abdul Aziz declares himself protector of holy places in Mecca."], ["1924-10-22T00:00:00", "The Toastmasters Club is founded."], ["1924-10-24T00:00:00", "The British Foreign Office publishes the Zinoviev letter."], ["1924-10-24T00:00:00", "Dixie Dean scores a hat-trick for Tranmere Rovers to become the youngest ever player to score three goals for The Superwhites."], ["1924-10-25T00:00:00", "British authorities in India arrest Subhas Chandra Bose and jail him for the next 2½ years."], ["1924-10-27T00:00:00", "The Uzbek SSR joins the Soviet Union."], ["1924-11-04T00:00:00", "Nellie Tayloe Ross of Wyoming is elected as the first woman governor in the United States."], ["1924-11-04T00:00:00", "U.S. presidential election, 1924: Republican Calvin Coolidge defeats Democrat John W. Davis and Progressive Robert M. La Follette, Sr."], ["1924-11-19T00:00:00", "In Los Angeles, famous silent film director Thomas Ince (\"The Father of the Western\") dies, reportedly of a heart attack, in his bed (rumors soon surface that he was shot dead by publishing tycoon William Randolph Hearst)."], ["1924-11-21T00:00:00", "Ali Fethi Okyar forms new government in Turkey. (3rd government)"], ["1924-11-27T00:00:00", "129 communists, including several members of the Riigikogu, are convicted during the Trial of the 149 in Estonia."], ["1924-11-27T00:00:00", "In New York City the first Macy's Thanksgiving Day Parade is held."], ["1924-12-01T00:00:00", "A Soviet-backed communist coup attempt fails in Estonia."], ["1924-12-01T00:00:00", "George Gershwin's Lady Be Good and Fascinating Rhythm (book by Guy Bolton and Fred Thompson, lyrics by Ira Gershwin) premiere in New York, NY."], ["1924-12-19T00:00:00", "German serial killer Fritz Haarmann is sentenced to death for a series of murders."], ["1924-12-20T00:00:00", "In Germany Adolf Hitler is released from Landsberg Prison. Hitler served nine months for his crucial role in the Beer Hall Putsch from 1923."], ["1924-12-24T00:00:00", "An air crash at Croydon Air Field in London kills 8."], ["1924-12-24T00:00:00", "Albania becomes a republic."], ["1924-12-24T00:00:00", "A flash fire at a Christmas celebration in a one-room schoolhouse in Babbs, Oklahoma kills 36 people, mostly small children."], ["1924-12-30T00:00:00", "Astronomer Edwin Hubble announces that Andromeda, previously believed to be a nebula, is actually another galaxy, and that the Milky Way is only one of many such galaxies in the universe."]]