[["1973-01-01T00:00:00", "The United Kingdom, the Republic of Ireland and Denmark enter the European Economic Community, which later becomes the European Union."], ["1973-01-01T00:00:00", "CBS sells the New York Yankees for $10 million to a 12-person syndicate led by George Steinbrenner (3.2 million dollars less than CBS bought the Yankees for)."], ["1973-01-14T00:00:00", "Elvis Presley's concert in Hawaii is the first worldwide telecast by an entertainer, that is watched by more people than watched the Apollo moon landings."], ["1973-01-14T00:00:00", "Super Bowl VII: The Miami Dolphins defeat the Washington Redskins, 14–7, at the Los Angeles Memorial Coliseum, to complete the NFL's first Perfect Season in front of 90,182 fans."], ["1973-01-22T00:00:00", "Roe v. Wade: The U.S. Supreme Court overturns state bans on abortion."], ["1973-01-22T00:00:00", "George Foreman defeats Joe Frazier to win the heavyweight world boxing championship."], ["1973-01-22T00:00:00", "A Royal Jordanian Boeing 707 flight from Jeddah crashes in Kano, Nigeria; 176 people are killed."], ["1973-01-22T00:00:00", "Former U.S. President Lyndon B. Johnson dies at his Stonewall, Texas ranch, leaving no former U.S. President living until the resignation of Richard Nixon in 1974."], ["1973-01-22T00:00:00", "The crew of Apollo 17 addresses a joint session of Congress after the completion of the final Apollo moon landing mission."], ["1973-01-23T00:00:00", "Eldfell on the Icelandic island of Heimaey erupts."], ["1973-01-23T00:00:00", "U.S. President Richard Nixon announces that a peace accord has been reached in Vietnam."], ["1973-02-28T00:00:00", "The Republic of Ireland general election is held. Liam Cosgrave becomes the new Taoiseach."], ["1973-02-28T00:00:00", "The landmark postmodern novel Gravity's Rainbow by Thomas Pynchon is published."], ["1973-03-01T00:00:00", "Dick Taverne, having resigned from the Parliament of the United Kingdom on leaving the Labour Party, is re-elected as a 'Democratic Labour' candidate."], ["1973-03-01T00:00:00", "Pink Floyd's The Dark Side of the Moon, one of rock's landmark albums, is released in the US. It is released in the UK on March 24."], ["1973-03-08T00:00:00", "Northern Ireland sovereignty referendum (the \"Border Poll\"): 98.9% of those voting in the province want Northern Ireland to remain within the United Kingdom. Turnout is 58.7%, although less than 1% for Catholics. This is the first referendum on regional government in the U.K."], ["1973-03-08T00:00:00", "Provisional Irish Republican Army bombs explode in Whitehall and the Old Bailey in London."], ["1973-03-12T00:00:00", "Last episode of original Laugh-In airs on NBC. The show will continue with re-runs until May 14, 1973."], ["1973-03-17T00:00:00", "Elizabeth II opens the modern London Bridge."], ["1973-03-17T00:00:00", "Many of the few remaining United States soldiers begin to leave Vietnam. One reunion of a former POW with his family is immortalized in the Pulitzer Prize-winning photograph Burst of Joy."], ["1973-03-26T00:00:00", "TV soap opera The Young and the Restless debuts on CBS."], ["1973-03-27T00:00:00", "At the 45th Academy Awards, The Godfather wins best picture."], ["1973-04-05T00:00:00", "Fahri Korutürk becomes the sixth president of Turkey."], ["1973-04-05T00:00:00", "Pioneer 11 is launched on a mission to study the Solar System."], ["1973-04-08T00:00:00", "Artist Pablo Picasso dies at his home in France."], ["1973-04-17T00:00:00", "The German counter-terrorist force GSG 9 is officially formed in response to the Munich massacre."], ["1973-04-17T00:00:00", "Federal Express officially begins operations, with the launch of 14 small aircraft from Memphis International Airport. On that night, Federal Express delivers 186 packages to 25 U.S. cities from Rochester, New York, to Miami, Florida."], ["1973-04-17T00:00:00", "The Morganza Spillway on the Mississippi River is opened for the first time to prevent poor people from bathing naked in it."], ["1973-04-28T00:00:00", "The last section of the IRT 3rd Avenue Elevated Line from 149th Street to Gun Hill Road in the Bronx is closed."], ["1973-04-28T00:00:00", "Six Irishmen, including Joe Cahill, are arrested by the Irish Naval Service off County Waterford, on board a coaster carrying 5 tons of weapons destined for the Provisional Irish Republican Army."], ["1973-05-05T00:00:00", "Shambu Tamang becomes the youngest person to climb to the summit of Mount Everest."], ["1973-05-05T00:00:00", "Sunderland AFC defeats Leeds United A.F.C. in the FA Cup final."], ["1973-05-05T00:00:00", "Secretariat wins the Kentucky Derby in a dramatic come from behind victory and setting a new Derby record of 1:59 2/5ths."], ["1973-05-05T00:00:00", "Led Zeppelin plays before 56,800 persons at Tampa Stadium on the band's 1973 North American Tour, thus breaking the August 15, 1965 record of 55,600 set by The Beatles at Shea Stadium."], ["1973-05-10T00:00:00", "The Montreal Canadiens win the Stanley Cup 4 games to 2 over the Chicago Blackhawks, Yvan Cournoyer was voted MVP."], ["1973-05-10T00:00:00", "The Polisario Front, a Sahrawi movement dedicated to the independence of Spanish Sahara, is formed."], ["1973-05-10T00:00:00", "The New York Knicks defeat the Los Angeles Lakers, 102–93 in Game 5 of the NBA Finals to win the NBA title."], ["1973-05-13T00:00:00", "Bobby Riggs challenges and defeats Margaret Court, the world's #1 women's player, in a nationally-televised tennis match set in Ramona, CA northeast of San Diego. Riggs wins 6-2, 6-1 which leads to the huge Battle of the Sexes match against Billie Jean King later in the year on September 20."], ["1973-05-14T00:00:00", "Skylab, the United States' first space station, is launched."], ["1973-05-14T00:00:00", "The British House of Commons votes to abolish capital punishment in Northern Ireland."], ["1973-05-23T00:00:00", "Royal Canadian Mounted Police celebrate 100 year anniversary."], ["1973-05-25T00:00:00", "Skylab 2 (Pete Conrad, Paul Weitz, Joseph Kerwin) is launched on a mission to repair damage to the recently launched Skylab space station."], ["1973-05-25T00:00:00", "Héctor José Cámpora becomes democratic president of the Argentine Republic ending the 1966 to 1973 Revolución Argentina military dictatorship."], ["1973-06-10T00:00:00", "Henri Pescarolo and co-driver Gérard Larrousse (both France) win the 24 Hours of Le Mans in the Equipe Matra MS670B."], ["1973-06-10T00:00:00", "The grandson of J. Paul Getty is kidnapped in Rome.Confirmation needed"], ["1973-06-25T00:00:00", "Conference on Security and Cooperation in Europe (CSCE)."], ["1973-06-25T00:00:00", "Erskine Hamilton Childers is elected the 4th President of Ireland."], ["1973-06-25T00:00:00", "Watergate scandal: Former White House counsel John Dean begins his testimony before the Senate Watergate Committee."], ["1973-07-05T00:00:00", "The Isle of Man Post begins to issue its own postage stamps."], ["1973-07-05T00:00:00", "The catastrophic BLEVE (Boiling Liquid Expanding Vapor Explosion) occurs in Kingman, Arizona, following a fire that broke out as propane was being transferred from a railroad car to a storage tank, killing 11 firefighters. This explosion becomes a classic incident, studied in fire department training programs worldwide."], ["1973-07-27T00:00:00", "The New York Dolls release their debut album."], ["1973-07-28T00:00:00", "The Summer Jam at Watkins Glen, a massive rock festival featuring the Grateful Dead, The Allman Brothers Band and The Band, attracts over 600,000 music fans."], ["1973-07-28T00:00:00", "Skylab 3 (Owen Garriott, Jack Lousma, Alan Bean) is launched, to conduct various medical and scientific experiments aboard Skylab."], ["1973-07-31T00:00:00", "Militant protesters led by Ian Paisley disrupt the first sitting of the Northern Ireland Assembly."], ["1973-07-31T00:00:00", "A Delta Air Lines DC-9 aircraft flying as Delta Air Lines Flight 173 lands short of Boston's Logan Airport runway in poor visibility, striking a sea wall about 165 feet (50 m) to the right of the runway centerline and about 3,000 feet (914 m) short. All 6 crew members and 83 passengers are killed, 1 of the passengers dying several months after the accident."], ["1973-08-08T00:00:00", "South Korean politician Kim Dae-jung is kidnapped in Tokyo by the KCIA."], ["1973-08-08T00:00:00", "The death of Dean Corll leads to the discovery of the Houston Mass Murders: 28 boys were killed by 3 men."], ["1973-09-11T00:00:00", "Chile's democratically elected government is overthrown in a military coup after serious instability. President Salvador Allende allegedly commits suicide during the coup in the presidential palace, and General Augusto Pinochet heads a U.S.-backed military junta that governs Chile for the next 16 years."], ["1973-09-11T00:00:00", "Art Garfunkel finally releases his solo debut album Angel Clare, 17 years after starting his career."], ["1973-09-20T00:00:00", "Singer-songwriter Jim Croce dies following a gig at Northwestern State University in Natchitoches, Louisiana. Croce boarded a small chartered plane that crashed on takeoff. All six people aboard were killed."], ["1973-09-27T00:00:00", "Soviet space program: Soyuz 12, the first Soviet manned flight since the Soyuz 11 tragedy in 1971, is launched."], ["1973-09-27T00:00:00", "Luís Cabral declares the independence of the Republic of Guinea-Bissau from the Estado Novo regime in Portugal. It is later granted in September 1974."], ["1973-10-06T00:00:00", "Yom Kippur War begins: The fourth and largest Arab–Israeli conflict begins, as Egyptian and Syrian forces attack Israeli forces in the Sinai Peninsula and Golan Heights on Yom Kippur."], ["1973-10-06T00:00:00", "French Formula One driver François Cevert is killed in the Tyrrell 003-Cosworth during the U.S. Grand Prix. Cevert's teammate, World Champion Jackie Stewart, announces his retirement after the event."], ["1973-10-10T00:00:00", "Spiro T. Agnew resigns as Vice President of the United States and then, in federal court in Baltimore, pleads no contest to charges of income tax evasion on $29,500 he received in 1967, while he was governor of Maryland. He is fined $10,000 and put on 3 years' probation."], ["1973-10-15T00:00:00", "Typhoon Ruth crosses Luzon, Philippines, killing 27 people and causing $5 million in damage."], ["1973-10-20T00:00:00", "The Saturday Night Massacre: U.S. President Richard Nixon orders Attorney General Elliot Richardson to dismiss Watergate Special Prosecutor Archibald Cox. Richardson refuses and resigns, along with Deputy Attorney General William Ruckelshaus. Solicitor General Robert Bork, third in line at the Department of Justice, then fires Cox. The event raises calls for Nixon's impeachment."], ["1973-10-20T00:00:00", "The Sydney Opera House is opened by Elizabeth II after 14 years of construction work."], ["1973-10-26T00:00:00", "The Yom Kippur War ends."], ["1973-10-26T00:00:00", "The United Nations recognizes the independence of Guinea-Bissau."], ["1973-11-03T00:00:00", "Pan Am cargo flight 160, a Boeing 707-321C, crashes at Logan International Airport, Boston, killing 3 people."], ["1973-11-03T00:00:00", "Mariner program: NASA launches Mariner 10 toward Mercury (on March 29, 1974 it becomes the first space probe to reach that planet)."], ["1973-11-16T00:00:00", "Skylab program: NASA launches Skylab 4 (Gerald Carr, William Pogue, Edward Gibson) from Cape Canaveral, Florida on an 84-day mission."], ["1973-11-16T00:00:00", "U.S. President Richard Nixon signs the Trans-Alaska Pipeline Authorization Act into law, authorizing the construction of the Alaska Pipeline."], ["1973-11-17T00:00:00", "Watergate scandal: In Orlando, Florida, U.S. President Richard Nixon tells 400 Associated Press managing editors \"I am not a crook.\""], ["1973-11-17T00:00:00", "The Athens Polytechnic uprising occurs against the military regime in Athens, Greece."], ["1973-12-14T00:00:00", "Rhodesia executes two Blacks at Salisbury Central Prison for murder."], ["1973-12-19T00:00:00", "Namco releases Mach Storm, a flight simulator simulating an F-4 Phantom cockpit in which players can shoot down MiGs in the Vietnam War during Operation Linebacker."], ["1973-12-25T00:00:00", "Movie premier for The Sting starring Robert Redford and Paul Newman in Manhattan."], ["1973-01-01T00:00:00", "Danny Lloyd, American actor"], ["1973-01-01T00:00:00", "Bryan Thao Worra, Lao writer"], ["1973-01-01T00:00:00", "Jimi Mistry, English actor"], ["1973-01-04T00:00:00", "Greg de Vries, Canadian ice hockey player"], ["1973-01-05T00:00:00", "Uday Chopra, Indian actor"], ["1973-01-05T00:00:00", "Diamond Foxxx, American pornographic actress"], ["1973-01-12T00:00:00", "Joseph M. Smith, American actor, writer and producer"], ["1973-01-12T00:00:00", "Hande Yener, Turkish singer"], ["1973-01-13T00:00:00", "Nikolai Khabibulin, Russian hockey player"], ["1973-01-13T00:00:00", "Gloria Yip, Hong Kong actress"], ["1973-01-15T00:00:00", "Tomáš Galásek, Czech football player"], ["1973-01-15T00:00:00", "Essam El-Hadary, Egyptian goalkepper"], ["1973-01-15T00:00:00", "Maksim Martynov, Russian engineer"], ["1973-01-16T00:00:00", "Josie Davis, American actress"], ["1973-01-16T00:00:00", "Scott Greenall, musician, recording engineer, producer, and performance artist"], ["1973-01-18T00:00:00", "Burnie Burns, American filmmaker"], ["1973-01-18T00:00:00", "Crispian Mills, British musician (The Jeevas, Kula Shaker)"], ["1973-01-19T00:00:00", "Ann Kristin Aarønes, Norwegian footballer"], ["1973-01-19T00:00:00", "Wang Junxia, Chinese long-distance runner"], ["1973-01-19T00:00:00", "Karen Lancaume, French actress (d. 2005)"], ["1973-01-19T00:00:00", "Antero Manninen, Finnish cellist"], ["1973-01-19T00:00:00", "Yevgeny Sadovyi, Russian swimmer"], ["1973-01-19T00:00:00", "Aaron Yonda, American YouTube celebrity"], ["1973-01-26T00:00:00", "Brendan Rodgers, Northern Irish football manager"], ["1973-01-31T00:00:00", "Shingo Katayama, Japanese golfer"], ["1973-01-31T00:00:00", "Portia de Rossi, American actress"], ["1973-02-01T00:00:00", "Yuri Landman, Dutch artist and musician"], ["1973-02-01T00:00:00", "Nick Mitchell, American wrestler"], ["1973-02-01T00:00:00", "Makiko Ohmoto, Japanese voice actress"], ["1973-02-01T00:00:00", "Óscar Pérez Rojas, Mexican Goalkeeper"], ["1973-02-04T00:00:00", "James Hird, Australian rules footballer"], ["1973-02-04T00:00:00", "Brett Hestla, American musician and record producer."], ["1973-02-04T00:00:00", "Oscar De La Hoya, American boxer"], ["1973-02-05T00:00:00", "Trijntje Oosterhuis, Dutch pop singer"], ["1973-02-05T00:00:00", "Deng Yaping, Chinese table tennis player"], ["1973-02-07T00:00:00", "Turki Al-Dakhil, Saudi journalist"], ["1973-02-07T00:00:00", "Juwan Howard, American retired professional basketball player"], ["1973-02-07T00:00:00", "Angel Aquino, Filipina model, actress and host"], ["1973-02-07T00:00:00", "Mie Sonozaki, Japanese voice actress"], ["1973-02-07T00:00:00", "Kate Thornton, British television presenter"], ["1973-02-11T00:00:00", "Jeon Do-yeon, South Korean actress"], ["1973-02-11T00:00:00", "Mishal Husain, British news presenter for the BBC"], ["1973-02-11T00:00:00", "Craig Jones, American rock sampler (Slipknot)"], ["1973-02-11T00:00:00", "Varg Vikernes, Norwegian rock musician (Burzum)"], ["1973-02-22T00:00:00", "Shota Arveladze, Georgian football player"], ["1973-02-22T00:00:00", "Gustavo Assis-Brasil, Brazilian guitarist"], ["1973-02-22T00:00:00", "Scott Phillips, American rock drummer"], ["1973-02-24T00:00:00", "Alexei Kovalev, Russian ice hockey player"], ["1973-02-24T00:00:00", "Yordan Yovchev, Bulgarian gymnast"], ["1973-02-26T00:00:00", "Anders and Jonas Björler, guitarists"], ["1973-02-26T00:00:00", "Marshall Faulk, American football player"], ["1973-02-26T00:00:00", "Ole Gunnar Solskjær, Norwegian footballer"], ["1973-02-26T00:00:00", "Jenny Thompson, American swimmer"], ["1973-02-27T00:00:00", "Peter Andre, English singer and television personality"], ["1973-02-28T00:00:00", "Eric Lindros, Canadian hockey player"], ["1973-02-28T00:00:00", "Masato Tanaka, Japanese professional wrestler"], ["1973-03-01T00:00:00", "Jack Davenport, English actor"], ["1973-03-01T00:00:00", "Anton Gunn, American politician"], ["1973-03-01T00:00:00", "Ahmed El Sakka, Egyptian action actor"], ["1973-03-01T00:00:00", "Chris Webber, American basketball player"], ["1973-03-06T00:00:00", "Peter Lindgren, Swedish musician"], ["1973-03-06T00:00:00", "Rumi Ochiai, Japanese voice actress"], ["1973-03-10T00:00:00", "Eva Herzigova, Czech model and actress"], ["1973-03-10T00:00:00", "John LeCompt, American musician"], ["1973-03-10T00:00:00", "Dan Swanö, Swedish musician"], ["1973-03-13T00:00:00", "Edgar Davids, Dutch footballer"], ["1973-03-13T00:00:00", "David Draiman song writer and lead singer for the band Disturbed"], ["1973-03-18T00:00:00", "Luci Christian, American voice actress"], ["1973-03-19T00:00:00", "Magnus Hedman, Swedish footballer"], ["1973-03-19T00:00:00", "Simmone Jade Mackinnon, Australian actor"], ["1973-03-24T00:00:00", "Jacek Bąk, Polish footballer"], ["1973-03-24T00:00:00", "Jim Parsons, American actor"], ["1973-03-25T00:00:00", "Anders Fridén, Swedish musician"], ["1973-03-26T00:00:00", "T. R. Knight, American actor"], ["1973-03-26T00:00:00", "Larry Page, American entrepreneur"], ["1973-03-27T00:00:00", "Sayaka Aoki, Japanese comedian"], ["1973-03-28T00:00:00", "Matt Nathanson, American singer-songwriter"], ["1973-03-28T00:00:00", "Umaga, American wrestler (d. 2009)"], ["1973-04-01T00:00:00", "Stephen Fleming, New Zealand cricket captain"], ["1973-04-01T00:00:00", "Rachel Maddow, American political commentator"], ["1973-04-01T00:00:00", "Kris Marshall, British actor"], ["1973-04-03T00:00:00", "Jamie Bamber, English actor"], ["1973-04-03T00:00:00", "Matthew Ferguson, Canadian actor"], ["1973-04-04T00:00:00", "David Blaine, American magician"], ["1973-04-04T00:00:00", "Loris Capirossi, Italian motorcycle racer"], ["1973-04-05T00:00:00", "Elodie Bouchez, French actress"], ["1973-04-05T00:00:00", "Cho Sung-min, South Korean baseball pitcher (d. 2013)"], ["1973-04-05T00:00:00", "Pharrell Williams, American musician and producer (The Neptunes)"], ["1973-04-06T00:00:00", "Rie Miyazawa, Japanese actress and singer"], ["1973-04-06T00:00:00", "Lori Heuring, American actress"], ["1973-04-08T00:00:00", "Emma Caulfield, American actress"], ["1973-04-12T00:00:00", "Amr Waked, Egyptian film, television, and stage actor"], ["1973-04-21T00:00:00", "Katsuyuki Konishi, Japanese voice actor"], ["1973-04-24T00:00:00", "Sachin Tendulkar, Indian cricketer"], ["1973-04-24T00:00:00", "Lee Westwood, English golfer"], ["1973-04-28T00:00:00", "Melissa Fahn, American actress"], ["1973-04-28T00:00:00", "Elisabeth Röhm, German-American actress"], ["1973-04-29T00:00:00", "David Belle, French actor"], ["1973-04-30T00:00:00", "Jeff Timmons, American singer"], ["1973-05-01T00:00:00", "Paul Burke, Irish rugby player"], ["1973-05-01T00:00:00", "Diana Hayden, former Miss World and Indian actress"], ["1973-05-01T00:00:00", "Oliver Neuville, German footballer"], ["1973-05-03T00:00:00", "Brad Martin, American musician"], ["1973-05-03T00:00:00", "Michael Reiziger, Dutch footballer"], ["1973-05-08T00:00:00", "Hiromu Arakawa, Japanese manga artist"], ["1973-05-08T00:00:00", "Marcus Brigstocke, British comedian"], ["1973-05-10T00:00:00", "Gareth Ainsworth, English footballer"], ["1973-05-10T00:00:00", "Rüştü Reçber, Turkish football goalkeeper"], ["1973-05-14T00:00:00", "Natalie Appleton, Canadian singer (All Saints)"], ["1973-05-14T00:00:00", "Shanice, African-American singer"], ["1973-05-16T00:00:00", "Jason Acuna, American skateboarder and actor"], ["1973-05-16T00:00:00", "Tori Spelling, American actress"], ["1973-05-16T00:00:00", "Kōsuke Toriumi, Japanese voice actor"], ["1973-05-16T00:00:00", "Muna AbuSulayman, Influential Arab and Muslim Media personality"], ["1973-05-17T00:00:00", "Sasha Alexander, American actress"], ["1973-05-17T00:00:00", "Joshua Homme, American musician"], ["1973-05-17T00:00:00", "Tamsier Joof, British dancer, choreographer and entrepreneur (of Senegalese and Gambian descent)"], ["1973-05-24T00:00:00", "Dermot O'Leary, British TV presenter"], ["1973-05-24T00:00:00", "Ruslana, Ukrainian pop star, activist, Eurovision Song Contest 2004 winner"], ["1973-05-25T00:00:00", "Jean-Pierre Canlis, American glass artist"], ["1973-05-25T00:00:00", "Demetri Martin, American comedian"], ["1973-05-31T00:00:00", "Cadaveria, Italian singer (Opera IX)"], ["1973-05-31T00:00:00", "Dominique van Roost, Belgian tennis player"], ["1973-06-01T00:00:00", "Fred Deburghgraeve, Belgian swimmer"], ["1973-06-01T00:00:00", "Heidi Klum, German model"], ["1973-06-01T00:00:00", "Derek Lowe, American baseball player"], ["1973-06-01T00:00:00", "Adam Garcia, Australian actor and singer"], ["1973-06-12T00:00:00", "Mitsuki Saiga, Japanese voice actress"], ["1973-06-12T00:00:00", "Darryl White, Australian footballer"], ["1973-06-13T00:00:00", "Sam Adams, American football player"], ["1973-06-13T00:00:00", "Cheryl \"Coko\" Clemons, African-American singer (SWV)"], ["1973-06-15T00:00:00", "Neil Patrick Harris, American actor, singer, presenter, host"], ["1973-06-15T00:00:00", "Greg Vaughan, American actor"], ["1973-06-23T00:00:00", "Marie N, Latvian singer, Eurovision Song Contest 2002 winner"], ["1973-06-30T00:00:00", "Chan Ho Park, Korean Major League Baseball player"], ["1973-06-30T00:00:00", "Robert Bales, former United States Army staff-sergeant and suspect of the Kandahar massacre"], ["1973-07-15T00:00:00", "John Dolmayan, Lebanese-born rock drummer for the band System of a Down"], ["1973-07-15T00:00:00", "Brian Austin Green, American actor"], ["1973-07-16T00:00:00", "Stefano Garzelli, Italian professional road racing cyclist"], ["1973-07-16T00:00:00", "Graham Robertson, American filmmaker and author"], ["1973-07-17T00:00:00", "Eric Moulds, American football player"], ["1973-07-17T00:00:00", "Liam Kyle Sullivan, American comedian"], ["1973-07-20T00:00:00", "Peter Forsberg, Swedish hockey player"], ["1973-07-20T00:00:00", "HRH Crown Prince Haakon of Norway"], ["1973-07-22T00:00:00", "Daniel Jones, Australian musician and record producer"], ["1973-07-22T00:00:00", "Rufus Wainwright, American-Canadian musician"], ["1973-07-23T00:00:00", "Omar Epps, African-American actor"], ["1973-07-23T00:00:00", "Nomar Garciaparra, American baseball player"], ["1973-07-23T00:00:00", "Monica Lewinsky, American former White House intern"], ["1973-07-25T00:00:00", "Kevin Phillips, English footballer"], ["1973-07-25T00:00:00", "Tony Vincent, American actor and singer"], ["1973-07-30T00:00:00", "Markus Näslund, Swedish ice hockey player"], ["1973-07-30T00:00:00", "Sonu Nigam, Indian singer"], ["1973-07-31T00:00:00", "Jacob Aagaard, Danish-Scottish chess player"], ["1973-08-02T00:00:00", "Miguel Mendonca, Anglo-Azorean writer"], ["1973-08-02T00:00:00", "Susie O'Neill, Australian swimmer"], ["1973-08-06T00:00:00", "Asia Carrera, American actress"], ["1973-08-06T00:00:00", "Vera Farmiga, American actress"], ["1973-08-08T00:00:00", "Jessica Calvello, American voice actress"], ["1973-08-09T00:00:00", "Filippo Inzaghi, Italian footballer"], ["1973-08-09T00:00:00", "Oleksandr Ponomaryov, Ukrainian singer"], ["1973-08-13T00:00:00", "Ryoko Shinohara, Japanese actress"], ["1973-08-14T00:00:00", "Jared Borgetti, Mexican footballer"], ["1973-08-14T00:00:00", "Jay-Jay Okocha, Nigerian soccer player (footballer)"], ["1973-08-14T00:00:00", "Kieren Perkins, Australian swimmer"], ["1973-08-18T00:00:00", "Victoria Coren, British writer, presenter and professional poker player"], ["1973-08-19T00:00:00", "HRH Crown Princess Mette-Marit of Norway"], ["1973-08-19T00:00:00", "Marco Materazzi, Italian football player"], ["1973-08-21T00:00:00", "Sergey Brin, Soviet-born American entrepreneur, co-founder of Google"], ["1973-08-21T00:00:00", "Steve McKenna, hockey player"], ["1973-08-21T00:00:00", "Nikolai Valuev, Russian heavyweight boxing champion"], ["1973-08-22T00:00:00", "Howie Dorough, American singer (Backstreet Boys)"], ["1973-08-22T00:00:00", "Kristen Wiig, American actress and comedian"], ["1973-08-24T00:00:00", "Dave Brown, English comedian"], ["1973-08-24T00:00:00", "Inge de Bruijn, Dutch swimmer"], ["1973-08-24T00:00:00", "Dave Chappelle, African-American actor, comedian"], ["1973-08-24T00:00:00", "Carmine Giovinazzo, American actor"], ["1973-08-24T00:00:00", "Grey DeLisle, voice actress"], ["1973-09-04T00:00:00", "Jason David Frank, American actor and martial artist"], ["1973-09-04T00:00:00", "Diobelys Hurtado, Cuban boxer"], ["1973-09-06T00:00:00", "Carlo Cudicini, Italian footballer"], ["1973-09-06T00:00:00", "Greg Rusedski, Canadian-British tennis player"], ["1973-09-12T00:00:00", "Darren Campbell, British athlete"], ["1973-09-12T00:00:00", "Paul Walker, American actor (d. 2013)"], ["1973-09-14T00:00:00", "Andrew Lincoln, British actor"], ["1973-09-14T00:00:00", "Nas, African-American rapper"], ["1973-09-15T00:00:00", "Indira Levak, Croatian lead vocalist of Colonia"], ["1973-09-15T00:00:00", "Julie Cox, English actress"], ["1973-09-15T00:00:00", "Prince Daniel, Duke of Västergötland, né Olof Daniel Westling, Swedish prince, married to Crown Princess Victoria"], ["1973-09-18T00:00:00", "Paul Brousseau, Canadian ice hockey player"], ["1973-09-19T00:00:00", "José Azevedo, Portuguese cyclist"], ["1973-09-19T00:00:00", "David Zepeda, Mexican actor, model and singer"], ["1973-09-22T00:00:00", "Craig McRae, Australian footballer"], ["1973-09-22T00:00:00", "Yoo Chae-yeong, South Korean singer and actress"], ["1973-09-29T00:00:00", "Alfie Boe, English tenor"], ["1973-09-29T00:00:00", "Joe Hulbig, American ice hockey player"], ["1973-10-02T00:00:00", "Melissa Harris-Perry, African-American political commentator"], ["1973-10-02T00:00:00", "Lene Nystrøm, Norwegian singer (Aqua)"], ["1973-10-02T00:00:00", "Verka Serduchka, Ukrainian Drag queen, comedian and singer, Eurovision Song Contest 2007 runner-up"], ["1973-10-03T00:00:00", "Neve Campbell, Canadian actress"], ["1973-10-03T00:00:00", "Richard Ian Cox, Welsh voice actor and radio host"], ["1973-10-09T00:00:00", "Steve Burns, Blues Clues actor"], ["1973-10-09T00:00:00", "Fabio Lione, Italian singer"], ["1973-10-11T00:00:00", "Takeshi Kaneshiro, Taiwanese/Japanese actor"], ["1973-10-11T00:00:00", "Daisuke Sakaguchi, Japanese voice actor"], ["1973-10-13T00:00:00", "Matt Hughes, American mixed martial arts fighter"], ["1973-10-13T00:00:00", "Nanako Matsushima, Japanese actress"], ["1973-10-15T00:00:00", "Susy Pryde, New Zealand cyclist"], ["1973-10-15T00:00:00", "Dax Riggs, American musician"], ["1973-10-18T00:00:00", "Rachel Nichols, American sports journalist"], ["1973-10-18T00:00:00", "Alex Tagliani, Canadian race car driver"], ["1973-10-25T00:00:00", "Lamont Bentley, American actor (d. 2005)"], ["1973-10-25T00:00:00", "Maxi Mounds, American female stripper"], ["1973-10-26T00:00:00", "Seth MacFarlane, American animator and voice actor"], ["1973-10-26T00:00:00", "Taka Michinoku, Japanese professional wrestler"], ["1973-10-30T00:00:00", "Adam Copeland, retired Canadian professional wrestler and 4-time WWE Champion"], ["1973-10-30T00:00:00", "Silvia Corzo, Colombian newsreader"], ["1973-11-01T00:00:00", "Assia, Algerian singer"], ["1973-11-01T00:00:00", "Li Xiaoshuang, Chinese gymnast"], ["1973-11-01T00:00:00", "Aishwarya Rai, Indian actress, Miss World 1994"], ["1973-11-05T00:00:00", "Johnny Damon, baseball player"], ["1973-11-05T00:00:00", "Peter Emmerich, American illustrator"], ["1973-11-06T00:00:00", "Rumi Shishido, Japanese voice actress and singer"], ["1973-11-09T00:00:00", "Alyson Court, Canadian actress (The Big Comfy Couch)"], ["1973-11-09T00:00:00", "Nick Lachey, American singer (98 Degrees)"], ["1973-11-09T00:00:00", "Maija Vilkkumaa, Finnish pop rock singer"], ["1973-11-10T00:00:00", "Jacqui Abbott, English singer (The Beautiful South)"], ["1973-11-10T00:00:00", "Róbert Gulya, Hungarian composer"], ["1973-11-14T00:00:00", "Lawyer Milloy, American football player"], ["1973-11-14T00:00:00", "Dana Snyder, American voice actor"], ["1973-11-19T00:00:00", "Billy Currington, American country singer"], ["1973-11-28T00:00:00", "Rob Conway, American professional wrestler"], ["1973-11-28T00:00:00", "Jade Puget, American guitarist (AFI)"], ["1973-11-29T00:00:00", "Ryan Giggs, Welsh footballer"], ["1973-11-29T00:00:00", "Raphael Smith, South African screenwriter and songwriter"], ["1973-11-30T00:00:00", "Im Chang-jung, South Korean actor"], ["1973-11-30T00:00:00", "Jason Reso, Canadian professional wrestler"], ["1973-12-02T00:00:00", "Monica Seles, Yugoslavian-born tennis player"], ["1973-12-02T00:00:00", "Jan Ullrich, German professional road bicycle racer"], ["1973-12-04T00:00:00", "Tyra Banks, African American supermodel, talk show host"], ["1973-12-04T00:00:00", "Steven Menzies, Australian rugby league player"], ["1973-12-04T00:00:00", "Michael Jackson, former English football defender"], ["1973-12-05T00:00:00", "Mikelangelo Loconte, Italian singer"], ["1973-12-07T00:00:00", "Terrell Owens, American football player"], ["1973-12-07T00:00:00", "Damien Rice, Irish singer-songwriter, musician and record producer"], ["1973-12-14T00:00:00", "Tomasz Radzinski, Canadian footballer"], ["1973-12-14T00:00:00", "Thuy Trang, Vietnamese-born actress (d. 2001)"], ["1973-12-24T00:00:00", "Stephenie Meyer, American novelist"], ["1973-12-24T00:00:00", "Kerry Nettle, Australian politician"], ["1973-12-25T00:00:00", "Shalom Harlow, Canadian model and actress"], ["1973-12-25T00:00:00", "Chris Harris, American professional wrestler"], ["1973-12-27T00:00:00", "Wilson Cruz, American actor"], ["1973-12-27T00:00:00", "Kristoffer Zegers, Dutch composer"], ["1973-12-28T00:00:00", "Seth Meyers, American actor and comedian"], ["1973-12-28T00:00:00", "Ids Postma, Dutch speed skater"], ["1973-12-29T00:00:00", "Theo Epstein, American baseball general manager"], ["1973-12-29T00:00:00", "Pimp C, American rap artist"], ["1973-12-30T00:00:00", "Jason Behr, American actor"], ["1973-12-30T00:00:00", "Ato Boldon, West Indian athlete"], ["1973-01-01T00:00:00", "Sir Arthur Elton, pioneer of the British documentary film industry (b. 1906)"], ["1973-01-01T00:00:00", "Sergei Kourdakov, former KGB agent (b. 1951)"], ["1973-01-12T00:00:00", "Turk Edwards, American football player (Washington Redskins) and a member of the Pro Football Hall of Fame (b. 1907)"], ["1973-01-17T00:00:00", "Herbert D. Riley, United States Navy admiral (b. 1904)"], ["1973-02-15T00:00:00", "Wally Cox, American actor (b. 1924)"], ["1973-02-15T00:00:00", "Tim Holt, American actor (b. 1919)"], ["1973-02-22T00:00:00", "Elizabeth Bowen, Irish novelist (b. 1899)"], ["1973-02-22T00:00:00", "Katina Paxinou, Greek actress (b. 1900)"], ["1973-03-14T00:00:00", "Rafael Godoy, Colombian composer (b. 1907)"], ["1973-03-14T00:00:00", "Chic Young, American cartoonist (b. 1901)"], ["1973-03-18T00:00:00", "Johannes Aavik, Estonian philologist (b. 1880)"], ["1973-03-18T00:00:00", "Lauritz Melchior, Danish opera singer (b. 1890)"], ["1973-03-26T00:00:00", "Safford Cape, American composer and musicologist (b. 1906)"], ["1973-03-26T00:00:00", "Sir Noël Coward, English composer and playwright (b. 1899)"], ["1973-03-26T00:00:00", "George Sisler, American baseball player (St. Louis Browns) and a member of the MLB Hall of Fame (b. 1893)"], ["1973-04-12T00:00:00", "Henry Darger, reclusive American outsider artist (b.1892)"], ["1973-04-12T00:00:00", "Arthur Freed, American film producer (b. 1894)"], ["1973-04-16T00:00:00", "Nino Bravo, singer (b. 1944)"], ["1973-04-16T00:00:00", "Istvan Kertesz, Hungarian conductor (b. 1929)"], ["1973-04-21T00:00:00", "Merian C. Cooper, American aviator, director, and producer (b. 1893)"], ["1973-04-21T00:00:00", "Arthur Fadden, 13th Prime Minister of Australia (b. 1894)"], ["1973-05-18T00:00:00", "Dieudonné Costes, French aviator (b. 1892)"], ["1973-05-18T00:00:00", "Jeannette Rankin, first U.S. Congresswoman (b. 1880)"], ["1973-06-30T00:00:00", "Nancy Mitford, English novelist (b. 1904)"], ["1973-06-30T00:00:00", "Blessed Vasyl Velychkovsky C.Ss.R, Ukrainian Catholic bishop and martyr (b. 1903)"], ["1973-07-02T00:00:00", "Betty Grable, American actress (b. 1916)"], ["1973-07-02T00:00:00", "Chick Hafey, American baseball player (St. Louis Cardinals) and a member of the MLB Hall of Fame (b. 1903)"], ["1973-07-02T00:00:00", "George Macready, American actor (b. 1899)"], ["1973-07-02T00:00:00", "Swede Savage, American race car driver (b. 1946)"], ["1973-07-06T00:00:00", "Joe E. Brown, American actor (b. 1892)"], ["1973-07-06T00:00:00", "Otto Klemperer, German-born conductor (b. 1885)"], ["1973-07-07T00:00:00", "Max Horkheimer, German philosopher and sociologist (b. 1895)"], ["1973-07-07T00:00:00", "Veronica Lake, American actress (b. 1922)"], ["1973-07-08T00:00:00", "Arthur Calwell, Australian labor politician (b. 1896)"], ["1973-07-08T00:00:00", "Ben-Zion Dinur, Russian-born Israeli educator, historian and politician (b. 1884)"], ["1973-07-08T00:00:00", "Wilfred Rhodes, English cricketer (b. 1877)"], ["1973-07-11T00:00:00", "Alexander Mosolov, Russian composer (b. 1900)"], ["1973-07-11T00:00:00", "Robert Ryan, American actor (b. 1909)"], ["1973-07-20T00:00:00", "Bruce Lee, Chinese-American martial artist and actor (b. 1940)"], ["1973-07-20T00:00:00", "Robert Smithson, American artist (b. 1938)"], ["1973-07-25T00:00:00", "Louis St. Laurent, 12th Prime Minister of Canada (b. 1882)"], ["1973-07-29T00:00:00", "Henri Charrière, French writer (b. 1906)"], ["1973-07-29T00:00:00", "Roger Williamson, British race car driver (b. 1948)"], ["1973-08-01T00:00:00", "Gian Francesco Malipiero, Italian composer (b. 1882)"], ["1973-08-01T00:00:00", "Walter Ulbricht, East German leader (b. 1893)"], ["1973-08-06T00:00:00", "Fulgencio Batista, Cuban dictator (b. 1901)"], ["1973-08-06T00:00:00", "James Beck, British actor (b. 1929)"], ["1973-08-12T00:00:00", "Dayanand Bandodkar, Chief Minister of Goa (b. 1911)"], ["1973-08-12T00:00:00", "Walter Rudolf Hess, Swiss physiologist, Nobel Prize laureate (b. 1881)"], ["1973-08-13T00:00:00", "Willy Rey, American model (b. 1949)"], ["1973-08-16T00:00:00", "Veda Ann Borg, American actress (b. 1915)"], ["1973-08-16T00:00:00", "Selman Waksman, Ukrainian-born biochemist, recipient of the Nobel Prize in Physiology or Medicine (b. 1888)"], ["1973-08-17T00:00:00", "Conrad Aiken, American writer (b. 1889)"], ["1973-08-17T00:00:00", "Jean Barraqué, French composer (b. 1928)"], ["1973-08-17T00:00:00", "Paul Williams, American singer (The Temptations) (b. 1939)"], ["1973-08-27T00:00:00", "Tol Avery, American actor (b. 1915)"], ["1973-09-02T00:00:00", "Diana Sands, American actress (b. 1934)"], ["1973-09-02T00:00:00", "J. R. R. Tolkien, British writer (b. 1892)"], ["1973-09-13T00:00:00", "Betty Field, American actress (b. 1913)"], ["1973-09-13T00:00:00", "Sajjad Zaheer, Urdu writer and revolutionary (b. 1905)"], ["1973-09-15T00:00:00", "King Gustaf VI Adolf of Sweden (b. 1882)"], ["1973-09-15T00:00:00", "Victor Jara, Chilean politician and singer-songwriter (b. 1932)"], ["1973-09-20T00:00:00", "Jim Croce, American songwriter (b. 1943)"], ["1973-09-20T00:00:00", "Glenn Strange, American actor (b. 1899)"], ["1973-09-26T00:00:00", "Ralph Earnhardt, American race car driver (b. 1928)"], ["1973-09-26T00:00:00", "Anna Magnani, Italian actress (b. 1908)"], ["1973-10-02T00:00:00", "Paul Hartman, American dancer and actor (b. 1904)"], ["1973-10-02T00:00:00", "Paavo Nurmi, Finnish runner (b. 1897)"], ["1973-10-06T00:00:00", "Sidney Blackmer, American actor (b. 1895)"], ["1973-10-06T00:00:00", "François Cevert, French race car driver (b. 1944)"], ["1973-10-14T00:00:00", "Edmund A. Chester, American broadcaster and journalist (b. 1897)"], ["1973-10-14T00:00:00", "Ahmed Hamdi, Egyptian general who fought in Yom Kippur (b. 1929)"], ["1973-10-18T00:00:00", "Walt Kelly, American cartoonist (b. 1913)"], ["1973-10-18T00:00:00", "Crane Wilbur, American actor (b. 1886)"], ["1973-11-23T00:00:00", "Sessue Hayakawa, Japanese-American actor (b. 1889)"], ["1973-11-23T00:00:00", "Constance Talmadge, American actress (b. 1897)"], ["1973-12-20T00:00:00", "Luis Carrero Blanco, first minister of Spain (assassinated) (b. 1904)"], ["1973-12-20T00:00:00", "Bobby Darin, American singer, songwriter, musician, actor, dancer, impressionist and TV presenter (b. 1936)"], ["1973-12-25T00:00:00", "İsmet İnönü, Turkish general, later Prime Minister, President (b. 1884)"], ["1973-12-25T00:00:00", "Adrian Scott, American screenwriter, one of the Hollywood Ten (b. 1912)"], ["1973-12-25T00:00:00", "Gabriel Voisin, French aviation pioneer (b. 1880)"], ["1973-12-26T00:00:00", "William Haines, American actor (b. 1900)"], ["1973-12-26T00:00:00", "Harold B. Lee, American president of The Church of Jesus Christ of Latter-day Saints (b. 1899)"]]