[["1901-01-01T00:00:00", "The world celebrates the beginning of the 20th century."], ["1901-01-01T00:00:00", "The British colonies of New South Wales, Queensland, South Australia, Tasmania, Victoria and Western Australia federate as the Commonwealth of Australia. Edmund Barton becomes first Prime Minister of Australia."], ["1901-01-01T00:00:00", "Nigeria becomes a British protectorate."], ["1901-01-01T00:00:00", "The birth of Pentecostalism at a prayer meeting at Bethel Bible College in Topeka, Kansas."], ["1901-01-05T00:00:00", "Typhoid fever breaks out in a Seattle jail, the first of two typhoid outbreaks in the USA during the year."], ["1901-01-07T00:00:00", "Alferd Packer is released from prison after serving 18 years for cannibalism."], ["1901-01-09T00:00:00", "Lord Kitchener reports that Christiaan de Wet has shot one of the \"peace\" envoys, and flogged two more, who had gone to his commando to ask the Burgher citizens of South Africa to halt fighting."], ["1901-01-10T00:00:00", "In the first great Texas gusher, oil is discovered at Spindletop in Beaumont, Texas."], ["1901-01-22T00:00:00", "Queen Victoria of the United Kingdom dies at age 81, after more than 63 years on the throne, and her son the Prince of Wales formally succeeds her as King Edward VII."], ["1901-01-22T00:00:00", "The Grand Opera House in Cincinnati is destroyed in a fire."], ["1901-01-28T00:00:00", "Baseball's American League declares itself a Major League."], ["1901-02-02T00:00:00", "Funeral of Queen Victoria at St George's Chapel, Windsor Castle."], ["1901-02-05T00:00:00", "Hay-Pauncefote Treaty signed by United Kingdom and United States, ceding control of the Panama Canal to the United States."], ["1901-02-05T00:00:00", "J. P. Morgan buys mines and steel mills in the United States, marking the first billion dollar business deal."], ["1901-02-05T00:00:00", "In Evansville, Indiana, a fire burns through the business district, causing $175,000 of damage."], ["1901-02-06T00:00:00", "First public telephones at railway stations in Paris."], ["1901-02-11T00:00:00", "Anti-Jesuit riots sweep across Spain."], ["1901-02-12T00:00:00", "Viceroy of India Lord Curzon creates the new North-West Frontier Province in the north of the Punjab region, bordering Afghanistan."], ["1901-02-14T00:00:00", "Edward VII opens his first parliament of the United Kingdom."], ["1901-02-15T00:00:00", "The Alianza Lima Foundation is created in Peru."], ["1901-02-20T00:00:00", "The Hawaii Territory Legislature convenes for the first time."], ["1901-02-22T00:00:00", "The Pacific Mail Steamship Company's SS City of Rio de Janeiro sinks entering San Francisco Bay, killing 128."], ["1901-02-23T00:00:00", "The United Kingdom and Germany agree the frontier between German East Africa and the British colony of Nyasaland."], ["1901-02-25T00:00:00", "U.S. Steel is incorporated by industrialist J. P. Morgan as the first billion-dollar corporation."], ["1901-02-26T00:00:00", "Chi-hsui and Hsu-cheng-yu, Boxer Rebellion leaders, executed in Peking."], ["1901-02-26T00:00:00", "The Middelburg peace conference fails in South Africa as Boers continue to demand autonomy."], ["1901-02-27T00:00:00", "The Sultan of Turkey orders 50,000 troops to the Bulgarian frontier because of unrest in Macedonia"], ["1901-03-01T00:00:00", "The United Kingdom, Germany and Japan protest at the Sino-Russian agreement on Manchuria."], ["1901-03-01T00:00:00", "1901 Census of India taken, the fourth, and first reliable, census of the British Raj."], ["1901-03-02T00:00:00", "The United States Congress passes the Platt Amendment, limiting the autonomy of Cuba as a condition for the withdrawal of American troops."], ["1901-03-04T00:00:00", "President of the United States William McKinley begins his second term. Theodore Roosevelt becomes Vice President of the United States."], ["1901-03-05T00:00:00", "Irish nationalist demonstrators are ejected by police from House of Commons of the United Kingdom in London."], ["1901-03-06T00:00:00", "In Bremen, an assassination attempt is made on Wilhelm II, German Emperor."], ["1901-03-11T00:00:00", "The United Kingdom rejects the amended Hay-Pauncefote Treaty."], ["1901-03-13T00:00:00", "Benjamin Harrison, 23rd president of the United States, dies of pneumonia at age 67."], ["1901-03-17T00:00:00", "A showing of 71 Vincent van Gogh paintings in Paris, 11 years after his death, creates a sensation."], ["1901-03-17T00:00:00", "Student riots in Saint Petersburg and Moscow."], ["1901-03-18T00:00:00", "Patrick Donahoe, businessman and publisher of the Boston Catholic newspaper The Pilot, dies aged 90."], ["1901-03-31T00:00:00", "1901 Black Sea earthquake of 7.2 on the moment magnitude scale."], ["1901-03-31T00:00:00", "The United Kingdom Census 1901 is taken. The number of people employed in manufacturing is at its highest-ever level."], ["1901-04-25T00:00:00", "New York becomes the first US state to require automobile license plates."], ["1901-04-29T00:00:00", "Anti-Jewish rioting breaks out in Budapest."], ["1901-05-03T00:00:00", "The Great Fire of 1901 begins in Jacksonville, Florida."], ["1901-05-05T00:00:00", "The Caste War of Yucatán in Mexico officially ends, although Mayan skirmishers continue sporadic fighting for another decade."], ["1901-05-09T00:00:00", "The first Australian Parliament opens in Melbourne."], ["1901-05-17T00:00:00", "Panic of 1901: The New York Stock Exchange crashes."], ["1901-05-24T00:00:00", "81 miners are killed in an accident at Universal Colliery, Senghenydd in South Wales."], ["1901-05-25T00:00:00", "The Club Atlético River Plate is founded in Argentina."], ["1901-05-27T00:00:00", "In New Jersey, the Edison Storage Battery Company is founded."], ["1901-05-28T00:00:00", "Persia grants William Knox D'Arcy a concession, giving him the right to prospect for oil."], ["1901-06-02T00:00:00", "Katsura Tarō becomes Prime Minister of Japan."], ["1901-06-12T00:00:00", "Cuba becomes a United States protectorate."], ["1901-06-15T00:00:00", "RMS Lucania is the first Cunard Line ship to receive a wireless radio set."], ["1901-07-01T00:00:00", "The first United Kingdom Fingerprint Bureau is established at Scotland Yard, the Metropolitan Police headquarters in London, by Edward Henry."], ["1901-07-01T00:00:00", "Bureau of Chemistry established within the United States Department of Agriculture."], ["1901-07-04T00:00:00", "The 1,282 foot (390 m) covered bridge crossing the Saint John River at Hartland, New Brunswick, Canada opens. It is the longest covered bridge in the world."], ["1901-07-04T00:00:00", "William Howard Taft becomes Governor-General of the Philippines."], ["1901-07-10T00:00:00", "The world's first passenger-carrying trolleybus in regular service operates on the Biela Valley Trolleybus route at Koeninggstein in Germany."], ["1901-07-24T00:00:00", "O. Henry is released from prison in Columbus, Ohio after serving three years for embezzlement from the First National Bank in Austin, Texas."], ["1901-08-05T00:00:00", "Peter O'Connor sets the first International Association of Athletics Federations recognised long jump world record of 24 ft 11¾ins. The record will stand for 20 years."], ["1901-08-06T00:00:00", "Discovery Expedition: Robert Falcon Scott sets sail on the RRS Discovery to explore the Ross Sea in Antarctica."], ["1901-08-14T00:00:00", "The first claimed powered flight, by Gustave Whitehead in his Number 21."], ["1901-08-21T00:00:00", "The International Secretariat of National Trade Union Centres is founded in Copenhagen."], ["1901-08-28T00:00:00", "Silliman University is founded in the Philippines, the first American private school in the country."], ["1901-08-30T00:00:00", "Hubert Cecil Booth patents an electric vacuum cleaner in the United Kingdom."], ["1901-09-02T00:00:00", "Vice President of the United States Theodore Roosevelt utters the famous phrase, \"Speak softly and carry a big stick\" at the Minnesota State Fair."], ["1901-09-05T00:00:00", "The National Association of Professional Baseball Leagues (later renamed Minor League Baseball), is formed in Chicago."], ["1901-09-06T00:00:00", "William McKinley assassination: American anarchist Leon Czolgosz shoots U.S. President William McKinley at the Pan-American Exposition in Buffalo, New York. McKinley dies 8 days later."], ["1901-09-07T00:00:00", "The Boxer Rebellion in China officially ends with the signing of the Boxer Protocol."], ["1901-09-14T00:00:00", "Vice President Theodore Roosevelt succeeds William McKinley as President of the United States, upon McKinley's death."], ["1901-09-26T00:00:00", "The body of U.S. President Abraham Lincoln is exhumed and reinterred in concrete several feet thick."], ["1901-09-28T00:00:00", "Philippine-American War: Balangiga massacre: Filipino guerrillas kill more than forty United States soldiers in a surprise attack in the town of Balangiga on Samar Island."], ["1901-10-02T00:00:00", "The British Royal Navy's first submarine, Holland 1, is launched at Barrow-in-Furness."], ["1901-10-04T00:00:00", "The American yacht Columbia defeats the British Shamrock in the America's Cup yachting race."], ["1901-10-16T00:00:00", "U.S. President Theodore Roosevelt invites African American leader Booker T. Washington to the White House. The American South reacts angrily to the visit, and racial violence increases in the region."], ["1901-10-23T00:00:00", "Yale University celebrates its bicentennial."], ["1901-10-24T00:00:00", "Michigan schoolteacher Annie Edson Taylor goes over Niagara Falls in a barrel and survives."], ["1901-10-29T00:00:00", "In Amherst, New York, nurse Jane Toppan is arrested for murdering the Davis family of Boston with an overdose of morphine."], ["1901-11-01T00:00:00", "Sigma Phi Epsilon is founded in Richmond, Virginia."], ["1901-11-09T00:00:00", "The Prince George, Duke of Cornwall (later George V) becomes Prince of Wales and Earl of Chester."], ["1901-11-15T00:00:00", "The Alpha Sigma Alpha Fraternity is founded at Longwood University in Farmville, Virginia."], ["1901-11-25T00:00:00", "Auguste Deter is first examined by German psychiatrist Dr Alois Alzheimer, leading to a diagnosis of the condition that will carry Alzheimer's name."], ["1901-11-28T00:00:00", "The new Constitution of Alabama requires voters in the state to have passed literacy tests."], ["1901-12-03T00:00:00", "U.S. President Theodore Roosevelt delivers a 20,000-word speech to the House of Representatives asking Congress to curb the power of trusts \"within reasonable limits\"."], ["1901-12-10T00:00:00", "The first Nobel Prize ceremony is held in Stockholm on the fifth anniversary of Alfred Nobel's death."], ["1901-12-12T00:00:00", "Guglielmo Marconi receives the first trans-Atlantic radio signal, sent from Poldhu in England to Newfoundland, Canada; it is the letter \"S\" in Morse."], ["1901-12-20T00:00:00", "The final spike is driven into the Mombasa-Victoria-Uganda Railway in what is now Kisumu, Kenya."], ["1901-12-22T00:00:00", "Peace Sunday and Charles Aked, a Baptist minister in Liverpool, says about the war in South Africa: \"Great Britain cannot win the battles without resorting to the last despicable cowardice of the most loathsome cur on earth — the act of striking a brave man's heart through his wife's honour and his child's life. The cowardly war has been conducted by methods of barbarism... the concentration camps have been Murder Camps.\" A crowd follows him home and breaks the windows of his house."]]