[["1934-01-01T00:00:00", "International Telecommunication Union established."], ["1934-01-07T00:00:00", "The Flash Gordon comic strip is first published, in the United States."], ["1934-01-20T00:00:00", "The Japanese company Fuji Photo Film is established."], ["1934-01-26T00:00:00", "The 10 year German-Polish Non-Aggression Pact is signed by Nazi Germany and the Second Polish Republic."], ["1934-01-30T00:00:00", "In Nazi Germany the political power of the federal states such as Prussia is substantially abolished by the \"Law on the Reconstruction of the Reich\" (Gesetz über den Neuaufbau des Reiches)."], ["1934-02-06T00:00:00", "French political crisis: The French far-right leagues rally in front of the Palais Bourbon in an attempted coup d'état against the Third Republic."], ["1934-02-09T00:00:00", "Gaston Doumergue forms a new government in France."], ["1934-02-09T00:00:00", "Greece, Romania, Turkey and Yugoslavia form the Balkan Pact."], ["1934-02-16T00:00:00", "Commission of Government sworn in as form of direct rule for the Dominion of Newfoundland."], ["1934-02-21T00:00:00", "Augusto César Sandino is assassinated in Managua by the National Guard."], ["1934-03-01T00:00:00", "Manchuria becomes Manchukuo, following an invasion by the Japanese."], ["1934-03-12T00:00:00", "Konstantin Päts and General Johan Laidoner stage a coup in Estonia to neutralize the popular right wing Vaps Movement, starting the Era of Silence. Their actions are initially approved by the Riigikogu."], ["1934-03-20T00:00:00", "The Great Hakodate Fire kills at least 2,166 people in southern Hokkaido, Japan."], ["1934-03-24T00:00:00", "The Tydings-McDuffie Act is passed, allowing the Philippines a greater degree of self-government from the United States."], ["1934-04-06T00:00:00", "Rudyard Kipling and William Butler Yeats are awarded the Gothenburg Prize for Poetry."], ["1934-04-21T00:00:00", "Surgeon's Photograph: London gynaecologist Robert Kenneth Wilson takes a photograph of the Loch Ness Monster before being proven in 1994 it was an elaborate hoax."], ["1934-05-01T00:00:00", "The May Constitution of 1934 heralds the beginning of the Austrofascist Federal State of Austria."], ["1934-05-05T00:00:00", "The first Three Stooges short, Woman Haters, is released."], ["1934-05-15T00:00:00", "Kārlis Ulmanis establishes an authoritarian government in Latvia."], ["1934-05-19T00:00:00", "Kimon Georgiev stages a coup d'état in Bulgaria."], ["1934-05-28T00:00:00", "Near Callander, Ontario, the Dionne quintuplets are born to Oliva and Elzire Dionne, becoming the first quintuplets to survive infancy."], ["1934-06-10T00:00:00", "Italy beats Czechoslovakia 2-1 after extra time to win the 1934 World Cup."], ["1934-06-12T00:00:00", "Political parties are banned in Bulgaria."], ["1934-06-14T00:00:00", "Adolf Hitler and Benito Mussolini meet for the first time, at the Venice Biennale."], ["1934-06-18T00:00:00", "The Indian Reorganization Act is enacted."], ["1934-06-27T00:00:00", "The Emir of Yemen and ibn Saud of Saudi Arabia conclude a peace treaty."], ["1934-06-30T00:00:00", "The Nazi Party SA camp Oranienburg becomes a national camp, taken over by the Schutzstaffel (SS)."], ["1934-07-25T00:00:00", "Austrian Nazis assassinate chancellor Engelbert Dollfuss during a failed coup attempt."], ["1934-08-02T00:00:00", "Adolf Hitler becomes Führer of Germany, or head of state combined with that of Chancellor following the death of President Paul von Hindenburg."], ["1934-08-08T00:00:00", "The Wehrmacht swears a personal oath of loyalty to Adolf Hitler."], ["1934-08-19T00:00:00", "In a referendum, 90% of the German population approves of Hitler's assumption of presidential powers as Führer and Reichskanzler."], ["1934-09-08T00:00:00", "Off the New Jersey coast, a fire aboard the passenger liner SS Morro Castle kills 134 people."], ["1934-09-19T00:00:00", "The Soviet Union joins the League of Nations."], ["1934-09-19T00:00:00", "Bruno Richard Hauptmann is arrested in connection with the Lindbergh kidnapping case in the U.S."], ["1934-09-21T00:00:00", "A typhoon in Honshū, Japan kills 3,036 people, and destroys the temple, schools, and other buildings in Osaka."], ["1934-09-22T00:00:00", "A gas explosion at Gresford Colliery in Wrexham, north-east Wales, kills 266 miners and rescuers."], ["1934-09-28T00:00:00", "Afghanistan joins the League of Nations."], ["1934-10-02T00:00:00", "A tornado in Osaka and Kyoto kills 1,660, injures 5,400, and destroys the rice harvest."], ["1934-10-09T00:00:00", "King Alexander of Yugoslavia and French foreign minister Louis Barthou are assassinated during the king's state visit in Marseille."], ["1934-10-16T00:00:00", "The Long March of the People's Liberation Army of the Communist Party of China begins."], ["1934-10-20T00:00:00", "Start of MacRobertson Air Race from London to Melbourne"], ["1934-11-23T00:00:00", "An Anglo-Ethiopian boundary commission in the Ogaden discovers an Italian garrison at Walwal, which lays well within Ethiopian territory. This encounter leads to the Abyssinia Crisis."], ["1934-12-05T00:00:00", "Abyssinia Crisis: Ethiopian and Italian troops exchange gunfire. Reported casualties for the Ethiopians are 150, and for the Italians 50."], ["1934-12-27T00:00:00", "Persia becomes Iran."], ["1934-12-29T00:00:00", "Japan renounces the Washington Naval Treaty of 1922 and the London Naval Treaty of 1930."]]