[["1981-01-01T00:00:00", "Greece enters the European Community, which later becomes the European Union."], ["1981-01-01T00:00:00", "Palau becomes a self-governing territory."], ["1981-01-10T00:00:00", "Salvadoran Civil War: The FMLN launches its first major offensive, gaining control of most of Morazán and Chalatenango departments."], ["1981-01-15T00:00:00", "Pope John Paul II receives a delegation led by Solidarity leader Lech Wałęsa at the Vatican."], ["1981-01-16T00:00:00", "Loyalists shoot and seriously wound nationalist activist Bernadette Devlin McAliskey and her husband."], ["1981-01-17T00:00:00", "Philippine President Ferdinand Marcos lifts martial law."], ["1981-01-19T00:00:00", "United States and Iranian officials sign an agreement to release 52 American hostages after 14 months of captivity."], ["1981-01-20T00:00:00", "Iran releases the 52 Americans held for 444 days within minutes of Ronald Reagan succeeding Jimmy Carter as the 40th President of the United States, ending the Iran hostage crisis."], ["1981-01-21T00:00:00", "The first DeLorean DMC-12 automobile, a stainless steel sports car with gull-wing doors, rolls off the production line in Dunmurry, Northern Ireland."], ["1981-01-23T00:00:00", "An earthquake of 6.8 magnitude in Sichuan, China kills 150."], ["1981-01-25T00:00:00", "Jiang Qing (\"Madame Mao\") is sentenced to death in the People's Republic of China."], ["1981-01-25T00:00:00", "In South Africa the largest part of the town Laingsburg is swept away within minutes by one of the strongest floods ever experienced in the Great Karoo."], ["1981-01-27T00:00:00", "The Indonesian passenger ship Tamponas 2 catches fire and capsizes in the Java Sea, killing 580."], ["1981-02-04T00:00:00", "Gro Harlem Brundtland becomes Prime Minister of Norway."], ["1981-02-08T00:00:00", "20 fans of Olympiacos and 1 fan of AEK Athens die, while 54 are injured, after a stampede at the Karaiskakis Stadium in Piraeus, possibly because gate 7 does not open immediately after the end of the game."], ["1981-02-09T00:00:00", "Polish Prime Minister Józef Pińkowski resigns and is replaced by General Wojciech Jaruzelski."], ["1981-02-14T00:00:00", "Stardust fire: A fire at the Stardust nightclub in Artane, Dublin, Ireland in the early hours kills 48 people and injures 214."], ["1981-02-14T00:00:00", "Australia withdraws recognition of the Pol Pot regime in Cambodia."], ["1981-02-23T00:00:00", "Antonio Tejero, with members of the Guardia Civil, enters the Spanish Congress of Deputies and stops the session where Leopoldo Calvo-Sotelo is about to be named president of the government. The coup d'état fails thanks to King Juan Carlos."], ["1981-02-24T00:00:00", "A powerful, magnitude 6.7 earthquake hits Athens, killing 22 people, injuring 400 people and destroying several buildings and 4000 house, mostly in Corinth and the nearby towns of Loutraki, Kiato and Xylokastro."], ["1981-03-01T00:00:00", "Bobby Sands, a Provisional Irish Republican Army member, begins a hunger strike for political status in Long Kesh prison. He died May 5, the first of 10 men."], ["1981-03-11T00:00:00", "Chilean military dictator Augusto Pinochet is sworn in as President of Chile for another 8-year term."], ["1981-03-17T00:00:00", "In Italy the Propaganda Due Masonic Lodge is discovered."], ["1981-03-19T00:00:00", "Three workers are killed and 5 injured during a test of the Space Shuttle Columbia."], ["1981-03-29T00:00:00", "The first London Marathon starts with 7,500 runners."], ["1981-03-30T00:00:00", "U.S. President Ronald Reagan is shot in the chest outside a Washington, D.C. hotel by John Hinckley, Jr.; 2 police officers and Press Secretary James Brady are also wounded."], ["1981-04-01T00:00:00", "Daylight saving time is introduced in the Soviet Union."], ["1981-04-04T00:00:00", "The UK pop group Bucks Fizz wins the Eurovision Song Contest 1981 with the song, \"Making Your Mind Up\"."], ["1981-04-11T00:00:00", "1981 Brixton riot: Rioters in south London throw petrol bombs, attack police and loot shops."], ["1981-04-12T00:00:00", "The Space Shuttle program: Space Shuttle Columbia with NASA astronauts John Young and Robert Crippen launches on the STS-1 mission, returning to Earth on April 14. It is the first time a manned reusable spacecraft has returned from orbit."], ["1981-04-15T00:00:00", "The first Coca-Cola bottling plant in China is opened."], ["1981-04-18T00:00:00", "A Minor League Baseball game between the Rochester Red Wings and the Pawtucket Red Sox at McCoy Stadium in Pawtucket, Rhode Island, becomes the longest professional baseball game in history: 8 hours and 25 minutes/33 innings (the 33rd inning is not played until June 23)."], ["1981-04-18T00:00:00", "The rock band Yes splits up (regrouping in 1983)."], ["1981-04-26T00:00:00", "French presidential election: A first-round runoff results between Valéry Giscard d'Estaing and François Mitterrand."], ["1981-05-01T00:00:00", "The new Chilean pension system, based on private pension funds, begins."], ["1981-05-05T00:00:00", "Bobby Sands, Provisional Irish Republican Army volunteer and abstentionist Member of Parliament of the House of Commons, dies, aged 27, while on hunger strike in prison."], ["1981-05-06T00:00:00", "A jury of architects and sculptors unanimously selects Maya Lin's design for the Vietnam Veterans Memorial from 1,421 other entries."], ["1981-05-11T00:00:00", "Bob Marley, dies aged 36 from cancer."], ["1981-05-13T00:00:00", "Pope John Paul II is shot and nearly killed by Mehmet Ali Ağca, a Turkish gunman who is allegedly on orders from the Soviet KGB to shoot him, as he enters St. Peter's Square in Vatican City to address a general audience. The Pope successfully recovers."], ["1981-05-15T00:00:00", "Donna Payant is murdered by serial killer Lemuel Smith, the first time a female prison officer has been killed on-duty in the United States."], ["1981-05-21T00:00:00", "In France, Socialist François Mitterrand becomes President."], ["1981-05-22T00:00:00", "Peter Sutcliffe is found guilty of being the Yorkshire Ripper. He is sentenced to life imprisonment on 13 counts of murder and 7 of attempted murder."], ["1981-05-25T00:00:00", "In Riyadh, the Gulf Cooperation Council is created between Bahrain, Kuwait, Oman, Qatar, Saudi Arabia and the United Arab Emirates."], ["1981-05-26T00:00:00", "The Italian government resigns over its links to the fascist Masonic cell Propaganda Due."], ["1981-05-30T00:00:00", "Bangladesh President Ziaur Rahman is assassinated in Chittagong."], ["1981-05-31T00:00:00", "Burning of Jaffna library, was one of the most violent examples of ethnic biblioclasm of the 20th century."], ["1981-06-05T00:00:00", "The Centers for Disease Control and Prevention report that 5 homosexual men in Los Angeles have a rare form of pneumonia seen only in patients with weakened immune systems (the first recognized cases of AIDS)."], ["1981-06-06T00:00:00", "Bihar train disaster: Seven coaches of an overcrowded passenger train fall off the tracks into the Bagmati River in Bihar, India, killing between 500 and 800."], ["1981-06-07T00:00:00", "The Israeli Air Force destroys Iraq's Osirak nuclear reactor killing ten Iraqi troops and a French technician."], ["1981-06-12T00:00:00", "Indiana Jones and the Raiders of the Lost Ark is released in theaters."], ["1981-06-13T00:00:00", "At the Trooping the Colour ceremony in London, Marcus Sarjeant fires 6 blank shots at Elizabeth II."], ["1981-06-18T00:00:00", "The Organization of Eastern Caribbean States is founded."], ["1981-06-18T00:00:00", "The Lockheed F-117 Nighthawk Stealth Fighter makes its first flight at Groom Lake (Area 51), NV."], ["1981-06-22T00:00:00", "Iranian president Abolhassan Banisadr is deposed."], ["1981-06-27T00:00:00", "The first game of paintball is played in Henniker, New Hampshire."], ["1981-07-02T00:00:00", "The Wonderland Gang is brutally murdered in a massacre involving Eddie Nash."], ["1981-07-03T00:00:00", "The Toxteth riots in Liverpool, UK start after a mob saves a youth from being arrested. Shortly afterward, the Chapeltown riots in Leeds start after increased racial tension."], ["1981-07-07T00:00:00", "United States President Ronald Reagan nominates the first woman, Sandra Day O'Connor, to the Supreme Court of the United States."], ["1981-07-08T00:00:00", "Irish republican volunteer Joe McDonnell dies at the Long Kesh Internment Camp after a 61-day hunger strike."], ["1981-07-09T00:00:00", "Donkey Kong is released, marking the first Donkey Kong title and Mario title arcade smash hit game developed by Nintendo."], ["1981-07-10T00:00:00", "Mahathir bin Mohamad becomes the 4th Prime Minister of Malaysia."], ["1981-07-17T00:00:00", "Hyatt Regency walkway collapse: Two skywalks filled with people at the Hyatt Regency Hotel in Kansas City, Missouri collapse into a crowded atrium lobby, killing 114."], ["1981-07-17T00:00:00", "Israeli aircraft bomb Beirut, destroying multi-story apartment blocks containing the offices of PLO associated groups, killing approximately 300 civilians and resulting in worldwide condemnation and a U.S. embargo on the export of aircraft to Israel."], ["1981-07-17T00:00:00", "In Bolivia, General Luis Gracia Meza leads a bloody coup d'état against the elected government of Lidia Gayler."], ["1981-07-19T00:00:00", "The 1981 Springbok Tour commences in New Zealand, amid controversy over the support of apartheid."], ["1981-07-21T00:00:00", "Tohui The Panda is born in Chapultepec Zoo in Mexico City, the first panda to ever be born and survive in captivity outside of China."], ["1981-07-29T00:00:00", "A worldwide television audience of over 700 million people watch the Wedding of Charles, Prince of Wales, and Lady Diana Spencer at St Paul's Cathedral in London."], ["1981-08-01T00:00:00", "The first 24-hour video music channel MTV (Music Television) is launched."], ["1981-08-09T00:00:00", "Major League Baseball resumes from the strike with the All-Star Game in Cleveland's Municipal Stadium."], ["1981-08-12T00:00:00", "The original Model 5150 IBM PC (with a 4.77 MHz Intel 8088 processor) is released in the United States at a base price of $1,565."], ["1981-08-12T00:00:00", "Kiribati, Papua New Guinea, Nauru, Solomon Islands and Tuvalu recognize the Sahrawi Arab Democratic Republic (SADR)."], ["1981-08-19T00:00:00", "Gulf of Sidra incident (1981): Libyan leader Muammar Gaddafi sends two Sukhoi Su-22 fighter jets to intercept two U.S. fighters over the Gulf of Sidra. The American jets destroy the Libyan fighters."], ["1981-08-24T00:00:00", "Mark David Chapman is sentenced to 20 years to life in prison, after pleading guilty to murdering John Lennon in Manhattan 8 months earlier."], ["1981-08-28T00:00:00", "South African troops invade Angola."], ["1981-08-31T00:00:00", "A bomb explodes at the U.S. Air Force base in Ramstein, West Germany, injuring 20 people."], ["1981-09-01T00:00:00", "Gregorio Conrado Álvarez is inaugurated as a military de facto President of Uruguay."], ["1981-09-04T00:00:00", "An explosion at a mine in Záluží, Czechoslovakia, kills 65 people."], ["1981-09-08T00:00:00", "the first episode of the extremely popular British sitcom Only Fools and Horses, Big Brother is shown on BBC One."], ["1981-09-10T00:00:00", "Picasso's painting \"Guernica\" is moved from New York to Madrid."], ["1981-09-15T00:00:00", "The John Bull becomes the oldest operable steam locomotive in the world, at 150 years old, when it operates under its own power outside Washington, D.C."], ["1981-09-17T00:00:00", "Ric Flair defeats Dusty Rhodes to win his first World Heavyweight Wrestling Championship in Kansas City."], ["1981-09-18T00:00:00", "France abolishes capital punishment."], ["1981-09-19T00:00:00", "Simon & Garfunkel perform The Concert in Central Park, a free concert in New York in front of approximately half a million people."], ["1981-09-20T00:00:00", "The Brazilian river boat Sobral Santos capsizes in the Amazon River, Óbidos, Brazil, killing at least 300."], ["1981-09-21T00:00:00", "Belize gains independence from the United Kingdom."], ["1981-09-25T00:00:00", "Sandra Day O'Connor takes her seat as the first female justice of the U.S. Supreme Court."], ["1981-09-25T00:00:00", "The Rolling Stones begin their Tattoo You tour at JFK Stadium in Philadelphia."], ["1981-09-26T00:00:00", "The Boeing 767 airliner makes its first flight."], ["1981-09-26T00:00:00", "The Sydney Tower opens to the public."], ["1981-09-27T00:00:00", "TGV high-speed rail service between Paris and Lyon, France begins."], ["1981-09-28T00:00:00", "The British children's animated TV series Danger Mouse debuts on ITV."], ["1981-10-02T00:00:00", "English rock band The Police releases Ghost in the Machine."], ["1981-10-05T00:00:00", "Raoul Wallenberg becomes a posthumously honorary citizen of the United States."], ["1981-10-06T00:00:00", "Egyptian president Anwar Sadat is assassinated during a parade by army members who belong to the Egyptian Islamic Jihad organization led by Khalid Islambouli; they opposed his negotiations with Israel."], ["1981-10-10T00:00:00", "The Ministry for Education of Japan issues the jōyō kanji."], ["1981-10-14T00:00:00", "Vice President Hosni Mubarak is elected President of Egypt, one week after Anwar Sadat was assassinated."], ["1981-10-16T00:00:00", "Gas explosions at a coal mine at Hokutan, Yūbari, Hokkaidō, Japan kill 93."], ["1981-10-21T00:00:00", "Andreas Papandreou becomes Prime Minister of Greece."], ["1981-10-22T00:00:00", "The founding congress of the Nepal Workers and Peasants Organization faction led by Hareram Sharma and D. P. Singh begins."], ["1981-10-27T00:00:00", "Soviet submarine S-363 runs aground outside the Karlskrona, Sweden military base."], ["1981-11-01T00:00:00", "Antigua and Barbuda gain independence from the United Kingdom."], ["1981-11-09T00:00:00", "Edict No. 81-234 abolishes slavery in Mauritania."], ["1981-11-12T00:00:00", "The Church of England General Synod votes to admit women to holy orders."], ["1981-11-16T00:00:00", "Luke and Laura marry on the U.S. soap opera General Hospital; it is the highest-rated hour in daytime television history."], ["1981-11-18T00:00:00", "COMDEX Fall, IBM introduces the IBM PC; Scientific Solutions announces the first PC add-in cards."], ["1981-11-23T00:00:00", "Iran-Contra affair: U.S. President Ronald Reagan signs the top secret National Security Decision Directive 17 (NSDD-17), authorizing the Central Intelligence Agency to recruit and support Contra rebels in Nicaragua."], ["1981-11-30T00:00:00", "Cold War: In Geneva, representatives from the United States and the Soviet Union begin negotiating intermediate-range nuclear weapon reductions in Europe (the meetings end inconclusively on Thursday, December 17)."], ["1981-12-01T00:00:00", "An Inex-Adria Aviopromet McDonnell Douglas MD-80 strikes a mountain peak and crashes while approaching Ajaccio Airport in Corsica, killing all 180 people on board."], ["1981-12-04T00:00:00", "South Africa grants homeland Ciskei independence, not recognized outside South Africa."], ["1981-12-07T00:00:00", "Rotary International charters the Rotary Club of Grand Baie, Mauritius."], ["1981-12-08T00:00:00", "The No. 21 Mine explosion in Whitwell, Tennessee kills 13."], ["1981-12-08T00:00:00", "Arthur Scargill becomes President-elect of the National Union of Mineworkers."], ["1981-12-10T00:00:00", "During the Ministerial Session of the North Atlantic Council in Brussels, Spain signs the Protocol of Accession to NATO."], ["1981-12-11T00:00:00", "Boxing: Muhammad Ali loses to Trevor Berbick; this proves to be Ali's last-ever fight."], ["1981-12-11T00:00:00", "El Mozote massacre: In El Salvador, army units kill 900 civilians."], ["1981-12-13T00:00:00", "Wojciech Jaruzelski declares martial law in Poland, to prevent the dismantling of the communist system by Solidarity."], ["1981-12-15T00:00:00", "A car bomb destroys the Iraqi Embassy in Beirut, Lebanon, killing 61 people; Syrian intelligence is blamed."], ["1981-12-17T00:00:00", "American Brigadier General James L. Dozier is kidnapped in Verona by the Italian Red Brigades."], ["1981-12-20T00:00:00", "The Penlee lifeboat disaster occurs off the coast of South-West Cornwall."], ["1981-12-21T00:00:00", "Preferential Trade Area for Eastern and Southern Africa (PTA)."], ["1981-12-28T00:00:00", "The first American test-tube baby, Elizabeth Jordan Carr, is born in Norfolk, Virginia."], ["1981-12-31T00:00:00", "A coup d'état in Ghana removes President Hilla Limann's PNP government and replaces it with the PNDC led by Flight Lieutenant Jerry Rawlings."]]