[["1954-01-01T00:00:00", "The Soviet Union ceases to demand war reparations from East Germany."], ["1954-01-10T00:00:00", "BOAC Flight 781, a de Havilland Comet jet plane, disintegrates in mid-air due to metal fatigue and crashes in the Mediterranean near Elba. All 35 people on board are killed."], ["1954-01-12T00:00:00", "Avalanches in Austria kill more than 200."], ["1954-01-14T00:00:00", "Marilyn Monroe marries baseball player Joe DiMaggio."], ["1954-01-15T00:00:00", "Mau Mau leader Waruhiu Itote is captured in Kenya."], ["1954-01-17T00:00:00", "In Yugoslavia, Milovan Đilas, one of the leading members of the League of Communists of Yugoslavia, is relieved of his duties."], ["1954-01-20T00:00:00", "The U.S.-based National Negro Network is established with forty-six member radio stations."], ["1954-01-21T00:00:00", "The first nuclear-powered submarine, the USS Nautilus, is launched in Groton, Connecticut, by First Lady of the United States Mamie Eisenhower."], ["1954-01-25T00:00:00", "The foreign ministers of the United States, Britain, France and the Soviet Union meet at the Berlin Conference."], ["1954-02-03T00:00:00", "Elizabeth II becomes the first reigning monarch to visit Australia."], ["1954-02-10T00:00:00", "After authorizing $385 million over the $400 million already budgeted for military aid to Vietnam, President of the United States Dwight D. Eisenhower warns against his country's intervention in Vietnam."], ["1954-02-19T00:00:00", "1954 transfer of Crimea: The Soviet Politburo of the Soviet Union orders the transfer the Crimean Oblast from the Russian SFSR to the Ukrainian SSR."], ["1954-02-23T00:00:00", "The first mass vaccination of children against polio begins in Pittsburgh, United States."], ["1954-02-25T00:00:00", "Lt. Col. Gamal Abdel Nasser becomes premier of Egypt."], ["1954-03-01T00:00:00", "U.S. officials announce that a hydrogen bomb test (Castle Bravo) has been conducted on Bikini Atoll in the Pacific Ocean."], ["1954-03-01T00:00:00", "U.S. Capitol shooting incident: Four Puerto Rican nationalists open fire in the United States House of Representatives chamber and wound five; they are apprehended by security guards."], ["1954-03-09T00:00:00", "American journalists Edward R. Murrow and Fred W. Friendly produce a 30-minute See It Now documentary, entitled A Report on Senator Joseph McCarthy."], ["1954-03-12T00:00:00", "Finland and Germany officially end their state of war."], ["1954-03-13T00:00:00", "French troops begin the battle against the Viet Minh in Dien Bien Phu."], ["1954-03-19T00:00:00", "Joey Giardello knocks out Willie Tory at Madison Square Garden, in the first televised boxing prize fight to be shown in colour."], ["1954-03-23T00:00:00", "In Vietnam, the Viet Minh capture the main airstrip of Dien Bien Phu. The remaining French Army units there are partially isolated."], ["1954-03-25T00:00:00", "The 26th Academy Awards ceremony is held."], ["1954-03-25T00:00:00", "RCA manufactures the first color television set (12-inch screen; price: $1,000)"], ["1954-03-25T00:00:00", "The Soviet Union recognises the sovereignty of East Germany. Soviet troops remain in the country."], ["1954-03-27T00:00:00", "The Castle Romeo nuclear test explosion is executed."], ["1954-03-28T00:00:00", "Puerto Rico's first television station, WKAQ-TV, commences broadcasting."], ["1954-03-29T00:00:00", "A C-47 transport with French nurse Geneviève de Galard on board is wrecked on the runway at Dien Bien Phu."], ["1954-03-30T00:00:00", "The first operational subway line in Canada opens in Toronto."], ["1954-04-01T00:00:00", "The U.S. Congress and President Dwight D. Eisenhower authorize the founding of the United States Air Force Academy in Colorado."], ["1954-04-01T00:00:00", "South Point School (India) is founded and becomes the largest school in the world by 1992."], ["1954-04-03T00:00:00", "Vladimir Petrov defects from the Soviet Union and asks for political asylum in Australia."], ["1954-04-04T00:00:00", "The legendary symphony conductor Arturo Toscanini experiences a lapse of memory during a concert. At this concert's end, his retirement is announced, and Toscanini never conducts in public again."], ["1954-04-07T00:00:00", "Dwight D. Eisenhower gives his \"domino theory\" speech during a news conference."], ["1954-04-08T00:00:00", "A Royal Canadian Air Force Canadair Harvard collides with a Trans-Canada Air Lines Canadair North Star over Moose Jaw, Saskatchewan, killing 37 people."], ["1954-04-11T00:00:00", "This day is denoted as the most boring day in the 20th century by True Knowledge, an answer engine developed by William Tunstall-Pedoe."], ["1954-04-14T00:00:00", "Aneurin Bevan resigns from the British Labour Party's \"Shadow Cabinet\"."], ["1954-04-14T00:00:00", "A Soviet spy ring in Australia is unveiled."], ["1954-04-16T00:00:00", "Vice President Richard Nixon announces that the United States may be “putting our own boys in Indochina regardless of Allied support”."], ["1954-04-22T00:00:00", "Senator Joseph McCarthy begins hearings investigating the United States Army for being \"soft\" on Communism."], ["1954-04-26T00:00:00", "- An international conference on Korea and Indo-China opens in Geneva."], ["1954-04-26T00:00:00", "- Akira Kurosawa's Seven Samurai is released in Japan."], ["1954-04-28T00:00:00", "U.S. Secretary of State John Foster Dulles accuses Communist China of sending combat troops to Indo-China to train the Viet Minh guerrillas."], ["1954-05-01T00:00:00", "The Unification Church is founded in South Korea."], ["1954-05-04T00:00:00", "General Alfredo Stroessner deposes Federico Chávez in a coup d'état in Paraguay and rules until 1989."], ["1954-05-06T00:00:00", "Roger Bannister runs the first sub-four minute mile, in Oxford, England."], ["1954-05-07T00:00:00", "Vietnam War (run-up): The Battle of Dien Bien Phu ends in a French defeat (the battle began on March 13)."], ["1954-05-08T00:00:00", "The Asian Football Confederation (AFC) is formed in Manila, Philippines."], ["1954-05-11T00:00:00", "U.S. Secretary of State John Foster Dulles declares that Indochina is important but not essential to the security of Southeast Asia, thus ending any prospect of American intervention on the side of France."], ["1954-05-14T00:00:00", "The Boeing 707 is released after about two years of development."], ["1954-05-15T00:00:00", "The Latin Union (Unión Latina) is created by the Convention of Madrid. Its member countries use the five Romance languages: Italian, French, Spanish, Portuguese, and Romanian. It will suspend operations in 2012."], ["1954-05-17T00:00:00", "Brown v. Board of Education (347 US 483 1954): The U.S. Supreme Court rules unanimously that segregated schools are unconstitutional."], ["1954-05-17T00:00:00", "The Royal Commission on the Petrov Affair in Australia begins its inquiry."], ["1954-05-17T00:00:00", "Adnan Menderes of the Democrat Party forms the new (21st) government of Turkey."], ["1954-05-20T00:00:00", "Chiang Kai-shek is reelected as the president of the Republic of China by the National Assembly."], ["1954-05-22T00:00:00", "The common Nordic Labour Market act is signed."], ["1954-05-26T00:00:00", "A fire on board the U.S. Navy aircraft carrier USS Bennington off Narragansett Bay, Massachusetts, kills 103 sailors."], ["1954-05-29T00:00:00", "Robert Menzies's government is reelected for a fourth term in Australia."], ["1954-05-29T00:00:00", "Creation and first meeting of the Bilderberg Group."], ["1954-05-29T00:00:00", "Diane Leather becomes the first woman to run a sub-five minute mile, in Birmingham, England."], ["1954-06-07T00:00:00", "Early computer scientist Alan Turing commits suicide."], ["1954-06-09T00:00:00", "McCarthyism: Joseph Welch, special counsel for the United States Army, lashes out at Senator Joseph McCarthy, during hearings on whether Communism has infiltrated the Army, saying, \"Have you, at long last, no decency?\""], ["1954-06-14T00:00:00", "The words \"under God\" are added to the United States Pledge of Allegiance."], ["1954-06-15T00:00:00", "The UEFA (Union of European Football Associations) is formed in Basel, Switzerland."], ["1954-06-16T00:00:00", "July 4 - the 1954 FIFA World Cup is held in Switzerland"], ["1954-06-17T00:00:00", "A CIA-engineered military coup occurs in Guatemala."], ["1954-06-18T00:00:00", "Pierre Mendès France becomes prime minister of France."], ["1954-06-22T00:00:00", "Sarah Mae Flemming is expelled from a bus in South Carolina for sitting in a white-only section."], ["1954-06-22T00:00:00", "Parker-Hulme murder case: 16-year old Pauline Parker and her friend 15-year-old Juliet Hulme bludgeon Parker's mother to death using a brick at Victoria Park in New Zealand."], ["1954-06-27T00:00:00", "Guatemalan President Jacobo Árbenz steps down in a CIA-sponsored military coup, triggering a bloody civil war that continues for more than 35 years."], ["1954-06-27T00:00:00", "The world's first atomic power station opens at Obninsk, near Moscow."], ["1954-07-01T00:00:00", "The Common Nordic Labor Market Act comes into effect."], ["1954-07-01T00:00:00", "The United States officially begins using the international unit of the nautical mile, equal to 6,076.11549 ft. or 1,852 meters."], ["1954-07-04T00:00:00", "Food rationing in Great Britain ends with the lifting of restrictions on sale and purchase of meat, 14 years after it began early in World War II and nearly a decade after the war's end."], ["1954-07-04T00:00:00", "“Miracle of Bern”: West Germany beats Hungary 3-2 to win the 1954 FIFA World Cup."], ["1954-07-10T00:00:00", "Peter Thomson becomes the first Australian to win the British Open Golf Championship."], ["1954-07-15T00:00:00", "The maiden flight of the Boeing 367-80 (or Dash 80), prototype of the Boeing 707 series."], ["1954-07-15T00:00:00", "Juan Fangio, the Argentine driver for German Grand Prix team Mercedes-Benz, makes a new fastest lap of the Silverstone Circuit with an average speed of 100.35 mph, the previous record being 100.16 mph."], ["1954-07-21T00:00:00", "First Indochina War: The Geneva Conference sends French forces to the south, and Vietnamese forces to the north, of a ceasefire line, and calls for elections to decide the government for all of Vietnam by July 1956. Failure to abide by the terms of the agreement leads to the establishment de facto of regimes of North Vietnam and South Vietnam, and the Vietnam War."], ["1954-07-31T00:00:00", "Italian mountaineers Lino Lacedelli and Achille Compagnoni become the first successfully to reach the summit of the Himalayan peak K2."], ["1954-08-01T00:00:00", "The First Indochina War ends with the Vietnam People's Army in North Vietnam, the Vietnamese National Army in South Vietnam, the Kingdom of Cambodia in Cambodia, and the Kingdom of Laos in Laos, emerging victorious against the French Army."], ["1954-08-06T00:00:00", "Emilie Dionne, one of the Dionne quintuplets, dies of asphyxiation following an epileptic seizure. She is the first of the five to perish, and three of them live into the 21st century."], ["1954-08-16T00:00:00", "The first issue of Sports Illustrated magazine is published in the United States."], ["1954-08-24T00:00:00", "Brazilian president Getúlio Vargas commits suicide after being accused of involvement in a conspiracy to murder his chief political opponent, Carlos Lacerda."], ["1954-09-03T00:00:00", "The last 'new' episode of The Lone Ranger radio program is broadcast, after 2,956 episodes over a period of 21 years. Reruns of old episodes continue to be transmitted."], ["1954-09-06T00:00:00", "The SEATO treaty is signed in Manila, Philippines."], ["1954-09-08T00:00:00", "The Southeast Asia Treaty Organization (SEATO) is established in Bangkok, Thailand."], ["1954-09-09T00:00:00", "An earthquake centered on the city of Orléansville, Algeria kills 1,500 and leaves thousands homeless."], ["1954-09-11T00:00:00", "The Miss America Pageant is broadcast on television for the first time."], ["1954-09-14T00:00:00", "The Soviet Union test fires a thermonuclear bomb for the first time."], ["1954-09-14T00:00:00", "English composer Benjamin Britten’s chamber opera version of The Turn of the Screw receives its world premiere at the Teatro La Fenice in Venice, Italy."], ["1954-09-15T00:00:00", "Black Wednesday in air travel: severe delays to flights due to bad weather along the East Coast of the United States."], ["1954-09-17T00:00:00", "William Golding's novel Lord of the Flies is published in London."], ["1954-09-25T00:00:00", "Footscray Football Club win their first and only Australian Football League Grand Final."], ["1954-09-26T00:00:00", "The Japanese ferry Tōya Maru sinks during a typhoon in the Tsugaru Strait. More than 1,100 people are killed. Seven other ships are wrecked and at least nine others seriously damaged."], ["1954-09-30T00:00:00", "The USS Nautilus (SSN-571), the first nuclear-powered submarine in the world, is commissioned into the U.S. Navy."], ["1954-10-11T00:00:00", "Pre-Vietnam War: The Viet Minh takes control of North Vietnam."], ["1954-10-11T00:00:00", "Hurricane Hazel crosses over Haiti, killing 1,000."], ["1954-10-15T00:00:00", "Hurricane Hazel makes U.S. landfall; it is the only recorded Category 4 hurricane to strike as far north as North Carolina."], ["1954-10-18T00:00:00", "Texas Instruments announces the development of the first commercial transistor radio. The Regency TR-1 goes on sale the following month."], ["1954-10-18T00:00:00", "The comic strip Hi and Lois, by Mort Walker and Dik Browne, is launched."], ["1954-10-20T00:00:00", "A dock workers' strike expands in England."], ["1954-10-23T00:00:00", "West Germany joins NATO."], ["1954-10-23T00:00:00", "Paris Agreement sets up the Western European Union to implement the Treaty of Brussels (1948) providing for mutual self-defence and other collaboration between Belgium, France, West Germany, Italy, Luxembourg, the Netherlands and the United Kingdom."], ["1954-10-25T00:00:00", "Landslides caused by heavy rains hit Salerno, Italy, killing about 300."], ["1954-10-26T00:00:00", "Muslim Brotherhood member Mahmoud Abdul Latif tries to kill Gamal Abdel Nasser."], ["1954-10-31T00:00:00", "Algerian War of Independence: The Algerian National Liberation Front begins a revolt against French rule."], ["1954-11-01T00:00:00", "The FLN attacks representative and public buildings of the French colonial power."], ["1954-11-02T00:00:00", "The dock workers' strike in England ends."], ["1954-11-02T00:00:00", "The radio program Hancock's Half Hour, a pioneer in situation comedy, is first broadcast on BBC Radio. A television version would follow in 1956."], ["1954-11-03T00:00:00", "The first Godzilla film premieres in Tokyo."], ["1954-11-05T00:00:00", "Japan and Burma sign a peace treaty in Rangoon, to end their long-extinct state of war."], ["1954-11-10T00:00:00", "U.S. President Dwight D. Eisenhower dedicates the USMC War Memorial (Iwo Jima memorial) at the Arlington National Cemetery."], ["1954-11-12T00:00:00", "The main immigration port-of-entry in New York Harbor at Ellis Island closes permanently."], ["1954-11-14T00:00:00", "Egyptian president Muhammad Naguib is deposed, and Gamal Abdel Nasser replaces him."], ["1954-11-19T00:00:00", "The Korean Cold War between the communist North and the capitalist South begins over a year after the conclusion of the Korean War."], ["1954-11-22T00:00:00", "The U.S. Supreme Court decides the landmark case Berman v. Parker (348 U.S. 26), upholding the federal slum clearance and urban renewal programs."], ["1954-11-23T00:00:00", "The Dow Jones Industrial Average rises 3.27 points, or 0.86 percent, closing at an all-time high of 382.74. More significantly, this is the first time the Dow has surpassed its peak level reached just before the Wall Street Crash of 1929."], ["1954-11-26T00:00:00", "Larry T. Kochis is born."], ["1954-11-30T00:00:00", "In Sylacauga, Alabama, a four-kilogram piece of the Hodges Meteorite crashes through the roof of a house and badly bruises a napping woman, in the first documented case of an object from outer space hitting a person."], ["1954-12-01T00:00:00", "The first Hyatt Hotel, The Hyatt House Los Angeles, opens on the grounds of Los Angeles International Airport. It is the first hotel in the world built on an airport property."], ["1954-12-02T00:00:00", "Red Scare: The United States Senate votes 67-22 to condemn Joseph McCarthy for \"conduct that tends to bring the Senate into dishonor and disrepute.\""], ["1954-12-02T00:00:00", "The Taiwan-United States Mutual Defense Treaty is signed."], ["1954-12-04T00:00:00", "The first Burger King opens in Miami, Florida."], ["1954-12-15T00:00:00", "The Netherlands Antilles is created out of the Dutch Caribbean nations. It is later dissolved between 1986 and 2010."], ["1954-12-23T00:00:00", "J. Hartwell Harrison, and Joseph Murray perform the world's first successful kidney transplant in Boston, Massachusetts."], ["1954-12-24T00:00:00", "Laos gains full independence from France."]]