[["1982-01-01T00:00:00", "New ITV franchises, Central, TVS and TSW, are launched."], ["1982-01-06T00:00:00", "William Bonin is convicted of being the Freeway Killer in California."], ["1982-01-07T00:00:00", "The Commodore 64 8-bit home computer is launched by Commodore International in Las Vegas (released in August); it becomes the all-time best-selling single personal computer model."], ["1982-01-08T00:00:00", "AT&T Corporation agrees to divest itself into 22 subdivisions."], ["1982-01-11T00:00:00", "Mark Thatcher, son of British Prime Minister Margaret Thatcher, disappears in the Sahara during the Dakar Rally; he is rescued January 14."], ["1982-01-11T00:00:00", "January 17 - A brutal cold snap sends temperatures to all-time record lows in dozens of cities throughout the Midwestern United States."], ["1982-01-13T00:00:00", "Shortly after takeoff, Air Florida Flight 90 crashes into Washington, D.C.'s 14th Street Bridge and falls into the Potomac River, killing 78. On the same day, a Washington Metro train derails to the north, killing 3 (the system's first fatal accident)."], ["1982-01-17T00:00:00", "Cold Sunday sweeps over the northern United States."], ["1982-01-18T00:00:00", "1982 Thunderbirds Indian Springs Diamond Crash: Four Northrop T-38 aircraft of the United States Air Force Thunderbirds Demonstration Squadron crash at Indian Springs Air Force Auxiliary Field, Nevada, killing all 4 pilots."], ["1982-01-26T00:00:00", "Mauno Koivisto is elected President of Finland."], ["1982-01-26T00:00:00", "Unemployment in the United Kingdom increases by 129,918 to 3,070,621, a post-war record number."], ["1982-01-27T00:00:00", "The Garret FitzGerald government of the Republic of Ireland is defeated 82-81 on its budget; the 22nd Dáil Éireann is dissolved."], ["1982-01-28T00:00:00", "United States Army Brigadier General James L. Dozier is rescued by the Italian anti-terrorism Nucleo Operativo Centrale di Sicurezza (NOCS) force after being held captive for 42 days by the Red Brigades."], ["1982-01-30T00:00:00", "The first computer virus, the Elk Cloner, written by 15-year old Rich Skrenta, is found. It infects Apple II computers via floppy disk."], ["1982-02-01T00:00:00", "Senegal and Gambia form a loose Senegambia Confederation."], ["1982-02-02T00:00:00", "The Hama massacre begins in Syria."], ["1982-02-03T00:00:00", "Syrian president Hafez al-Assad orders the army to purge the city of Harran of the Muslim Brotherhood."], ["1982-02-05T00:00:00", "London-based Laker Airways collapses, leaving 6,000 stranded passengers and debts of $270 million."], ["1982-02-07T00:00:00", "Iraqi club Al-Shorta win the 1982 Arab Club Champions Cup with a 4-2 aggregate win over Al-Nejmeh in the final."], ["1982-02-09T00:00:00", "Japan Airlines Flight 350 crashes in Tokyo Bay due to thrust reversal on approach to Tokyo International Airport, killing 24 among the 174 people on board."], ["1982-02-15T00:00:00", "The oil platform Ocean Ranger sinks during a storm off the coast of Newfoundland, killing all 84 rig workers aboard."], ["1982-02-18T00:00:00", "The Republic of Ireland general election gives a boost to Fianna Fáil."], ["1982-02-19T00:00:00", "The DeLorean Motor Company Car Factory in Belfast is put into receivership."], ["1982-02-24T00:00:00", "In South Africa, 22 National Party MPs led by Andries Treurnicht vote for no confidence in P. W. Botha."], ["1982-02-25T00:00:00", "The European Court of Human Rights rules that teachers who cane, belt or tase children against the wishes of their parents are in breach of the Human Rights Convention."], ["1982-02-27T00:00:00", "Atlanta murders of 1979-81: Wayne Williams is convicted of murdering 2 adult men and is sentenced to two consecutive life terms."], ["1982-03-03T00:00:00", "Elizabeth II opens the Barbican Centre in London."], ["1982-03-09T00:00:00", "Charles Haughey becomes Taoiseach of the Republic of Ireland."], ["1982-03-10T00:00:00", "The United States places an embargo on Libyan oil imports, alleging Libyan support for terrorist groups."], ["1982-03-10T00:00:00", "Syzygy: All 8 planets align on the same side of the Sun (see also The Jupiter Effect)."], ["1982-03-16T00:00:00", "In Newport, Rhode Island, Claus von Bülow is found guilty of the attempted murder of his wife."], ["1982-03-18T00:00:00", "An Argentine scrap metal dealer raises the Argentine flag in South Georgia."], ["1982-03-18T00:00:00", "Mary Whitehouse's private prosecution of The Romans in Britain collapses."], ["1982-03-26T00:00:00", "A ground-breaking ceremony for the Vietnam Veterans Memorial is held in Washington, D.C."], ["1982-03-29T00:00:00", "Royal Assent is given to the Canada Act 1982, setting the stage for the repatriation of the Canadian Constitution on April 17."], ["1982-03-29T00:00:00", "The 54th Academy Awards, hosted by Johnny Carson, are held at the Dorothy Chandler Pavilion in Los Angeles. Chariots of Fire wins Best Picture and 3 other Academy Awards."], ["1982-04-02T00:00:00", "The Falklands War begins: Argentina invades and occupies the Falkland Islands."], ["1982-04-04T00:00:00", "Mexico's children's festival \"Juguemos a Cantar\" takes place and ends its first run on May 2 ."], ["1982-04-06T00:00:00", "A blizzard unprecedented in size for April dumps 1-2 feet of snow on the northeastern United States, closing schools and businesses, snarling traffic, and canceling several major league baseball games."], ["1982-04-17T00:00:00", "By Proclamation of the Queen of Canada on Parliament Hill, Canada patriates its constitution, gaining full political independence from the United Kingdom; included is the country's first entrenched bill of rights."], ["1982-04-23T00:00:00", "Dennis Wardlow, mayor of Key West, Florida, declares the independent \"Conch Republic\" for a day."], ["1982-04-24T00:00:00", "German singer Nicole wins the Eurovision Song Contest 1982 for Germany, with the song \"Ein Bisschen Frieden\"."], ["1982-04-25T00:00:00", "Israel completes its withdrawal from the Sinai Peninsula in accordance with the Egypt-Israel Peace Treaty of 1979."], ["1982-04-26T00:00:00", "Falklands War: British troops retake South Georgia during Operation Paraquet."], ["1982-04-30T00:00:00", "The Bijon Setu massacre takes place in India."], ["1982-05-01T00:00:00", "A crowd of over 100,000 attends the first day of the 1982 World's Fair in Knoxville, Tennessee, which is kicked off with an address by President Ronald Reagan. Over 11 million people attend during its 6-month run."], ["1982-05-02T00:00:00", "Falklands War: The nuclear submarine HMS Conqueror sinks the Argentine cruiser General Belgrano, killing 323 sailors. Operation Algeciras, an attempt to destroy a Royal Navy warship in Gibraltar, fails."], ["1982-05-02T00:00:00", "The Weather Channel airs on cable television for the first time."], ["1982-05-04T00:00:00", "Falklands War: HMS Sheffield is hit by an Exocet missile, and burns out of control; 20 sailors are killed. The ship sinks on May 10."], ["1982-05-05T00:00:00", "A Unabomber bomb explodes in the computer science department at Vanderbilt University; secretary Janet Smith is injured."], ["1982-05-08T00:00:00", "French-Canadian racing driver Gilles Villeneuve is killed during qualifying for the Belgian Grand Prix."], ["1982-05-12T00:00:00", "Spanish priest Juan María Fernández y Krohn tries to stab Pope John Paul II with a bayonet during the latter's pilgrimage to the shrine at Fátima."], ["1982-05-12T00:00:00", "Braniff International Airways is declared bankrupt and ceases all flights."], ["1982-05-18T00:00:00", "Falklands War: The British Special Air Service launches an operation to destroy three Argentinean Exocet missiles and five Super Étendard fighter-bombers in mainland Argentina. It fails when the Argentineans discover about the plot."], ["1982-05-21T00:00:00", "Falklands War: British landings spark the Battle of San Carlos."], ["1982-05-22T00:00:00", "Falklands War: HMS Ardent is sunk by Argentine aircraft, killing 22 sailors."], ["1982-05-22T00:00:00", "The International Maritime Organization (IMO) is established."], ["1982-05-23T00:00:00", "Falklands War: HMS Antelope is lost."], ["1982-05-24T00:00:00", "Iranian troops retake Khorramshahr."], ["1982-05-24T00:00:00", "KGB head Yuri Andropov is appointed to the Secretariat of the Communist Party of the Soviet Union."], ["1982-05-25T00:00:00", "British ships HMS Coventry and SS Atlantic Conveyor are sunk during the Falklands War; Coventry by two A-4C Skyhawks and the latter sunk by an Exocet."], ["1982-05-26T00:00:00", "Aston Villa wins the European Cup, beating Bayern Munich 1-0 after a 69-minute goal by Peter Withe in Rotterdam."], ["1982-05-26T00:00:00", "Kielder Water, an artificial lake in Northumberland, is opened."], ["1982-05-27T00:00:00", "Tottenham Hotspur F.C. wins the FA Cup, beating Queens Park Rangers 1-0 in a replay."], ["1982-05-27T00:00:00", "Conservative candidate Tim Smith holds the seat of Beaconsfield in a by-election. The Labour Party candidate is future Prime Minister Tony Blair."], ["1982-05-28T00:00:00", "Pope John Paul II's visit to the United Kingdom, the first by a reigning pope, begins."], ["1982-05-28T00:00:00", "29 - Falklands War: Battle of Goose Green: British forces defeat a larger Argentine force."], ["1982-05-30T00:00:00", "Spain becomes the 16th member of NATO and the first nation to enter the alliance since West Germany's admission in 1955."], ["1982-05-30T00:00:00", "Indianapolis 500: In what Indianapolis Motor Speedway historian Donald Davidson and Speedway public address announcer Tom Carnegie later call the greatest moment in the track's history, 1973 winner Gordon Johncock wins his second race over 1979 winner Rick Mears by 0.16 seconds, the closest finish to this date, after Mears draws alongside Johncock with a lap remaining, after erasing a seemingly insurmountable advantage of more than 11 seconds in the final 10 laps."], ["1982-05-30T00:00:00", "Hussain Muhammad Ershad seizes power in Bangladesh."], ["1982-05-30T00:00:00", "Cal Ripken, Jr. plays the first of what eventually becomes his record-breaking streak of 2,632 consecutive Major League Baseball games."], ["1982-06-06T00:00:00", "The 1982 Lebanon War begins: Forces under Israeli Defense Minister Ariel Sharon invade southern Lebanon in their \"Operation Peace for the Galilee,\" eventually reaching as far north as the capital Beirut."], ["1982-06-06T00:00:00", "The United Nations Security Council votes to demand that Israel withdraw its troops from Lebanon."], ["1982-06-08T00:00:00", "President Ronald Reagan becomes the first American chief executive to address a joint session of the British Parliament."], ["1982-06-08T00:00:00", "Falklands War: British ship RFA Sir Galahad is destroyed during the Bluff Cove Air Attacks"], ["1982-06-08T00:00:00", "VASP Flight 168, a Boeing 727 passenger jet, crashes into forest Fortaleza, killing 137."], ["1982-06-11T00:00:00", "U.S. release date of E.T.: The Extra-Terrestrial, which would become the biggest box-office hit for the rest of the decade (and beyond)."], ["1982-06-12T00:00:00", "A rally against nuclear weapons draws 750,000 to New York City's Central Park. Jackson Browne, James Taylor, Bruce Springsteen, and Linda Ronstadt attend. An international convocation at The Cathedral of St. John the Divine features prominent peace activists from around the world and afterward participants march on Fifth Avenue to Central Park for the rally."], ["1982-06-13T00:00:00", "The 1982 FIFA World Cup begins in Spain."], ["1982-06-13T00:00:00", "Fahd becomes King of Saudi Arabia upon the death of his brother, Khalid."], ["1982-06-14T00:00:00", "The Falklands War ends: Formal surrender of Argentine forces, and liberation of the Falkland Islanders."], ["1982-06-18T00:00:00", "Argentine military dictator Leopoldo Galtieri resigns, in the wake of his country's defeat in the Falklands War."], ["1982-06-19T00:00:00", "The body of \"God's Banker\", Roberto Calvi, chairman of Banco Ambrosiano, is found hanging beneath Blackfriars Bridge in London."], ["1982-06-21T00:00:00", "Prince William is born at St Mary's Hospital in Paddington, West London."], ["1982-06-24T00:00:00", "British Airways Flight 9 suffers a temporary four-engine flameout and damage to the exterior of the plane, after flying through the otherwise undetected ash plume from Indonesia's Mount Galunggung."], ["1982-06-25T00:00:00", "The Institute for Puerto Rican Policy is founded in New York City to research and advocate for Puerto Rican and Latino community issues. In 2006, it changes its name to the National Institute for Latino Policy."], ["1982-06-30T00:00:00", "The Equal Rights Amendment falls short of the 38 states needed to pass; Phyllis Schlafly and other leaders of the Christian right take credit for its defeat."], ["1982-07-02T00:00:00", "Larry Walters, a.k.a. Lawn Chair Larry, flies 16,000 feet (4,900 m) above Long Beach, California, in a lawn chair with weather balloons attached."], ["1982-07-02T00:00:00", "Roy Jenkins is elected Leader of the Social Democratic Party."], ["1982-07-03T00:00:00", "ASLEF train drivers in the United Kingdom go on strike over hours of work; they return to work on July 18."], ["1982-07-04T00:00:00", "Four Iranian diplomats are kidnapped upon Israel's invasion of Lebanon."], ["1982-07-06T00:00:00", "A lunar eclipse (umbral duration 236 min and total duration 106 min, the longest of the 20th century) occurs."], ["1982-07-09T00:00:00", "Pan Am Flight 759 (Boeing 727) crashes in Kenner, Louisiana, killing all 146 on board and 8 on the ground."], ["1982-07-09T00:00:00", "Intruder Michael Fagan breaches Buckingham Palace security as far as into the bedroom of Elizabeth II."], ["1982-07-11T00:00:00", "Italy beats West Germany 3-1 to win the 1982 FIFA World Cup in Spain."], ["1982-07-12T00:00:00", "Checker Motors Corporation ceases production of automobiles."], ["1982-07-15T00:00:00", "Geoffrey Prime, a GCHQ civil servant, is remanded in custody on charges under the Official Secrets Act 1911."], ["1982-07-16T00:00:00", "In New York City, the Reverend Sun Myung Moon is sentenced to 18 months in prison and fined $25,000 for tax fraud and conspiracy to obstruct justice."], ["1982-07-19T00:00:00", "William Whitelaw, Home Secretary, announces that Michael Trestrail (the Queen's bodyguard) has resigned from the Metropolitan Police Service over a relationship with a male prostitute."], ["1982-07-20T00:00:00", "The Provisional IRA detonates 2 bombs in central London, killing 8 soldiers, wounding 47 people, and leading to the deaths of 7 horses."], ["1982-07-21T00:00:00", "HMS Hermes, the Royal Navy flagship during the Falklands War, returns home to Portsmouth to a hero's welcome."], ["1982-07-23T00:00:00", "The International Whaling Commission decides to end commercial whaling by 1985-1986."], ["1982-07-23T00:00:00", "A coroner's jury returns a verdict of suicide on Roberto Calvi, who was found hanging under Blackfriars Bridge."], ["1982-07-23T00:00:00", "Torrential rain and mudslides in Nagasaki, Japan destroy bridges and kill 299."], ["1982-07-23T00:00:00", "On a movie set, the Twilight Zone actor Vic Morrow and 2 child actors die in a helicopter stunt accident."], ["1982-07-31T00:00:00", "In Beaune, France, 53 persons, 46 of them children, die in a highway accident (France's worst)."], ["1982-08-01T00:00:00", "Attempted coup against government of Daniel Arap Moi in Kenya."], ["1982-08-03T00:00:00", "Venezuela recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1982-08-04T00:00:00", "The United Nations Security Council votes to censure Israel because its troops are still in Lebanon."], ["1982-08-07T00:00:00", "Italian Prime Minister Giovanni Spadolini resigns."], ["1982-08-11T00:00:00", "Suriname recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1982-08-12T00:00:00", "Mexico announces it is unable to pay its large foreign debt, triggering a debt crisis that quickly spread throughout Latin America."], ["1982-08-13T00:00:00", "In Hong Kong, health warnings on cigarette packets are made statutory."], ["1982-08-17T00:00:00", "The first compact discs (CDs) are released to the public in Germany."], ["1982-08-20T00:00:00", "Lebanese Civil War: A multinational force lands in Beirut to oversee the PLO withdrawal from Lebanon. French troops arrive August 21, U.S. Marines August 25."], ["1982-09-03T00:00:00", "Italian general Carlo Alberto Dalla Chiesa is killed in a Mafia ambush."], ["1982-09-05T00:00:00", "Iowa paperboy Johnny Gosch is kidnapped."], ["1982-09-14T00:00:00", "Lebanese President-elect Bachir Gemayel is assassinated in Beirut."], ["1982-09-18T00:00:00", "The Lebanese Christian militia (the Phalange) kill thousands of Palestinians in the Sabra and Shatila refugee camps with the overlooking of Israeli troops in West Beirut. The massacre is in retaliation for the assassination of pro-Israel president-elect, Bachir Gemayel, as well as several Palestinian massacres against Lebanese Christians."], ["1982-09-19T00:00:00", "The first emoticons are posted by Scott Fahlman."], ["1982-09-21T00:00:00", "The first International Day of Peace is proclaimed by the (United Nations)."], ["1982-09-23T00:00:00", "Amine Gemayel, brother of Bachir, is elected president of Lebanon."], ["1982-09-24T00:00:00", "The Wimpy Operation, first act of armed resistance against Israeli troops in Beirut."], ["1982-09-25T00:00:00", "In Israel, 400,000 marchers demand the resignation of Prime Minister Menachem Begin."], ["1982-09-26T00:00:00", "Thermals take Australian parachutist Rich Collins up to 2,800 metres (9,200 ft) during a jump; he almost blacks out due to lack of oxygen. He releases his main parachute to fall to lower altitude and lands by his reserve parachute."], ["1982-09-29T00:00:00", "October 1 - The Chicago Tylenol murders occur when 7 people in the Chicago area die after ingesting capsules laced with potassium cyanide."], ["1982-10-01T00:00:00", "Helmut Kohl replaces Helmut Schmidt as Chancellor of Germany through a constructive vote of no confidence."], ["1982-10-01T00:00:00", "In Orlando, Florida, Walt Disney World opens the second largest theme park, EPCOT Center, to the public for the first time."], ["1982-10-01T00:00:00", "Sony launches the first consumer compact disc (CD) player (model CDP-101)."], ["1982-10-01T00:00:00", "October 8 - Poland bans Solidarity after having suspended it on 13 December 1981."], ["1982-10-01T00:00:00", "October 8 - After eight years in opposition, Social Democrat Olof Palme becomes once again Prime Minister of Sweden ."], ["1982-10-08T00:00:00", "Poland bans Solidarity after having suspended it on 13 December 1981."], ["1982-10-08T00:00:00", "After eight years in opposition, Social Democrat Olof Palme becomes once again Prime Minister of Sweden ."], ["1982-10-11T00:00:00", "The Mary Rose, flagship of Henry VIII of England that sank in 1545, is raised from the Solent."], ["1982-10-13T00:00:00", "The Ford Sierra is launched in Europe, replacing the Ford Cortina."], ["1982-10-19T00:00:00", "John DeLorean is arrested for selling cocaine to undercover FBI agents (he is later found not guilty due to entrapment)."], ["1982-10-20T00:00:00", "Luzhniki disaster: During the UEFA Cup match between FC Spartak Moscow and HFC Haarlem, 66 people are crushed to death."], ["1982-10-27T00:00:00", "In Canada, Dominion Day is officially renamed Canada Day."], ["1982-10-27T00:00:00", "The Homosexual Offences (Northern Ireland) Order 1982 comes into effect, decriminalising homosexuality in Northern Ireland for those aged 18 or older."], ["1982-10-28T00:00:00", "The Socialist Party wins the election in Spain; Felipe González is elected Prime Minister."]]