[["1993-01-01T00:00:00", "Dissolution of Czechoslovakia: The Czech Republic and Slovakia separate in the so-called Velvet Divorce."], ["1993-01-01T00:00:00", "The European Economic Community eliminates trade barriers and creates a European single market."], ["1993-01-01T00:00:00", "British ITV companies GMTV, Carlton Television, Meridian Broadcasting and Westcountry Television start broadcasting, replacing TV-am, Thames Television, TVS and TSW respectively."], ["1993-01-02T00:00:00", "Sri Lankan Civil War: The Sri Lanka Navy kills 35-100 civilians on the Jaffna Lagoon."], ["1993-01-03T00:00:00", "In Moscow, Presidents George H. W. Bush (United States) and Boris Yeltsin (Russia) sign the second Strategic Arms Reduction Treaty."], ["1993-01-03T00:00:00", "The third Star Trek TV series Deep Space Nine premieres in syndication."], ["1993-01-05T00:00:00", "The state of Washington executes Westley Allan Dodd by hanging (the first judicial hanging in America since 1965)."], ["1993-01-05T00:00:00", "US$7.4 million is stolen from the Brink's Armored Car Depot in Rochester, New York in the 5th largest robbery in U.S. history. Four men, Samuel Millar, Father Patrick Moloney, former Rochester Police officer Thomas O'Connor, and Charles McCormick, all of whom have ties to the Provisional Irish Republican Army, are accused."], ["1993-01-05T00:00:00", "MV Braer, a Liberian-registered oil tanker, runs aground off the Scottish island of Mainland, Shetland, causing a massive oil spill."], ["1993-01-06T00:00:00", "Douglas Hurd is the first high-ranking British official to visit Argentina since the Falklands War."], ["1993-01-07T00:00:00", "The Fourth Republic of Ghana is inaugurated, with Jerry Rawlings as president."], ["1993-01-11T00:00:00", "Monday Night Raw, the longest running weekly episodic show of the World Wrestling Entertainment/Federation (WWE/F), debuts on television in the United States."], ["1993-01-14T00:00:00", "The Polish ferry MS Jan Heweliusz sinks off the coast of Rügen in the Baltic Sea, killing 54 people."], ["1993-01-15T00:00:00", "Salvatore Riina, the Mafia boss known as 'The Beast', is arrested in Palermo, Sicily, after 23 years as a fugitive."], ["1993-01-19T00:00:00", "The Chemical Weapons Convention (CWC) is signed."], ["1993-01-19T00:00:00", "IBM announces a $4.97 billion loss for 1992, the largest single-year corporate loss in United States history to date."], ["1993-01-19T00:00:00", "Iraq disarmament crisis: Iraq refuses to allow UNSCOM inspectors to use its own aircraft to fly into Iraq, and begins military operations in the demilitarized zone between Iraq and Kuwait, and the northern Iraqi no-fly zones. U.S. forces fire approximately 40 Tomahawk cruise missiles at Baghdad factories linked to Iraq's illegal nuclear weapons program. Iraq then informs UNSCOM that it will be able to resume its flights."], ["1993-01-20T00:00:00", "Bill Clinton succeeds George H. W. Bush as the 42nd President of the United States."], ["1993-01-24T00:00:00", "In Turkey, thousands protest the murder of journalist Uğur Mumcu."], ["1993-01-25T00:00:00", "Mir Aimal Kasi fires a rifle and kills two employees outside Central Intelligence Agency headquarters in Langley, Virginia."], ["1993-01-25T00:00:00", "Social Democrat Poul Nyrup Rasmussen succeeds Conservative Poul Schlüter as Prime Minister of Denmark."], ["1993-01-25T00:00:00", "The Russian space station Mir boasts the first art exhibition in outer space."], ["1993-01-26T00:00:00", "Václav Havel is elected President of the Czech Republic."], ["1993-01-31T00:00:00", "Super Bowl XXVII: The Buffalo Bills become the first team to lose three consecutive Super Bowls, as they are defeated by the Dallas Cowboys, 52-17."], ["1993-02-04T00:00:00", "Members of the right-wing Austrian Freedom Party of Austria split to form the Liberal Forum in protest against the increasing nationalistic bent of the party."], ["1993-02-05T00:00:00", "Belgium becomes a federal monarchy rather than a unitary kingdom."], ["1993-02-08T00:00:00", "General Motors sues NBC, after Dateline NBC allegedly rigged 2 crashes showing that some GM pickups can easily catch fire if hit in certain places. NBC settles the lawsuit the following day."], ["1993-02-10T00:00:00", "Lien Chan is named by Lee Teng-hui to succeed Hau Pei-tsun as Premier of the Republic of China."], ["1993-02-10T00:00:00", "Mani pulite scandal: Italian legislator Claudio Martelli resigns, followed by various politicians over the next 2 weeks."], ["1993-02-11T00:00:00", "Janet Reno is selected by President Clinton as Attorney General of the United States."], ["1993-02-12T00:00:00", "Two-year-old James Bulger is abducted from New Strand Shopping Centre by two ten-year-old boys, who later torture and murder him."], ["1993-02-14T00:00:00", "Glafcos Clerides defeats incumbent George Vasiliou in the Cypriot presidential election."], ["1993-02-14T00:00:00", "Albert Zafy defeats Didier Ratsiraka in the Madagascar presidential election."], ["1993-02-17T00:00:00", "A ferry sinks in Haiti, killing approximately 1,215 out of 1,500 passengers."], ["1993-02-21T00:00:00", "Star Fox (series) is released, marking the first 3D Polygonal Star Fox title for the Super Famicom/Super Nintendo Entertainment System smash hit game developed by Nintendo with programming assistance by Argonaut Software (currently Argonaut Games)."], ["1993-02-22T00:00:00", "UN Security Council Resolution 808 is voted on, deciding that \"an international tribunal shall be established\" to prosecute violations of international law in Yugoslavia. The tribunal is established on May 25 by Resolution 827."], ["1993-02-24T00:00:00", "Prime Minister of Canada Brian Mulroney resigns amidst political and economic turmoil. Kim Campbell, his successor, becomes Canada's first female Prime Minister."], ["1993-02-26T00:00:00", "World Trade Center bombing: In New York City, a van bomb parked below the North Tower of the World Trade Center explodes, killing 6 and injuring over 1,000."], ["1993-02-28T00:00:00", "Bureau of Alcohol, Tobacco, Firearms and Explosives agents raid the Branch Davidian compound in Waco, Texas, with a warrant to arrest leader David Koresh on federal firearms violations. Four agents and five Davidians die in the raid and a 51-day standoff begins."], ["1993-03-04T00:00:00", "Authorities announce the capture of suspected World Trade Center bombing conspirator Mohammad Salameh."], ["1993-03-05T00:00:00", "Macedonian Palair Flight 305, a F-100 on a flight to Zürich, crashes shortly after take-off from Skopje, killing 83 of the 97 on board."], ["1993-03-08T00:00:00", "The Moon moves into its nearest point to Earth, called perigee, at the same time as its fullest phase of the Lunar Cycle. The Moon appears to be 14% bigger and 30% brighter than the year's other full moons. The next time these two events coincide will be in 2008."], ["1993-03-11T00:00:00", "Janet Reno is confirmed by the United States Senate and sworn in the next day, becoming the first female Attorney General of the United States."], ["1993-03-12T00:00:00", "1993 Bombay bombings: Several bombs explode in Bombay, India, killing 257 and injuring hundreds more."], ["1993-03-12T00:00:00", "North Korea nuclear weapons program: North Korea announces that it plans to withdraw from the Nuclear Nonproliferation Treaty and refuses to allow inspectors access to nuclear sites."], ["1993-03-13T00:00:00", "Australian federal election, 1993: The Australian Labor Party stays in power despite poor economic results."], ["1993-03-17T00:00:00", "The Kurdistan Workers' Party announces a unilateral ceasefire in Iraq."], ["1993-03-20T00:00:00", "Warrington bomb attacks: A Provisional Irish Republican Army bomb explodes in Warrington Town Centre and kills 2 children, Jonathan Ball and Tim Parry."], ["1993-03-22T00:00:00", "The Intel Corporation ships the first P5 Pentium chips."], ["1993-03-24T00:00:00", "The Israeli Knesset elects Ezer Weizman as President of Israel."], ["1993-03-24T00:00:00", "South Africa officially abandons its nuclear weapons programme. President de Klerk announces that the country's 6 warheads had already been dismantled in 1989."], ["1993-03-27T00:00:00", "Jiang Zemin becomes President of the People's Republic of China."], ["1993-03-27T00:00:00", "Following a rash of integrist murders, Algeria breaks diplomatic relations with Iran, accusing the country of interfering in its interior affairs."], ["1993-03-27T00:00:00", "Mahamane Ousmane is elected president of Niger."], ["1993-03-28T00:00:00", "French legislative election, 1993: Rally for the Republic (Gaullist party) wins a majority and Édouard Balladur becomes Prime Minister."], ["1993-03-29T00:00:00", "The 65th Academy Awards, hosted by Billy Crystal, are held at the Dorothy Chandler Pavilion in Los Angeles, with Unforgiven winning Best Picture."], ["1993-04-01T00:00:00", "The Vatican orders the moving of the Carmelite convent at Auschwitz."], ["1993-04-06T00:00:00", "A nuclear accident occurs at Tomsk 7 in Russia."], ["1993-04-08T00:00:00", "The Republic of Macedonia is admitted to the United Nations."], ["1993-04-10T00:00:00", "African National Congress activist Chris Hani is assassinated in South Africa."], ["1993-04-16T00:00:00", "Bosnian War: the enclave of Srebrenica is declared a UN-protected \"safe area\"."], ["1993-04-19T00:00:00", "A 51-day stand-off at the Branch Davidian compound near Waco, Texas, ends with a fire that kills 76 people, including David Koresh."], ["1993-04-19T00:00:00", "South Dakota governor George Mickelson and 7 others are killed when a state-owned aircraft crashes near Dubuque, Iowa."], ["1993-04-21T00:00:00", "The Supreme Court in La Paz, Bolivia, sentences former dictator Luis Garcia Meza to 30 years in jail without parole for murder, theft, fraud and violating the constitution."], ["1993-04-22T00:00:00", "In Washington, D.C., the Holocaust Memorial Museum is dedicated."], ["1993-04-23T00:00:00", "The World Health Organization declares tuberculosis a Global Emergency."], ["1993-04-23T00:00:00", "Eritreans vote overwhelmingly for independence from Ethiopia in a United Nations-monitored referendum, the Eritrean independence referendum."], ["1993-04-24T00:00:00", "A huge IRA truck bomb explodes at Bishopsgate in the centre of London's financial district, killing one person and causing extensive damage to the area."], ["1993-04-26T00:00:00", "Oscar Luigi Scalfaro appoints Carlo Azeglio Ciampi as Prime Minister of Italy."], ["1993-04-27T00:00:00", "Eritrea: Eritrean independence is declared as a result of a referendum held with United Nations verification."], ["1993-04-27T00:00:00", "Yemeni parliamentary election, 1993: The General People's Congress wins a plurality of 121 seats."], ["1993-04-27T00:00:00", "All members of the Zambia national football team die in a plane crash off Libreville, Gabon en route to Dakar, Senegal."], ["1993-04-28T00:00:00", "An executive order requires the United States Air Force to allow women to fly war planes."], ["1993-04-30T00:00:00", "Tennis star Monica Seles is stabbed in the back by an obsessed fan of rival Steffi Graf at a tournament in Hamburg, Germany."], ["1993-05-01T00:00:00", "Pierre Bérégovoy, former Prime Minister of France, commits suicide."], ["1993-05-01T00:00:00", "A Tamil Tigers suicide bomber assassinates President Ranasinghe Premadasa of Sri Lanka."], ["1993-05-01T00:00:00", "Dingiri Banda Wijetunga became third executive president of Sri Lanka."], ["1993-05-04T00:00:00", "UNOSOM II assumes the Somalian duties of the dissolved UNITAF."], ["1993-05-09T00:00:00", "Juan Carlos Wasmosy becomes the first democratically elected President of Paraguay in nearly 40 years."], ["1993-05-15T00:00:00", "Niamh Kavanagh wins the Eurovision Song Contest for Ireland with \"In Your Eyes\"."], ["1993-05-24T00:00:00", "Eritrea gains independence from Ethiopia."], ["1993-05-25T00:00:00", "The International Criminal Tribunal for the former Yugoslavia is created in The Hague."], ["1993-05-27T00:00:00", "Massacre of Via dei Georgofili: A car bomb planted outside the Uffizi Gallery in Florence by the Mafia kills 5 and irretrievably destroys 3 paintings."], ["1993-05-28T00:00:00", "Eritrea and Monaco gain entry to the United Nations."], ["1993-05-29T00:00:00", "The first Life Ball takes place in Vienna, Austria. In 2011, the event is named the largest public charity on HIV and AIDS in Europe."], ["1993-06-01T00:00:00", "Large protests erupt against Slobodan Milošević's regime in Belgrade; opposition leader Vuk Drašković and his wife Danica are arrested."], ["1993-06-01T00:00:00", "President of Guatemala Jorge Serrano Elías is forced to flee the country after an attempted self-coup."], ["1993-06-01T00:00:00", "Burundian presidential election, 1993: The first multiparty elections in Burundi since the country's independence lead to the election of Melchior Ndadaye, leader of the Front for Democracy in Burundi. The next day's legislative election sees his party win with an overwhelming majority."], ["1993-06-05T00:00:00", "The National Assembly of Venezuela designates Ramón José Velásquez as successor of suspended President Carlos Andrés Pérez."], ["1993-06-05T00:00:00", "24 Pakistani troops in the United Nations forces are killed in Mogadishu, Somalia."], ["1993-06-06T00:00:00", "Following the Revolutionary Nationalist Movement's victory, Gonzalo Sánchez de Lozada becomes president of Bolivia."], ["1993-06-06T00:00:00", "Mongolia holds its first direct presidential elections."], ["1993-06-08T00:00:00", "The PKK-declared ceasefire ends in Iraq."], ["1993-06-14T00:00:00", "Multipartyists win a referendum on the future of the one-party system in Malawi."], ["1993-06-18T00:00:00", "Iraq disarmament crisis: Iraq refuses to allow UNSCOM weapons inspectors to install remote-controlled monitoring cameras at two missile engine test stands."], ["1993-06-20T00:00:00", "A 7.5 earthquake hits Japan, killing 385 people."], ["1993-06-20T00:00:00", "John Paxson's 3-point shot in game six of the NBA Finals helps the Chicago Bulls secure a 99-98 win over the Phoenix Suns, and their third consecutive championship."], ["1993-06-22T00:00:00", "Japan's New Party Sakigake breaks away from the Liberal Democratic Party."], ["1993-06-23T00:00:00", "In Manassas, Virginia, Lorena Bobbitt cuts off the penis of her husband John Wayne Bobbitt."], ["1993-06-24T00:00:00", "A Unabomber bomb injures computer scientist David Gelernter at Yale University."], ["1993-06-24T00:00:00", "Andrew Wiles wins worldwide fame after presenting his proof of Fermat's Last Theorem, a problem that had been unsolved for more than three centuries."], ["1993-06-25T00:00:00", "Kim Campbell becomes the 19th, and first female, Prime Minister of Canada."], ["1993-06-25T00:00:00", "Tansu Çiller of True Path Party forms the new government of Turkey."], ["1993-06-25T00:00:00", "Zoran Lilić succeeds Dobrica Ćosić as President of Yugoslavia."], ["1993-06-25T00:00:00", "The litas is introduced in Lithuania."], ["1993-06-25T00:00:00", "Jacques Attali resigns as President of the European Bank for Reconstruction and Development."], ["1993-06-27T00:00:00", "U.S. President Bill Clinton orders a cruise missile attack on Iraqi intelligence headquarters in the Al-Mansur District of Baghdad, in response to an Iraqi plot to assassinate former U.S. President George H. W. Bush during his visit to Kuwait in mid-April."], ["1993-06-27T00:00:00", "In Bad Kleinen, Germany, GSG 9 troopers arrest Birgit Hogefeld and kill Wolfgang Grams, two Red Army Faction terrorists."], ["1993-07-02T00:00:00", "An integrist mob sets fire to the hotel where The Satanic Verses translator Aziz Nesin resides in Sivas, Turkey, killing 37."], ["1993-07-02T00:00:00", "266 people died after a floating chapel, sank in Bocaue, Bulacan."], ["1993-07-05T00:00:00", "Iraq disarmament crisis: UN inspection teams leave Iraq. Iraq then agrees to UNSCOM demands and the inspection teams return."], ["1993-07-05T00:00:00", "Electrochemist Faiza Al-Kharafi is appointed rector (president) of Kuwait University, the first woman to head a major university in the Middle East."], ["1993-07-07T00:00:00", "Hurricane Calvin lands in Mexico. It is the second Pacific hurricane on record to land in Mexico in July, and kills 34."], ["1993-07-12T00:00:00", "A magnitude 7.8 earthquake off Hokkaidō, Japan launches a devastating tsunami that kills 202 on the small island of Okushiri, Hokkaido."], ["1993-07-19T00:00:00", "Japanese general election, 1993: The loss of majority of the Liberal Democratic Party results in a coalition taking power."], ["1993-07-19T00:00:00", "U.S. President Bill Clinton announces his 'Don't ask, don't tell' policy regarding gays in the American military."], ["1993-07-20T00:00:00", "White House deputy counsel Vince Foster commits suicide in Virginia."], ["1993-07-23T00:00:00", "Candelária massacre: Brazilian police officers kill eight street kids in Rio de Janeiro."], ["1993-07-26T00:00:00", "Miguel Indurain wins the 1993 Tour de France."], ["1993-07-26T00:00:00", "Asiana Airlines Flight 733 crashes into Mt. Ungeo in Haenam, South Korea; 68 die."], ["1993-07-27T00:00:00", "Windows NT 3.1, the first version of Microsoft's line of Windows NT operating systems, is released to manufacturing."], ["1993-07-29T00:00:00", "The Israeli Supreme Court acquits accused Nazi death camp guard John Demjanjuk of all charges and he is set free."], ["1993-07-31T00:00:00", "King Baudouin I of Belgium dies."], ["1993-08-04T00:00:00", "A federal judge sentences Los Angeles Police Department officers Stacey Koon and Laurence Powell to 30 months in prison for violating motorist Rodney King's civil rights."], ["1993-08-04T00:00:00", "The Japanese government issues the Kono Statement, acknowledging the comfort women's (sex slaves) deportation."], ["1993-08-05T00:00:00", "The discovery of the Tel Dan Stele, the first archaeological confirmation of the existence of the Davidic line, is announced."], ["1993-08-05T00:00:00", "Magic: The Gathering undergoes its first general release."], ["1993-08-06T00:00:00", "According to Japanese government and TBS networks reports, torrential rain and mudslides kill 72 in Kagoshima, Japan."], ["1993-08-09T00:00:00", "King Albert II of Belgium is sworn into office nine days after the death of his brother, King Baudouin I."], ["1993-08-13T00:00:00", "Over 130 die in the collapse of Royal Plaza Hotel at Nakhon Ratchasima in Thailand's worst hotel disaster."], ["1993-08-17T00:00:00", "For the first time, the public is allowed inside Buckingham Palace in London."], ["1993-08-18T00:00:00", "The 14th century Kapellbrücke covered wooden truss bridge in Lucerne (Switzerland) is largely destroyed by fire."], ["1993-08-21T00:00:00", "NASA loses radio contact with the Mars Observer orbiter 3 days before the spacecraft is scheduled to enter orbit around Mars."], ["1993-08-28T00:00:00", "Ong Teng Cheong becomes the first President of Singapore elected by the population."], ["1993-08-30T00:00:00", "Russia completes removing its troops from Lithuania."], ["1993-09-13T00:00:00", "Norwegian parliamentary election, 1993: The Labour Party wins a plurality of the seats, and Prime Minister Gro Harlem Brundtland retains office."], ["1993-09-13T00:00:00", "PLO leader Yasser Arafat and Israeli prime minister Yitzhak Rabin shake hands in Washington, D.C., after signing a peace accord."], ["1993-09-15T00:00:00", "Giuseppe 'Pino' Puglisi, an Italian priest in the Palermo neighborhood of Brancaccio, is assassinated in front of his church on his 56th birthday in retaliation for his anti-Mafia activism. One of the hitmen later confessed that Fr. Puglisi's last words as his killers approached were: \"I've been expecting you.\""], ["1993-09-17T00:00:00", "Russian troops withdraw from Poland."], ["1993-09-19T00:00:00", "Polish parliamentary election, 1993: A coalition of the Democratic Left Alliance and the Polish People's Party led by Waldemar Pawlak comes into power."], ["1993-09-22T00:00:00", "Big Bayou Canot train disaster: A bridge collapses as the Sunset Limited crosses it, killing 47."], ["1993-09-23T00:00:00", "The International Olympic Committee selects Sydney, Australia to host the 2000 Summer Olympics."], ["1993-09-24T00:00:00", "The Cambodian monarchy is restored, with Norodom Sihanouk as king."], ["1993-09-26T00:00:00", "The first mission in Biosphere 2 ends after two years."], ["1993-09-26T00:00:00", "PoSAT-1 (the first Portuguese satellite) is launched on board French rocket Ariane 4."], ["1993-09-27T00:00:00", "War in Abkhazia - Fall of Sukhumi: Eduard Shevardnadze accuses Russia of passive complicity."], ["1993-09-30T00:00:00", "An earthquake centered in Killari, Maharashtra, India kills over 10,000."], ["1993-10-03T00:00:00", "Battle of Mogadishu: The U.S. Army conducts Operation Gothic Serpent in the city of Mogadishu, Somalia, using Task Force Ranger. Two UH-60 Blackhawks are shot down and the operation leaves over 1,000 Somalians dead and over 73 Americans WIA, 19 KIA, and 1 captured."], ["1993-10-04T00:00:00", "The Russian constitutional crisis culminates with Russian military and security forces clearing the White House of Russia Parliament building by force, quashing a mass uprising against President Boris Yeltsin."], ["1993-10-05T00:00:00", "China performs a nuclear test, ending a worldwide de facto moratorium."], ["1993-10-05T00:00:00", "The papal encyclical Veritatis Splendor is promulgated."], ["1993-10-10T00:00:00", "The South Korean ferry Seohae capsizes off Pusan, South Korea; 292 are killed."], ["1993-10-10T00:00:00", "NTV Russia was lanuched."], ["1993-10-13T00:00:00", "Greek legislative election, 1993: Andreas Papandreou begins his second term as Prime Minister of Greece."], ["1993-10-13T00:00:00", "The fifth summit of the Francophonie opens in Mauritius."], ["1993-10-19T00:00:00", "Benazir Bhutto becomes the Prime Minister of Pakistan for the second time."], ["1993-10-21T00:00:00", "A coup in Burundi results in the death of president Melchior Ndadaye and sparks the Burundi Civil War."], ["1993-10-25T00:00:00", "Canadian federal election, 1993: Jean Chrétien and his Liberal Party defeat the governing Progressive Conservative Party, which falls to a historic low of 2 seats."], ["1993-10-30T00:00:00", "Greysteel massacre: Three members of the Ulster Defence Association, a loyalist paramilitary group, attack a crowded bar in Greysteel, Northern Ireland, with firearms, killing 8 civilians and wounding 13. The bar was targeted because it is in an Irish nationalist and Catholic area."], ["1993-11-01T00:00:00", "The Maastricht Treaty takes effect, formally establishing the European Union."], ["1993-11-05T00:00:00", "The Parliament of the United Kingdom passes the Railways Act 1993, setting out the procedures for privatisation of British Rail."], ["1993-11-09T00:00:00", "Bosnian Croat forces destroy the Stari Most, or Old Bridge of Mostar, Bosnia and Herzegovina, by tank fire."], ["1993-11-11T00:00:00", "Microsoft releases Windows for Workgroups 3.11 to manufacturing."], ["1993-11-11T00:00:00", "Sri Lankan Civil War - Battle of Pooneryn: Over 400 Sri Lankan military are killed."], ["1993-11-12T00:00:00", "London Convention: Marine dumping of radioactive waste is outlawed."], ["1993-11-18T00:00:00", "In a status referendum, Puerto Rico residents vote with a slim margin to maintain Commonwealth status."], ["1993-11-18T00:00:00", "In South Africa, 21 political parties approve a new constitution."], ["1993-11-18T00:00:00", "The first meeting of the Asia-Pacific Economic Cooperation summit opens in Seattle."], ["1993-11-20T00:00:00", "Savings and loan crisis: The United States Senate Ethics Committee issues a stern censure of California senator Alan Cranston for his dealings with savings-and-loan executive Charles Keating."], ["1993-11-20T00:00:00", "An Avioimpex Yakovlev Yak-42D crashes into Mount Trojani near Ohrid, Macedonia. The aircraft was on a flight from Geneva, Switzerland to Skopje, but had been diverted to Ohrid due to poor weather conditions at the Skopje airport. All 8 crew members and 115 of the 116 passengers are killed."], ["1993-11-28T00:00:00", "The Observer reveals that a channel of communications has existed between the Provisional Irish Republican Army and the British government, despite the government's persistent denials."], ["1993-11-30T00:00:00", "An agreement establishing the Permanent Commission for East African Co-operation is signed. U.S. President Bill Clinton signs the Brady Handgun Violence Prevention Act"], ["1993-12-01T00:00:00", "A train crash at Tattenham Corner railway station leads to the introduction of the current drugs and alcohol policy for railways in the UK."], ["1993-12-02T00:00:00", "STS-61: NASA launches the Space Shuttle Endeavour on a mission to repair an optical flaw in the Hubble Space Telescope."], ["1993-12-02T00:00:00", "The September 6 merger between Renault and Volvo fails; Volvo CEO Pehr G. Gyllenhammar resigns."], ["1993-12-05T00:00:00", "Rafael Caldera Rodríguez is elected President of Venezuela for the second time, succeeding interim president Ramón José Velásquez."], ["1993-12-07T00:00:00", "Colin Ferguson opens fire with his Ruger 9 mm pistol on a Long Island Rail Road train, killing 6 and injuring 19."], ["1993-12-07T00:00:00", "The 32-member Transitional Executive Committee holds its first meeting in Cape Town, marking the first meeting of an official government body in South Africa with Black members."], ["1993-12-07T00:00:00", "President of Côte d'Ivoire Félix Houphouët-Boigny dies at 88, the oldest African head of state. He is succeeded three days later by Henri Konan Bédié."], ["1993-12-08T00:00:00", "U.S. President Bill Clinton signs into law the North American Free Trade Agreement."], ["1993-12-10T00:00:00", "id Software releases Doom, a seminal first-person shooter that uses advanced 3D graphics for computer games."], ["1993-12-11T00:00:00", "Chilean presidential election, 1993: Eduardo Frei Ruiz-Tagle is elected with 58% of the vote."], ["1993-12-11T00:00:00", "A variety of Soviet space program paraphernalia are put to auction in Sotheby's New York, and sell for a total of US$6.8M. One of the items is Lunokhod 1 and its spacecraft Luna 17; they sell for $68,500."], ["1993-12-11T00:00:00", "One of the three blocks of the Highland Towers near Kuala Lumpur, Malaysia comes down, killing 48."], ["1993-12-12T00:00:00", "Péter Boross becomes Prime Minister of Hungary following the death of József Antall."], ["1993-12-13T00:00:00", "Prime Minister of Canada Kim Campbell resigns as leader of the Progressive Conservative Party, and is succeeded as leader by Jean Charest."], ["1993-12-13T00:00:00", "The Majilis of Kazakhstan approves the nuclear Non-Proliferation Treaty, and agrees to dismantle the more than 100 missiles left on its territory by the fall of the USSR."], ["1993-12-15T00:00:00", "Downing Street Declaration: The United Kingdom commits itself to the search for an answer to the problems of Northern Ireland."], ["1993-12-15T00:00:00", "The Uruguay Round of General Agreement on Tariffs and Trade (GATT) talks reach a successful conclusion after seven years."], ["1993-12-16T00:00:00", "Brazil's Supreme Court rules that former President Fernando Collor de Mello may not hold elected office again until 2000 due to political corruption."], ["1993-12-18T00:00:00", "Omar Bongo is re-elected as President of Gabon in the country's first multiparty elections."], ["1993-12-20T00:00:00", "The United Nations General Assembly votes unanimously to appoint a U.N. High Commissioner for Human Rights."], ["1993-12-20T00:00:00", "The first corrected images from the Hubble Telescope are taken."], ["1993-12-22T00:00:00", "The interim South African constitution is approved by Parliament 237-45."], ["1993-12-29T00:00:00", "Argentina passes a measure allowing President Carlos Menem and all future presidents to run for a second term. It also shortens presidential terms to 4 years and removes the requirement for the president to be Roman Catholic."], ["1993-12-30T00:00:00", "Israel and the Vatican establish diplomatic relations."], ["1993-12-30T00:00:00", "The Congress Party gains a parliamentary majority in India after the defection of 10 Janata Dal party lawmakers."]]