[["1958-01-01T00:00:00", "The European Economic Community (EEC) is founded."], ["1958-01-01T00:00:00", "The first Carrefour store opens, in Annecy."], ["1958-01-03T00:00:00", "Edmund Hillary's Commonwealth Trans-Antarctic Expedition completes the third overland journey to the South Pole, and the first to use powered vehicles."], ["1958-01-04T00:00:00", "Sputnik 1 (launched on October 4, 1957) falls to Earth from its orbit and burns up."], ["1958-01-08T00:00:00", "14-year-old Bobby Fischer wins the United States Chess Championship."], ["1958-01-18T00:00:00", "Armed Lumbee Indians confront a handful of Klansmen in Maxton, North Carolina."], ["1958-01-18T00:00:00", "The first of Leonard Bernstein's Young People's Concerts with the New York Philharmonic is telecast by CBS. The Emmy-winning series (one concert approximately every three months except for the summer) will run for more than fourteen years. It will make Bernstein's name a household word, and the most famous conductor in the U.S."], ["1958-01-20T00:00:00", "Anne de Vries releases the fourth and final volume of Journey Through the Night."], ["1958-01-28T00:00:00", "Hall of Fame baseball player Roy Campanella is involved in an automobile accident that ends his career and leaves him paralyzed."], ["1958-01-31T00:00:00", "The first successful American satellite, Explorer 1, is launched into orbit."], ["1958-02-01T00:00:00", "Egypt and Syria unite to form the United Arab Republic."], ["1958-02-02T00:00:00", "The word Aerospace is coined, from the words Aircraft (aero) and Spacecraft (space), taking into consideration that the Earth's atmosphere and outerspace is to be one, or a single realm."], ["1958-02-05T00:00:00", "Gamal Abdel Nasser is nominated as the first president of the United Arab Republic."], ["1958-02-05T00:00:00", "The Tybee Bomb, a 7,600 pound (3,500 kg) Mark 15 hydrogen bomb, is lost in the waters off Savannah, Georgia."], ["1958-02-06T00:00:00", "Seven Manchester United footballers are among the 21 people killed in the Munich air disaster in West Germany, on the return flight from a European Cup game in Yugoslavia. 23 people survive, but four of them, including manager Matt Busby and players Johnny Berry and Duncan Edwards, are in a serious condition."], ["1958-02-11T00:00:00", "The strongest ever known solar maximum is recorded."], ["1958-02-11T00:00:00", "Marshal Chen Yi succeeds Zhou Enlai as Chinese Minister of Foreign Affairs."], ["1958-02-11T00:00:00", "Ruth Carol Taylor is the first African American woman hired as a flight attendant. Hired by Mohawk Airlines, her career lasts only six months, due to another discriminatory barrier - the airline's ban on married flight attendants."], ["1958-02-14T00:00:00", "The Hashemite Kingdoms of Iraq and Jordan unite in the Arab Federation with King Faisal II of Iraq as head of state."], ["1958-02-17T00:00:00", "Pope Pius XII declares Saint Clare the patron saint of television."], ["1958-02-20T00:00:00", "A test rocket explodes at Cape Canaveral."], ["1958-02-21T00:00:00", "A peace symbol is designed and completed by Gerald Holtom, commissioned by the Campaign for Nuclear Disarmament, in protest against the Atomic Weapons Research Establishment."], ["1958-02-23T00:00:00", "Cuban rebels kidnap five-time world driving champion Juan Manuel Fangio, releasing him 28 hours later."], ["1958-02-23T00:00:00", "Arturo Frondizi is elected president of Argentina."], ["1958-02-24T00:00:00", "In Cuba, Fidel Castro's Radio Rebelde begins broadcasting from Sierra Maestra."], ["1958-02-25T00:00:00", "Bertrand Russell launches the Campaign for Nuclear Disarmament."], ["1958-02-28T00:00:00", "One of the worst school bus accidents in U.S. history occurs at Prestonburg, Kentucky; 29 are killed."], ["1958-03-01T00:00:00", "The Turkish passenger ship Üsküdar capsizes and sinks in the Gulf of İzmit, Turkey; at least 300 die."], ["1958-03-02T00:00:00", "A British Commonwealth Trans-Antarctic Expedition team led by Sir Vivian Fuchs completes the first overland crossing of the Antarctic, using snowcat caterpillar tractors and dogsled teams, in 99 days, via the South Pole."], ["1958-03-08T00:00:00", "The USS Wisconsin is decommissioned, leaving the United States Navy without an active battleship for the first time since 1896 (it is recommissioned October 22, 1988)."], ["1958-03-11T00:00:00", "A U.S. B-47 bomber accidentally drops an atom bomb on Mars Bluff, South Carolina. Without a fissile warhead, its conventional explosives destroy a house and injure several people."], ["1958-03-17T00:00:00", "The Convention on the Inter-Governmental Maritime Consultative Organization (IMCO) enters into force, founding the IMCO as a specialized agency of the United Nations."], ["1958-03-17T00:00:00", "The United States launches the Vanguard 1 satellite."], ["1958-03-19T00:00:00", "The Monarch Underwear Company fire occurs in New York."], ["1958-03-24T00:00:00", "The U.S. Army inducts Elvis Presley, transforming The King Of Rock & Roll into U.S. Private #53310761."], ["1958-03-25T00:00:00", "Canada's Avro Arrow makes its debut flight."], ["1958-03-26T00:00:00", "The United States Army launches Explorer 3."], ["1958-03-26T00:00:00", "The 30th Academy Awards ceremony takes place; The Bridge on the River Kwai wins seven awards, including Academy Award for Best Picture."], ["1958-03-27T00:00:00", "Nikita Khrushchev becomes Premier of the Soviet Union."], ["1958-04-01T00:00:00", "The BBC Radiophonic Workshop is established."], ["1958-04-03T00:00:00", "Castro's revolutionary army begins its attacks on Havana."], ["1958-04-04T00:00:00", "April 7 - In the first protest march for the Campaign for Nuclear Disarmament from Hyde Park, London to Aldermaston, Berkshire, demonstrators demand the banning of nuclear weapons."], ["1958-04-04T00:00:00", "Cheryl Crane, daughter of actress Lana Turner, fatally stabs her mother's gangster lover Johnny Stompanato (the stabbing is eventually ruled as self-defense)."], ["1958-04-06T00:00:00", "Soraya Esfandiary-Bakhtiari divorces the Shah of Iran, Mohammad Reza Pahlavi after she is unable to produce any children."], ["1958-04-14T00:00:00", "The satellite Sputnik 2 disintegrates in space after several orbits."], ["1958-04-14T00:00:00", "Van Cliburn wins the International Tchaikovsky Competition for pianists in Moscow, breaking Cold War tensions."], ["1958-04-15T00:00:00", "The San Francisco Giants beat the Los Angeles Dodgers 8-0 at San Francisco's Seals Stadium, in the first Major League Baseball regular season game ever played in California."], ["1958-04-17T00:00:00", "King Baudouin of Belgium officially opens the world's fair in Brussels, also known as Expo 58. The Atomium forms the centrepiece."], ["1958-04-20T00:00:00", "The Montreal Canadiens win the Stanley Cup after defeating the Boston Bruins in six games."], ["1958-04-21T00:00:00", "United Airlines Flight 736 is involved in a mid-air collision with a U.S. Air Force F-100F jet fighter near Las Vegas. All 49 persons in both aircraft are killed."], ["1958-05-01T00:00:00", "Arturo Frondizi becomes President of Argentina."], ["1958-05-01T00:00:00", "The Nordic Passport Union comes into force."], ["1958-05-09T00:00:00", "Actor-singer Paul Robeson, whose passport has been reinstated, sings in a sold-out one-man recital at Carnegie Hall. The recital is such a success that Robeson gives another one at Carnegie Hall a few days later; but, after this, Robeson is seldom seen in public in the United States again. His Carnegie Hall concerts are later released on records and on CD."], ["1958-05-10T00:00:00", "Interviewed in the Chave d'Ouro café, when asked about his rival António de Oliveira Salazar, Humberto Delgado utters one of the most famous comments in Portuguese political history: \"Obviamente, demito-o! (Obviously, I'll sack him!)\"."], ["1958-05-12T00:00:00", "A formal North American Aerospace Defense Command agreement is signed between the United States and Canada."], ["1958-05-13T00:00:00", "French Algerian protesters seize government offices in Algiers, leading to a military coup."], ["1958-05-13T00:00:00", "During a visit to Caracas, Venezuela, Vice President Richard Nixon's car is attacked by anti-American demonstrators."], ["1958-05-15T00:00:00", "The Soviet Union launches Sputnik 3."], ["1958-05-15T00:00:00", "MGM's Gigi opens in New York City, beginning its run in the U.S. after being shown at the Cannes film festival. The last of the great MGM musicals, it will become a huge critical and box office success and win nine Academy Awards including Best Picture. Gigi is Lerner and Loewe's first musical written especially for film, and is deliberately written in a style evoking the team's My Fair Lady, which was still playing on Broadway at the time and could not be filmed yet."], ["1958-05-18T00:00:00", "An F-104 Starfighter sets a world speed record of 1,404.19 mph (2,259.82 km/h)."], ["1958-05-20T00:00:00", "Fulgencio Batista's government launches a counteroffensive against Castro's rebels."], ["1958-05-21T00:00:00", "United Kingdom Postmaster General Ernest Marples announces that from December, Subscriber Trunk Dialling will be introduced in the Bristol area."], ["1958-05-23T00:00:00", "Explorer 1 ceases transmission."], ["1958-05-28T00:00:00", "Real Madrid beats A.C.Milan 3-2 at Heysel Stadium, Brussels and wins the 1957-58 European Cup (football)."], ["1958-05-30T00:00:00", "The bodies of unidentified United States soldiers killed in action during World War II and the Korean War are buried at the Tomb of the Unknowns in Arlington National Cemetery."], ["1958-06-01T00:00:00", "Charles de Gaulle is brought out of retirement to lead France by decree for 6 months."], ["1958-06-01T00:00:00", "Iceland extends its fishing limits to 12 miles (22.2 km)."], ["1958-06-02T00:00:00", "In San Simeon, California, Hearst Castle opens to the public for guided tours."], ["1958-06-04T00:00:00", "French President Charles de Gaulle visits Algeria."], ["1958-06-08T00:00:00", "The SS Edmund Fitzgerald is launched; she will be the largest Lake freighter for more than a dozen years."], ["1958-06-15T00:00:00", "Pizza Hut is founded."], ["1958-06-16T00:00:00", "Imre Nagy is hanged for treason in Hungary."], ["1958-06-20T00:00:00", "The iron barque Omega of Callao, Peru (built in Scotland, 1887), sinks on passage carrying guano from the Pachacamac Islands for Huacho, the world's last full-rigged ship trading under sail alone."], ["1958-06-27T00:00:00", "The Peronist party becomes legal again in Argentina."], ["1958-06-29T00:00:00", "Brazil beats Sweden 5-2 to win the football World Cup."], ["1958-06-30T00:00:00", "The Ifni War ends."], ["1958-07-05T00:00:00", "Gasherbrum I, the 11th highest mountain in the world, is first ascended."], ["1958-07-07T00:00:00", "United States President Dwight D. Eisenhower signs the Alaska Statehood Act into law."], ["1958-07-07T00:00:00", "The first International House of Pancakes (IHOP) opens in Toluca Lake, Los Angeles."], ["1958-07-09T00:00:00", "1958 Lituya Bay megatsunami: A 7.5 Richter scale earthquake in Lituya Bay, Alaska, causes a landslide that produces a huge 520-meter high megatsunami."], ["1958-07-10T00:00:00", "The first parking meters are installed in Britain."], ["1958-07-11T00:00:00", "Count Michael Rhédey von Kis-Rhéde, direct descendant of Samuel Aba, King of Hungary, at the age of 60 is pistol-whipped and murdered over a few hectares of land by Czechoslovak Communists during the collectivization process at his residence in Olcsvar, Slovakia."], ["1958-07-11T00:00:00", "Scottish serial killer Peter Manuel, \"The Beast of Birkenshaw\" is hanged at Barlinnie Prison in Glasgow for the murder of seven people."], ["1958-07-12T00:00:00", "The Beatles, at this time The Quarrymen, pay 17 shillings and 6 pence to have their first recording session where they record That'll Be The Day by Buddy Holly and In Spite Of All The Danger by Paul McCartney and George Harrison."], ["1958-07-12T00:00:00", "Henri Cornelis becomes Governor-General of the Belgian Congo, the last Belgian governor prior to independence."], ["1958-07-14T00:00:00", "July 14 Revolution in Iraq. King Faisal is killed. Abdul Qassim assumes power."], ["1958-07-15T00:00:00", "In Lebanon, 5,000 United States Marines land in the capital Beirut in order to protect the pro-Western government there."], ["1958-07-17T00:00:00", "British paratroopers arrive in Jordan; King Hussein has asked help against pressure from Iraq."], ["1958-07-20T00:00:00", "Various rebel groups in Cuba join forces but the communists do not join them."], ["1958-07-24T00:00:00", "The first life peerage under the Life Peerages Act 1958 is created in the United Kingdom."], ["1958-07-26T00:00:00", "Explorer program: Explorer 4 is launched."], ["1958-07-26T00:00:00", "Elizabeth II gives her son and heir apparent The Prince Charles the customary title of Prince of Wales."], ["1958-07-29T00:00:00", "The U.S. Congress formally creates the National Aeronautics and Space Administration (NASA)."], ["1958-07-31T00:00:00", "The Tibetan resistance movement against rule by China receives support from the United States Central Intelligence Agency."], ["1958-08-01T00:00:00", "The last Tom and Jerry episode (Tot Watchers) made by William Hanna and Joseph Barbera is released. Tom and Jerry will not be released to theatres again until 1961."], ["1958-08-03T00:00:00", "The nuclear-powered submarine USS Nautilus becomes the first vessel to cross the North Pole under water."], ["1958-08-06T00:00:00", "Australian athlete Herb Elliott clips almost three seconds off the world record for the mile run at Santry Stadium, Dublin, recording a time of 3 minutes 54.5 seconds."], ["1958-08-14T00:00:00", "A 4-engine Lockheed L-1049 Super Constellation aircraft belonging to KLM crashes into the sea with 99 people on board."], ["1958-08-17T00:00:00", "The first Thor-Able rocket is launched, carrying Pioneer 0, from Cape Canaveral Air Force Station Space Launch Complex 17. The launch fails due to a first stage malfunction."], ["1958-08-18T00:00:00", "Vladimir Nabokov's controversial novel Lolita is published in the United States."], ["1958-08-18T00:00:00", "Brojen Das from East Pakistan swims across the English Channel in a competition, as the first Bangali as well as the first Asian to ever do it. He is first among 39 competitors."], ["1958-08-23T00:00:00", "Chinese Civil War: The Second Taiwan Strait Crisis begins with the People's Liberation Army's bombardment of Quemoy."], ["1958-08-23T00:00:00", "President of the United States Dwight D. Eisenhower signs the Federal Aviation Act, transferring all authority over aviation in the USA to the newly created Federal Aviation Agency (FAA, later renamed Federal Aviation Administration)."], ["1958-08-27T00:00:00", "Operation Argus: The United States begins nuclear tests over the South Atlantic."], ["1958-08-29T00:00:00", "Michael Jackson is born."], ["1958-08-30T00:00:00", "September 1 - Notting Hill race riots: Riots occur between blacks and whites in Notting Hill, London."], ["1958-09-01T00:00:00", "The first Cod War begins between the United Kingdom and Iceland."], ["1958-09-06T00:00:00", "Paul Robeson performs in concert at the Soviet Young Pioneer camp Artek."], ["1958-09-12T00:00:00", "Jack Kilby invents the first integrated circuit."], ["1958-09-14T00:00:00", "Two rockets designed by German engineer Ernst Mohr (the first German post-war rockets) reach the upper atmosphere."], ["1958-09-27T00:00:00", "Typhoon Ida kills at least 1,269 in Honshū, Japan."], ["1958-09-27T00:00:00", "Hurricane Helene, the worst storm of the North Atlantic hurricane season, reaches category 4 status."], ["1958-09-28T00:00:00", "In France, a majority of 79% says yes to the constitution of the Fifth Republic."], ["1958-09-30T00:00:00", "The U.S.S.R. performs a nuclear test at Novaya Zemlya."], ["1958-10-01T00:00:00", "Tunisia and Morocco join the Arab League."], ["1958-10-01T00:00:00", "NASA starts operations and replaces the NACA."], ["1958-10-02T00:00:00", "Guinea declares itself independent from France."], ["1958-10-04T00:00:00", "BOAC uses the new De Havilland Comet jets, to become the first airline to fly jet passenger services across the Atlantic."], ["1958-10-09T00:00:00", "Pope Pius XII dies."], ["1958-10-11T00:00:00", "Pioneer 1, the second and most successful of the 3 project Able space probes, becomes the first spacecraft launched by the newly formed NASA."], ["1958-10-13T00:00:00", "Penny Coelen is crowned as Miss World 1958 during the 8th Miss World pageant, the first South African to win the title."], ["1958-10-16T00:00:00", "First broadcast of the long-running BBC Television children's programme Blue Peter."], ["1958-10-19T00:00:00", "Beginning of Great Chinese Famine."], ["1958-10-21T00:00:00", "The Life Peerages Act entitles women to sit in the British House of Lords for the first time. The Baronesses Swanborough (Stella Isaacs, Marchioness of Reading) and Wooton (Barbara Wootton, Baroness Wootton of Abinger) are the first to take their seats."], ["1958-10-23T00:00:00", "Nobel Committee announces Boris Pasternak as the winner of the 1958 Prize for Literature"], ["1958-10-26T00:00:00", "First transatlantic flight of a Pan American World Airways Boeing 707."], ["1958-10-28T00:00:00", "Pope John XXIII succeeds Pope Pius XII as the 261st pope."], ["1958-11-03T00:00:00", "The new UNESCO building is inaugurated in Paris."], ["1958-11-10T00:00:00", "The bossa nova is born in Rio de Janeiro, with João Gilberto's recording of Chega de Saudade."], ["1958-11-10T00:00:00", "Harry Winston donates the Hope Diamond to the Smithsonian Institution."], ["1958-11-18T00:00:00", "En route to Rogers City, Michigan, the lake freighter SS Carl D. Bradley breaks up and sinks in a storm on Lake Michigan; 33 of the 35 crewmen on board perish."], ["1958-11-22T00:00:00", "The Menzies Liberal government in Australia is re-elected for a fifth term."], ["1958-11-23T00:00:00", "The radio version of Have Gun - Will Travel premieres. It is one of the last dramas to go on the air on commercial radio. Only some NPR stations will broadcast radio dramas in years to come."], ["1958-11-25T00:00:00", "French Sudan gains autonomy as a self-governing member of the French colonial empire."], ["1958-11-28T00:00:00", "Chad, the Republic of the Congo, and Gabon become autonomous republics within the French colonial empire."], ["1958-11-30T00:00:00", "Gaullists win the French parliamentary election."], ["1958-12-01T00:00:00", "Adolfo López Mateos takes office as President of Mexico."], ["1958-12-01T00:00:00", "Our Lady of the Angels School fire: At least 90 students and 3 nuns are killed in a fire in Chicago."], ["1958-12-05T00:00:00", "Subscriber trunk dialling (STD) is inaugurated in the United Kingdom by the Queen, when she dials a call from Bristol to Edinburgh and speaks to the Lord Provost."], ["1958-12-05T00:00:00", "Prime Minister Harold Macmillan personally inspects and opens the United Kingdom's first ever motorway, the Preston Bypass, to traffic for the first time. The Bypass is now part of the M6 and M55 Motorways, and was significantly upgraded in the mid 1990s. 11 months later the M1, M45 and M10 Motorways open."], ["1958-12-09T00:00:00", "The right-wing John Birch Society is founded in the United States by Robert W. Welch, Jr., a retired candy manufacturer."], ["1958-12-14T00:00:00", "The 3rd Soviet Antarctic Expedition becomes the first ever to reach the Southern Pole of Inaccessibility."], ["1958-12-15T00:00:00", "Arthur L. Schawlow and Charles H. Townes of Bell Laboratories publish a paper in Physical Review Letters setting out the principles of the optical laser."], ["1958-12-16T00:00:00", "A fire breaks out in the Vida Department Store in Bogotá, Colombia and kills 84 persons."], ["1958-12-18T00:00:00", "The United States launches SCORE, the world's first communications satellite."], ["1958-12-18T00:00:00", "The Bell XV-3 Tiltrotor makes the first true mid-air transition from vertical helicopter-type flight to fully level fixed-wing flight."], ["1958-12-19T00:00:00", "A message from U.S. President Dwight D. Eisenhower is broadcast from the SCORE satellite."], ["1958-12-21T00:00:00", "General Charles de Gaulle is elected president of France with 78.5% of the votes."], ["1958-12-24T00:00:00", "1958 BOAC Bristol Britannia crash: A BOAC Bristol Britannia (312 G-AOVD) crashes near Winkton, England during a test flight."], ["1958-12-25T00:00:00", "Tchaikovsky's ballet The Nutcracker (the George Balanchine version) is shown on prime-time television in color for the first time, as an episode of the CBS anthology series Playhouse 90."], ["1958-12-28T00:00:00", "In American football, the Baltimore Colts beat the New York Giants 23-17 to win the NFL Championship Game, the first to go into sudden death overtime and \"The Greatest Game Ever Played\"."], ["1958-12-29T00:00:00", "Rebel troops under Che Guevara begin to invade Santa Clara, Cuba. Fulgencio Batista resigns two days later, on the night of the 31st."], ["1958-12-31T00:00:00", "Tallies reveal that, for the first time, the total of passengers carried by air this year exceeds the total carried by sea in transatlantic service."]]