[["1974-01-20T00:00:00", "The General Dynamics F-16 Fighting Falcon makes its first flight at Edwards Air Force Base, California."], ["1974-01-26T00:00:00", "Bülent Ecevit, of CHP forms the new government of Turkey (37th government, partner MSP)."], ["1974-02-01T00:00:00", "Fire breaks out in the Joelma Building in São Paulo, Brazil; 177 die, 293 are injured, 11 die later of their injuries."], ["1974-02-01T00:00:00", "Kuala Lumpur, the capital of Malaysia, is declared a Federal Territory."], ["1974-02-08T00:00:00", "After a record 84 days in orbit, the crew of Skylab 4 returns to Earth."], ["1974-02-17T00:00:00", "A soccer stampede occurs in Cairo, killing 49."], ["1974-03-03T00:00:00", "Turkish Airlines Flight 981 travelling from Paris to London crashes in a wood near Paris, killing all 346 aboard."], ["1974-03-04T00:00:00", "Following a hung parliament in the United Kingdom general election, Conservative prime minister Edward Heath resigns and is succeeded by Labour's Harold Wilson, who previously led the country from 1964 to 1970."], ["1974-03-04T00:00:00", "People magazine's first issue released in the U.S. Mia Farrow is on the cover."], ["1974-03-08T00:00:00", "Charles de Gaulle Airport opens in Paris, France."], ["1974-03-10T00:00:00", "Japanese holdout: A Japanese World War II soldier, Second Lieutenant Hiroo Onoda, surrenders in the Philippines."], ["1974-03-18T00:00:00", "End of 1973 oil crisis: Most OPEC nations end a 5-month oil embargo against the United States, Europe and Japan."], ["1974-03-18T00:00:00", "After 23 consecutive years on television, Lucille Ball airs the series finale of Here's Lucy and does not continue a weekly television series."], ["1974-03-29T00:00:00", "The Terracotta Army of Qin Shi Huang is discovered at Xi'an, China."], ["1974-04-02T00:00:00", "French president Georges Pompidou, dies of cancer at 63. Alain Poher succeeds him immediately; Valéry Giscard d'Estaing wins the presidential contest in May 1974."], ["1974-04-04T00:00:00", "Hank Aaron ties Babe Ruth for the all-time home run record with his 714th at Riverfront Stadium in Cincinnati."], ["1974-04-05T00:00:00", "Stephen King publishes Carrie, his first novel."], ["1974-04-06T00:00:00", "Swedish pop group ABBA win the 1974 Eurovision Song Contest with Waterloo."], ["1974-04-06T00:00:00", "California Jam is held at the Ontario Motor Speedway in Ontario, California, attracting 250,000 fans."], ["1974-04-08T00:00:00", "Hank Aaron became the all-time MLB home run leader with his 715th at Atlanta in front of a national television audience."], ["1974-04-11T00:00:00", "The Kiryat Shmona massacre takes place in Israel."], ["1974-04-15T00:00:00", "As \"Tania\", Patty Hearst is photographed wielding an M1 carbine while robbing the Sunset District branch of the Hibernia Bank in San Francisco."], ["1974-04-25T00:00:00", "Carnation Revolution: A left-wing military coup in Portugal restores democracy, ending 48 years of Estado Novo and Ditadura Nacional dictatorship in the country. Portuguese Prime Minister Marcelo Caetano flees to Brazil and is granted political asylum by Brazilian military president Ernesto Geisel."], ["1974-05-04T00:00:00", "An all-female Japanese team summits Manaslu in Nepal, becoming the first women to climb an 8,000 metre peak."], ["1974-05-04T00:00:00", "The Expo '74 world's fair opens in Spokane, Washington."], ["1974-05-17T00:00:00", "Dublin and Monaghan bombings: The Ulster Volunteer Force (UVF), explode four car bombs in Dublin and Monaghan in the Republic of Ireland. The attacks kill 33 civilians and wound almost 300, the highest number of casualties in any single day during \"The Troubles\"."], ["1974-05-18T00:00:00", "Nuclear test: Under Project Smiling Buddha, India successfully detonates its first nuclear weapon, becoming the 6th nation to do so."], ["1974-05-18T00:00:00", "The Warsaw radio mast is completed, the second tallest structure ever built (it collapses on August 8, 1991)."], ["1974-05-19T00:00:00", "The Philadelphia Flyers defeat the Boston Bruins to become the first team from the 1967 NHL expansion class to win the Stanley Cup in the North American National Hockey League."], ["1974-05-30T00:00:00", "NASA's ATS-6 satellite is launched."], ["1974-06-04T00:00:00", "The Cleveland Indians stage an ill-advised Ten Cent Beer Night for a game against the Texas Rangers at Cleveland Municipal Stadium. Cleveland forfeits after alcohol-fueled mayhem and violence spreads from the stands onto the field."], ["1974-06-13T00:00:00", "The 1974 FIFA World Cup begins in West Germany."], ["1974-06-26T00:00:00", "The Universal Product Code is scanned for the first time, to sell a package of Wrigley's chewing gum at the Marsh Supermarket in Troy, Ohio."], ["1974-06-29T00:00:00", "Isabel Perón is sworn in as the first female President of Argentina, replacing her sick husband Juan Perón, who dies 2 days later."], ["1974-06-29T00:00:00", "America Sings attraction opens to the public for the first time at Disneyland in Anaheim, California."], ["1974-07-07T00:00:00", "West Germany beats the Netherlands 2-1 to win the 1974 FIFA World Cup. The West German football team are awarded the new FIFA World Cup Trophy."], ["1974-07-08T00:00:00", "Two weeks after the attraction's opening, an 18 year old employee is crushed to her death while working on America Sings at Disneyland. This is the first casualty to occur to an employee at a Disney Park."], ["1974-07-15T00:00:00", "News anchor Christine Chubbuck commits suicide during a live broadcast on WXLT-TV in Sarasota, Florida."], ["1974-07-19T00:00:00", "Railcar explosion in Decatur, Illinois. A tanker car collides with a Norfolk & Western boxcar. Seven people are killed, 349 are injured and $18 million in property damage."], ["1974-07-20T00:00:00", "The Turkish invasion of Cyprus occurs."], ["1974-07-23T00:00:00", "The Greek military junta is replaced by a civilian government in Greece concluding the seven-year military rule."], ["1974-08-04T00:00:00", "A bomb explodes in a train between Italy and West Germany, killing 12 and wounding 48. Italian neo-fascists take responsibility."], ["1974-08-08T00:00:00", "Watergate scandal: U.S. President Richard Nixon announces his resignation (effective August 9)."], ["1974-08-09T00:00:00", "Vice President Gerald Ford succeeds Richard Nixon as the 38th President of the United States."], ["1974-08-14T00:00:00", "Turkey invades Cyprus for the second time, occupying 37% of the island's territory."], ["1974-08-30T00:00:00", "An express train bound for Germany from Belgrade derails in Zagreb, Yugoslavia (now Croatia), killing more than 150 passengers."], ["1974-09-08T00:00:00", "TWA Flight 841 crashes into the Ionian Sea 18 minutes after take off from Athens, after a bomb explodes in the cargo hold, and kills 88 people."], ["1974-09-10T00:00:00", "The Portuguese military junta grants independence to Guinea-Bissau."], ["1974-09-12T00:00:00", "Emperor Haile Selassie of Ethiopia is deposed by the Derg, bringing an end to the Solomonic dynasty's rule since 1270. The Ethiopian Civil War begins."], ["1974-09-13T00:00:00", "Japanese Red Army members seize the French Embassy in The Hague, Netherlands."], ["1974-09-20T00:00:00", "The Kootenai War is declared, and 10-cent tolls are charged on U.S. Highway 95."], ["1974-09-23T00:00:00", "Ceefax (one of the first public service information systems) is started by the BBC."], ["1974-10-11T00:00:00", "The UK Labour government of Harold Wilson wins the second general election of the year, forming a three-seat majority. Wilson, who has led the party for a total of 11 years, has now won four of the five general elections he has contested."], ["1974-10-30T00:00:00", "The Rumble in the Jungle takes place in Kinshasa, Zaire, where Muhammad Ali knocks out George Foreman in 8 rounds to regain the Heavyweight title, which had been stripped from him 7 years earlier."], ["1974-11-01T00:00:00", "The World Tourism Organization (WTO or WToO) is established."], ["1974-11-01T00:00:00", "The German electronic band Kraftwerk releases their studio album Autobahn."], ["1974-11-13T00:00:00", "Ronald DeFeo, Jr., murders his entire family in their home in Amityville on Long Island, an event that inspires the story of The Amityville Horror."], ["1974-11-16T00:00:00", "Arecibo message: The radio telescope at the Arecibo Observatory on Puerto Rico sends an interstellar radio message towards Messier 13, the Great Globular Cluster in Hercules. The message will reach its destination around the year 27,000."], ["1974-11-21T00:00:00", "Birmingham pub bombings: In Birmingham, England, two pubs are bombed, killing 21 people in an attack widely believed at the time to be linked to the Provisional Irish Republican Army. The Birmingham Six are later sentenced to life in prison for this, but their convictions are quashed after a lengthy campaign."]]