[["1997-01-17T00:00:00", "A Delta II rocket carrying a military GPS payload explodes, shortly after liftoff from Cape Canaveral."], ["1997-01-18T00:00:00", "In northwest Rwanda, Hutu militia members kill 6 Spanish aid workers, 3 soldiers, and seriously wound another."], ["1997-01-19T00:00:00", "Yasser Arafat returns to Hebron after more than 30 years, and joins celebrations over the handover of the last Israeli-controlled West Bank city."], ["1997-01-20T00:00:00", "U.S. President Bill Clinton is inaugurated for his second term."], ["1997-01-22T00:00:00", "Madeleine Albright becomes the first female Secretary of State, after confirmation by the United States Senate."], ["1997-01-23T00:00:00", "Mir Aimal Kasi is sentenced to death for a 1993 assault rifle attack outside CIA headquarters that killed 2 and wounded 3."], ["1997-01-27T00:00:00", "It is revealed that French museums had nearly 2,000 pieces of art that had been stolen by Nazis."], ["1997-02-04T00:00:00", "On their way to Lebanon, 2 Israeli troop-transport helicopters collide, killing 73."], ["1997-02-04T00:00:00", "After at first contesting the results, Serbian President Slobodan Milošević recognizes opposition victories in the November 1996 elections."], ["1997-02-04T00:00:00", "British Home Secretary Michael Howard informs Moors Murderer Myra Hindley that she will never be released from prison. Mr. Howard has made the decision in agreement with a recommendation made by his predecessor David Waddington in 1990."], ["1997-02-05T00:00:00", "The so-called \"Big Three\" banks in Switzerland announce the creation of a $71 million fund to aid Holocaust survivors and their families."], ["1997-02-05T00:00:00", "Morgan Stanley and Dean Witter Reynolds investment banks announce a $10 billion merger."], ["1997-02-10T00:00:00", "The United States Army suspends Gene C. McKinney, Sergeant Major of the Army, its top-ranking enlisted soldier, after hearing allegations of sexual misconduct."], ["1997-02-10T00:00:00", "Sandline affair: Australian newspapers publish stories that the government of Papua New Guinea has brought mercenaries onto Bougainville Island."], ["1997-02-13T00:00:00", "STS-82: Tune-up and repair work on the Hubble Space Telescope is started by astronauts from the Space Shuttle Discovery."], ["1997-02-13T00:00:00", "The Dow Jones Industrial Average closes above 7,000 for the first time, gaining 60.81 to 7,022.44."], ["1997-02-22T00:00:00", "In Roslin, Scotland, scientists announce that an adult sheep named Dolly had been successfully cloned, and was born in July 1996."], ["1997-02-23T00:00:00", "A small fire occurs on the Russian space station Mir."], ["1997-02-27T00:00:00", "Divorce becomes legal in the Republic of Ireland."], ["1997-02-28T00:00:00", "North Hollywood shootout: Two robbers wearing kevlar body armor armed with AK-47s containing armor-piercing bullets injure 17 police officers and civilians in a gun battle. The incident sparks debate on the appropriate firepower for United States patrol officers to have available in similar situations in the future."], ["1997-03-04T00:00:00", "U.S. President Bill Clinton bans federal funding for any research on human cloning."], ["1997-03-06T00:00:00", "Pablo Picasso's Tête de Femme is stolen from a London gallery (recovered a week later)."], ["1997-03-06T00:00:00", "In Sri Lanka, Tamil Tigers overrun a military base and kill more than 200."], ["1997-03-13T00:00:00", "India's Missionaries of Charity chooses Sister Nirmala to succeed Mother Teresa as its leader."], ["1997-03-13T00:00:00", "The National People's Congress of the People's Republic of China creates a new Chongqing Municipality, out of part of Sichuan."], ["1997-03-13T00:00:00", "The Phoenix Lights, a series of UFOs, are seen over Phoenix, Arizona."], ["1997-03-16T00:00:00", "Sandline affair: On Bougainville Island, soldiers of commander Jerry Singirok arrest Tim Spicer and his mercenaries of the Sandline International."], ["1997-03-18T00:00:00", "The tail of a Russian An-24 charter plane breaks off while en route to Turkey, causing the plane to crash, killing all 50 on board, and resulting in the grounding of all An-24s."], ["1997-03-21T00:00:00", "In Zaire, Etienne Tshiksekedi is appointed prime minister; he ejects supporters of Mobutu Sese Seko from his cabinet."], ["1997-03-21T00:00:00", "Mercenaries of Sandline International withdraw from Papua New Guinea."], ["1997-03-22T00:00:00", "Tara Lipinski, 14, becomes the youngest women's world figure skating champion."], ["1997-03-22T00:00:00", "The Comet Hale-Bopp makes its closest approach to Earth."], ["1997-03-23T00:00:00", "The British detective drama show, Midsomer Murders broadcasts on ITV."], ["1997-03-24T00:00:00", "The 69th Academy Awards, hosted by Billy Crystal, are held at the Shrine Auditorium in Los Angeles, with The English Patient winning Best Picture."], ["1997-03-26T00:00:00", "In San Diego, 39 Heaven's Gate cultists commit mass suicide at their compound."], ["1997-03-26T00:00:00", "Julius Chan resigns as prime minister of Papua New Guinea, ending the Sandline affair."], ["1997-04-01T00:00:00", "Comet Hale-Bopp meets or exceeds most predictions when it passes perihelion."], ["1997-04-03T00:00:00", "The Thalit massacre in Algeria: All but one of the 53 inhabitants of Thalit are killed by guerrillas."], ["1997-04-11T00:00:00", "Fire damages the Turin Cathedral in Italy."], ["1997-04-14T00:00:00", "Fire breaks out in a pilgrim camp on the Plain of Mena, 7 miles (11 km) from Mecca; 343 die."], ["1997-04-14T00:00:00", "Former S.S. Captain Erich Priebke is retried; on July 22 he is sentenced to 5 years in prison."], ["1997-04-16T00:00:00", "Houston, socialite Doris Angleton is murdered in her River Oaks home. Her brother-in-law, Roger Angleton, later admits to the crime in his suicide note."], ["1997-04-18T00:00:00", "The Red River of the North breaks through dikes and floods Grand Forks, North Dakota, and East Grand Forks, Minnesota, causing US$2 billion in damage."], ["1997-04-21T00:00:00", "A Pegasus rocket carries the remains of 24 people into earth orbit, in the first space burial."], ["1997-04-22T00:00:00", "Haouch Khemisti massacre: 93 villagers are killed in Algeria."], ["1997-04-22T00:00:00", "A 126-day hostage crisis at the residence of the Japanese ambassador in Lima, Peru, ends after government commandos storm and capture the building, rescuing 71 hostages. One hostage dies of a heart attack, 2 soldiers are killed by rebel fire, and all 14 Túpac Amaru rebels are slain."], ["1997-04-22T00:00:00", "France supports the new transitional government in Zaire, withdrawing its support of Mobutu Sese Seko."], ["1997-04-23T00:00:00", "42 villagers are killed in the Omaria massacre in Algeria."], ["1997-04-27T00:00:00", "Andrew Cunanan murders Jeffrey Trail, beginning a murder spree that lasts until July and ends with the murder of fashion designer Gianni Versace."], ["1997-04-29T00:00:00", "The Organization for the Prohibition of Chemical Weapons (OPCW), CWC treaty enters into force."], ["1997-04-29T00:00:00", "Two trains crash at Hunan, China; 126 are killed."], ["1997-05-02T00:00:00", "The Labour Party of the United Kingdom returns to power for the first time in 18 years, with Tony Blair becoming Prime Minister, in a landslide majority in the 1997 general election."], ["1997-05-03T00:00:00", "Katrina and the Waves win the Eurovision Song Contest 1997 for the UK with \"Love Shine a Light\", the most successful Eurovision entry ever."], ["1997-05-08T00:00:00", "Playhouse Disney launches."], ["1997-05-10T00:00:00", "An earthquake near Ardekul, in northeastern Iran, kills at least 2,400."], ["1997-05-11T00:00:00", "IBM's Deep Blue defeats Garry Kasparov in the last game of the rematch, the first time a computer beats a chess World champion in a match."], ["1997-05-12T00:00:00", "The Russian-Chechen Peace Treaty is signed."], ["1997-05-14T00:00:00", "The Star Alliance is formed between Air Canada, Lufthansa, Scandinavian Airlines System, Thai Airways International and United Airlines."], ["1997-05-15T00:00:00", "The United States government acknowledges existence of the \"Secret War\" in Laos (1953-1975) during the Vietnam War, and dedicates the Laos Memorial in honor of Hmong and other \"Secret War\" veterans."], ["1997-05-16T00:00:00", "President Mobutu Sese Seko is exiled from Zaire."], ["1997-05-16T00:00:00", "U.S. President Bill Clinton issues a formal apology to the surviving victims of the Tuskegee Study of Untreated Syphilis in the Negro Male and their families."], ["1997-05-17T00:00:00", "Troops of Laurent Kabila march into Kinshasa."], ["1997-05-22T00:00:00", "Kelly Flinn, the U.S. Air Force's first female bomber pilot certified for combat, accepts a general discharge in order to avoid a court-martial."], ["1997-05-23T00:00:00", "Mohammad Khatami wins the 1997 Iranian presidential election and becomes the first Iranian Reformist president."], ["1997-05-25T00:00:00", "French legislative election, 1997 first-round voting."], ["1997-05-25T00:00:00", "Strom Thurmond becomes the longest-serving member in the history of the United States Senate (41 years and 10 months)."], ["1997-05-25T00:00:00", "A military coup in Sierra Leone replaces President Ahmad Tejan Kabbah with Major Johnny Paul Koroma."], ["1997-05-27T00:00:00", "The second-deadliest tornado of the 1990s hits in Jarrell, Texas, killing 27 people."], ["1997-05-31T00:00:00", "The 13-kilometer Confederation Bridge, the world's longest bridge spanning ice-covered waters, opens between Prince Edward Island and New Brunswick, Canada."], ["1997-06-01T00:00:00", "Socialist Party-led Centre-left coalition won the second-round in 1997 legislative elections, began with the third Cohabitation (1997-2002)."], ["1997-06-01T00:00:00", "Hugo Banzer wins the Presidential elections in Bolivia."], ["1997-06-02T00:00:00", "In Denver, Colorado, Timothy McVeigh is convicted on 15 counts of murder and conspiracy for his role in the 1995 Oklahoma City bombing."], ["1997-06-06T00:00:00", "In Lacey Township, New Jersey, high school senior Melissa Drexler kills her newborn baby in a toilet."], ["1997-06-07T00:00:00", "A computer user known as \"_eci\" publishes his Microsoft C source code on a Windows 95 and Windows NT exploit, which later becomes WinNuke. The source code gets wide distribution across the internet, and Microsoft is forced to release a security patch."], ["1997-06-08T00:00:00", "A United States Coast Guard helicopter crashes near Humboldt Bay, California; all 4 crewmembers perish."], ["1997-06-10T00:00:00", "Khmer Rouge leader Pol Pot orders the killing of his defense chief, Son Sen, and 11 of Sen's family members, before Pol Pot flees his northern stronghold (the news does not reach outside Cambodia for 3 days)."], ["1997-06-11T00:00:00", "In the United Kingdom, the House of Commons votes for a total ban on handguns."], ["1997-06-12T00:00:00", "The United States Department of the Treasury unveils a new $50 bill, meant to be more difficult to counterfeit."], ["1997-06-13T00:00:00", "A jury sentences Timothy McVeigh to death for his part in the 1995 Oklahoma City bombing."], ["1997-06-16T00:00:00", "About 50 are killed in the Daïat Labguer (M'sila) massacre in Algeria."], ["1997-06-19T00:00:00", "The fast food chain McDonald's wins a partial victory in its libel trial, known as the McLibel case, against two environmental campaigners."], ["1997-06-22T00:00:00", "Swedish musician Ted Gärdestad commits suicide by jumping in front of a train (he is found dead later that morning)."], ["1997-06-25T00:00:00", "A massive eruption of the Soufrière Hills volcano on the island of Montserrat leads to evacuation and eventual abandonment of the capital, Plymouth."], ["1997-06-25T00:00:00", "An unmanned Progress spacecraft collides with the Russian space station Mir."], ["1997-06-26T00:00:00", "Bertie Ahern is appointed as the 10th Taoiseach of the Republic of Ireland and Mary Harney is appointed as the 16th, and first female, Tánaiste, after their parties, Fianna Fáil and the Progressive Democrats respectively, win the 1997 General Election."], ["1997-06-26T00:00:00", "Bloomsbury Publishing publishes J. K. Rowling's Harry Potter and the Philosopher's Stone in London."], ["1997-07-01T00:00:00", "The United Kingdom hands sovereignty of Hong Kong to the People's Republic of China."], ["1997-07-04T00:00:00", "NASA's Pathfinder space probe lands on the surface of Mars."], ["1997-07-05T00:00:00", "In Cambodia, Hun Sen of the Cambodian People's Party overthrows Norodom Ranariddh in a coup."], ["1997-07-07T00:00:00", "The Great Flood begins in southern Poland."], ["1997-07-08T00:00:00", "Mayo Clinic researchers warn that the dieting drug \"fen-phen\" can cause severe heart and lung damage."], ["1997-07-08T00:00:00", "NATO invites the Czech Republic, Hungary, and Poland to join the alliance in 1999."], ["1997-07-10T00:00:00", "In London, scientists report their DNA analysis findings from a Neanderthal skeleton, which support the out of Africa theory of human evolution, placing an \"African Eve\" at 100,000 to 200,000 years ago."], ["1997-07-10T00:00:00", "Miguel Ángel Blanco is kidnapped in Ermua, Spain and murdered by the ETA."], ["1997-07-11T00:00:00", "Thailand's worst hotel fire at Pattaya kills 90."], ["1997-07-13T00:00:00", "The remains of Che Guevara are returned to Cuba for burial, alongside some of his comrades. Guevara and his comrades were executed on 9 October 1967 in Bolivia."], ["1997-07-15T00:00:00", "Spree killer Andrew Cunanan shoots fashion designer Gianni Versace to death outside Versace's Miami residence."], ["1997-07-16T00:00:00", "The Dow Jones Industrial Average gains 63.17 to close at 8,038.88. It is the Dow's first close above 8,000. The Dow has doubled its value in 30 months."], ["1997-07-17T00:00:00", "The F. W. Woolworth Company closes after 117 years in business."], ["1997-07-21T00:00:00", "On her 200th birthday, the fully restored USS Constitution (aka \"Old Ironsides\") sets sail for the first time in 116 years."], ["1997-07-23T00:00:00", "Digital Equipment Corporation files antitrust charges against chipmaker Intel."], ["1997-07-24T00:00:00", "Spree killer Andrew Cunanan commits suicide in a Miami houseboat."], ["1997-07-25T00:00:00", "K. R. Narayanan is sworn in as India's 10th president and the first member of the Dalit caste to hold this office."], ["1997-07-27T00:00:00", "About 50 are killed in the Si Zerrouk massacre in Algeria."], ["1997-07-30T00:00:00", "18 people are killed in the Thredbo landslide in the Snowy Mountains resort in Australia. Stuart Diver is the only survivor."], ["1997-08-01T00:00:00", "Boeing and McDonnell Douglas complete a merger."], ["1997-08-01T00:00:00", "Steve Jobs returns to Apple Computer, Inc at Macworld in Boston."], ["1997-08-02T00:00:00", "Australian ski instructor Stuart Diver is rescued as the sole survivor from the Thredbo landslide in New South Wales, in which 18 die."], ["1997-08-03T00:00:00", "Between 40-76 villagers are killed in the Oued El-Had and Mezouara massacre in Algeria."], ["1997-08-04T00:00:00", "185,000 Teamsters Union United Parcel Service drivers walk off the job."], ["1997-08-04T00:00:00", "Jeanne Calment, the oldest person ever, dies at age 122 years 164 days in Arles, France."], ["1997-08-06T00:00:00", "Microsoft buys a $150 million share of financially troubled Apple Computer."], ["1997-08-06T00:00:00", "Korean Air Flight 801 crash lands west of Guam International Airport, resulting in the deaths of 228 people."], ["1997-08-13T00:00:00", "In Belo Horizonte, Brazil, Cruzeiro defeats Sporting Cristal of Peru 1-0, becoming the Copa Libertadores de América champions for the second time."], ["1997-08-13T00:00:00", "South Park debuts on Comedy Channel."], ["1997-08-20T00:00:00", "Over 60 are killed, 15 kidnapped in the Souhane massacre in Algeria."], ["1997-08-21T00:00:00", "Be Here Now, the third album from English rock band Oasis, becomes the fastest selling album in UK history."], ["1997-08-26T00:00:00", "60-100 are killed in the Beni Ali massacre in Algeria."], ["1997-08-26T00:00:00", "The Independent International Commission on Decommissioning is set up in Northern Ireland, as part of a peace process."], ["1997-08-29T00:00:00", "Over 98 (and possibly up to 400) are killed in the Rais massacre in Algeria."], ["1997-08-31T00:00:00", "Death of Diana, Princess of Wales: Diana, Princess of Wales is taken to a hospital after a car accident shortly after midnight, in the Pont de l'Alma road tunnel in Paris. She is pronounced dead at 3:00 am."], ["1997-09-04T00:00:00", "In Lorain, Ohio, the last Ford Thunderbird for 3 years rolls off the assembly line."], ["1997-09-05T00:00:00", "Over 87 are killed in the Beni Messous massacre in Algeria."], ["1997-09-05T00:00:00", "The International Olympic Committee picks Athens, Greece, to be the host city for the 2004 Summer Olympics."], ["1997-09-05T00:00:00", "Mother Teresa, Albanian missionary and humanitarian, dies (b. 1910)"], ["1997-09-06T00:00:00", "The funeral of Diana, Princess of Wales, takes place at Westminster Abbey, watched by over 2 billion people worldwide."], ["1997-09-06T00:00:00", "A Jean Michel Jarre Oxygene in Moscow concert, celebrating the city's 850th anniversary, draws 3.5 million people."], ["1997-09-07T00:00:00", "The F-22 Raptor makes its first test flight."], ["1997-09-11T00:00:00", "Scotland votes to create its own Parliament after 290 years of union with England."], ["1997-09-13T00:00:00", "Iraq disarmament crisis: An Iraqi military officer attacks an UNSCOM weapons inspector on board an UNSCOM helicopter, while the inspector attempts to take photographs of unauthorized movement of Iraqi vehicles inside a site designated for inspection."], ["1997-09-15T00:00:00", "Norwegian parliamentary election, 1997."], ["1997-09-17T00:00:00", "Iraq disarmament crisis: While waiting for access to a site, UNSCOM inspectors witness and videotape Iraqi guards moving files, burning documents, and dumping waste cans into a nearby river."], ["1997-09-18T00:00:00", "Wales votes in favour of devolution and the formation of a National Assembly for Wales."], ["1997-09-18T00:00:00", "Al-Qaeda carries out a terrorist attack in Mostar, Bosnia and Herzegovina."], ["1997-09-19T00:00:00", "53 are killed in the Guelb El-Kebir massacre in Algeria."], ["1997-09-21T00:00:00", "The Islamic Salvation Army, the Islamic Salvation Fronts' armed wing, declares a unilateral ceasefire in Algeria."], ["1997-09-25T00:00:00", "Iraq disarmament crisis: UNSCOM inspector Dr. Diane Seaman catches several Iraqi men sneaking out the back door of an inspection site, with log books for the creation of prohibited bacteria and chemicals."], ["1997-09-26T00:00:00", "An air crash in Indonesia (likely caused by smoke rising from numerous forest fires in the area) kills 235 people (see Garuda Indonesia Flight 152)."], ["1997-09-26T00:00:00", "An earthquake strikes the Italian regions of Umbria and Marche, causing part of the Basilica of St. Francis at Assisi to collapse."], ["1997-09-27T00:00:00", "The Roman Catholic Diocese of Požega in Croatia is founded."], ["1997-10-01T00:00:00", "Luke Woodham walks into Pearl High School in Pearl, Mississippi, and opens fire, killing 2 girls, after killing his mother earlier that morning."], ["1997-10-02T00:00:00", "British scientists Moira Bruce and John Collinge, with their colleagues, independently show that the new variant form of the Creutzfeldt-Jakob disease is the same disease as Bovine spongiform encephalopathy."], ["1997-10-04T00:00:00", "One million men gather for Promise Keepers' \"Stand in the Gap\" event in Washington, D.C.."], ["1997-10-04T00:00:00", "Loomis Fargo Bank Robbery: The second largest cash robbery in U.S. history ($17.3 million, mostly in small bills) occurs at the Charlotte, North Carolina office of Wells Fargo. An FBI investigation eventually results in 24 convictions and the recovery of approximately 95% of the stolen cash."], ["1997-10-11T00:00:00", "The mixed martial arts organization Pride Fighting Championships holds its inaugural event at the Tokyo Dome in Tokyo, Japan. In the main event Rickson Gracie defeats Nobuhiko Takada by armbar."], ["1997-10-12T00:00:00", "43 are killed at a false roadblock, in the Sidi Daoud massacre in Algeria."], ["1997-10-15T00:00:00", "Andy Green sets the first supersonic land speed record for the ThrustSSC team, led by Richard Noble of the UK. ThrustSSC goes through the flying mile course at Black Rock Desert, Nevada at an average speed of 1,227.985 km/h (763.035 mph)."], ["1997-10-15T00:00:00", "NASA launches the Cassini-Huygens probe to Saturn."], ["1997-10-16T00:00:00", "The first color photograph appears on the front page of The New York Times."], ["1997-10-17T00:00:00", "The remains of Che Guevara are laid to rest with full military honours in a specially built mausoleum in the city of Santa Clara, Cuba, where he had won the decisive battle of the Cuban Revolution 39 years before."], ["1997-10-27T00:00:00", "In the U.S., the Dow Jones Industrial Average drops -554.26 points (-7.18%), closing at 7,161.14."], ["1997-10-28T00:00:00", "In the U.S., the Dow Jones Industrial Average gains a record 337.17 points (+4.71%), closing at 7,498.32. One billion shares are traded on the New York Stock Exchange for the first time ever."], ["1997-10-29T00:00:00", "Iraq disarmament crisis: Iraq says it will begin shooting down Lockheed U-2 surveillance planes being used by UNSCOM inspectors."], ["1997-10-30T00:00:00", "In Newton, Massachusetts, British au pair Louise Woodward is found guilty of the baby-shaking death of 8-month-old Matthew Eappen."], ["1997-11-03T00:00:00", "In France, striking truck drivers blockade ports during a pay dispute."], ["1997-11-10T00:00:00", "Telecom companies WorldCom and MCI Communications announce a US$37 billion merger to form MCI WorldCom (the largest merger in U.S. history)."], ["1997-11-10T00:00:00", "A Fairfax, Virginia jury finds Mir Aimal Kasi guilty of murdering 2 CIA employees in 1993."], ["1997-11-11T00:00:00", "Mary McAleese is elected the 8th President of Ireland in succession to Mary Robinson, the first time in the world that one woman has succeeded another as elected head of state."], ["1997-11-12T00:00:00", "Ramzi Yousef is found guilty of masterminding the 1993 World Trade Center bombing."], ["1997-11-17T00:00:00", "In Luxor, Egypt, 62 people are killed by 6 Islamic militants outside the Temple of Hatshepsut."], ["1997-11-19T00:00:00", "In Des Moines, Iowa, Bobbi McCaughey gives birth to septuplets in the second known case where all 7 babies are born alive, and the first in which all survive infancy."], ["1997-11-27T00:00:00", "NASA's Tropical Rainfall Measuring Mission is launched, the start of the satellite component of the Clouds and the Earth's Radiant Energy System."], ["1997-12-01T00:00:00", "In the Indian state of Bihar, Ranvir Sena attacks the CPI(ML) Party Unity stronghold Lakshmanpur-Bathe, killing 63 lower caste people."], ["1997-12-03T00:00:00", "In Ottawa, Canada, representatives from 121 countries sign a treaty prohibiting the manufacture and deployment of anti-personnel land mines. However, the United States, the People's Republic of China, Russia, South Korea and 32 other nations do not sign and/or ratify the treaty."], ["1997-12-08T00:00:00", "Myra Hindley, one of the Moors murderers, arrives at the High Court of Justice, to contest a recent Home Secretary's decision that she should remain in prison until she dies."], ["1997-12-10T00:00:00", "The capital of Kazakhstan is moved from Almaty to Astana."], ["1997-12-11T00:00:00", "The Kyoto Protocol is adopted by a United Nations committee."], ["1997-12-12T00:00:00", "Demonstrations occur in the state capitals of Australia against the WTO and IMF."], ["1997-12-12T00:00:00", "The 1997 FIFA Confederations Cup begins in Saudi Arabia."], ["1997-12-16T00:00:00", "\"Dennō Senshi Porygon\", an episode of the Pokémon TV series, is aired in Japan, inducing seizures in hundreds of Japanese children."], ["1997-12-18T00:00:00", "Myra Hindley loses her High Court appeal against the government's decision to keep her behind bars for the rest of her life."], ["1997-12-19T00:00:00", "Janet Jagan (the former wife of Cheddi Jagan) takes office in Guyana."], ["1997-12-19T00:00:00", "James Cameron's Titanic, the then highest-grossing film of all time, premieres in the U.S."], ["1997-12-21T00:00:00", "Brazil beats Australia 6-0 in the Confederations Cup final."], ["1997-12-24T00:00:00", "50-100 villagers are killed in the Sid El-Antri massacre in Algeria."], ["1997-12-27T00:00:00", "Ulster loyalist paramilitary leader Billy Wright is assassinated in Northern Ireland, inside Long Kesh prison."], ["1997-12-29T00:00:00", "Hong Kong begins to kill all the chickens within its territory (1.25 million) to stop the spread of a potentially deadly influenza strain."], ["1997-12-30T00:00:00", "Wilaya of Relizane massacres of December 30, 1997: In the worst incident in Algeria's insurgency, 400 are killed from four villages in the wilaya of Relizane."]]