[["1917-01-01T00:00:00", "The University of Oregon defeats the University of Pennsylvania 14-0 in U.S. college football's 3rd Annual Rose Bowl Game."], ["1917-01-02T00:00:00", "The Royal Bank of Canada takes over Quebec Bank."], ["1917-01-09T00:00:00", "WWI: The last substantial Ottoman Army garrison on the Sinai Peninsula is captured by the Egyptian Expeditionary Force's Desert Column at the Battle of Rafa."], ["1917-01-11T00:00:00", "German saboteurs set off the Kingsland Explosion at Kingsland (modern-day Lyndhurst, New Jersey), one of the events leading to United States involvement in WWI."], ["1917-01-16T00:00:00", "The Danish West Indies is sold to the United States for $25 million."], ["1917-01-19T00:00:00", "Silvertown explosion: A blast at a munitions factory in London kills 73 and injures over 400. The resulting fire causes over £2,000,000 worth of damage."], ["1917-01-22T00:00:00", "WWI: President of the United States Woodrow Wilson calls for \"peace without victory\" in Germany."], ["1917-01-25T00:00:00", "WWI: British armed merchantman SS Laurentic is sunk by mines off Lough Swilly (Ireland) with the loss of 354 of the 475 aboard."], ["1917-01-25T00:00:00", "An anti-prostitution drive in San Francisco occurs and police close about 200 prostitution houses."], ["1917-01-26T00:00:00", "The sea defences at the English village of Hallsands are breached, leading to all but one of the houses becoming uninhabitable."], ["1917-01-28T00:00:00", "The United States ends its search for Pancho Villa."], ["1917-01-30T00:00:00", "Pershing's troops in Mexico begin withdrawing back to the United States. They reach Columbus, New Mexico February 5."], ["1917-02-01T00:00:00", "WWI: Atlantic U-boat Campaign: Germany announces its U-boats will resume unrestricted submarine warfare, rescinding the 'Sussex pledge'."], ["1917-02-03T00:00:00", "WWI: The United States severs diplomatic relations with Germany."], ["1917-02-05T00:00:00", "The new constitution of Mexico is adopted."], ["1917-02-13T00:00:00", "Mata Hari is arrested in Paris for spying."], ["1917-02-13T00:00:00", "WWI: Beginning of the Raid on Nekhl by units of the Egyptian Expeditionary Force, to complete reoccupation of the Egyptian Sinai Peninsula."], ["1917-02-24T00:00:00", "WWI: United States ambassador to the United Kingdom, Walter Hines Page, is shown the intercepted Zimmermann Telegram, in which Germany offers to give the American Southwest back to Mexico if Mexico declares war on the United States."], ["1917-03-01T00:00:00", "The U.S. government releases the text of the Zimmermann Telegram to the public."], ["1917-03-01T00:00:00", "Japanese city of Ōmuta is founded by Hiroushi Miruku."], ["1917-03-02T00:00:00", "The enactment of the Jones Act grants Puerto Ricans United States citizenship."], ["1917-03-04T00:00:00", "U.S. President Woodrow Wilson begins his second term."], ["1917-03-04T00:00:00", "Jeannette Rankin of Montana becomes the first woman member of the United States House of Representatives."], ["1917-03-08T00:00:00", "(N.S.) (February 23, O.S.) - The February Revolution begins in Russia: Women calling for bread in Petrograd start riots, which spontaneously spread throughout the city."], ["1917-03-08T00:00:00", "The United States Senate adopts the cloture rule in order to limit filibusters."], ["1917-03-10T00:00:00", "The Province of Batangas is formally founded as one of the Philippines' first encomiendas."], ["1917-03-11T00:00:00", "Mexican Revolution: Venustiano Carranza is elected president of Mexico; the United States gives de jure recognition of his government."], ["1917-03-12T00:00:00", "The Duma declares a Provisional Government."], ["1917-03-25T00:00:00", "The Georgian Orthodox Church restores the autocephaly abolished by Imperial Russia in 1811."], ["1917-03-26T00:00:00", "WWI: First Battle of Gaza: British Egyptian Expeditionary Force troops virtually encircle the Gaza garrison but are then ordered to withdraw, leaving the city to the Ottoman defenders."], ["1917-03-30T00:00:00", "Hjalmar Hammarskjöld steps down as Prime Minister of Sweden. He is replaced by the right-wing businessman and politician Carl Swartz."], ["1917-03-31T00:00:00", "The United States takes possession of the Danish West Indies, which become the US Virgin Islands, after paying $25 million to Denmark."], ["1917-04-02T00:00:00", "WWI: U.S. President Woodrow Wilson asks the United States Congress for a declaration of war on Germany."], ["1917-04-06T00:00:00", "WWI: The United States declares war on Germany."], ["1917-04-10T00:00:00", "An ammunition factory explosion in Chester, Pennsylvania kills 133."], ["1917-04-11T00:00:00", "WWI: Brazil severs diplomatic relations with Germany."], ["1917-04-16T00:00:00", "(N.S.) (April 3, O.S.) - Vladimir Lenin arrives at the Finland Station in Petrograd."], ["1917-04-16T00:00:00", "WWI: The Nivelle Offensive commences."], ["1917-04-17T00:00:00", "(N.S.) (April 4, O.S.) - Vladimir Lenin's April Theses are published. They become very influential in the following July Days and Bolshevik Revolution."], ["1917-04-17T00:00:00", "WWI: The Egyptian Expeditionary Force begins the Second Battle of Gaza. This unsuccessful frontal attack on strong Ottoman defences along with the first battle, resulted in 10,000 casualties, the dismissal of the force commander General Archibald Murray and the beginning of the Stalemate in Southern Palestine."], ["1917-04-26T00:00:00", "WWI: Agreement of Saint-Jean-de-Maurienne between France, Italy and the United Kingdom to settle interests in the Middle Eastern signed."], ["1917-05-09T00:00:00", "WWI: The Nivelle Offensive is abandoned."], ["1917-05-13T00:00:00", "The nuncio Eugenio Pacelli, the future Pope Pius XII, is consecrated Archbishop by Pope Benedict XV."], ["1917-05-15T00:00:00", "Robert Nivelle is replaced as Commander-in-Chief of the French Army by Philippe Pétain."], ["1917-05-18T00:00:00", "WWI: The Selective Service Act passes the United States Congress, giving the President the power of conscription."], ["1917-05-21T00:00:00", "Over 300 acres (73 blocks) are destroyed in the Great Atlanta fire of 1917."], ["1917-05-22T00:00:00", "Commissioned Officer Corps of the U.S. Coast and Geodetic Survey."], ["1917-05-23T00:00:00", "A month of civil violence in Milan, Italy, ends after the Italian army forcibly takes over the city from anarchists and anti-war revolutionaries. Fifty people are killed and 800 arrested."], ["1917-05-23T00:00:00", "WWI: During the Stalemate in Southern Palestine the Raid on the Beersheba to Hafir el Auja railway by Desert Column, destroyed large sections of railway line which had linked Beersheba to the main Ottoman desert base."], ["1917-05-26T00:00:00", "A tornado strikes Mattoon, Illinois, causing devastation and killing 101 people."], ["1917-05-27T00:00:00", "WWI: Over 30,000 French troops refuse to go to the trenches at Missy-aux-Bois."], ["1917-06-01T00:00:00", "French Army Mutinies: A French infantry regiment seizes Missy-aux-Bois and declares an anti-war military government. Other French army troops soon apprehend them."], ["1917-06-04T00:00:00", "The first Pulitzer Prizes are awarded: Laura E. Richards, Maud Howe Elliott and Florence Hall receive the first Pulitzer for a biography (for Julia Ward Howe). Jean Jules Jusserand receives the first Pulitzer for history for his work With Americans of Past and Present Days. Herbert Bayard Swope receives the first Pulitzer for journalism for his work for the New York World."], ["1917-06-05T00:00:00", "WWI: Conscription begins in the United States."], ["1917-06-07T00:00:00", "WWI: Battle of Messines opens with the British Army detonating 19 ammonal mines under the German lines, killing 10,000 in the deadliest deliberate non-nuclear man-made explosion in history."], ["1917-06-08T00:00:00", "Speculator Mine disaster: A fire at the Granite Mountain and Speculator ore mine outside Butte, Montana kills at least 168 workers."], ["1917-06-11T00:00:00", "King Constantine I of Greece abdicates for the first time, being succeeded by his son Alexander."], ["1917-06-13T00:00:00", "WWI: The first major German bombing raid on London by fixed-wing aircraft leaves 162 dead and 432 injured."], ["1917-06-15T00:00:00", "The United States enacts the Espionage Act."], ["1917-06-29T00:00:00", "WWI: Greece joins the war on the side of the Allies."], ["1917-07-01T00:00:00", "East St. Louis riot: A labor dispute ignites a race riot in East St. Louis, Illinois, which leaves 250 dead."], ["1917-07-01T00:00:00", "Russian General Brusilov begins the major Kerensky Offensive in Galicia, initially advancing towards Lemberg."], ["1917-07-06T00:00:00", "WWI: - Battle of Aqaba: Arabian troops led by T. E. Lawrence capture Aqaba from the Ottoman Empire."], ["1917-07-06T00:00:00", "WWI: - Conscription Crisis of 1917 in Canada leads to passage of the Military Service Act."], ["1917-07-07T00:00:00", "The Lions Clubs International is formed in the United States."], ["1917-07-12T00:00:00", "Bisbee Deportation: The Phelps Dodge Corporation deports over 1,000 suspected IWW members from Bisbee, Arizona."], ["1917-07-17T00:00:00", "King George V of the United Kingdom issues a proclamation, stating that thenceforth the male line descendants of the British Royal Family will bear the surname Windsor, vice the Germanic bloodline of House of Saxe-Coburg and Gotha, which is an offshoot of the historic (800+ years) House of Wettin."], ["1917-07-20T00:00:00", "The Parliament of Finland, with a Social Democratic majority, passes a \"Sovereignty Act\", declaring itself, as the representative of the Finnish people, sovereign over the Grand Principality of Finland. The Russian Provisional Government does not recognize the act, as it would have devolved Russian sovereignty over Finland, formerly exercised by the Russian Emperor as Grand Prince of Finland and alter the relationship between Finland and Russia into a real union with Russia solely responsible for the defence and foreign relations of an independent Finland."], ["1917-07-20T00:00:00", "(July 7, O.S.) - Alexander Kerensky becomes premier of the Russian Provisional Government, replacing Prince Georgy Lvov."], ["1917-07-20T00:00:00", "The Russian Provisional Government enacts women's suffrage."], ["1917-07-20T00:00:00", "The Corfu Declaration, which enables the establishment of the post-war Kingdom of Yugoslavia, is signed by the Yugoslav Committee and the Kingdom of Serbia."], ["1917-07-25T00:00:00", "Sir William Thomas White introduces Canada's first income tax as a \"temporary\" measure (lowest bracket is 4% and highest is 25%)."], ["1917-07-28T00:00:00", "The Silent Parade is organized by the NAACP in New York City to protest the East St. Louis riot of July 2, as well as lynchings in Tennessee and Texas."], ["1917-07-30T00:00:00", "The Parliament of Finland is dissolved by the Russian Provisional Government. New elections are held in the autumn, resulting in a bourgeois majority."], ["1917-07-31T00:00:00", "WWI: Battle of Passchendaele: Allied offensive operations commence in Flanders."], ["1917-08-02T00:00:00", "Squadron Commander E.H. Dunning lands his aircraft on the ship HMS Furious in Scapa Flow, Orkney. He is killed 5 days later during another landing on the ship."], ["1917-08-03T00:00:00", "The New York Guard is founded."], ["1917-08-10T00:00:00", "A general strike begins in Spain; it is smashed after 3 days with 70 left dead, hundreds of wounded and 2,000 arrests."], ["1917-08-17T00:00:00", "One of English literature's important meetings takes place when Wilfred Owen introduces himself to Siegfried Sassoon at the Craiglockhart War Hospital in Edinburgh."], ["1917-08-18T00:00:00", "The Great Thessaloniki Fire of 1917 in Greece destroys 32% of the city, leaving 70,000 individuals homeless."], ["1917-08-29T00:00:00", "WWI: The Military Service Act is passed in the Canadian House of Commons, giving the Government of Canada the right to conscript men into the army."], ["1917-09-14T00:00:00", "Russia is declared a republic by the Provisional Government."], ["1917-09-23T00:00:00", "Leon Trotsky is elected Chairman of the Petrograd Soviet."], ["1917-09-25T00:00:00", "The Mossovet (Moscow Soviet of People's Deputies) votes to side with the Bolsheviks."], ["1917-10-12T00:00:00", "WWI: First Battle of Passchendaele - Allies fail to take a German defensive position with the biggest loss of life in a single day for New Zealand, over 800 of whose men and 45 officers are killed, roughly 1 in 1000 of the nation's population at this time."], ["1917-10-13T00:00:00", "Miracle of the Sun at Fátima, Portugal."], ["1917-10-15T00:00:00", "WWI: At Vincennes outside Paris, Dutch dancer Mata Hari is executed by firing squad for spying for Germany."], ["1917-10-19T00:00:00", "Dallas Love Field is opened."], ["1917-10-19T00:00:00", "Carl Swartz resigns as Prime Minister of Sweden after dismal election results for the right-wing in the Riksdag elections in September. He is replaced by liberal leader and history professor Nils Edén."], ["1917-10-23T00:00:00", "A Brazilian ship is destroyed by a German U-Boat, encouraging Brazil to enter World War I."], ["1917-10-26T00:00:00", "WWI: Brazil declares war against the Central Powers."], ["1917-10-27T00:00:00", "WWI: Ottoman force attacks Desert Mounted Corps units garrisoning el Buqqar ridge during the Battle of Buqqar Ridge fought in the last days of the Stalemate in Southern Palestine."], ["1917-10-31T00:00:00", "WWI: Battle of Beersheba: The British XX Corps and Desert Mounted Corps (Egyptian Expeditionary Force) attack and capture Beersheba ending the Stalemate in Southern Palestine."], ["1917-11-01T00:00:00", "WWI: - The British XXI Corps of the Egyptian Expeditionary Force begins the Third Battle of Gaza."], ["1917-11-01T00:00:00", "WWI: - The British Desert Mounted Corps begins the Battle of Tel el Khuweilfe in the direction of Hebron and Jerusalem."], ["1917-11-02T00:00:00", "Zionism: The British Foreign Secretary Arthur Balfour makes the Balfour Declaration proclaiming British support for the \"establishment in Palestine of a national home for the Jewish people\" with the clear understanding \"that nothing shall be done which may prejudice the civil and religious rights of existing non-Jewish communities\"."], ["1917-11-06T00:00:00", "WWI: Battle of Passchendaele: After 3 months of fierce fighting, Canadian forces take Passchendaele in Belgium."], ["1917-11-06T00:00:00", "WWI: Battle of Hareira and Sheria launched by the British XX Corps and Desert Mounted Corps against the central Ottoman defences protecting the Gaza to Beersheba road."], ["1917-11-06T00:00:00", "Militants from Trotsky's committee join with trusty Bolshevik soldiers to seize government buildings and pounce on members of the provisional government."], ["1917-11-07T00:00:00", "(N.S.) (October 25, O.S.) - October Revolution in Russia: The workers of the Petrograd Soviet in Russia, led by the Bolshevik Party and leader Vladimir Lenin, storm the Winter Palace and successfully destroy the Kerensky Provisional Government after less than eight months of rule."], ["1917-11-07T00:00:00", "Iran (which has provided weapons for Russia) refuses to support the Allied Forces after the October Revolution."], ["1917-11-07T00:00:00", "WWI: Third Battle of Gaza: XXI Corps occupies Gaza after the Ottoman garrison withdraws."], ["1917-11-07T00:00:00", "WWI: Battle of Hareira and Sheria continues when the XX Corps and Desert Mounted Corps capture Hareira and Sheria, marking the end of the Ottoman Gaza to Beersheba line."], ["1917-11-13T00:00:00", "WWI: - Egyptian Expeditionary Force attack retreating Yildirim Army Group forces during the Battle of Mughar Ridge results in the capture of 10,000 Ottoman prisoners, 100 guns and 50 miles (80 km) of Palestine territory."], ["1917-11-13T00:00:00", "WWI: - ANZAC Mounted Division (Desert Mounted Corps) successfully fights the Battle of Ayun Kara in the aftermath of the Battle of Mughar Ridge against strong German rearguards."], ["1917-11-15T00:00:00", "In a \"Night of Terror\" in the United States, influential suffragettes from the Silent Sentinels are deliberately subjected to physical assaults by guards while imprisoned."], ["1917-11-15T00:00:00", "The Parliament of Finland passes another \"Sovereignty Act\", dissolving Russian sovereignty over Finland and effectively declaring Finland independent."], ["1917-11-15T00:00:00", "(N.S.) (November 28, O.S.) - The Provincial Assembly of the Autonomous Governorate of Estonia declares itself the highest legal body in Estonia."], ["1917-11-16T00:00:00", "WWI: ANZAC Mounted Division occupies Jaffa following their victory at the Battle of Ayun Kara."], ["1917-11-16T00:00:00", "Georges Clemenceau becomes prime minister of France."], ["1917-11-17T00:00:00", "WWI: Action of 17 November 1917: United States Navy destroyers USS Fanning and USS Nicholson capture Imperial German Navy U-boat SM U-58 off the south-west coast of Ireland, the first combat action in which U.S. ships take a submarine (which is then scuttled)."], ["1917-11-17T00:00:00", "WWI: Battle of Jerusalem (1917) begins with the Egyptian Expeditionary Force launching attacks against Ottoman forces in the Judean Hills."], ["1917-11-17T00:00:00", "The People's Dispensary for Sick Animals is founded in the United Kingdom."], ["1917-11-20T00:00:00", "WWI: Battle of Cambrai: British forces, using tanks, make early progress in an attack on German positions but are soon beaten back."], ["1917-11-20T00:00:00", "The Ukraine is declared a republic."], ["1917-11-22T00:00:00", "In Montreal, Canada, the National Hockey Association breaks up."], ["1917-11-23T00:00:00", "The Bolsheviks release the full text of the previously secret Sykes-Picot Agreement of 1916 in Izvestia and Pravda; it is subsequently printed in the Manchester Guardian on November 26."], ["1917-11-24T00:00:00", "Nine members of the Milwaukee Police Department are killed by a bomb, the most deaths in a single event in U.S. police history until the September 11 attacks in 2001."], ["1917-11-25T00:00:00", "WWI: German forces defeat Portuguese army of about 1200 at Negomano on the border of modern-day Mozambique and Tanzania."], ["1917-11-26T00:00:00", "The National Hockey League is formed in Montreal as a replacement for the recently disbanded National Hockey Association."], ["1917-11-28T00:00:00", "WWI: The Bolsheviks offer peace terms to the Germans."], ["1917-12-03T00:00:00", "After nearly 20 years of planning and construction, the Quebec Bridge opens to traffic (the bridge partially collapsed on August 29, 1907 and September 11, 1916)."], ["1917-12-06T00:00:00", "The Senate of Finland officially declares the country's independence from Russia."], ["1917-12-06T00:00:00", "Halifax Explosion: Two freighters collide in Halifax Harbour at Halifax, Nova Scotia and cause a huge explosion that kills at least 1,963 people, injures 9,000 and destroys part of the city (the biggest man-made explosion in recorded history until the Trinity nuclear test in 1945)."], ["1917-12-09T00:00:00", "WWI: The British Egyptian Expeditionary Force accepts the surrender of Jerusalem by the mayor, Hussein al-Husayni, following effective defeat of the Ottoman Empire's Yildirim Army Group during the Battle of Jerusalem."], ["1917-12-11T00:00:00", "WWI: General Edmund Allenby leads units of the British Egyptian Expeditionary Force into Jerusalem on foot through the Jaffa Gate."], ["1917-12-17T00:00:00", "The Raad van Vlaanderen proclaims the independence of Flanders."], ["1917-12-20T00:00:00", "The Cheka, a predecessor to the KGB is established in Russia."], ["1917-12-25T00:00:00", "Jesse Lynch Williams' Why Marry?, the first dramatic play to win a Pulitzer Prize, opens at the Astor Theatre in New York."], ["1917-12-26T00:00:00", "United States president Woodrow Wilson uses the Federal Possession and Control Act to place most U.S. railroads under the United States Railroad Administration, hoping to transport troops and materials for the war effort more efficiently."], ["1917-12-30T00:00:00", "WWI: Egyptian Expeditionary Force secures the victory at the Battle of Jerusalem by successfully defending Jerusalem from numerous Yildirim Army Group counterattacks."]]