[["1905-01-01T00:00:00", "The Trans-Siberian Railway officially opens after its completion on July 21, 1904."], ["1905-01-02T00:00:00", "Russo-Japanese War: The Russian Army surrenders at Port Arthur in Qing dynasty China."], ["1905-01-05T00:00:00", "The play The Scarlet Pimpernel opens at the New Theatre in London and begins a run of 122 performances and numerous revivals."], ["1905-01-26T00:00:00", "(January 13 O.S.) Russian Revolution of 1905: The Imperial Russian Army opens fire on demonstrators in Riga, Governorate of Livonia, killing 73 and injuring 200 people."], ["1905-01-26T00:00:00", "The Cullinan Diamond is found near Pretoria, South Africa, at the Premier Mine."], ["1905-02-12T00:00:00", "In Christchurch, New Zealand, the Cathedral of the Blessed Sacrament is opened."], ["1905-02-16T00:00:00", "At Haulbowline Base in Ireland, two explosions on board HM Submarine A5, due to gasoline fumes after refueling, kill six of the eleven crew."], ["1905-02-17T00:00:00", "At Fremantle, the R.M.S. Orizaba is wrecked, but all 160 passengers and the mail are saved."], ["1905-02-20T00:00:00", "Russo-Japanese War: The Battle of Mukden begins in Manchuria."], ["1905-02-23T00:00:00", "Rotary International is founded."], ["1905-03-01T00:00:00", "Australian Conservative leader Richard Butler takes office as Premier of South Australia."], ["1905-03-03T00:00:00", "Tsar Nicholas II of Russia agrees to create an elected assembly (the Duma)."], ["1905-03-04T00:00:00", "United States President Theodore Roosevelt begins a full term."], ["1905-03-05T00:00:00", "Russo-Japanese War: Russian troops begin to retreat from Mukden after losing 100,000 troops in 3 days."], ["1905-03-10T00:00:00", "Russo-Japanese War: The Japanese capture of Mukden (now Shenyang) completes the rout of Russian armies in Manchuria."], ["1905-03-10T00:00:00", "Cassie Chadwick is sentenced for 14 years in Cleveland, Ohio for fraud."], ["1905-03-10T00:00:00", "Chelsea F.C. is founded in London."], ["1905-03-13T00:00:00", "Mata Hari introduces her exotic dance act in Paris."], ["1905-03-17T00:00:00", "Albert Einstein publishes his paper \"On a heuristic viewpoint concerning the production and transformation of light\", in which he explains the photoelectric effect using the notion of light quanta."], ["1905-03-20T00:00:00", "Grover Shoe Factory disaster: A boiler explosion, building collapse and fire in Brockton, Massachusetts kills 58."], ["1905-03-23T00:00:00", "Theriso revolt breaks out on Crete when about 1,500 men led by Eleftherios Venizelos meet at the village of Theriso to challenge the island's authoritarian government and press for its unification with Greece."], ["1905-03-31T00:00:00", "Wilhelm II, German Emperor asserts German equality with France in Morocco, triggering the Tangier or First Moroccan Crisis."], ["1905-04-01T00:00:00", "Penny Post established between the United Kingdom and Australia."], ["1905-04-02T00:00:00", "The Simplon Tunnel is officially opened through the Alps."], ["1905-04-04T00:00:00", "In India, the 1905 Kangra earthquake hits the Kangra Valley, kills 20,000, and destroys most buildings in Kangra, McLeod Ganj and Dharamsala."], ["1905-04-06T00:00:00", "Lochner v. New York: The Supreme Court of the United States invalidates New York's 8-hour-day law."], ["1905-04-14T00:00:00", "Erik Gustaf Boström resigns as the Prime Minister of Sweden, over the issue of the Swedish- Norwegian Union. His Minister without Portfolio, Johan Ramstedt, becomes the new Prime Minister of Sweden."], ["1905-05-11T00:00:00", "Albert Einstein submits his doctoral dissertation \"On the Motion of Small Particles...\", in which he explains Brownian motion. In the course of the year, Einstein publishes four papers, formulates the theory of special relativity and explains the photoelectric effect by quantization. 1905 is regarded as his \"miracle year\"."], ["1905-05-15T00:00:00", "Las Vegas is founded when 110 acres (0.45 km2), in what later becomes downtown, are auctioned off."], ["1905-05-17T00:00:00", "Kappa Delta Rho is founded in room 14 of Old Painter Hall at Middlebury College in Middlebury, Vermont."], ["1905-06-07T00:00:00", "The Norwegian Parliament declares the union with Sweden dissolved, and Norway achieves full independence."], ["1905-06-09T00:00:00", "The Charlton Athletic F.C. is founded."], ["1905-06-15T00:00:00", "Princess Margaret of Connaught marries Prince Gustaf Adolf of Sweden, Duke of Skåne (Gustaf VI Adolf of Sweden)."], ["1905-06-27T00:00:00", "(June 14 according to the Julian calendar): Mutiny breaks out on the Russian ironclad Potemkin."], ["1905-06-29T00:00:00", "The Automobile Association is founded in the United Kingdom."], ["1905-06-30T00:00:00", "Albert Einstein publishes the article \"On the Electrodynamics of Moving Bodies\" where he reveals his theory of special relativity."], ["1905-07-22T00:00:00", "Taft-Katsura Secret Agreement."], ["1905-07-23T00:00:00", "Alfred Deakin becomes Prime Minister of Australia for the second time."], ["1905-08-12T00:00:00", "Leopold II of Belgium opens the Antwerpen-Centraal railway station"], ["1905-08-12T00:00:00", "First running of the Shelsley Walsh Speed Hill Climb, the world's oldest motorsport event to have been staged continuously on its original course"], ["1905-08-25T00:00:00", "The Ancient Order of Druids initiate neo-Druidic rituals at Stonehenge in England."], ["1905-09-01T00:00:00", "The Canadian provinces of Alberta and Saskatchewan are established from the southwestern part of the Northwest Territories."], ["1905-09-05T00:00:00", "Russo-Japanese War - Treaty of Portsmouth: In New Hampshire, a treaty mediated by U.S. President Theodore Roosevelt is signed by victor Japan and Russia. Russia cedes the island of Sakhalin and port and rail rights in Manchuria to Japan."], ["1905-09-27T00:00:00", "Albert Einstein submits his paper \"Does the Inertia of a Body Depend Upon Its Energy Content?\" in which he develops an argument for the famous equation E = mc2."], ["1905-10-02T00:00:00", "HMS Dreadnought is laid down in the United Kingdom, revolutionizing battleship design and triggering a naval arms race."], ["1905-10-05T00:00:00", "The Wright brothers' third aeroplane (Wright Flyer III) stays in the air for 39 minutes with Wilbur piloting, the first aeroplane flight lasting over half an hour."], ["1905-10-16T00:00:00", "The Partition of Bengal is made by Lord Curzon to separate the region of Bengal by Muslim and Hindu territories, until its reunification in 1911."], ["1905-10-20T00:00:00", "Galatasaray S.K. sports and Association football club is founded in Istanbul."], ["1905-10-26T00:00:00", "Sweden agrees to the repeal of the union with Norway."], ["1905-10-29T00:00:00", "(October 16 Old Style) Russian Revolution of 1905: The Imperial Russian Army opens fire on a meeting at a street market in Tallinn, Governorate of Estonia, killing 94 and injuring over 200 people."], ["1905-10-29T00:00:00", "(October 16 Old Style) The Circum-Baikal Railway is brought into permanent operation, completing through rail communication on the Trans-Siberian Railway."], ["1905-11-04T00:00:00", "The application of the infamous February Manifesto, removing the veto of the Diet of the autonomous Grand Principality of Finland over matters considered by the Emperor to concern Russian imperial interests, is interrupted by the new November Manifesto. The Senate of Finland is ordered to put forward a proposal for parliamentary reform based on unicameralism and universal and equal suffrage."], ["1905-11-09T00:00:00", "The Province of Alberta, Canada, holds its first general election."], ["1905-11-18T00:00:00", "Prince Carl of Denmark becomes King Haakon VII of Norway."], ["1905-11-28T00:00:00", "Irish nationalist Arthur Griffith founds Sinn Féin in Dublin as a political party whose goal is independence for all of Ireland."], ["1905-12-11T00:00:00", "In support of the Moscow Uprising, the Council of Workers' Deputies of Kiev stages a mass uprising, establishing the Shuliavka Republic in the city, December 12-16."], ["1905-12-30T00:00:00", "A bomb kills Frank Steunenberg, ex-governor of Idaho; the case leads to a trial against leaders of the Western Federation of Miners."], ["1905-12-30T00:00:00", "First performance of Franz Lehár's operetta The Merry Widow, at the Theater an der Wien, Vienna."]]