[["1912-01-01T00:00:00", "The Republic of China is proclaimed."], ["1912-01-04T00:00:00", "The Scout Association is incorporated throughout the British Commonwealth by Royal Charter."], ["1912-01-06T00:00:00", "New Mexico becomes the 47th state of the United States."], ["1912-01-08T00:00:00", "The African National Congress is founded as the South African Native National Congress at the Waaihoek Wesleyan Church in Bloemfontein to promote improved rights for black South Africans, with John Langalibalele Dube as its first president."], ["1912-01-17T00:00:00", "British polar explorer Captain Robert Falcon Scott and a team of four become the second expeditionary group to reach the South Pole."], ["1912-01-22T00:00:00", "The Overseas Railroad opens and the first train arrives in Key West with Henry M. Flagler, the railroad's creator and owner, aboard."], ["1912-01-23T00:00:00", "The International Opium Convention is signed at The Hague."], ["1912-02-12T00:00:00", "The Manchu Qing dynasty of China comes to an end after 268 years with the abdication of Emperor Puyi in favour of the Republic of China."], ["1912-02-14T00:00:00", "Arizona becomes the 48th U.S. state and the last of the contiguous United States which pushed the American frontier to the brink."], ["1912-02-24T00:00:00", "Battle of Beirut: Italy makes a surprise attack on the Ottoman port of Beirut, when the cruiser Giuseppe Garibaldi and the gunboat Volturno bombard the harbour, killing 97 sailors and civilians."], ["1912-02-29T00:00:00", "Serbia and Bulgaria secretly sign a treaty of alliance for a term of eight years, with each pledging to come to the defense of the other during war."], ["1912-03-01T00:00:00", "Albert Berry is reported to have made the first parachute jump from a flying airplane."], ["1912-03-06T00:00:00", "Italian forces became the first to use airships in war, as two dirigibles dropped bombs on Turkish troops encamped at Janzur, from an altitude of 6,000 feet."], ["1912-03-07T00:00:00", "Roald Amundsen in Hobart, Tasmania, announces his success in reaching the South Pole the previous December."], ["1912-03-12T00:00:00", "The Girl Scouts is founded by Juliette Gordon Low in Savannah, Georgia."], ["1912-03-16T00:00:00", "Lawrence Oates, dying member of Scott's South Pole expedition, leaves the tent saying, \"I am just going outside and may be some time.\""], ["1912-03-27T00:00:00", "Mayor Yukio Ozaki of Tokyo gives 3,000 cherry trees to be planted in Washington, D.C., to symbolize the friendship between the two countries."], ["1912-03-29T00:00:00", "The remaining members of Robert Falcon Scott's South Pole expedition die."], ["1912-03-30T00:00:00", "The French Third Republic establishes the French protectorate in Morocco."], ["1912-04-10T00:00:00", "White Star liner RMS Titanic departs from Southampton with 2225 passengers and crew on her maiden voyage bound for New York."], ["1912-04-11T00:00:00", "RMS Titanic makes her last call, at Queenstown in Ireland."], ["1912-04-16T00:00:00", "Harriet Quimby becomes the first woman to fly across the English Channel."], ["1912-04-17T00:00:00", "500 striking gold miners in Siberia are killed or wounded by troops in the Lena massacre."], ["1912-04-18T00:00:00", "Cunard Line vessel RMS Carpathia arrives in New York with the 708 RMS Titanic survivors."], ["1912-04-20T00:00:00", "Fenway Park in Boston, Massachusetts, opens."], ["1912-04-30T00:00:00", "Carl Laemmle founds Universal Studios as the Universal Film and Manufacturing Company in the United States."], ["1912-05-01T00:00:00", "`Abdu'l-Bahá lays the cornerstone for the Bahá'í House of Worship in Wilmette, Illinois"], ["1912-05-05T00:00:00", "The Olympic Games open in Stockholm, Sweden."], ["1912-05-11T00:00:00", "Alaska becomes a territory of the United States."], ["1912-05-13T00:00:00", "In the United Kingdom, the Royal Flying Corps (forerunner of the Royal Air Force) is established."], ["1912-05-23T00:00:00", "The Hamburg America Line's SS Imperator is launched in Hamburg and is the world's largest ship."], ["1912-05-30T00:00:00", "Wilbur Wright (of the Wright brothers) dies with a case of typhoid fever."], ["1912-06-06T00:00:00", "The Novarupta volcano (290 miles (470 km) southwest of Anchorage) experiences a VEI 6 eruption; the largest eruption in the 20th century."], ["1912-07-01T00:00:00", "Harriet Quimby, who set the record as the first woman to fly the English Channel only 2 months before, dies in Squantum, Massachusetts after her brand-new two-seat Bleriot monoplane crashes, killing both Quimby and her passenger."], ["1912-07-12T00:00:00", "United States release of Sarah Bernhardt's film Les Amours de la reine Élisabeth is influential on the development of the movie feature. Adolph Zukor, who incorporates Paramount Pictures on May 8, 1914, launches his company as the distributor. Paramount celebrates its centennial in 2012."], ["1912-07-30T00:00:00", "Emperor Meiji of Japan dies. He is succeeded by his son Yoshihito who becomes Emperor Taishō. In Japanese History, the event marks the end of the Meiji era and the beginning of the Taishō era."], ["1912-08-04T00:00:00", "United States occupation of Nicaragua: U.S. Marines land from the USS Annapolis in Nicaragua to support the conservative government at its request."], ["1912-08-12T00:00:00", "Sultan Abd al-Hafid of Morocco abdicates."], ["1912-08-21T00:00:00", "First Eagle Scout."], ["1912-08-25T00:00:00", "The Kuomintang, the Chinese nationalist party, is founded."], ["1912-09-28T00:00:00", "William Christopher Handy's \"Memphis Blues\" is published."], ["1912-10-08T00:00:00", "The First Balkan War begins: Montenegro declares war against the Ottoman Empire."], ["1912-10-10T00:00:00", "The Maternity Allowance Act goes into effect in Australia, but excludes minorities."], ["1912-10-14T00:00:00", "John Flammang Schrank attempts to assassinate Theodore Roosevelt."], ["1912-10-16T00:00:00", "Bulgarian pilots Radul Minkov and Prodan Toprakchiev perform the first bombing with an airplane in history, at the railway station of Karaagac near Edirne against Turkey."], ["1912-10-17T00:00:00", "Krupp engineers Benno Strauss and Eduard Maurer patent austenitic stainless steel."], ["1912-10-18T00:00:00", "Italy and the Ottoman Empire sign a treaty in Ouchy near Lausanne ending the Italo-Turkish War."], ["1912-10-24T00:00:00", "First Balkan War: Battle of Kumanovo: Serbian forces defeat the Ottoman army in Vardar Macedonia."], ["1912-11-05T00:00:00", "Governor of New Jersey Woodrow Wilson wins U.S. presidential election"], ["1912-11-11T00:00:00", "William Lawrence Bragg presents his derivation of Bragg's law for the angles for coherent and incoherent scattering from a crystal lattice, creating the field of x-ray crystallography, and making possible the eventual imaging of the double helix of DNA"], ["1912-11-28T00:00:00", "Albania declares independence from the Ottoman Empire."], ["1912-12-18T00:00:00", "Piltdown Man, thought to be the fossilized skull of a hitherto unknown form of early human, presented to the Geological Society of London. It is revealed to be a hoax in 1953."], ["1912-12-24T00:00:00", "Merck files patent applications in Germany for synthesis of the entactogenic drug MDMA (Ecstasy), developed by Anton Köllisch."], ["1912-12-30T00:00:00", "The First Balkan War ends temporarily: Bulgaria, Greece, Montenegro, and Serbia (the Balkan League countries) sign an armistice with Turkey, ending the two-month-long war."]]