[["1945-01-01T00:00:00", "WWII: - Germany begins Operation Bodenplatte, an attempt by the Luftwaffe to cripple Allied air forces in the Low Countries."], ["1945-01-01T00:00:00", "WWII: - The Chenogne massacre in which German prisoners were killed by American forces near the village of Chenogne, Belgium."], ["1945-01-05T00:00:00", "Australia recognize the Polish Committee of National Liberation as the government of Poland."], ["1945-01-07T00:00:00", "WWII: British General Bernard Montgomery holds a press conference at Zonhoven describing his supporting role at the Battle of the Bulge."], ["1945-01-12T00:00:00", "WWII: The Soviet Union begins the Vistula-Oder Offensive in Eastern Europe against the German Army."], ["1945-01-13T00:00:00", "WWII: The Soviet Union begins the East Prussian Offensive to eliminate German forces in East Prussia."], ["1945-01-16T00:00:00", "WWII: Adolf Hitler takes residence in the Führerbunker in Berlin."], ["1945-01-17T00:00:00", "WWII: The Soviet Union occupies Warsaw, Poland."], ["1945-01-17T00:00:00", "The Holocaust: A Soviet patrol arrests Raoul Wallenberg in Hungary."], ["1945-01-18T00:00:00", "The Holocaust: The SS begins evacuation of Auschwitz concentration camp. Nearly 60,000 prisoners, mostly Jews, are forced to march to other locations in Germany; as many as 15,000 die. The 7,000 too sick to move are left without supplies being distributed."], ["1945-01-20T00:00:00", "Franklin D. Roosevelt is inaugurated to a fourth term as President of the United States, the only President ever to exceed two terms."], ["1945-01-23T00:00:00", "WWII: - Hungary agrees to an armistice with the Allies."], ["1945-01-23T00:00:00", "WWII: - German Grand Admiral Karl Dönitz orders the start of Operation Hannibal, the mass evacuation by sea of German troops and civilians from the Courland Pocket, East Prussia and the Polish Corridor."], ["1945-01-24T00:00:00", "WWII: AP war correspondent Joseph Morton, nine OSS men, and four SOE agents are executed by the Germans at Mauthausen concentration camp under Hitler's Commando Order of 1942 which stipulates the immediate execution of all captured Allied commandos or saboteurs without trial, even those in proper uniforms. Morton is the only Allied correspondent to be executed by the Axis during the war."], ["1945-01-26T00:00:00", "WWII: Infantry action at Holtzwihr, France, for which Audie Murphy is awarded the Medal of Honor."], ["1945-01-27T00:00:00", "The Holocaust: The Soviet Red Army liberates the Auschwitz and Birkenau concentration camps."], ["1945-01-28T00:00:00", "WWII: Supplies begin to reach China over the newly reopened Burma Road."], ["1945-01-30T00:00:00", "WWII: - MV Wilhelm Gustloff, with over 10,000 mainly civilian Germans from Gotenhafen (Gdynia) is sunk in Gdańsk Bay by three torpedoes from the Soviet submarine S-13 in the Baltic Sea; up to 9,400 are thought to have died - the greatest loss of life in a single ship sinking in war action in history."], ["1945-01-30T00:00:00", "WWII: - Raid at Cabanatuan: 121 American soldiers and 800 Filipino guerrillas free 813 American prisoners of war from the Japanese-held camp in the city of Cabanatuan in the Philippines."], ["1945-01-30T00:00:00", "WWII: - Adolf Hitler makes his last public speech to be delivered personally, on broadcast radio, expressing the belief that Germany will triumph."], ["1945-01-31T00:00:00", "WWII: Eddie Slovik is executed by firing squad near Sainte-Marie-aux-Mines for desertion, the only U.S. soldier since the American Civil War ever executed for this offense."], ["1945-02-03T00:00:00", "WWII: - Battle of Manila: United States forces enter the outskirts of Manila to capture it from the Japanese Imperial Army, starting the battle."], ["1945-02-03T00:00:00", "WWII: - The Soviet Union agrees to enter the Pacific War against Japan once hostilities against Germany are concluded."], ["1945-02-06T00:00:00", "French writer Robert Brasillach is executed for collaboration with the Germans."], ["1945-02-07T00:00:00", "WWII: General Douglas MacArthur returns to Manila."], ["1945-02-09T00:00:00", "Walter Ulbricht becomes leader of the German Communists in Moscow."], ["1945-02-09T00:00:00", "WWII: \"Black Friday\": A force of Allied Bristol Beaufighter aircraft suffers heavy casualties in an unsuccessful attack on German destroyer Z33 and escorting vessels sheltering in Førde Fjord, Norway."], ["1945-02-10T00:00:00", "WWII: 3,608 drown when the troopship SS General von Steuben is sunk by the Soviet submarine S-13."], ["1945-02-13T00:00:00", "WWII: - Soviet forces capture Budapest, Hungary, from the Nazis."], ["1945-02-13T00:00:00", "WWII: - Royal Air Force bombing of Dresden, Germany."], ["1945-02-14T00:00:00", "Chile, Ecuador, Paraguay and Peru join the United Nations."], ["1945-02-16T00:00:00", "WWII: - American and Filipino ground forces land on Corregidor Island in the Philippines."], ["1945-02-16T00:00:00", "WWII: - Combined American and Filipino forces recapture the Bataan Peninsula."], ["1945-02-16T00:00:00", "WWII: - Venezuela declares war on Germany."], ["1945-02-19T00:00:00", "WWII - Battle of Iwo Jima: About 30,000 United States Marines land on Iwo Jima."], ["1945-02-21T00:00:00", "The last V-2-rocket is launched from Peenemünde."], ["1945-02-22T00:00:00", "WWII: - Italian Front: end of the Battle of Monte Castello, after nearly three months of fighting, Brazilian troops expel German forces of a pivot point in the (Tuscan) North Apennines, where their artillery was impeding the advance of British 8th Army toward Bologna;"], ["1945-02-22T00:00:00", "WWII: - Uruguay declares war on Germany and Japan."], ["1945-02-23T00:00:00", "WWII: - Battle of Iwo Jima: A group of United States Marines reach the top of Mount Suribachi on the island and are photographed raising the American flag. The photo, Raising the Flag on Iwo Jima (taken by Joe Rosenthal), later wins a Pulitzer Prize."], ["1945-02-23T00:00:00", "WWII: - The 11th Airborne Division, with Filipino guerrillas, freed the captives of the Los Baños internment camp."], ["1945-02-23T00:00:00", "WWII: - The capital of the Philippines, Manila, is liberated by combined American and Filipino ground troops."], ["1945-02-23T00:00:00", "WWII: - American and Filipino troops enter Intramuros, Manila."], ["1945-02-23T00:00:00", "WWII: - The German garrison in Poznań capitulates to Red Army and Polish troops."], ["1945-02-23T00:00:00", "WWII: - Bombing of Pforzheim: Heaviest of a series of bombing raids on Pforzheim in Germany by Allied aircraft is carried out by the British Royal Air Force. As many as 17,600 people, or 31.4% of the town's population, are killed in the raid and about 83% of the town's buildings destroyed, two-thirds of its complete area and between 80 and 100% of the inner city."], ["1945-02-23T00:00:00", "WWII: - Turkey joins the war on the allies side."], ["1945-02-24T00:00:00", "The Egyptian Premier Ahmad Mahir Pasha is killed in Parliament after reading a decree."], ["1945-02-28T00:00:00", "In Bucharest, a violent demonstration takes place, during which the bolşevic group opens fire on the army and protesters. In response, Andrei Y. Vishinsky, USSR vice commissioner of foreign affairs and president of the Allied Control Commission for Romania, travels to Bucharest to compel Nicolae Rădescu to resign as premier."], ["1945-03-01T00:00:00", "Franklin D. Roosevelt gives what will be his last address to a joint session of the United States Congress, reporting on the Yalta Conference."], ["1945-03-02T00:00:00", "Former U.S. Vice-President Henry A. Wallace starts his term of office as U.S. Secretary of Commerce, serving under President Franklin D. Roosevelt."], ["1945-03-02T00:00:00", "The rocket-propelled Bachem Ba 349 Natter is first test launched at Stetten am kalten Markt. The launch fails and the pilot, Lothar Sieber, dies."], ["1945-03-03T00:00:00", "WWII: - Finland declares war on the Axis powers."], ["1945-03-03T00:00:00", "WWII: - United States and Filipino troops take Manila, Philippines."], ["1945-03-03T00:00:00", "WWII: - Bombing of the Bezuidenhout: The British Royal Air Force accidentally bombs the Bezuidenhout neighbourhood in The Hague, Netherlands, killing 511 people."], ["1945-03-03T00:00:00", "WWII: - A possible experimental atomic test blast occurs at the Nazis' Ohrdruf military testing area."], ["1945-03-04T00:00:00", "In the United Kingdom, The Princess Elizabeth, later to become Queen Elizabeth II, joins the British Army's Women's Auxiliary Territorial Service as a truck driver/mechanic."], ["1945-03-04T00:00:00", "Football club FC Red Star (in Serbian: FK Crvena Zvezda) formed in Belgrade, Yugoslavia."], ["1945-03-05T00:00:00", "WWII: Brazilian troops take Castelnuovo (Vergato), in the last prior operations for the Allied Spring 1945 offensive in Italy."], ["1945-03-06T00:00:00", "A Communist-led government is formed in Romania under Petru Groza following Soviet intervention."], ["1945-03-06T00:00:00", "Resistance fighters accidentally ambush and attempt to execute SS general Hanns Albin Rauter, the arch-persecutor of the Dutch."], ["1945-03-07T00:00:00", "WWII: At the end of Operation Lumberjack, American troops seize the Ludendorff Bridge over the Rhine at Remagen in Germany and begin to cross; in the next 10 days 25,000 troops with equipment are able to cross."], ["1945-03-08T00:00:00", "Josip Broz Tito forms a government in Yugoslavia."], ["1945-03-08T00:00:00", "The Nazi authorities kill 117 Dutch men in reprisal for the attempted murder of Hanns Albin Rauter."], ["1945-03-08T00:00:00", "Operation Sunrise: Waffen-SS General Karl Wolff meets with Allen Welsh Dulles of the United States Office of Strategic Services at Lucerne in neutral Switzerland to negotiate surrender of the Axis forces in Italy to the Allies."], ["1945-03-09T00:00:00", "The film Les Enfants du Paradis premières in Paris."], ["1945-03-11T00:00:00", "The Empire of Japan establishes the Empire of Vietnam, a puppet state which will last only until August 23, with Bảo Đại as its ruler."], ["1945-03-11T00:00:00", "Sammarinese general election gives San Marino the world's first democratically elected communist government, which will hold power to 1957."], ["1945-03-12T00:00:00", "WWII: Swinemünde is destroyed by the USAAF killing an estimated 8,000 to 23,000 civilians, mostly refugees saved by Operation Hannibal."], ["1945-03-15T00:00:00", "The 17th Academy Awards ceremony is held, broadcast via radio for the first time. Best Picture goes to Going My Way."], ["1945-03-16T00:00:00", "WWII: The Battle of Iwo Jima unofficially ends, with pockets of guerrilla resistance persisting until the official conclusion of the battle."], ["1945-03-17T00:00:00", "WWII: Kobe, Japan is is fire-bombed by 331 B-29 bombers, killing over 8,000 people."], ["1945-03-18T00:00:00", "WWII: 1,250 American bombers attack Berlin."], ["1945-03-19T00:00:00", "WWII: - Adolf Hitler orders that all industries, military installations, machine shops, transportation facilities and communications facilities in Germany be destroyed."], ["1945-03-19T00:00:00", "WWII: - Off the coast of Japan, bombers hit the aircraft carrier USS Franklin, killing about 800 of her crewmen and crippling the ship."], ["1945-03-21T00:00:00", "WWII: - British troops liberate Mandalay, Burma."], ["1945-03-21T00:00:00", "WWII: - Bulgarian and Soviet troops successfully defend the north bank of the Drava River as the Battle of the Transdanubian Hills concludes."], ["1945-03-22T00:00:00", "Arab League is formed with the adoption of a charter in Cairo, Egypt."], ["1945-03-22T00:00:00", "St. Mary's Cathedral, Hildesheim, is destroyed in an air raid."], ["1945-03-24T00:00:00", "WWII - Operation Varsity: Two airborne divisions capture bridges across the Rhine River to aid the Allied advance."], ["1945-03-24T00:00:00", "Sylvester the cat, a cartoon character, debuts in Life with Feathers."], ["1945-03-26T00:00:00", "WWII: The Battle of Iwo Jima officially ends, with the destruction of the remaining areas of Japanese resistance."], ["1945-03-29T00:00:00", "WWII: The Red Army almost destroys the German 4th Army in the Heiligenbeil Pocket in East Prussia."], ["1945-03-29T00:00:00", "The \"Clash of Titans\": George Mikan and Bob Kurland duel at Madison Square Garden as Oklahoma State University defeats DePaul 52-44 in basketball."], ["1945-03-30T00:00:00", "WWII: - The Red Army pushes most of the Axis forces out of Hungary into Austria."], ["1945-03-30T00:00:00", "WWII: - Alger Hiss is congratulated in Moscow for his part in bringing positions of Western powers and the Soviet Union closer to each other at the Yalta Conference."], ["1945-04-01T00:00:00", "WWII: - Battle of Okinawa: The Tenth United States Army lands on Okinawa."], ["1945-04-04T00:00:00", "WWII: - American troops liberate their first Nazi concentration camp, Ohrdruf extermination camp in Germany."], ["1945-04-04T00:00:00", "WWII: - The Red Army enters Bratislava and pushes to the outskirts of Vienna, taking it on April 13 after several days of intense fighting."], ["1945-04-06T00:00:00", "WWII: - Sarajevo is liberated from Nazi Germany and the Independent State of Croatia (a fascist puppet state) by Yugoslav Partisans."], ["1945-04-06T00:00:00", "WWII: - The Battle of Slater's Knoll on Bougainville Island concludes with a decisive victory for the Australian Army's 7th Brigade."], ["1945-04-07T00:00:00", "WWII: - The only flight of the German ramming unit known as the Sonderkommando Elbe takes place, resulting in the loss of some 24 B-17s and B-24s of the United States Eighth Air Force."], ["1945-04-07T00:00:00", "WWII: - The Japanese battleship Yamato is sunk 200 miles (320 km) north of Okinawa while en route on a suicide mission."], ["1945-04-07T00:00:00", "WWII: - Kantarō Suzuki becomes Prime Minister of Japan."], ["1945-04-08T00:00:00", "The SS begins to evacuate the Buchenwald concentration camp; inmates in the Buchenwald Resistance call for American aid and overpower and kill the remaining guards."], ["1945-04-09T00:00:00", "WWII: The Battle of Königsberg, in East Prussia, ends with Soviet forces capturing the city."], ["1945-04-09T00:00:00", "Abwehr conspirators Wilhelm Canaris, Hans Oster and Hans von Dohnányi are hanged at Flossenberg concentration camp, along with pastor Dietrich Bonhoeffer."], ["1945-04-09T00:00:00", "Johann Georg Elser, would-be assassin of Adolf Hitler, is executed at Dachau concentration camp."], ["1945-04-10T00:00:00", "WWII: Visoko is liberated by the 7th, 9th and 17th Krajina Brigades from the Tenth Division of Yugoslav Partisan forces."], ["1945-04-11T00:00:00", "Buchenwald concentration camp is liberated by the United States Army."], ["1945-04-12T00:00:00", "President of the United States Franklin D. Roosevelt dies suddenly at Warm Springs, Georgia; Vice President Harry S. Truman becomes the 33rd President."], ["1945-04-14T00:00:00", "WWII: The First Canadian Army assumes military control of the Netherlands where German forces are trapped in the Atlantic wall fortifications along the coastline."], ["1945-04-15T00:00:00", "WWII: - The Bergen-Belsen concentration camp is liberated by British and Canadian forces."], ["1945-04-15T00:00:00", "WWII: - The Canadian First Army reaches the coast in the northern Netherlands and captures Arnhem."], ["1945-04-16T00:00:00", "WWII: - Battle of Berlin begins, opening with the Battle of the Oder-Neisse and the Battle of the Seelow Heights."], ["1945-04-16T00:00:00", "WWII: - Canadian forces take Harlingen, and occupy Leeuwarden and Groningen in the Netherlands."], ["1945-04-16T00:00:00", "WWII: - 6,500 drown when Goya is sunk by Soviet submarine L-3."], ["1945-04-17T00:00:00", "WWII: - Brazilian forces liberate the town of Montese, Italy, from German forces."], ["1945-04-17T00:00:00", "WWII: - Inundation of the Wieringermeer in the Netherlands by occupying German forces."], ["1945-04-18T00:00:00", "American war correspondent Ernie Pyle is killed by Japanese machine gun fire on the island of Ie Shima off Okinawa."], ["1945-04-19T00:00:00", "Rodgers and Hammerstein's Carousel, a musical play based on Ferenc Molnár's Liliom, opens on Broadway and becomes their second long-running stage classic."], ["1945-04-20T00:00:00", "WWII: On his 56th birthday Adolf Hitler leaves his Führerbunker to decorate a group of Hitler Youth soldiers in Berlin. It will be his last trip to the surface from his underground bunker."], ["1945-04-22T00:00:00", "WWII: - Heinrich Himmler, through Count Bernadotte, puts forth an offer of German surrender to the Western Allies, but not the Soviet Union."], ["1945-04-22T00:00:00", "WWII: - Adolf Hitler privately concedes defeat in his underground Berlin bunker after learning Felix Steiner could not mobilize enough men to launch a counterattack on the Soviets who had just broken through Germany."], ["1945-04-23T00:00:00", "WWII: Hermann Göring sends the Göring Telegram to Hitler seeking confirmation that he should take over leadership of Germany in accordance with the decree of 29 June 1941. Hitler regards this as treason."], ["1945-04-24T00:00:00", "Retreating German troops destroy all the bridges over the Adige in Verona, including the historic Ponte di Castelvecchio and Ponte Pietra."], ["1945-04-25T00:00:00", "Founding negotiations for the United Nations begin in San Francisco."], ["1945-04-25T00:00:00", "WWII - Elbe Day: United States and Soviet troops link up at the Elbe River, cutting Germany in two."], ["1945-04-26T00:00:00", "WWII: - Battle of Bautzen: The last \"successful\" German panzer-offensive in Bautzen ends with the city recaptured."], ["1945-04-26T00:00:00", "WWII: - The British 3rd Infantry Division under General Whistler captures Bremen."], ["1945-04-26T00:00:00", "WWII: - Nazi surrenders mean the British and Canadians now control the German border with Switzerland from Basle to Lake Constance."], ["1945-04-27T00:00:00", "U.S. Ordnance troops find the coffins of Frederick William I of Prussia, Frederick the Great, Paul von Hindenburg, and his wife."], ["1945-04-27T00:00:00", "The Western Allies flatly reject any offer of surrender by Germany other than unconditional on all fronts."], ["1945-04-28T00:00:00", "Benito Mussolini and his mistress, Clara Petacci, are executed by Italian partisans as they attempt to flee the country. Their bodies are then hung by their heels in the public square of Milan."], ["1945-04-28T00:00:00", "The Canadian First Army captures Emden and Wilhelmshaven."], ["1945-04-29T00:00:00", "Men of the 15th US Regiment, 45th Infantry Division, machine gun 520 surrendering German soldiers - including a doctor carrying a Red Cross flag - at Dachau concentration camp, after the soldiers take over from fleeing SS guards."], ["1945-04-29T00:00:00", "At the royal palace in Caserta, Lieutenant-Colonel Viktor von Schweinitz (representing General Heinrich von Vietinghoff) and SS-Obersturmbannfuehrer Eugen Wenner (representing Waffen-SS General Karl Wolf) sign an unconditional instrument of surrender for all Axis powers forces in Italy, taking effect on May 2. Italian General Rodolfo Graziani orders the Esercito Nazionale Repubblicano forces under his command to lay down their arms."], ["1945-04-29T00:00:00", "Brazilian forces liberate the commune of Fornovo di Taro, Italy, from German forces."], ["1945-04-29T00:00:00", "Operation Manna: British Avro Lancaster bombers drop food into the Netherlands to prevent the starvation of the civilian population."], ["1945-04-29T00:00:00", "Adolf Hitler marries his longtime mistress Eva Braun in a closed civil ceremony in the Berlin Führerbunker and signs his last will and testament."], ["1945-04-30T00:00:00", "Death of Adolf Hitler: Adolf Hitler and his wife of one day, Eva Braun, commit suicide as the Red Army approaches the Führerbunker in Berlin. Karl Dönitz succeeds Hitler as President of Germany (Reichspräsident) and Joseph Goebbels succeeds as Chancellor of Germany (Reichskanzler), in accordance with Hitler's political testament of the previous day."], ["1945-05-01T00:00:00", "WWII: - Hamburg Radio announces that Hitler has died in battle, \"fighting up to his last breath against Bolshevism.\""], ["1945-05-01T00:00:00", "WWII: - Joseph Goebbels and his wife Magda commit suicide after killing their six children. Karl Dönitz appoints Lutz Graf Schwerin von Krosigk as the new Chancellor of Germany in the Flensburg Government."], ["1945-05-01T00:00:00", "WWII: - Troops of the Yugoslav 4th Army, together with the Slovene 9th Corpus NOV, enter Trieste."], ["1945-05-01T00:00:00", "WWII: - Mass suicide in Demmin."], ["1945-05-02T00:00:00", "WWII: - The Soviet Union announces the fall of Berlin. Soviet soldiers hoist the Red flag over the Reich Chancellery.\n\n"], ["1945-05-02T00:00:00", "WWII: - Lübeck is liberated by the British Army."], ["1945-05-02T00:00:00", "WWII: - Surrender of Axis troops in Italy comes into effect."], ["1945-05-02T00:00:00", "WWII: - Troops of the New Zealand Army 2nd Division enter Trieste a day after the Yugoslavs; the German Army in Trieste surrenders to the New Zealand Army."], ["1945-05-02T00:00:00", "WWII: - Following the death or resignation of the Hitler Cabinet in Germany, the Schwerin von Krosigk cabinet first meets."], ["1945-05-02T00:00:00", "WWII: - Neuengamme concentration camp near Hamburg is evacuated at about this date."], ["1945-05-02T00:00:00", "WWII: - Expatriate American poet Ezra Pound is arrested by the Italian resistance movement; released by them, on May 5 he turns himself in to the United States Army and is imprisoned as a traitor."], ["1945-05-03T00:00:00", "WWII: - The prison ships Cap Arcona, Thielbek and Deutschland are sunk by the British Royal Air Force in Lübeck Bay."], ["1945-05-03T00:00:00", "WWII: - Rocket scientist Wernher von Braun and 120 members of his team surrender to U.S. forces (later going on to help to start the U.S. space program)."], ["1945-05-03T00:00:00", "WWII: - German Protestant theologian Gerhard Kittel is arrested by the French forces in Tübingen, Germany."], ["1945-05-04T00:00:00", "WWII: - German surrender at Lüneburg Heath: All German armed forces in northwest Germany, Denmark and the Netherlands surrender unconditionally to Field Marshal Bernard Montgomery, officially coming into effect on May 5 at 08:00 hours British Double (and German) Summer Time."], ["1945-05-04T00:00:00", "WWII: - The Netherlands is liberated by British and Canadian troops."], ["1945-05-04T00:00:00", "WWII: - Denmark is liberated."], ["1945-05-04T00:00:00", "WWII: - Admiral Karl Dönitz orders all U-boats to cease offensive operations and return to bases in Norway."], ["1945-05-04T00:00:00", "WWII: - The Holy Crown of Hungary is found by the United States Army 86th Infantry Division. The United States government keeps the crown in Fort Knox for safekeeping from the Soviets until it is returned to Hungary on 6 January 1978."], ["1945-05-05T00:00:00", "WWII: - Prague uprising: Prague rises up against occupying Nazi forces."], ["1945-05-05T00:00:00", "WWII: - The US 11th Armored Division liberates the prisoners of Mauthausen concentration camp, including Simon Wiesenthal.\n\n"], ["1945-05-05T00:00:00", "WWII: - Canadian soldiers liberate the city of Amsterdam from Nazi occupation."], ["1945-05-05T00:00:00", "WWII: - A Japanese fire balloon kills five children and a woman, Elsie Mitchell, near Bly, Oregon, when it explodes as they drag it from the woods. They are the only people killed by an enemy attack on the American mainland during WWII."], ["1945-05-06T00:00:00", "WWII: Mildred Gillars (\"Axis Sally\") delivers her last propaganda broadcast to Allied troops (the first was on December 11, 1941)."], ["1945-05-06T00:00:00", "Holocaust: Ebensee concentration camp in Austria is liberated by troops of the 80th Division (United States)."], ["1945-05-07T00:00:00", "WWII: General Alfred Jodl signs the unconditional German Instrument of Surrender at Reims, France, ending Germany's participation in the war, officially coming into effect on May 8 at 23:01 hours Central European Time (00:01 hours May 9 German Summer Time)."], ["1945-05-08T00:00:00", "WWII: - Victory in Europe Day (V-E Day) observed by the western European powers as Nazi Germany surrenders, marking the end of WWII in Europe."], ["1945-05-08T00:00:00", "WWII: - Shortly before midnight (May 9 Moscow time) the final German Instrument of Surrender is signed at the seat of the Soviet Military Administration in Berlin-Karlshorst, attended by representatives of the Allies."], ["1945-05-08T00:00:00", "WWII: - Canadian troops move into Amsterdam, after German troops surrender."], ["1945-05-08T00:00:00", "WWII: - Surrender of the Dodecanese is signed in Symi."], ["1945-05-08T00:00:00", "WWII: - The British 8th Army, together with Slovene partisan troops and a motorized detachment of the Yugoslav 4th Army, arrives in Carinthia and Klagenfurt. The Croatian Armed Forces of the Independent State of Croatia are ordered by their commanders not to surrender to the Yugoslav Partisans but to attempt to retreat to Austria and surrender to the British, part of the events leading to the Bleiburg repatriations."], ["1945-05-09T00:00:00", "WWII: - The Soviet Union marks V-E Day."], ["1945-05-09T00:00:00", "WWII: - The Red Army enters Prague."], ["1945-05-09T00:00:00", "WWII: - Hermann Göring surrenders to the United States Army near Radstadt."], ["1945-05-09T00:00:00", "WWII: - Vidkun Quisling and other members of the collaborationist Quisling regime in Norway surrender to the Resistance (Milorg) and police at Møllergata 19 in Oslo as part of the legal purge in Norway after World War II."], ["1945-05-09T00:00:00", "WWII: - General Alexander Löhr, Commander of German Army Group E near Topolšica, Slovenia, signs the capitulation of German occupation troops."], ["1945-05-09T00:00:00", "WWII: - The German occupation of the Channel Islands ends with their liberation by British troops. Alderney, an annex of the Neuengamme concentration camp, is among the islands liberated."], ["1945-05-12T00:00:00", "Argentinian labour leader José Peter declares the Meat Industry Workers Federation dissolved."], ["1945-05-12T00:00:00", "Rev. W. V. Awdry's children's book The Three Railway Engines, first of The Railway Series, is published in England."], ["1945-05-15T00:00:00", "WWII: - Bleiburg tragedy (Croatian: \"Way of the Cross\"): Retreating troops of the Croatian Armed Forces of the former puppet Independent State of Croatia (intermingled with fleeing civilians) attempt to surrender to the British Army at Bleiburg but are directed to surrender to Yugoslav Partisans who open fire on them. The remainder, after orders are given by Josip Broz Tito, are force-marched through Croatia and Serbia, interned or massacred, with thousands dying."], ["1945-05-23T00:00:00", "The Flensburg Government is dissolved by the Allies and President of Germany Karl Dönitz and Chancellor of Germany Lutz Graf Schwerin von Krosigk are arrested by British forces at Flensburg. They are respectively the last German Head of state and Head of government until 1949."], ["1945-05-23T00:00:00", "Heinrich Himmler, former head of the Nazi SS, commits suicide in British custody."], ["1945-05-28T00:00:00", "William Joyce (\"Lord Haw-Haw\") is captured. He is later charged with high treason in London for his English-language wartime broadcasts on German radio, convicted, and then hanged in January 1946."], ["1945-05-29T00:00:00", "German communists, led by Walter Ulbricht, arrive in Berlin."], ["1945-05-29T00:00:00", "Dutch painter Han van Meegeren is arrested for collaboration with the Nazis, but the paintings he has sold to Hermann Göring (Koch) are later found to be his own fakes."], ["1945-05-30T00:00:00", "The Iranian government demands that all Soviet and British troops leave the country."], ["1945-06-01T00:00:00", "The British take over Lebanon and Syria."], ["1945-06-05T00:00:00", "The Allied Control Council, military occupation governing body of Germany, formally takes power."], ["1945-06-06T00:00:00", "King Haakon VII of Norway returns to Norway."], ["1945-06-11T00:00:00", "William Lyon Mackenzie King is re-elected as Canadian prime minister."], ["1945-06-11T00:00:00", "The Franck Committee recommends against a surprise nuclear bombing of Japan."], ["1945-06-12T00:00:00", "The Yugoslav Army leaves Trieste, leaving the New Zealand Army in control."], ["1945-06-21T00:00:00", "WWII: The Battle of Okinawa ends with US occupation of the island until 1972."], ["1945-06-24T00:00:00", "WWII: A victory parade is held in Red Square in Moscow."], ["1945-06-25T00:00:00", "Seán T. O'Kelly is elected the second President of Ireland."], ["1945-06-26T00:00:00", "The United Nations Charter is signed."], ["1945-06-29T00:00:00", "Czechoslovakia cedes Carpathian Ruthenia to the Soviet Union."], ["1945-06-30T00:00:00", "Distribution of John von Neumann's First Draft of a Report on the EDVAC, containing the first published description of the logical design of a computer with stored-program and instruction data stored in the same address space within the memory (von Neumann architecture)."], ["1945-07-01T00:00:00", "WWII: Germany is divided between the Allied occupation forces."], ["1945-07-05T00:00:00", "Australian Prime Minister John Curtin dies of a heart attack at age 60."]]