[["1910-02-08T00:00:00", "William D. Boyce founds the Boy Scouts of America."], ["1910-02-20T00:00:00", "Boutros Ghali, the first native-born prime minister of Egypt, is assassinated."], ["1910-03-08T00:00:00", "In France Raymonde de Laroche is awarded pilot's license #36 by the Federation Aeronautique Internationale, becoming the first woman authorized to fly an airplane."], ["1910-03-10T00:00:00", "Slavery in China, which has existed since the Shang dynasty, is now illegal."], ["1910-03-18T00:00:00", "The first filmed version of Mary Shelley's Frankenstein comes out. Considered to be the first horror movie, it stars actor Charles Ogle as the monster."], ["1910-03-27T00:00:00", "A fire during a barn-dance in Ököritófülpös, Hungary kills 312."], ["1910-04-20T00:00:00", "Comet Halley is visible from Earth. It won't be seen again until 1986."], ["1910-05-06T00:00:00", "George V becomes King of the United Kingdom of Great Britain and Ireland upon the death of his father, Edward VII."], ["1910-05-12T00:00:00", "Second NAACP meeting is held in New York."], ["1910-05-18T00:00:00", "The Earth passes through the tail of Halley's Comet."], ["1910-05-31T00:00:00", "The Union of South Africa is created."], ["1910-06-15T00:00:00", "The British Ship Terra Nova leaves London on its way toward an Antarctic expedition."], ["1910-06-22T00:00:00", "The DELAG Zeppelin dirigible, Deutschland, makes the first commercial passenger flight from Friedrichshafen to Düsseldorf in Germany. The flight takes nine hours."], ["1910-06-25T00:00:00", "The ballet The Firebird (L'Oiseau de feu), the first major work by Russian composer Igor Stravinsky, commissioned by Diaghilev's Ballets Russes, is premièred in Paris, bringing the composer international fame."], ["1910-07-04T00:00:00", "African-American boxer Jack Johnson defeats American boxer James J. Jeffries in a heavyweight boxing match, sparking race riots across the United States."], ["1910-07-22T00:00:00", "A wireless telegraph sent from the SS Montrose results in the identification, arrest and execution of murderer Dr. Hawley Crippen."], ["1910-07-24T00:00:00", "Ottoman forces capture the city of Shkodër to put down the Albanian Revolt of 1910."], ["1910-08-14T00:00:00", "A fire at the Brussels International 1910 destroys exhibitions of Britain and France."], ["1910-08-22T00:00:00", "The Japan-Korea Annexation Treaty is signed. It becomes null and void in 1965."], ["1910-08-28T00:00:00", "Montenegro is proclaimed an independent kingdom under Nicholas I."], ["1910-08-29T00:00:00", "Emperor Sunjong of Korea abdicates and the country's monarchy is abolished."], ["1910-09-01T00:00:00", "The Vatican introduces a compulsory oath against modernism, to be taken by all priests upon ordination."], ["1910-10-05T00:00:00", "5 October 1910 revolution in Portugal leading to the flight of King Manuel II of Portugal to England and proclamation of the First Portuguese Republic."], ["1910-10-20T00:00:00", "The hull of RMS Olympic is launched at the Harland and Wolff Shipyards in Belfast."], ["1910-10-23T00:00:00", "Vajiravudh (Rama VI) is crowned King of Siam, after the death of his father, King Chulalongkorn (Rama V)."], ["1910-11-07T00:00:00", "The first air flight for the purpose of delivering commercial freight takes place in the United States. The flight, made by Wright brothers pilot Philip Parmalee, is between Dayton and Columbus, Ohio."], ["1910-11-14T00:00:00", "In the first takeoff from a ship by a fixed-wing aircraft, Eugene Ely takes off from a temporary platform erected over the bow of the light cruiser USS Birmingham in Hampton Roads, Virginia."], ["1910-11-20T00:00:00", "Mexican Revolution: Begins when Francisco I. Madero proclaims the elections of 1910 null and void, and calls for an armed revolution at 6 p.m. against the illegitimate presidency/dictatorship of Porfirio Díaz."]]