[["1914-04-11T00:00:00", "Canadian Margaret C. MacDonald is appointed Matron-in-Chief of the Canadian Nursing service band and becomes the first woman in the British Empire to reach the rank of major."], ["1914-04-11T00:00:00", "Alpha Rho Chi, a professional architecture fraternity, is founded in the Hotel Sherman in Chicago."], ["1914-04-20T00:00:00", "Ludlow Massacre (Colorado Coalfield War): The Colorado National Guard attacks a tent colony of 1,200 striking coal miners in Ludlow, Colorado in the United States, killing 24 people."], ["1914-04-20T00:00:00", "President Woodrow Wilson asks the United States Congress to use military force in Mexico in reaction to the Tampico Affair."], ["1914-06-29T00:00:00", "Austria-Hungary: The Secretary of the Legation at Belgrade sends a dispatch to Vienna suggesting Serbian complicity in the crime of Sarajevo. Anti-Serb riots erupt in Sarajevo and throughout Bosnia generally."], ["1914-06-29T00:00:00", "Khioniya Guseva attempts and fails to assassinate Grigori Rasputin at his home town in Siberia."], ["1914-06-29T00:00:00", "International Exhibition opens at the \"White City\", Ashton Gate, Bristol (England). It closes on August 15 and the site is used as a military depot."], ["1914-07-04T00:00:00", "The Archduke's funeral takes place at Artstetten Castle (50 miles west of Vienna), Austria-Hungary."], ["1914-07-04T00:00:00", "Lexington Avenue bombing: 4 people are killed in New York City when an anarchist bomb intended to kill John D. Rockefeller explodes prematurely in the plotters' apartment."], ["1914-07-11T00:00:00", "Baseball legend Babe Ruth makes his major league debut with the Boston Red Sox."], ["1914-07-11T00:00:00", "USS Nevada, the United States Navy's first \"super-dreadnought\" battleship, is launched."], ["1914-07-11T00:00:00", "Over 5,000 attend a rally in Union Square, Manhattan, called by the Anti-Militarist League to commemorate the anarchists killed in the July 4 Lexington Avenue bombing."], ["1914-07-18T00:00:00", "The Signal Corps of the United States Army is formed, giving definite status to its air service for the first time."], ["1914-07-18T00:00:00", "British Fleet review at Spithead by George V."], ["1914-07-18T00:00:00", "Gandhi leaves South Africa for the last time, sailing out of Cape Town for England on board the SS Kinfauns Castle."], ["1914-07-28T00:00:00", "World War I: Austria-Hungary declares war on Serbia by telegram and its army bombards Belgrade. Tsar Nicholas II of Russia orders a partial mobilization against Austria-Hungary."], ["1914-07-28T00:00:00", "Henriette Caillaux, wife of French minister Joseph Caillaux is acquitted of murder by reason of crime passionnel."], ["1914-07-31T00:00:00", "Russia orders full mobilization."], ["1914-07-31T00:00:00", "French antimilitarist socialist leader Jean Jaurès is assassinated by a nationalist in Paris."], ["1914-08-01T00:00:00", "The German Empire declares war on the Russian Empire, following Russia's military mobilization in support of Serbia; Germany also begins mobilization."], ["1914-08-01T00:00:00", "France orders general mobilization."], ["1914-08-01T00:00:00", "New York Stock Exchange closed due to war in Europe, where nearly all stock exchanges are already closed."], ["1914-08-01T00:00:00", "Marcus Garvey founds the Universal Negro Improvement Association in Jamaica."], ["1914-08-02T00:00:00", "German troops occupy Luxembourg in accordance with its Schlieffen Plan."], ["1914-08-02T00:00:00", "A secret treaty between the Ottoman Empire and Germany secures Ottoman neutrality."], ["1914-08-02T00:00:00", "At 7:00 pm (local time) Germany issues a 12-hour ultimatum to neutral Belgium to allow German passage into France."], ["1914-08-03T00:00:00", "Germany declares war on Russia's ally, France."], ["1914-08-03T00:00:00", "At 7:00 am (local time) Belgium declines to accept Germany's ultimatum of August 2."], ["1914-08-04T00:00:00", "German troops invade Belgium at 8:02 am (local time). Declaration of war by the United Kingdom on Germany for this violation of Belgian neutrality. This effectively means a declaration of war by the whole British Empire against the German Empire. The United States declares neutrality. By then the First World War had began."], ["1914-08-04T00:00:00", "Imperial German Navy Rear-Admiral Wilhelm Souchon bombards the French Algerian ports of Bône and Philippeville from battlecruiser Goeben and light cruiser Breslau."], ["1914-08-04T00:00:00", "Gandhi is in the English Channel (en route from South Africa) when he learns that war has been declared. Later this day he arrives in London."], ["1914-08-05T00:00:00", "Germany declares war on Belgium."], ["1914-08-05T00:00:00", "The Kingdom of Montenegro declares war on Austria-Hungary."], ["1914-08-05T00:00:00", "The guns of Point Nepean fort at Port Phillip Heads in Victoria (Australia) fire across the bows of the Norddeutscher Lloyd steamer SS Pfalz which is attempting to leave the Port of Melbourne in ignorance of the declaration of war and she is detained; this is said to be the first Allied shot of the War."], ["1914-08-05T00:00:00", "SS Königin Luise, taken over two days earlier by the Imperial German Navy as a minelayer, lays mines 40 miles (64 km) off the east coast of England. She is intercepted and sunk by the British Royal Navy light cruiser HMS Amphion, the first German naval loss of the war. The following day, Amphion strikes mines laid by the Königin Luise and is sunk with some loss of life, the first British casualties of the war."], ["1914-08-05T00:00:00", "German zeppelins drop bombs on Liége in Belgium, killing 9 civilians."], ["1914-08-05T00:00:00", "First electric traffic light is installed between Euclid Avenue and East 105 Street, Cleveland, Ohio."], ["1914-08-08T00:00:00", "German colonial forces execute Martin-Paul Samba for high treason."], ["1914-08-08T00:00:00", "Sir Ernest Shackleton's Imperial Trans-Antarctic Expedition sets sail on the Endurance from England in an attempt to cross Antarctica."], ["1914-08-15T00:00:00", "The Panama Canal is inaugurated with the passage of the SS Ancon."], ["1914-08-15T00:00:00", "Mexican Revolution: Venustiano Carranza's troops under general Álvaro Obregón enter Mexico City."], ["1914-08-15T00:00:00", "A dismissed servant kills seven people at American architect Frank Lloyd Wright's studio and home, Taliesin in Wisconsin (including his mistress, Mamah Borthwick), and sets it on fire."], ["1914-08-26T00:00:00", "The German West African colony of Togoland (now Togo from 1960) surrenders to Britain and France."], ["1914-08-26T00:00:00", "Battle of Río de Oro: British Royal Navy protected cruiser HMS Highflyer forces the SS Kaiser Wilhelm der Grosse, sailing as an auxiliary cruiser, to scuttle."], ["1914-09-01T00:00:00", "Saint Petersburg in Russia changes its name to Petrograd."], ["1914-09-01T00:00:00", "The last known passenger pigeon \"Martha\" dies in the Cincinnati Zoo."], ["1914-09-03T00:00:00", "Pope Benedict XV (Giacomo della Chiesa) succeeds Pope Pius X as the 258th pope."], ["1914-09-03T00:00:00", "William, Prince of Albania leaves the country after just six months due to opposition to his rule."], ["1914-09-17T00:00:00", "World War I: Race to the Sea by opposing forces on the Western Front begins."], ["1914-09-17T00:00:00", "Andrew Fisher becomes Prime Minister of Australia for the third time."], ["1914-10-27T00:00:00", "World War I: The British super-dreadnought battleship HMS Audacious (23,400 tons), is sunk off Tory Island, north-west of Ireland, by a minefield laid by the armed German merchant-cruiser Berlin."], ["1914-10-27T00:00:00", "The Greek army occupies Northern Epirus with the approval of the Allies."], ["1914-10-28T00:00:00", "World War I: Battle of Penang, Malaya: The German cruiser Emden sinks a Russian cruiser and French destroyer before escaping."], ["1914-10-28T00:00:00", "Sentencing of participants in the Assassination of Archduke Franz Ferdinand of Austria at Sarajevo. Gavrilo Princip, being under 20 at the date of the assassination, cannot be given a death sentence and is given twenty years imprisonment."], ["1914-11-05T00:00:00", "World War I: Britain and France declare war on Turkey. The United Kingdom annexes Cyprus, which it controls until 1960."], ["1914-11-05T00:00:00", "Alpha Phi Delta is founded as a Greek social fraternity at Syracuse University in the United States."], ["1914-12-19T00:00:00", "Serbian Campaign (World War I): The Battle of Kolubara ends, resulting in a decisive Serbian victory over Austria-Hungary."], ["1914-12-19T00:00:00", "Mohandas Gandhi leaves England sailing for India on this date (accompanied by his wife Kasturba). He begins to learn the Bengali language whilst on board."], ["1914-01-02T00:00:00", "Noor Inayat Khan, World War II heroine (d. 1944)"], ["1914-01-02T00:00:00", "Kenny Clarke, American jazz musician (d. 1985)"], ["1914-01-02T00:00:00", "Vivian Stuart (aka Alex Stuart, Barbara Allen, Fiona Finlay, V.A. Stuart, William Stuart Long, Robyn Stuart), British writer (d. 1986)"], ["1914-01-04T00:00:00", "Herman Franks, American baseball player (d. 2009)"], ["1914-01-04T00:00:00", "Jean-Pierre Vernant, French historian and anthropologist (d. 2007)"], ["1914-01-17T00:00:00", "Anacleto Angelini, Italian-born businessman (d. 2007)"], ["1914-01-17T00:00:00", "William Stafford, American poet and pacifist (d. 1993)"], ["1914-01-30T00:00:00", "John Ireland, Canadian-born actor (d. 1992)"], ["1914-01-30T00:00:00", "David Wayne, American actor (d. 1995)"], ["1914-01-31T00:00:00", "Daya Mata, President of Self-Realization Fellowship (d. 2010)"], ["1914-01-31T00:00:00", "Jersey Joe Walcott, American boxer (d. 1994)"], ["1914-02-05T00:00:00", "William S. Burroughs, American author (d. 1997)"], ["1914-02-05T00:00:00", "Alan Lloyd Hodgkin, British scientist, recipient of the Nobel Prize in Physiology or Medicine (d. 1998)"], ["1914-02-09T00:00:00", "Bill Justice, American Disney animator (d. 2011)"], ["1914-02-09T00:00:00", "Ernest Tubb, American singer (d. 1984)"], ["1914-02-21T00:00:00", "Zachary Scott, American actor (d. 1965)"], ["1914-02-21T00:00:00", "Park Su-geun, Korean painter (d. 1965)"], ["1914-02-22T00:00:00", "Renato Dulbecco, Italian-born virologist, recipient of the Nobel Prize in Physiology or Medicine (d. 2012)"], ["1914-02-22T00:00:00", "Karl Otto Götz, German painter"], ["1914-03-01T00:00:00", "Harry Caray, baseball broadcaster (d. 1998)"], ["1914-03-01T00:00:00", "Ralph Ellison, American writer (d. 1994)"], ["1914-03-02T00:00:00", "Mayo Kaan, bodybuilder (d. 2002)"], ["1914-03-02T00:00:00", "Hansi Knoteck, Austrian actress (d. 2014)"], ["1914-03-02T00:00:00", "Martin Ritt, American director (d. 1990)"], ["1914-03-03T00:00:00", "Julio Franco Arango, Colombian Roman Catholic bishop (d. 1980)"], ["1914-03-03T00:00:00", "Asger Jorn, Danish painter (d. 1973)"], ["1914-03-04T00:00:00", "Ward Kimball, American cartoonist (d. 2002)"], ["1914-03-04T00:00:00", "Robert R. Wilson, American physicist, sculptor and architect (d. 2000)"], ["1914-03-14T00:00:00", "Abdias do Nascimento, Brazilian actor, artist and politician (d. 2011)"], ["1914-03-14T00:00:00", "Bill Owen, English actor (Last of the Summer Wine's 'Compo') (d. 1999)"], ["1914-03-19T00:00:00", "Jay Berwanger, American football player (d. 2002)"], ["1914-03-19T00:00:00", "Jiang Qing, Chinese politician (d. 1991)"], ["1914-04-02T00:00:00", "Alec Guinness, English actor (d. 2000)"], ["1914-04-02T00:00:00", "Hans Wegner, Danish furniture designer (d. 2007)"], ["1914-04-12T00:00:00", "Armen Alchian, American author and economist (d. 2013)"], ["1914-04-12T00:00:00", "Adriaan Blaauw, Dutch astronomer (d. 2010)"], ["1914-04-12T00:00:00", "Jan van Cauwelaert, Belgian bishop"], ["1914-04-22T00:00:00", "Baldev Raj Chopra, Indian film director (d. 2008)"], ["1914-04-22T00:00:00", "José Quiñones Gonzales, Peruvian aviator (d. 1941)"], ["1914-04-22T00:00:00", "Jan de Hartog, Dutch writer (d. 2002)"], ["1914-04-26T00:00:00", "Bernard Malamud, American author (d. 1986)"], ["1914-04-26T00:00:00", "Lilian Rolfe, French-born World War II heroine (d. 1945)"], ["1914-05-12T00:00:00", "Bertus Aafjes, Dutch poet (d. 1993)"], ["1914-05-12T00:00:00", "Howard K. Smith, American journalist (d. 2002)"], ["1914-05-13T00:00:00", "Phil Drabble, British author and television personality (d. 2007)"], ["1914-05-13T00:00:00", "Joe Louis, American boxer (d. 1981)"], ["1914-05-14T00:00:00", "Corneliu Coposu, Romanian politician (d. 1995)"], ["1914-05-14T00:00:00", "Hideko Maehata, Japanese swimmer (d. 1995)"], ["1914-05-14T00:00:00", "Mir Gul Khan Nasir, Baloch politician and poet from Pakistan (d. 1983)"], ["1914-05-18T00:00:00", "Alla Bayanova, Russian singer (d. 2011)"], ["1914-05-18T00:00:00", "Boris Christoff, Bulgarian opera singer (d. 1993)"], ["1914-05-19T00:00:00", "Max Perutz, Austrian-born molecular biologist, recipient of the Nobel Prize in Chemistry (d. 2002)"], ["1914-05-19T00:00:00", "Alex Shibicky, Canadian hockey player (d. 2005)"], ["1914-05-22T00:00:00", "Vance Packard, American social critic and author (d. 1996)"], ["1914-05-22T00:00:00", "Sun Ra, American musician (d. 1993)"], ["1914-05-22T00:00:00", "Edward Arthur Thompson, British historian (d. 1994)"], ["1914-05-24T00:00:00", "Arthur A. Link, American politician (d. 2010)"], ["1914-05-24T00:00:00", "George Tabori, Hungarian writer and director (d. 2007)"], ["1914-06-15T00:00:00", "Louis Edwards, Manchester United chairman 1965-1980 (d. 1980)"], ["1914-06-15T00:00:00", "Yuri Andropov, Soviet leader (d. 1984)"], ["1914-06-15T00:00:00", "Saul Steinberg, Romanian-born cartoonist (d. 1999)"], ["1914-06-26T00:00:00", "Laurie Lee, English author (d. 1997)"], ["1914-06-26T00:00:00", "Doc Williams, American musician (d. 2011)"], ["1914-07-02T00:00:00", "Frederick Fennell, American conductor (d. 2004)"], ["1914-07-02T00:00:00", "Ethelreda Leopold, American film actress (d. 1998)"], ["1914-07-08T00:00:00", "Jyoti Basu, Indian politician (d. 2010)"], ["1914-07-08T00:00:00", "Sarah P. Harkness, American architect (d. 2013)"], ["1914-07-10T00:00:00", "Charles Donnelly, Irish poet (d. 1937)"], ["1914-07-10T00:00:00", "Joe Shuster, Canadian-born comic book author (d. 1992)"], ["1914-07-15T00:00:00", "Akhtar Hameed Khan, pioneer of microcredit in developing countries (d. 1999)"], ["1914-07-15T00:00:00", "Gavin Maxwell, Scottish naturalist and author (d. 1969)"], ["1914-07-15T00:00:00", "Howard Vernon, Swiss actor (d. 1996)"], ["1914-07-19T00:00:00", "John Kenneth Macalister, Canadian World War II hero (d. 1944)"], ["1914-07-19T00:00:00", "Marius Russo, American baseball player (d. 2005)"], ["1914-07-20T00:00:00", "Dobri Dobrev, Bulgarian philanthropist"], ["1914-07-20T00:00:00", "Charilaos Florakis, Greek Communist leader (d. 2005)"], ["1914-07-20T00:00:00", "Masa Niemi, Finnish actor (d. 1960)"], ["1914-07-20T00:00:00", "Ersilio Cardinal Tonini, Italian Roman Catholic prelate (d. 2013)"], ["1914-07-24T00:00:00", "Frances Oldham Kelsey, American Food and Drug Administration reviewer"], ["1914-07-24T00:00:00", "Ed Mirvish, Canadian businessman and philanthropist (d. 2007)"], ["1914-08-09T00:00:00", "Gordon Cullen, British architect (d. 1994)"], ["1914-08-09T00:00:00", "Ferenc Fricsay, Hungarian conductor (d. 1963)"], ["1914-08-09T00:00:00", "Tove Jansson, Finnish author (d. 2001)"], ["1914-08-10T00:00:00", "Ken Annakin, British film director (d. 2009)"], ["1914-08-10T00:00:00", "Jeff Corey, American actor and drama teacher (d. 2002)"], ["1914-08-17T00:00:00", "Franklin Delano Roosevelt, Jr., American lawyer and politician (d. 1988)"], ["1914-08-17T00:00:00", "Gabrielle Weidner, Belgian World War II heroine (d. 1945)"], ["1914-09-05T00:00:00", "Sor Isolina Ferré, Puerto Rican Catholic nun (d. 2000)"], ["1914-09-05T00:00:00", "Nicanor Parra, Chilean poet"], ["1914-09-12T00:00:00", "Desmond Llewelyn, Welsh actor (d. 1999)"], ["1914-09-12T00:00:00", "Janusz Żurakowski, Polish-born pilot (d. 2004)"], ["1914-09-15T00:00:00", "Creighton Abrams, U.S. Vietnam War general (d. 1974)"], ["1914-09-15T00:00:00", "Adolfo Bioy Casares, Argentine writer (d. 1999)"], ["1914-09-15T00:00:00", "Jens Otto Krag, Danish politician, Prime Minister of Denmark (d. 1978)"], ["1914-09-15T00:00:00", "Robert McCloskey, American children's author/illustrator (d. 2003)"], ["1914-09-20T00:00:00", "Ken Hechler, American politician"], ["1914-09-20T00:00:00", "Kenneth More, English actor (d. 1982)"], ["1914-09-23T00:00:00", "Bethsabée de Rothschild, English philanthropist and patron of dance (d. 1999)"], ["1914-09-23T00:00:00", "Omar Ali Saifuddien III, Sultan of Brunei (d. 1986)"], ["1914-10-25T00:00:00", "John Berryman, American poet (d. 1972)"], ["1914-10-25T00:00:00", "Maudie Prickett, American actress (d. 1976)"], ["1914-10-28T00:00:00", "Glenn Robert Davis, U.S. congressman (d. 1988)"], ["1914-10-28T00:00:00", "Jonas Salk, American medical scientist (d. 1995)"], ["1914-10-28T00:00:00", "Richard Laurence Millington Synge, English chemist, Nobel Prize laureate (d. 1994)"], ["1914-11-02T00:00:00", "Johnny Vander Meer, baseball player (d. 1997)"], ["1914-11-02T00:00:00", "Ray Walston, American actor (d. 2001)"], ["1914-11-06T00:00:00", "Jonathan Harris, American actor (Lost in Space) (d. 2002)"], ["1914-11-06T00:00:00", "Leonard Miall, British broadcaster and television personality (d. 2005)"], ["1914-11-08T00:00:00", "George Dantzig, American mathematician (d. 2005)"], ["1914-11-08T00:00:00", "Norman Lloyd, American actor, producer, director and husband of Peggy Lloyd"], ["1914-11-23T00:00:00", "Roger Avon, English actor (d. 1998)"], ["1914-11-23T00:00:00", "George Dunn, American actor (d. 1982)"], ["1914-06-28T00:00:00", "Archduke Franz Ferdinand of Austria (assassinated) (b. 1863)"], ["1914-06-28T00:00:00", "Sophie, Duchess of Hohenberg, wife of Archduke Franz Ferdinand of Austria (assassinated) (b. 1868)"], ["1914-08-08T00:00:00", "Martin-Paul Samba, Cameroonian rebel leader (executed)"], ["1914-08-08T00:00:00", "Rudolf Duala Manga Bell, Cameroonian resistance leader (executed)"]]