[["1902-01-01T00:00:00", "The first college football bowl game, the Rose Bowl between Michigan and Stanford, is held in Pasadena, California."], ["1902-01-01T00:00:00", "Nurses Registration Act 1901 comes into effect in New Zealand, making it the first country in the world to require state registration of nurses. On January 10, Ellen Dougherty becomes the world's first registered nurse."], ["1902-01-08T00:00:00", "A train collision in the New York Central Railroad's Park Avenue Tunnel kills 17, injures 38, and leads to increased demand for electric trains and led to the banning of Steam locomotives in New York City."], ["1902-01-12T00:00:00", "Uddevalla Suffrage Association is officially dissolved."], ["1902-01-23T00:00:00", "A snowstorm at Mount Hakkoda, northern Honshu, Japan, kills 199 during a military training exercise."], ["1902-01-28T00:00:00", "The Carnegie Institution is founded in Washington, D.C. with a $10 million gift from Andrew Carnegie."], ["1902-02-09T00:00:00", "Fire levels 26 city blocks of Jersey City, New Jersey."], ["1902-02-11T00:00:00", "Police and universal suffrage demonstrators are involved in a physical altercation in Brussels."], ["1902-02-15T00:00:00", "The Berlin U-Bahn underground is opened."], ["1902-02-18T00:00:00", "U.S. President Theodore Roosevelt prosecutes the Northern Securities Company for violation of the Sherman Act."], ["1902-02-27T00:00:00", "American writer John Steinbeck is born."], ["1902-03-06T00:00:00", "Real Madrid was founded."], ["1902-03-07T00:00:00", "Second Boer War: South African Boers win their last battle over British forces, with the capture of a British general and 200 of his men."], ["1902-03-08T00:00:00", "Jean Sibelius's Second Symphony was premiered in Helsinki."], ["1902-03-10T00:00:00", "A Circuit Court prevents Thomas Edison from having a monopoly on motion picture technology."], ["1902-04-02T00:00:00", "Electric Theatre, the first movie theater in the United States, opens in Los Angeles."], ["1902-04-13T00:00:00", "A new car speed record of 74 mph (119 km/h) is set in Nice, France, by Léon Serpollet."], ["1902-04-19T00:00:00", "A magnitude 7.5 earthquake rocks Guatemala, killing 2,000."], ["1902-04-26T00:00:00", "Hibernian F.C. won the Scottish Cup 1-0 against Glasgow Celtic F.C., the last time in their history they have won the competition."], ["1902-05-05T00:00:00", "The Commonwealth Public Service Act creates Australia's Public Service."], ["1902-05-07T00:00:00", "In Saint Vincent, La Soufrière erupts, devastating the northern portion of the island, killing 2,000 people"], ["1902-05-08T00:00:00", "In Martinique, Mount Pelée erupts, destroying the town of Saint-Pierre and killing over 30,000."], ["1902-05-13T00:00:00", "Alfonso XIII of Spain begins his reign."], ["1902-05-20T00:00:00", "Cuba gains independence from the United States."], ["1902-05-29T00:00:00", "Lord Rosebery opens London School of Economics."], ["1902-05-31T00:00:00", "The Treaty of Vereeniging ends the Second Boer War."], ["1902-06-02T00:00:00", "The Anthracite Coal Strike begins in the United States."], ["1902-06-15T00:00:00", "The New York Central Railroad inaugurates the 20th Century Limited passenger train between Chicago and New York City."], ["1902-06-16T00:00:00", "Australia: Female British subjects (with the exception of Asians, Aborigines and Africans) win the vote with the Uniform Franchise Act."], ["1902-06-17T00:00:00", "Norwich City Football Club is formed."], ["1902-06-26T00:00:00", "Edward VII institutes the Order of Merit."], ["1902-07-05T00:00:00", "Erik Gustaf Boström returns as Prime Minister of Sweden."], ["1902-07-08T00:00:00", "Service of Reclamation within U.S. Geological Survey."], ["1902-07-10T00:00:00", "The Rolling Mill Mine disaster in Johnstown, Pennsylvania kills 112 miners."], ["1902-07-11T00:00:00", "Lord Salisbury retires as British prime minister."], ["1902-07-11T00:00:00", "The Order of the Garter is conferred on Archduke Franz Ferdinand of Austria."], ["1902-07-14T00:00:00", "St Mark's Campanile in Venice collapses."], ["1902-07-21T00:00:00", "Fluminense Football Club is founded in Rio de Janeiro."], ["1902-08-01T00:00:00", "100 miners die in a pit explosion in Wollongong, Australia."], ["1902-08-09T00:00:00", "Edward VII is crowned King of the United Kingdom."], ["1902-08-22T00:00:00", "Theodore Roosevelt becomes the first American President to ride in an automobile when he rides in a Columbia Electric Victoria through Hartford, Connecticut."], ["1902-08-24T00:00:00", "A statue of Joan of Arc was unveiled in Saint-Pierre-le-Moûtier."], ["1902-08-30T00:00:00", "In Martinique, Mount Pelée erupts again, destroying the town of Morne-Rouge causing 1000 deaths."], ["1902-09-19T00:00:00", "Shiloh Baptist Church disaster, a stampede at the Shiloh Baptist Church in Birmingham, Alabama, after a talk by Booker T. Washington, kills 115"], ["1902-10-16T00:00:00", "The first Borstal (youth offenders' institution) opens in Borstal, Kent, U.K."], ["1902-10-21T00:00:00", "In the United States, a five-month strike by the United Mine Workers ends."], ["1902-11-30T00:00:00", "American Old West: The second-in-command of Butch Cassidy's Wild Bunch gang, Kid Curry Logan, is sentenced to 20 years hard labor."], ["1902-12-10T00:00:00", "The first Aswan Dam on the Nile is completed."], ["1902-12-30T00:00:00", "Discovery Expedition: Scott, Shackleton and Wilson reach the furthest southern point reached thus far by man, south of 82°S."]]