[["1908-01-01T00:00:00", "Nimrod Expedition: Ernest Shackleton sets sail from New Zealand on the Nimrod for Antarctica."], ["1908-01-12T00:00:00", "A long-distance radio message is sent from the Eiffel Tower for the first time."], ["1908-01-13T00:00:00", "A fire at the Rhoads Opera House in Boyertown, Pennsylvania, U.S.A., kills 170."], ["1908-01-24T00:00:00", "Start of publication of Robert Baden-Powell's Scouting for Boys in London. The book will over time sell over 100 million copies and effectively begin the worldwide Boy Scout movement."], ["1908-02-01T00:00:00", "Lisbon Regicide: King Carlos I of Portugal and Infante Luis Filipe are shot dead in Lisbon."], ["1908-02-12T00:00:00", "The first around-the-world car race, the 1908 New York to Paris Race, begins."], ["1908-02-18T00:00:00", "Japanese emigration to the United States is forbidden under terms of the Gentlemen's Agreement of 1907."], ["1908-03-04T00:00:00", "The Collinwood school fire, near Cleveland, Ohio, U.S.A., kills 174."], ["1908-03-21T00:00:00", "French aviator Léon Delagrange pilots the first passenger flight with Henri Farman on board."], ["1908-03-23T00:00:00", "American diplomat Durham Stevens, an employee of Japan's Ministry of Foreign Affairs, is assassinated in San Francisco by two Korean immigrants unhappy with his recent support for the increasing Japanese presence in Korea."], ["1908-03-27T00:00:00", "The first Scout Troop outside the U.K. is formed in Gibraltar."], ["1908-04-20T00:00:00", "Sunshine train disaster: A rear-end collision of two trains in Melbourne, Australia, kills 44 people and injures more than 400."], ["1908-04-21T00:00:00", "Frederick Cook claims to have reached the North Pole on this date."], ["1908-05-26T00:00:00", "At Masjid-al-Salaman in southwest Persia, the first major commercial oil discovery in the Middle East is made. The rights to the resource are quickly acquired by the United Kingdom."], ["1908-07-03T00:00:00", "Young Turk Revolution in the Ottoman Empire: Major Ahmed Niyazi, with 200 followers (Ottoman troops and civilians), begins an open revolution by defecting from the 3rd Army Corps in Macedonia, decamping into the hill country."], ["1908-07-06T00:00:00", "Robert Peary sets sail for the North Pole."], ["1908-07-23T00:00:00", "Young Turk Revolution: The Committee of Union and Progress (CUP) issues a formal ultimatum to Sultan Abdul Hamid II to restore the constitution of 1876 within the Ottoman Empire. It is restored the following day."], ["1908-07-24T00:00:00", "Dorando Pietri wins the Olympic marathon in London in one of the most dramatic arrivals of the Olympic history, only to be disqualified soon afterwards for receiving assistance."], ["1908-08-08T00:00:00", "Wilbur Wright flies in France for the first time demonstrating true controlled powered flight in Europe."], ["1908-08-08T00:00:00", "The Hoover Company of Canton, Ohio, acquires manufacturing rights to the upright portable vacuum cleaner just invented by James M. Spangler."], ["1908-08-17T00:00:00", "Émile Cohl makes the first fully animated film, Fantasmagorie."], ["1908-08-24T00:00:00", "After an intense power struggle, Sultan Abdelaziz of Morocco is deposed, and is succeeded by his brother Abd al-Hafid."], ["1908-09-10T00:00:00", "The first Minas Geraes-class Dreadnought battleship for Brazil, Minas Geraes is launched at Armstrong Whitworth's yard on the River Tyne in England, catalysing the \"South American dreadnought race\"."], ["1908-09-17T00:00:00", "At Fort Myer, Virginia, U.S.A., Thomas Selfridge becomes the first person to die in an airplane crash. The pilot, Orville Wright, is severely injured in the crash but recovers."], ["1908-09-27T00:00:00", "Henry Ford produces his first Model T automobile."], ["1908-10-01T00:00:00", "Penny Post established between the United Kingdom and United States."], ["1908-10-05T00:00:00", "Bulgaria declares its independence from the Ottoman Empire; Ferdinand I of Bulgaria becomes Tsar."], ["1908-10-06T00:00:00", "The Bosnian crisis begins after the Austro-Hungarian Empire annexes Bosnia and Herzegovina."], ["1908-11-06T00:00:00", "Western bandits Butch Cassidy and the Sundance Kid are supposedly killed in Bolivia, after being surrounded by a large group of soldiers. There are many rumors to the contrary however, and their grave sites are unmarked."], ["1908-11-15T00:00:00", "King Leopold II of Belgium formally relinquishes his personal control of the Congo Free State to Belgium (becoming Belgian Congo) following evidence collected by Roger Casement of maladministration."], ["1908-11-25T00:00:00", "The Christian Science Monitor newspaper is first published, in the United States."], ["1908-12-02T00:00:00", "Child Emperor Pu Yi ascends the Chinese throne at age 2."], ["1908-12-16T00:00:00", "Construction begins on the RMS Olympic at the Harland and Wolff shipyard in Belfast."], ["1908-12-28T00:00:00", "Messina earthquake: An earthquake of 7.1 Mw and tsunami hit Sicily and Calabria, destroying Messina and killing over 70,000 people."]]