[["1929-01-01T00:00:00", "The U.S. Army Air Corps airplane ? begins a six-day non-stop endurance flight over Southern California using aerial refueling."], ["1929-01-01T00:00:00", "The British Columbian municipalities of Point Grey and South Vancouver are amalgamated into Vancouver."], ["1929-01-06T00:00:00", "6 January Dictatorship: King Alexander of the Serbs, Croats, and Slovenes suspends his country's constitution."], ["1929-01-06T00:00:00", "The Albanian missionary sister Agnes Gonxha Bojaxhiu, later known as Mother Teresa, arrives in Calcutta from Ireland to begin her work in India."], ["1929-01-10T00:00:00", "First appearance of Hergé's Belgian comic book hero Tintin as Tintin in the Land of the Soviets (Les Aventures de Tintin, reporter..., au pays des Soviets), begins serialization in children's newspaper supplement, Le Petit Vingtième."], ["1929-01-15T00:00:00", "Annales d'histoire économique et sociale begins publication in France."], ["1929-01-17T00:00:00", "First appearance of comic strip hero Popeye in Thimble Theatre."], ["1929-01-29T00:00:00", "All Quiet on the Western Front (Im Westen nichts Neues), by Erich Maria Remarque, is published in book form."], ["1929-02-09T00:00:00", "\"Litvinov's Pact\" is signed in Moscow by the Soviet Union, Poland, Estonia, Romania and Latvia who agree not to use force to settle disputes between themselves."], ["1929-02-11T00:00:00", "The Kingdom of Italy and the Holy See of the Catholic Church sign the Lateran Treaty to establish the Vatican City as an independent sovereign enclave within Rome, resolving the \"Roman Question\"."], ["1929-02-14T00:00:00", "\"Saint Valentine's Day Massacre\": Five gangsters (rivals of Al Capone), plus two civilians, are shot dead in Chicago."], ["1929-02-26T00:00:00", "The Grand Teton National Park is established by the United States Congress."], ["1929-03-02T00:00:00", "The longest bridge in the world at this time, the San Francisco Bay Toll-Bridge, opens."], ["1929-03-03T00:00:00", "A revolt by Generals José Gonzalo Escobar and Jesús María Aguirre fails in Mexico."], ["1929-03-04T00:00:00", "Herbert Hoover is inaugurated as the 31st President of the United States, succeeding Calvin Coolidge."], ["1929-03-04T00:00:00", "Establishment of the National Revolutionary Party (Partido Nacional Revolucionario) in Mexico by ex-President Plutarco Elías Calles. Under a succession of names, it will hold power in the country continuously for the next 71 years."], ["1929-03-28T00:00:00", "Japanese forces withdraw from Shandong province to their garrison in Tsingtao bringing an end to the Jinan Incident."], ["1929-03-30T00:00:00", "Imperial Airways begins operating the first commercial flights between London and Karachi."], ["1929-04-03T00:00:00", "Persia signs the Litvinov Protocol."], ["1929-04-04T00:00:00", "Karl Benz the creator of the first automobile dies."], ["1929-04-14T00:00:00", "The inaugural Monaco Grand Prix is won by William Grover-Williams driving a Bugatti."], ["1929-05-07T00:00:00", "\"The Battle Of Blood Alley\" is fought by a razor gang in Sydney, Australia"], ["1929-05-16T00:00:00", "The 1st Academy Awards are presented in a 15-minute ceremony at the Hollywood Roosevelt Hotel, honoring the best movies of 1927 and 1928, Wings (1927) winning Best Picture. Gerald Duffy (died 1928) receives the only Academy Award for Best Title Writing ever awarded (for his intertitles to the silent film The Private Life of Helen of Troy (1927))."], ["1929-05-31T00:00:00", "The United Kingdom general election again returns a hung parliament; the Liberals in Parliament determine which party will govern."], ["1929-06-01T00:00:00", "The 1st Conference of the Communist Parties of Latin America is held in Buenos Aires."], ["1929-06-03T00:00:00", "The Treaty of Lima settles a border dispute between Peru and Chile."], ["1929-06-07T00:00:00", "The Lateran Treaty, making Vatican City a sovereign state, is ratified."], ["1929-06-08T00:00:00", "Ramsay MacDonald forms the United Kingdom's second Labour government."], ["1929-06-21T00:00:00", "An agreement brokered by U.S. Ambassador Dwight Whitney Morrow helps end the Cristero War in Mexico."], ["1929-06-27T00:00:00", "The first public demonstration of color TV is held, by H. E. Ives and his colleagues at Bell Telephone Laboratories in New York. The first images are a bouquet of roses and an American flag. A mechanical system is used to transmit 50-line color television images between New York and Washington."], ["1929-07-11T00:00:00", "In Russia, a secret decree of the Sovnarkom creates the backbone of the Gulag system."], ["1929-07-24T00:00:00", "French prime minister Raymond Poincaré resigns and is succeeded by Aristide Briand."], ["1929-07-24T00:00:00", "The Kellogg-Briand Pact, renouncing war as an instrument of foreign policy, goes into effect (it was first signed in Paris on August 27, 1928 by most leading world powers)."], ["1929-07-25T00:00:00", "Pope Pius XI emerges from the Apostolic Palace and enters St. Peter's Square in a huge procession witnessed by about 250,000 persons, thus ending nearly 60 years of self-imposed status by the papacy as Prisoner in the Vatican."], ["1929-07-27T00:00:00", "The Geneva Convention addresses the treatment of prisoners of war."], ["1929-07-27T00:00:00", "Red Crescent adopted as an additional emblem of the League of Red Cross Societies."], ["1929-08-16T00:00:00", "The 1929 Palestine riots break out between Palestinians and Jews in Mandatory Palestine and continue until the end of the month. In total, 133 Jews and 116 Palestinians are killed."], ["1929-08-20T00:00:00", "First transmissions of John Logie Baird's experimental 30-line television system by the British Broadcasting Corporation."], ["1929-08-29T00:00:00", "The 1929 Safed massacre, in which 18-20 Jews are killed in Safed by Palestinian Arabs."], ["1929-08-29T00:00:00", "The SS San Juan collides with the oil tanker S.C.T. Dodd off the California coast, causing the San Juan to sink in 3 minutes, killing 77 people."], ["1929-08-31T00:00:00", "The Young Plan, which sets the total World War I reparations owed by Germany at US$26,350,000,000 to be paid over a period of 58½ years, is finalized."], ["1929-09-03T00:00:00", "The Dow Jones Industrial Average peaks at 381.17, a height it will not reach again until November 1954."], ["1929-09-05T00:00:00", "Aristide Briand presents his plan for the United States of Europe."], ["1929-09-17T00:00:00", "A coup ousts Augustinas Voldemaras in Lithuania; the new president is Antanas Smetona."], ["1929-09-30T00:00:00", "Fritz von Opel pilots the first rocket-powered aircraft, the Opel RAK.1, in front of a large crowd in Frankfurt am Main."], ["1929-10-18T00:00:00", "On appeal from the Supreme Court of Canada on behalf of \"The Famous Five\" Canadian women in the landmark case of Edwards v. Canada (Attorney General), the Judicial Committee of the Privy Council in the United Kingdom announces that women are \"persons\" under the British North America Acts and thus eligible for appointment to the Senate of Canada."], ["1929-10-22T00:00:00", "The government of Aristide Briand falls in France."], ["1929-10-25T00:00:00", "Former U.S. Interior Secretary Albert B. Fall is convicted of bribery for his role in the Teapot Dome scandal, becoming the first Presidential cabinet member to go to prison for actions in office."], ["1929-11-01T00:00:00", "An annular solar eclipse is seen over the Atlantic Ocean and Africa."], ["1929-11-01T00:00:00", "Conscription in Australia ends."], ["1929-11-07T00:00:00", "In New York City, the Museum of Modern Art opens to the public."], ["1929-11-15T00:00:00", "U.K. release of Atlantic, a film about the sinking of the RMS Titanic which is one of the first British sound-on-film movies and, in its simultaneously-shot German-language version, the first to be released in Germany."], ["1929-11-18T00:00:00", "1929 Grand Banks earthquake."], ["1929-11-29T00:00:00", "Bernt Balchen, U.S. Admiral Richard Byrd, Captain Ashley McKinley and Harold June become the first to fly over the South Pole."], ["1929-12-28T00:00:00", "\"Black Saturday\" in Samoa: New Zealand colonial police kill 11 unarmed demonstrators, an event which leads the Mau movement to demand independence for Samoa."], ["1929-12-29T00:00:00", "The All India Congress in Lahore demands Indian independence."]]