[["1947-01-01T00:00:00", "British coal mines are nationalised."], ["1947-01-01T00:00:00", "Nigeria gains limited autonomy before gaining independence in 1960."], ["1947-01-01T00:00:00", "The Canadian Citizenship Act comes into effect."], ["1947-01-03T00:00:00", "Proceedings of the United States Congress are televised for the first time."], ["1947-01-10T00:00:00", "The United Nations takes control of the free city of Trieste."], ["1947-01-15T00:00:00", "Elizabeth Short, an aspiring actress nicknamed the \"Black Dahlia\", is found brutally murdered in a vacant lot in Los Angeles. The case remains unsolved to this day."], ["1947-01-16T00:00:00", "Vincent Auriol is inaugurated as president of France."], ["1947-01-19T00:00:00", "A shipwreck near Athens, Greece kills 392."], ["1947-01-24T00:00:00", "Dimitrios Maximos founds a monarchist government in Athens."], ["1947-01-25T00:00:00", "A Philippine plane crashes in Hong Kong, with $5 million worth of gold and money."], ["1947-01-26T00:00:00", "A KLM Douglas C-47 Skytrain aircraft crashes soon after taking off from Kastrup Airport, Copenhagen, killing all on board, including Prince Gustaf Adolf, second in line to the Swedish throne, and the American singer Grace Moore."], ["1947-01-31T00:00:00", "The Communists take power in Poland."], ["1947-02-03T00:00:00", "The lowest air temperature in North America (-63 degrees Celsius) is recorded in Snag in the Yukon Territory."], ["1947-02-03T00:00:00", "Percival Prattis becomes the first African-American news correspondent allowed in the United States House of Representatives and Senate press galleries."], ["1947-02-05T00:00:00", "Bolesław Bierut becomes the President of Poland."], ["1947-02-05T00:00:00", "The Government of the United Kingdom announces the £25 million Tanganyika groundnut scheme for cultivation of peanuts in the Tanganyika Territory."], ["1947-02-06T00:00:00", "South Pacific Commission (SPC) founded."], ["1947-02-08T00:00:00", "Karlslust dance hall fire in Berlin, Germany, kills over 80 people."], ["1947-02-10T00:00:00", "In Paris, France, peace treaties are signed between the World War II Allies and Italy, Hungary, Romania, Bulgaria, and Finland. Italy cedes most of Istria to the Socialist Federal Republic of Yugoslavia (later Croatia)."], ["1947-02-12T00:00:00", "A meteor creates an impact crater in Sikhote-Alin, in the Soviet Union."], ["1947-02-12T00:00:00", "Christian Dior introduces The \"New Look\" in women's fashion, in Paris."], ["1947-02-12T00:00:00", "In Burma, the Panglong Agreement is reached between the Burmese government under its leader, General Aung San, and the Shan, Kachin, and Chin ethnic peoples at the Panglong Conference. U Aung Zan Wai, Pe Khin, Major Aung, Sir Maung Gyi, Dr. Sein Mya Maung and Myoma U Than Kywe are among the negotiators."], ["1947-02-17T00:00:00", "Cold War: The Voice of America begins to transmit radio broadcasts into Eastern Europe and the Soviet Union."], ["1947-02-20T00:00:00", "An explosion at the O'Connor Electro-Plating Company in Los Angeles, leaves 17 dead, 100 buildings damaged, and a 22-foot-deep (6.7 m) crater in the ground."], ["1947-02-20T00:00:00", "U.S. Army Ordnance Corps Hermes program V-2 rocket Blossom I launched into space carrying plant material and fruitflies, the first animals to enter space."], ["1947-02-21T00:00:00", "In New York City, Edwin Land demonstrates the first \"instant camera\", his Polaroid Land Camera, to a meeting of the Optical Society of America."], ["1947-02-22T00:00:00", "Tom and Jerry cartoon Cat Fishin', is released."], ["1947-02-23T00:00:00", "The International Organization for Standardization (ISO) is founded."], ["1947-02-25T00:00:00", "The German state of Prussia is officially abolished by the Allied Control Council."], ["1947-02-25T00:00:00", "The worst-ever train crash in Japan kills 184 people."], ["1947-02-25T00:00:00", "John C. Hennessy, Jr., brings the first Volkswagen Beetle to the United States. He purchased the 1946 automobile from the U.S. Army Post Exchange in Frankfurt, Germany, while serving in the U.S. Army. The Beetle was shipped from Bremerhaven, arriving in New York this day."], ["1947-02-28T00:00:00", "The United States grants France a military base in Casablanca."], ["1947-02-28T00:00:00", "In Taiwan, civil disorder is put down with large loss of civilian lives."], ["1947-03-01T00:00:00", "The International Monetary Fund begins to operate."], ["1947-03-01T00:00:00", "Wernher von Braun marries his first cousin, the 18-year-old Maria von Quirstorp."], ["1947-03-04T00:00:00", "Treaty of Dunkirk (coming into effect 8 September) signed between the United Kingdom and France providing for mutual assistance in the event of attack."], ["1947-03-09T00:00:00", "Carrie Chapman Catt dies in New Rochelle."], ["1947-03-12T00:00:00", "The Truman Doctrine is proclaimed to help stem the spread of Communism."], ["1947-03-14T00:00:00", "Thames flood and other widespread flooding as the exceptionally harsh British winter of 1946-1947 ends in a thaw."], ["1947-03-15T00:00:00", "Hindus and Muslims clash in Punjab."], ["1947-03-19T00:00:00", "The 19th Academy Awards ceremony is held. The movie The Best Years of Our Lives wins the Academy Award for Best Picture, along with several other Academy Awards."], ["1947-03-25T00:00:00", "A coal mine explosion in Centralia, Illinois, kills 111 miners."], ["1947-03-28T00:00:00", "A World War II Japanese booby trap explodes on Corregidor island, killing 28 people."], ["1947-03-29T00:00:00", "A rebellion against French rule erupts in Madagascar."], ["1947-03-31T00:00:00", "The leaders of the Kurdish People's Republic of Mahabad, the second Kurdish state in the history of Iran, are hanged at the Chuwarchira Square in Mahabad after that country had been overrun by the Iranian army."], ["1947-04-01T00:00:00", "Jackie Robinson, the first African American in Major League Baseball since the 1880s, signs a contract with the Brooklyn Dodgers."], ["1947-04-01T00:00:00", "King George II of Greece is succeeded by his brother King Paul I."], ["1947-04-04T00:00:00", "International Civil Aviation Organization begins operations."], ["1947-04-07T00:00:00", "Edaville Railroad was opened as the first railway theme parks."], ["1947-04-09T00:00:00", "Multiple tornadoes strike Texas, Oklahoma, and Kansas killing 181 and injuring 970."], ["1947-04-15T00:00:00", "Jackie Robinson becomes the first African American to play Major League Baseball since the 1880s."], ["1947-04-16T00:00:00", "Texas City disaster: The ammonium nitrate cargo of French-registered Liberty ship SS Grandcamp explodes in Texas City, Texas, killing at least 581, including all but one member of the city fire department, injuring at least 5,000 and destroying 20 city blocks. Of the dead, remains of 113 are never found and 63 are unidentifiable."], ["1947-04-16T00:00:00", "American financier and presidential adviser Bernard Baruch describes the post-World War II tensions between the Soviet Union and the United States as a \"Cold War\"."], ["1947-04-18T00:00:00", "The British Royal Navy detonates 6,800 tons of explosives in an attempt to demolish the fortified island of Heligoland, Germany, thus creating one of the largest man-made non-nuclear explosions in history."], ["1947-04-18T00:00:00", "Mrs. Ples is discovered in the Sterkfontein area in Transvaal, South Africa."], ["1947-04-26T00:00:00", "Academy-Award winning Tom and Jerry cartoon, The Cat Concerto, is released to theatres."], ["1947-05-01T00:00:00", "Portella della Ginestra massacre: The Salvatore Giuliano gang of Sicilian separatists opens fire on a Labour Day parade at Portella della Ginestra, Sicily, killing 11 people and wounding 27."], ["1947-05-02T00:00:00", "The movie Miracle on 34th Street, a Christmastime classic, is first shown in theaters."], ["1947-05-03T00:00:00", "The new post-war Japanese constitution goes into effect."], ["1947-05-12T00:00:00", "The animated cartoon film Rabbit Transit, directed by Friz Freleng, is released."], ["1947-05-22T00:00:00", "The Cold War begins: In an effort to fight the spread of Communism, President Harry S. Truman signs an Act of Congress that implements the Truman Doctrine. This Act grants $400 million in military and economic aid to Turkey and Greece. The Cold War ended in 1991."], ["1947-05-22T00:00:00", "David Lean's film Great Expectations, based on the novel by Charles Dickens, opens in the United States. Critics call it the finest film ever made from a Charles Dickens novel."], ["1947-05-25T00:00:00", "An airliner of the Flugfelag Íslands crashes into a mountainside, killing 25 people."], ["1947-06-05T00:00:00", "U.S. Secretary of State George Marshall outlines the Marshall Plan for American reconstruction and relief aid to Europe in a speech at Harvard University."], ["1947-06-07T00:00:00", "The Royal Romanian Army founds the Association football club FC Steaua București, which will become the most successful Romanian football team, as A.S.A. București."], ["1947-06-10T00:00:00", "SAAB in Sweden produces its first automobile."], ["1947-06-15T00:00:00", "The Portuguese government orders 11 military officers and 19 university professors who are accused of revolutionary activity to resign."], ["1947-06-21T00:00:00", "Seaman Harold Dahl claims to have seen six unidentified flying objects (UFOs) near Maury Island in Puget Sound, Washington. On the next morning, Dahl reports the first modern so-called \"Men in Black\" encounter."], ["1947-06-21T00:00:00", "The Canadian Parliament votes unanimously to pass several laws regarding displaced foreign refugees."], ["1947-06-23T00:00:00", "The United States Senate follows the House of Representatives in overriding President Harry S. Truman's veto of the Taft-Hartley Act."], ["1947-06-24T00:00:00", "Kenneth Arnold makes the first widely reported UFO sighting near Mount Rainier, Washington."], ["1947-06-25T00:00:00", "The Diary of a Young Girl by Anne Frank is published for the first time as Het Achterhuis: Dagboekbrieven 14 juni 1942 - 1 augustus 1944 (\"The Annex: Diary Notes from 14 June 1942 - 1 August 1944\") in Amsterdam, two years after the writer's death in Bergen-Belsen concentration camp."], ["1947-07-06T00:00:00", "The AK-47 assault rifle enters production. Becoming the most produced gun in history."], ["1947-07-08T00:00:00", "A supposedly downed extraterrestrial spacecraft is reportedly found in the Roswell UFO incident, near Roswell, New Mexico, which was written about by Stanton T. Friedman."], ["1947-07-10T00:00:00", "In the U.K., Princess Elizabeth announces her engagement to Lieutenant Philip Mountbatten."], ["1947-07-11T00:00:00", "The Exodus leaves France for Palestine, with 4,500 Jewish Holocaust survivor refugees on board."], ["1947-07-17T00:00:00", "The Indian passenger ship SS Ramdas is capsized by a cyclone at Mumbai, India, with 625 people killed."], ["1947-07-17T00:00:00", "This is the alleged date when Raoul Wallenberg dies in a Soviet prison. It is not announced until February 6, 1957. There will be reported sightings of him until 1987."], ["1947-07-18T00:00:00", "Following wide media and UNSCOP coverage, the Exodus is captured by British troops and refused entry into Palestine at the port of Haifa."], ["1947-07-18T00:00:00", "President Harry S. Truman signs the Presidential Succession Act into law, which places the Speaker of the House and the President pro tempore of the Senate next in the line of succession after the Vice President."], ["1947-07-26T00:00:00", "Cold War: U.S. President Harry S. Truman signs the National Security Act of 1947 into law, creating the Central Intelligence Agency, the Department of Defense, the Joint Chiefs of Staff, and the National Security Council."], ["1947-07-29T00:00:00", "After being shut down on November 9, 1946, for a refurbishment, the ENIAC computer, the world's first electronic digital computer, is turned back on again. It next remains in continuous operation until October 2, 1955."], ["1947-08-05T00:00:00", "The Netherlands stops all political actions in Indonesia."], ["1947-08-07T00:00:00", "Thor Heyerdahl's balsa wood raft, the Kon-Tiki, smashes into the reef at Raroia in the Tuamotu Islands after a 101-day, 4,300 mile, voyage across the Eastern Pacific Ocean, proving that pre-historic peoples could hypothetically have traveled to the Central Pacific islands from South America."], ["1947-08-07T00:00:00", "The Bombay Municipal Corporation formally takes over the Bombay Electric Supply and Transport (BEST)."], ["1947-08-14T00:00:00", "The Muslim majority region formed by the Partition of India gains independence from the British Empire and adopts the name Pakistan. While the transition is officially at midnight on this day, Pakistan celebrates its independence on August 14, compared with India on the 15th, because the Pakistan Standard Time is 30 minutes behind the standard time of India."], ["1947-08-14T00:00:00", "Muhammad Ali Jinnah becomes the first Governor-General of Pakistan. Liaquat Ali Khan takes office as the first Prime Minister of Pakistan"], ["1947-08-15T00:00:00", "The greater Indian subcontinent with a mixed population of Hindus, Muslims, Christians, Sikhs, Buddhists, Jains, Jews, etc. formed by the Partition of India gain independence from the British Empire and retains the name India."], ["1947-08-15T00:00:00", "Louis Mountbatten becomes the first Governor-General of India. Jawaharlal Nehru takes office as the first Prime Minister of India."], ["1947-08-16T00:00:00", "In Greece, General Markos Vafiadis takes over the government."], ["1947-08-23T00:00:00", "The Prime Minister of Greece, Dimitrios Maximos, resigns."], ["1947-08-27T00:00:00", "The French government lowers the daily bread ration to 200 grams, causing riots in Verdun and in Le Mans."], ["1947-08-30T00:00:00", "A fire at a movie theater in Rueil, a suburb of Paris, France kills 87 people."], ["1947-08-31T00:00:00", "The communists seize power in Hungary."], ["1947-09-13T00:00:00", "Indian Prime Minister Jawaharlal Nehru suggests the exchange of four million Hindus and Muslims between India and Pakistan."], ["1947-09-18T00:00:00", "National Security Act of 1947 becomes effective on this day creating the United States Air Force, National Security Council and the Central Intelligence Agency."], ["1947-09-18T00:00:00", "War Department becomes the Department of the Army, a branch of the new Department of Defense."], ["1947-09-22T00:00:00", "Information Bureau of the Communist and Workers' Parties (Communist Information Bureau) (\"Cominform\") is founded."], ["1947-09-30T00:00:00", "Pakistan and Yemen join the United Nations."], ["1947-10-05T00:00:00", "President Harry S. Truman delivers the first televised White House address speaking on the world food crises."], ["1947-10-14T00:00:00", "The United States Air Force test pilot, Captain Chuck Yeager, flies a Bell X-1 rocket plane faster than the speed of sound, the first time it has been accomplished"], ["1947-10-20T00:00:00", "A war begins in Kashmir, along the border between India and Pakistan, leading to the Indo-Pakistani War of 1947 in the following year. Also, Pakistan established diplomatic relations with the United States of America."], ["1947-10-24T00:00:00", "The first Azad Kashmir Government is established within Pakistan, headed by Sardar Muhammad Ibrahim Khan as its first President supported by the government of Pakistan."], ["1947-10-30T00:00:00", "The General Agreement on Tariffs and Trade (GATT), the foundation of the World Trade Organization (WTO), is established."], ["1947-11-02T00:00:00", "In Long Beach, California, the designer and airplane pilot Howard Hughes carries out the one and only flight of the Hughes H-4 Hercules, the largest fixed-wing aircraft ever built and flown. This flight only lasted eight minutes."], ["1947-11-02T00:00:00", "An earthquake in the Chilean Andes kills 233 people."], ["1947-11-06T00:00:00", "The program Meet the Press makes its television debut on the NBC-TV network in the United States."], ["1947-11-09T00:00:00", "Junagadh is invaded by the Indian army."], ["1947-11-10T00:00:00", "The arrest of four steel workers in Marseille begins a French communist riot that also spreads to Paris."], ["1947-11-15T00:00:00", "International Telecommunication Union becomes a specialized agency of the United Nations."], ["1947-11-15T00:00:00", "Universal Postal Union (UPU) becomes a specialized agency of the United Nations (effective 1 July 1948)."], ["1947-11-16T00:00:00", "In Brussels, 15,000 people demonstrate against the relatively short prison sentences of Belgian Nazi criminals."], ["1947-11-16T00:00:00", "Great Britain began withdrawing its troops from Palestine."], ["1947-11-18T00:00:00", "The Ballantyne's Department Store fire in Christchurch, New Zealand, kills 41 people."], ["1947-11-20T00:00:00", "The Princess Elizabeth (later Elizabeth II), the daughter of George VI, marries The Duke of Edinburgh at Westminster Abbey in London, United Kingdom."], ["1947-11-20T00:00:00", "Paul Ramadier resigns as the Prime Minister of France. He is succeeded by Robert Schuman, who calls 80,000 army reservists to quell rioting miners in France."], ["1947-11-21T00:00:00", "The United Nations Conference on Trade and Employment begins in Havana, Cuba. This conference ends in 1948, when its members finish the Havana Charter."], ["1947-11-24T00:00:00", "McCarthyism: The United States House of Representatives votes 346-17 to approve citations of Contempt of Congress against the \"Hollywood Ten\" after the screenwriters and directors refuse to co-operate with the House Un-American Activities Committee concerning allegations of communist influences in the movie business. The ten men are blacklisted by the Hollywood movie studios on the following day."], ["1947-11-25T00:00:00", "The Parliament of New Zealand ratifies the Statute of Westminster, and thus becomes independent of legislative control by the Parliament of the United Kingdom."], ["1947-11-25T00:00:00", "The new Pakistan Army and Pashtun mercenaries overrun Mirpur in Kashmir, resulting in the death of 20,000 Hindus and Sikhs."], ["1947-11-27T00:00:00", "In Paris, France, police occupy the editorial offices of the communist newspapers."], ["1947-11-29T00:00:00", "The United Nations General Assembly votes to partition Palestine between Arab and Jewish regions, which results in the creation of the State of Israel."], ["1947-12-03T00:00:00", "French communist strikers derail the Paris-Tourcoing express train because of false rumors that it was transporting soldiers. 21 people are killed."], ["1947-12-03T00:00:00", "The Tennessee Williams play A Streetcar Named Desire, starring Marlon Brando in his first great role, opens at the Ethel Barrymore Theatre on Broadway. Jessica Tandy also stars as Blanche Du Bois.[1]"], ["1947-12-04T00:00:00", "The French Interior Minister, Jules S. Moch, takes emergency measures against his country's rioters after six days of violent arguments in the National Assembly."], ["1947-12-06T00:00:00", "Arturo Toscanini conducts a concert performance of the first half of Giuseppe Verdi's opera Otello for a broadcast on NBC Radio in the United States. The second half of the opera is broadcast a week later."], ["1947-12-06T00:00:00", "Women are admitted to full membership of the University of Cambridge in England following a vote in September."], ["1947-12-09T00:00:00", "French labor unions call off the general strike and re-commence negotiations with the French government."], ["1947-12-12T00:00:00", "The Iranian Royal Army takes back power in the Azerbaijan province."], ["1947-12-21T00:00:00", "400,000 slaughtered during mass migration of Hindus and Muslims into the new states India and Pakistan."], ["1947-12-22T00:00:00", "The Italian Constituent Assembly votes to accept the new Constitution of Italy."], ["1947-12-22T00:00:00", "The first practical electronic transistor is demonstrated by Bardeen, Brattain, and Shockley of the United States."], ["1947-12-30T00:00:00", "King Michael I of Romania abdicates."]]