[["1998-01-02T00:00:00", "Russia begins to circulate new rubles to stem inflation and promote confidence."], ["1998-01-04T00:00:00", "Wilaya of Relizane massacres of 4 January 1998 in Algeria: Over 170 are killed in 3 remote villages."], ["1998-01-06T00:00:00", "The Lunar Prospector spacecraft is launched into orbit around the Moon, and later finds evidence for frozen water, in soil in permanently shadowed craters near the Moon's poles."], ["1998-01-08T00:00:00", "Ramzi Yousef is sentenced to life in prison for planning the first World Trade Center bombing in 1993."], ["1998-01-11T00:00:00", "Over 100 people are killed in the Sidi-Hamed massacre in Algeria."], ["1998-01-12T00:00:00", "Nineteen European nations agree to forbid human cloning."], ["1998-01-14T00:00:00", "Ralph Guarino is arrested for attempting to rob a Bank of America bank in the World Trade Center."], ["1998-01-17T00:00:00", "The Drudge Report breaks the story about Bill Clinton's alleged affair with Monica Lewinsky, which would lead to his impeachment."], ["1998-01-20T00:00:00", "Nepalese police intercept a shipment of 272 human skulls in Kathmandu."], ["1998-01-22T00:00:00", "Suspected \"Unabomber\" Theodore Kaczynski pleads guilty, and accepts a sentence of life without the possibility of parole."], ["1998-01-28T00:00:00", "Gunmen hold at least 400 children and teachers hostage for several hours, at an elementary school in Manila, Philippines."], ["1998-02-03T00:00:00", "Cavalese cable car disaster: a United States military pilot causes the deaths of 20 people near Trento, Italy, when his low-flying plane severs the cable of a cable-car."], ["1998-02-04T00:00:00", "An earthquake measuring 6.1 on the Richter scale in northeast Afghanistan kills more than 5,000 people."], ["1998-02-16T00:00:00", "China Airlines Flight 676 crashes into a residential area near Chiang Kai-shek International Airport, killing 202 people (all 196 on board and 6 on the ground)."], ["1998-02-20T00:00:00", "Iraq disarmament crisis: Iraqi President Saddam Hussein negotiates a deal with U.N. Secretary General Kofi Annan, allowing weapons inspectors to return to Baghdad, preventing military action by the United States and Britain."], ["1998-02-28T00:00:00", "A massacre in Likoshane, FR Yugoslavia starts the Kosovo War."], ["1998-03-02T00:00:00", "Data sent from the Galileo probe indicates that Jupiter's moon Europa has a liquid ocean under a thick crust of ice."], ["1998-03-02T00:00:00", "In Austria, Natascha Kampusch is abducted by Wolfgang Přiklopil (she will remain in his captivity until August 2006)."], ["1998-03-05T00:00:00", "NASA announces that the Clementine probe orbiting the Moon has found enough water in polar craters to support a human colony and rocket fueling station."], ["1998-03-11T00:00:00", "Danish parliamentary election, 1998: Prime Minister Poul Nyrup Rasmussen is re-elected."], ["1998-03-13T00:00:00", "The High-Z Supernova Search Team becomes the first team to publish evidence that the universe is expanding at an accelerating rate."], ["1998-03-23T00:00:00", "The 70th Academy Awards ceremony, hosted for the 6th time by Billy Crystal, is held at the Shrine Auditorium in Los Angeles, California. Titanic wins 11 Oscars including Best Picture."], ["1998-03-26T00:00:00", "Oued Bouaicha massacre in Algeria: 52 people are killed with axes and knives; 32 of the killed are babies under the age of 2."], ["1998-04-05T00:00:00", "In Japan, the Akashi Kaikyō Bridge linking Shikoku with Honshū and costing about US$3.8 billion, opens to traffic, becoming the largest suspension bridge in the world."], ["1998-04-06T00:00:00", "Pakistan tests medium-range missiles capable of hitting India."], ["1998-04-10T00:00:00", "Good Friday: 1 hour after the end of the talks deadline, the Belfast Agreement is signed between the Irish and British governments and most Northern Ireland political parties, with the notable exception of the Democratic Unionist Party."], ["1998-04-20T00:00:00", "The alleged date the German Red Army Faction (created 1970) is dissolved."], ["1998-05-08T00:00:00", "CBS telecasts The Wizard of Oz for the last time. Beginning in 1999, The Wizard of Oz will be shown on cable, and in 2002, 2003, 2004, and 2005 it will be telecast by the WB Television Network in addition to its cable showings."], ["1998-05-11T00:00:00", "India conducts 3 underground nuclear tests in Pokhran, including 1 thermonuclear device."], ["1998-05-11T00:00:00", "The first euro coins are minted in Pessac, France. Because the final specifications for the coins were not finished in 1998, they will have to be melted and minted again in 1999."], ["1998-05-19T00:00:00", "The Galaxy IV communications satellite fails, leaving 80-90% of the world's pagers without service."], ["1998-05-19T00:00:00", "The wreck of the aircraft carrier USS Yorktown, sunk during the Battle of Midway in 1942, is found near Midway Atoll by a team led by former US Navy officer Robert D. Ballard."], ["1998-05-21T00:00:00", "Suharto (elected 1967) resigns, after 32 years as President of Indonesia and his 7th consecutive re-election by the Indonesian Parliament (MPR). Suharto's hand-picked Vice President, B. J. Habibie, becomes Indonesia's third president."], ["1998-05-26T00:00:00", "Bear Grylls, 23, becomes the youngest British climber to scale Mount Everest."], ["1998-05-28T00:00:00", "Nuclear testing: In response to a series of Indian nuclear tests, Pakistan explodes 5 nuclear devices of its own in the Chaghai hills of Baluchistan, codenamed Chagai-I, prompting the United States, Japan and other nations to impose economic sanctions. Pakistan celebrates Youm-e-Takbir annually."], ["1998-05-30T00:00:00", "A 6.6 magnitude earthquake hits northern Afghanistan, killing up to 5,000."], ["1998-05-30T00:00:00", "A second nuclear test, codenamed Chagai-II, is conducted and supervised by the Pakistan Atomic Energy Commission (PAEC)."], ["1998-06-02T00:00:00", "The CIH computer virus is discovered in Taiwan."], ["1998-06-03T00:00:00", "Eschede train disaster: An Intercity-Express high-speed train derails between Hanover and Hamburg, Germany, causing 101 deaths."], ["1998-06-07T00:00:00", "Former Brigadier-General Ansumane Mané seizes control over military barracks in Bissau, marking the beginning of the Guinea-Bissau Civil War (1998-99)."], ["1998-06-07T00:00:00", "Peter Arnett publishes a false report of Operation Tailwind (initiated 1970), claiming that sarin nerve agents were used to eliminate a group of deserting U.S. soldiers."], ["1998-06-09T00:00:00", "July 12 - The 1998 FIFA World Cup begins in France."], ["1998-06-12T00:00:00", "The Centennial Celebration of Independence of the Philippines from Spain is observed."], ["1998-06-25T00:00:00", "Microsoft releases Windows 98."], ["1998-06-30T00:00:00", "Philippine Vice President Joseph Estrada is sworn in as the 13th President of the Philippines."], ["1998-07-05T00:00:00", "Japan launches a probe to Mars, joining the United States and Russia as an outer space-exploring nation."], ["1998-07-06T00:00:00", "The new Hong Kong International Airport at Chek Lap Kok opens, while the historic Kai Tak Airport closes."], ["1998-07-12T00:00:00", "France beats Brazil 3-0 in the football World Cup final."], ["1998-07-17T00:00:00", "At a conference in Rome, 120 countries vote to create a permanent International Criminal Court to prosecute individuals for genocide, crimes against humanity, war crimes, and the crime of aggression."], ["1998-07-17T00:00:00", "In Saint Petersburg, Nicholas II of Russia and his family are buried in St. Catherine Chapel, 80 years after he and his family were killed by the Lenin-led Bolsheviks in 1918."], ["1998-07-17T00:00:00", "A tsunami triggered by an undersea earthquake destroys 10 villages in Papua New Guinea, killing an estimated 1,500, leaving 2,000 more unaccounted for and thousands more homeless."], ["1998-07-17T00:00:00", "Biologists report in the journal Science how they sequenced the genome of the bacterium that causes syphilis, Treponema pallidum."], ["1998-08-04T00:00:00", "The Second Congo War begins; 3,900,000 people are killed before it ends in 2003, making it the bloodiest war, to date, since World War II."], ["1998-08-07T00:00:00", "Yangtze River Floods: In China the Yangtze river breaks through the main bank; before this, from August 1-5, peripheral levees collapsed consecutively in Jiayu County Baizhou Bay. The death toll exceeds 12,000, with many thousands more injured."], ["1998-08-07T00:00:00", "1998 U.S. embassy bombings: The bombings of the United States embassies in Dar es Salaam, Tanzania, and Nairobi, Kenya, kill 224 people and injure over 4,500; they are linked to terrorist Osama bin Laden, an exile of Saudi Arabia."], ["1998-08-15T00:00:00", "The Omagh bombing is carried out in Northern Ireland by the Real IRA."], ["1998-08-24T00:00:00", "The first RFID human implantation is tested in the United Kingdom."], ["1998-08-26T00:00:00", "Computer virus CIH activates and attacks Windows 9x."], ["1998-09-02T00:00:00", "A McDonnell Douglas MD-11 airliner (Swissair Flight 111) crashes near Peggys Cove, Nova Scotia, after taking off from New York City en route to Geneva; all 229 people on board are killed."], ["1998-09-02T00:00:00", "A United Nations court finds Jean-Paul Akayesu, the former mayor of a small town in Rwanda, guilty of 9 counts of genocide, marking the first time that the 1948 law banning genocide is enforced."], ["1998-09-04T00:00:00", "Google, Inc. is founded in Menlo Park, California, by Stanford University PhD candidates Larry Page and Sergey Brin."], ["1998-09-04T00:00:00", "The last former Soviet Union radar station, Skrunda-1, is closed down in Latvia."], ["1998-09-05T00:00:00", "The Government of North Korea adopts a military dictatorship on its 50th anniversary."], ["1998-09-12T00:00:00", "The Cuban Five intelligence agents are arrested in Miami, and convicted of espionage. The agents claim they were not spying against the United States Government but against the Cuban exile community in Miami."], ["1998-09-24T00:00:00", "Iranian President Mohammad Khatami retracts a fatwa against Satanic Verses author Salman Rushdie that was in force since 1989 stating that the Iranian government will \"neither support nor hinder assassination operations on Rushdie\"."], ["1998-10-02T00:00:00", "Antz, the first feature film made by DreamWorks, is released."], ["1998-10-06T00:00:00", "Matthew Shepard is beaten and left to die in a cornfield in Laramie, Wyoming."], ["1998-10-14T00:00:00", "Eric Rudolph is charged with 4 bombings (including the 1996 Olympic bombing) in Atlanta."], ["1998-10-16T00:00:00", "British police place General Augusto Pinochet, the former Chilean dictator from 1973-1990, under house arrest during his medical treatment in the UK."], ["1998-10-17T00:00:00", "A pipeline explosion in Jesse, Nigeria results in 1,082 deaths."], ["1998-10-29T00:00:00", "Hurricane Mitch makes landfall in Central America, killing an estimated 18,000 people."], ["1998-11-16T00:00:00", "Sesame Workshop (back then known as Children's Television Workshop) launches Elmo's World, the most famous Sesame Street segment, lasting from the late 90's to Sesame Street's 40th anniversary (69-09) and the 10th anniversary of the segment itself (99-09)."], ["1998-11-17T00:00:00", "Voyager 1 overtakes Pioneer 10 as the most distant man-made object from the Solar System, at a distance of 69.419 AU (1.03849×1010 km)."], ["1998-11-20T00:00:00", "A Russian Proton rocket is launched from the Baikonur Cosmodrome in Kazakhstan, carrying the first segment of the International Space Station, the 21-ton Zarya Module."], ["1998-11-24T00:00:00", "A declassified report by Swiss IOC official Marc Hodler reveals that bribes had been used to bring the 2002 Winter Olympics to Salt Lake City during bidding process in 1995. The International Olympic Committee, the Salt Lake Organizing Committee, the United States Olympic Committee and the United States Department of Justice immediately launch an investigation into the scandal."], ["1998-12-04T00:00:00", "The Space Shuttle Endeavour launches the first American component to the International Space Station, the 25,600 lb Unity module on STS-88. It docks with Zarya two days later."], ["1998-12-06T00:00:00", "Hugo Chávez, politician and former member of the Venezuelan military, is elected President of Venezuela."], ["1998-12-19T00:00:00", "The U.S. House of Representatives forwards articles of impeachment against President Clinton to the Senate, making him the second president to be impeached in the nation."], ["1998-12-29T00:00:00", "Khmer Rouge leaders apologize for the post-Vietnam War genocide in Cambodia that claimed over 1 million in the 1970s."], ["1998-12-31T00:00:00", "The first leap second since June 30, 1997 occurs. In the eurozone, the currency rates of this day are fixed permanently."]]