[["1940-01-04T00:00:00", "WWII: Axis powers: Luftwaffe General Hermann Göring assumes control of most war industries in Germany."], ["1940-01-06T00:00:00", "WWII: Winter War: General Semyon Timoshenko takes command of all Soviet forces."], ["1940-01-08T00:00:00", "WWII: Winter War - Battle of Suomussalmi: The Soviet 44th Rifle Division is destroyed by Finnish forces."], ["1940-01-08T00:00:00", "WWII: Food rationing begins in Great Britain."], ["1940-01-09T00:00:00", "WWII; British submarine HMS Starfish is sunk."], ["1940-01-10T00:00:00", "WWII: Mechelen incident: A German plane carrying secret plans for the invasion of western Europe makes a forced landing in Belgium, leading to mobilization of defense forces in the Low Countries."], ["1940-01-26T00:00:00", "Brisbane, Australia swelters through its hottest day ever, 43.2 degrees Celsius (109.76 Fahrenheit)."], ["1940-01-27T00:00:00", "WWII: A peace resolution introduced in the Parliament of South Africa is defeated 81-59."], ["1940-01-29T00:00:00", "Three gasoline-powered trains carrying factory workers crash and explode while approaching Ajikawaguchi Station, Yumesaki Line (Nishinari Line), Osaka, Japan, killing at least 181 people and injuring at least 92."], ["1940-02-01T00:00:00", "WWII: Winter War - Soviet forces launch a major assault on Finnish troops occupying the Karelian Isthmus."], ["1940-02-02T00:00:00", "Vsevolod Meyerhold is executed in the Soviet Union on charges of treason and espionage. He is cleared of all charges 15 years later in the first waves of de-Stalinization"], ["1940-02-07T00:00:00", "RKO release Walt Disney's second full-length animated film, Pinocchio."], ["1940-02-10T00:00:00", "Tom and Jerry make their debut in Puss Gets the Boot. However it is not until 1941 that their current names are adopted."], ["1940-02-16T00:00:00", "WWII: Altmark Incident: The British destroyer HMS Cossack pursues the German tanker Altmark into the neutral waters of Jøssingfjord in southwestern Norway and frees the 290 British seamen held aboard."], ["1940-02-22T00:00:00", "In Tibet, province of Ando, 4-year-old Tenzin Gyatso is proclaimed the tulku (rebirth) of the thirteenth Dalai Lama."], ["1940-02-27T00:00:00", "Martin Kamen and Sam Ruben discover carbon-14."], ["1940-02-29T00:00:00", "Hattie McDaniel becomes the first African-American to win an Academy Award."], ["1940-03-02T00:00:00", "Cartoon character Elmer Fudd makes his debut in the animated short Elmer's Candid Camera."], ["1940-03-03T00:00:00", "In Sweden, a time bomb destroys the office of Norrskenflamman (a Swedish communist newspaper), killing 5."], ["1940-03-05T00:00:00", "Katyn massacre: Members of the Soviet Politburo (Joseph Stalin, Vyacheslav Molotov, Lazar Kaganovich, Mikhail Kalinin, Kliment Voroshilov and Lavrentiy Beria) sign an order, prepared by Beria, for the execution of 25,700 Polish intelligentsia, including 14,700 Polish POWs."], ["1940-03-11T00:00:00", "Ed Ricketts, John Steinbeck and six others leave Monterey, California for the Sea of Cortez on a collecting expedition."], ["1940-03-12T00:00:00", "The Soviet Union and Finland sign a peace treaty in Moscow ending the Winter War; Finns, along with the world at large, are shocked by the harsh terms."], ["1940-03-15T00:00:00", "Mae West & W. C. Fields join comedic forces for My Little Chickadee with tremendous success. The film becomes one of the highest grossing of the year."], ["1940-03-18T00:00:00", "WWII: Axis powers: Adolf Hitler and Benito Mussolini meet at Brenner Pass in the Alps and agree to form an alliance against France and the United Kingdom."], ["1940-03-21T00:00:00", "Édouard Daladier resigns as prime minister of France; Paul Reynaud succeeds him."], ["1940-03-23T00:00:00", "Pakistan Movement: The Lahore Resolution, calling for greater autonomy for what will become Pakistan in British India, is drawn up by the All-India Muslim League during a three-day general session at Iqbal Park, Lahore."], ["1940-03-31T00:00:00", "WWII: Commerce raiding German auxiliary cruiser Atlantis, leaves the Wadden Sea for what will become the longest warship cruise of the war. (622 days without in-port replenishment or repair)"], ["1940-04-03T00:00:00", "WWII: Operation Weserübung: German ships set out for the invasion of Norway."], ["1940-04-05T00:00:00", "Neville Chamberlain, Prime Minister of the United Kingdom, in what proves to be a tragic misjudgment, declares in a major public speech that Hitler has \"missed the bus\"."], ["1940-04-07T00:00:00", "Booker T. Washington becomes the first African American to be depicted on a United States postage stamp."], ["1940-04-08T00:00:00", "WWII: Operation Wilfred: The British fleet lays naval mines off the coast of neutral Norway."], ["1940-04-09T00:00:00", "WWII: Germany invades the neutral countries of Denmark and Norway in Operation Weserübung, opening the Norwegian Campaign. The British Royal Navy attempts to attack elements of the German fleet off Norway. Vidkun Quisling proclaims a new collaborationist regime in Norway. The German invasion of Denmark lasts for about six hours before that country capitulates."], ["1940-04-10T00:00:00", "WWII: First Naval Battle of Narvik: The British Royal Navy attacks the German fleet in the Ofotfjord. At Bergen, German cruiser Königsberg is sunk by British Fleet Air Arm Blackburn Skua dive bombers flying from RNAS Hatston in Orkney."], ["1940-04-12T00:00:00", "The Faroe Islands are occupied by British troops, following the German invasion of Denmark. This action is taken to avert a possible German occupation of the islands with serious consequences for the course of the Battle of the Atlantic."], ["1940-04-12T00:00:00", "Opening day at Jamaica Race Course features the use of parimutuel betting equipment, a departure from bookmaking heretofore used exclusively throughout New York. Other tracks in the state follow suit later in 1940."], ["1940-04-13T00:00:00", "WWII: Second Naval Battle of Narvik: The British Royal Navy causes all eight defending German destroyers in the Ofotfjord to be sunk."], ["1940-04-13T00:00:00", "The New York Rangers win the 1940 Stanley Cup Finals in ice hockey. It will be another 54 years before their next win in 1994."], ["1940-04-14T00:00:00", "Norwegian Campaign: First British ground forces land in Norway at Namsos and Harstad."], ["1940-04-16T00:00:00", "The Cleveland Indians, behind Bob Feller's Opening Day no-hitter, defeat the Chicago White Sox, 1-0."], ["1940-04-21T00:00:00", "Take It or Leave It makes its debut on CBS Radio, with Bob Hawk as host."], ["1940-04-23T00:00:00", "The Rhythm Club fire at a dance hall in Natchez, Mississippi, kills 198."], ["1940-05-10T00:00:00", "WWII: - Battle of France begins"], ["1940-05-10T00:00:00", "WWII: - German forces invade Low Countries\nBattle of the Netherlands begins\nBattle of Belgium begins\nInvasion of Luxembourg begins\n"], ["1940-05-10T00:00:00", "WWII: - Battle of the Netherlands begins"], ["1940-05-10T00:00:00", "WWII: - Battle of Belgium begins"], ["1940-05-10T00:00:00", "WWII: - Invasion of Luxembourg begins"], ["1940-05-10T00:00:00", "WWII: - British Invasion of Iceland."], ["1940-05-10T00:00:00", "WWII: - With the resignation of Neville Chamberlain, Winston Churchill becomes Prime Minister of the United Kingdom."], ["1940-05-13T00:00:00", "WWII: - Winston Churchill, in his first address as Prime Minister, tells the House of Commons of the United Kingdom, \"I have nothing to offer you but blood, toil, tears, and sweat.\""], ["1940-05-13T00:00:00", "WWII: - German armies open a 60-mile (97 km) wide breach in the Maginot Line at Sedan, France."], ["1940-05-14T00:00:00", "WWII: - Rotterdam is subjected to savage terror bombing by the Luftwaffe; 980 are killed, and 20,000 buildings destroyed. General Henri Winkelman announces surrender of the Dutch army (outside Zeeland) to German forces"], ["1940-05-14T00:00:00", "WWII: - Recruitment begins in Britain for a home defence force: the Local Defence Volunteers, later known as the Home Guard."], ["1940-05-15T00:00:00", "WWII: The Dutch Army formally signs a surrender document."], ["1940-05-15T00:00:00", "The very first McDonald's restaurant opens in San Bernardino, California."], ["1940-05-15T00:00:00", "Women's stockings made of nylon are first placed on sale across the United States. Almost five million pairs are bought on this day."], ["1940-05-16T00:00:00", "President of the United States Franklin D. Roosevelt, addressing a joint session of the U.S. Congress, asks for an extraordinary credit of approximately $900 million to finance construction of at least 50,000 airplanes per year."], ["1940-05-17T00:00:00", "WWII: - Brussels falls to German forces; the Belgian government flees to Ostend."], ["1940-05-17T00:00:00", "WWII: - Zeeland is overrun by German forces, ending the Battle of the Netherlands and beginning full German occupation of the Netherlands (Noord-Beveland surrenders on May 18 and remaining Dutch troops are withdrawn from Zeelandic Flanders on May 19)."], ["1940-05-18T00:00:00", "Marshal Philippe Pétain is named vice-premier of France."], ["1940-05-19T00:00:00", "General Maxime Weygand replaces Maurice Gamelin as commander-in-chief of all French forces."], ["1940-05-20T00:00:00", "WWII: German forces (2nd Panzer division), under General Rudolf Veiel, reach Noyelles on the English Channel."], ["1940-05-20T00:00:00", "Holocaust: The Nazi concentration camp and extermination camp Auschwitz-Birkenau, the largest of the German concentration camps, opens in occupied Poland near the town of Oświęcim. From now until January 1945, around 1.1 million people will be killed here."], ["1940-05-22T00:00:00", "WWII: The Parliament of the United Kingdom passes the Emergency Powers (Defence) Act 1939, giving the government full control over all persons and property."], ["1940-05-24T00:00:00", "WWII: The Anglo-French Supreme War Council decides to withdraw all forces under its control from Norway."], ["1940-05-26T00:00:00", "WWII: The Dunkirk evacuation of the British Expeditionary Force starts."], ["1940-05-26T00:00:00", "First free flight of Igor Sikorsky's Vought-Sikorsky VS-300 helicopter."], ["1940-05-29T00:00:00", "The Vought XF4U-1, prototype of the F4U Corsair U.S. fighter later used in WWII, makes its first flight."], ["1940-06-03T00:00:00", "WWII: Paris is bombed by the Luftwaffe for the first time."], ["1940-06-03T00:00:00", "The Holocaust: Franz Rademacher proposes the Madagascar Plan."], ["1940-06-03T00:00:00", "Weather Bureau transferred to the United States Department of Commerce."], ["1940-06-04T00:00:00", "WWII: - The Dunkirk evacuation ends - the British and French navies together with large numbers of civilian vessels from various nations complete evacuating 300,000 troops from Dunkirk in France to England."], ["1940-06-04T00:00:00", "WWII: - Winston Churchill tells the House of Commons of the United Kingdom, \"We shall not flag or fail. We shall fight on the beaches... on the landing grounds... in the fields and the streets.... We shall never surrender.\""], ["1940-06-07T00:00:00", "Daisy Duck debuts in Mr. Duck Steps Out."], ["1940-06-07T00:00:00", "King Haakon VII of Norway and his government are evacuated from Tromsø to London on HMS Devonshire."], ["1940-06-09T00:00:00", "WWII: The British Commandos are created."], ["1940-06-10T00:00:00", "WWII: Italy declares war on France and the United Kingdom."], ["1940-06-10T00:00:00", "WWII: U.S. President Franklin D. Roosevelt denounces Italy's actions with his \"Stab in the Back\" speech during the graduation ceremonies of the University of Virginia."], ["1940-06-10T00:00:00", "WWII: Canada declares war on Italy."], ["1940-06-10T00:00:00", "WWII: The Norwegian Army surrenders to German forces."], ["1940-06-10T00:00:00", "WWII: The French government flees to Tours."], ["1940-06-10T00:00:00", "Jamaican political activist Marcus Garvey dies of a stroke in London."], ["1940-06-11T00:00:00", "WWII: The Western Desert Campaign opens with British forces crossing the Frontier Wire into Italian Libya."], ["1940-06-12T00:00:00", "WWII: 13,000 British and French troops surrender to Major-General Erwin Rommel's 7th Panzer Division at Saint-Valery-en-Caux."], ["1940-06-13T00:00:00", "WWII: Paris is declared an open city."], ["1940-06-14T00:00:00", "WWII: The French government flees to Bordeaux and Paris falls under German occupation."], ["1940-06-14T00:00:00", "WWII: U.S. President Franklin D. Roosevelt signs the Naval Expansion Act into law, which aims to increase the United States Navy's tonnage by 11%."], ["1940-06-14T00:00:00", "WWII: A group of 728 Polish political prisoners from Tarnów become the first residents of the Auschwitz concentration camp."], ["1940-06-15T00:00:00", "WWII: The Soviet Union occupies Lithuania."], ["1940-06-15T00:00:00", "WWII: Verdun falls to German forces."], ["1940-06-16T00:00:00", "The Churchill war ministry in the United Kingdom offers a Franco-British Union to Paul Reynaud, Prime Minister of France, in the hope of preventing France from agreeing to an armistice with Germany, but Reynaud resigns when his own cabinet refuses to accept it."], ["1940-06-16T00:00:00", "The Sturgis Motorcycle Rally is held for the first time in Sturgis, South Dakota."], ["1940-06-17T00:00:00", "WWII: Philippe Pétain becomes Prime Minister of France and immediately asks Germany for peace terms."], ["1940-06-17T00:00:00", "WWII: The Soviet Union occupies Estonia and Latvia."], ["1940-06-17T00:00:00", "WWII: Operation Ariel begins: Allied troops start to evacuate France, following Germany's takeover of Paris and most of the nation."], ["1940-06-17T00:00:00", "WWII: RMS Lancastria, serving as a troopship, is bombed and sunk by Luftwaffe Junkers Ju 88 aircraft while evacuating British troops and nationals from Saint-Nazaire in France with the loss of at least 4,000 lives, the largest single UK loss in any World War II event, immediate news of which is suppressed in the British press. Destroyer HMS Beagle (H30) rescues around 600."], ["1940-06-18T00:00:00", "WWII: Winston Churchill tells the House of Commons of the United Kingdom: \"The Battle of France is over. The Battle of Britain is about to begin.\""], ["1940-06-18T00:00:00", "WWII: Appeal of 18 June: General Charles de Gaulle, de facto leader of the Free French Forces, makes his first broadcast appeal over Radio Londres from London rallying French Resistance, calling on all French people to continue the fight against Nazi Germany: \"France has lost a battle. But France has not lost the war\"."], ["1940-06-22T00:00:00", "WWII: Second Armistice at Compiègne: The French Third Republic and Nazi Germany sign an armistice ending the Battle of France in the Forest of Compiègne, in the same Compagnie Internationale des Wagons-Lits railroad car used by Marshal Ferdinand Foch to agree the Armistice with Germany in 1918. This divides France into a Zone occupée in the north and west under the Military Administration in France (Nazi Germany) and a southern Zone libre, Vichy France."], ["1940-06-23T00:00:00", "WWII: German leader Adolf Hitler surveys newly defeated Paris in now occupied France."], ["1940-06-24T00:00:00", "United States politics: The Republican Party begins its national convention in Philadelphia and nominates Wendell Willkie as its candidate for president."], ["1940-06-24T00:00:00", "WWII: Vichy France signs armistice terms with Italy."], ["1940-06-25T00:00:00", "WWII: After the defeat of France, Hitler plans for an invasion of Switzerland, known as Operation Tannenbaum"], ["1940-06-28T00:00:00", "General Charles de Gaulle is officially recognized by Britain as the \"Leader of all Free Frenchmen, wherever they may be.\""], ["1940-06-30T00:00:00", "WWII: German forces land in Guernsey, marking the start of the 5-year Occupation of the Channel Islands."], ["1940-06-30T00:00:00", "Federal government of the United States reorganisation:\nThe Civil Aeronautics Administration is placed under the Department of Commerce.\nThe U.S. Food and Drug Administration (FDA) is placed under the Federal Security Agency.\nThe United States Fish and Wildlife Service is placed under the Department of the Interior.\n"], ["1940-06-30T00:00:00", "The Civil Aeronautics Administration is placed under the Department of Commerce."], ["1940-06-30T00:00:00", "The U.S. Food and Drug Administration (FDA) is placed under the Federal Security Agency."], ["1940-06-30T00:00:00", "The United States Fish and Wildlife Service is placed under the Department of the Interior."], ["1940-07-01T00:00:00", "The first Tacoma Narrows Bridge opens for business, built with an 8-foot (2.4 m) girder and 190 feet (58 m) above the water, as the third longest suspension bridge in the world."], ["1940-07-02T00:00:00", "WWII: British-owned SS Arandora Star, carrying civilian internees and POWs of Italian and German origin from Liverpool to Canada, is torpedoed and sunk by the German submarine U-47 off northwest Ireland with the loss of around 865 lives."], ["1940-07-03T00:00:00", "WWII: Attack on Mers-el-Kébir: British naval units sink or seize ships of the French fleet anchored in the Algerian ports of Mers-el-Kebir and Oran to prevent them falling into German hands. The following day, Vichy France breaks off diplomatic relations with Britain."], ["1940-07-06T00:00:00", "Opening of Story Bridge in Brisbane."], ["1940-07-06T00:00:00", "British submarine HMS Shark is sunk."], ["1940-07-10T00:00:00", "WWII: The Battle of Britain begins."], ["1940-07-11T00:00:00", "WWII: British destroyer HMS Escort is torpedoed and sunk by an Italian submarine."], ["1940-07-11T00:00:00", "WWII: Vichy France begins with a constitutional law which only 80 members of the parliament vote against. Philippe Pétain becomes Prime Minister of France."], ["1940-07-14T00:00:00", "WWII: Winston Churchill, in a worldwide broadcast, proclaims the intention of Great Britain to fight alone against Germany whatever the outcome: \"We shall seek no terms. We shall tolerate no parley. We may show mercy. We shall ask none.\""], ["1940-07-15T00:00:00", "U.S. politics: The Democratic Party begins its national convention in Chicago, and nominates Franklin D. Roosevelt for an unprecedented third term as president."], ["1940-07-19T00:00:00", "WWII: Allied victory at the Battle of Cape Spada HMAS Sydney and five destroyers sink the Italian cruiser Bartolomeo Colleoni."], ["1940-07-19T00:00:00", "WWII: Adolf Hitler makes a peace appeal to Britain in an address to the Reichstag. Lord Halifax, the British foreign minister, flatly rejects peace terms in a broadcast reply on July 22."], ["1940-07-21T00:00:00", "After rigged parliamentary elections in the three occupied countries on July 14-15, the parliaments proclaim the Estonian, Latvian and Lithuanian Soviet Socialist Republics"], ["1940-07-23T00:00:00", "Welles Declaration: United States Under Secretary of State Sumner Welles announces that the U.S. will not accord diplomatic recognition to the Soviet Union's occupation of the Baltic states."], ["1940-07-25T00:00:00", "General Henri Guisan addresses the officer corps of the Swiss army at Rütli resolving to resist any invasion of the country."], ["1940-07-27T00:00:00", "Bugs Bunny makes his debut in the Oscar-nominated cartoon short, A Wild Hare. However, it is not until 1941 that his name is adopted."], ["1940-08-01T00:00:00", "WWII: British submarine HMS Spearfish is sunk in the English Channel by what is much later discovered to be a mine."], ["1940-08-03T00:00:00", "The Lithuanian SSR is annexed into the Soviet Union, followed by the Latvian SSR on August 5 and the Estonian SSR August 6, just seven weeks after their occupation."], ["1940-08-04T00:00:00", "Gen. John J. Pershing, in a nationwide radio broadcast, urges all-out aid to Britain in order to defend the Americas, while Charles Lindbergh speaks to an isolationist rally at Soldier Field in Chicago."], ["1940-08-08T00:00:00", "WWII: Wilhelm Keitel signs the \"Aufbau Ost\" directive, which eventually leads to the invasion of the Soviet Union."], ["1940-08-10T00:00:00", "WWII: British armed merchant cruiser HMS Transylvania is torpedoed off Malin Head, Ireland, by German submarine U-56."], ["1940-08-13T00:00:00", "WWII: The Adlertag (\"Eagle Day\") strike on southern England occurs, starting the rapid escalation of the Battle of Britain air offensive of the Luftwaffe against RAF Fighter Command."], ["1940-08-15T00:00:00", "Italy, without having declared war on Greece, sinks the Greek boat Elli (Έλλη)."], ["1940-08-18T00:00:00", "HRH The Prince Edward, Duke of Windsor, is installed as Governor of the Bahamas."], ["1940-08-20T00:00:00", "WWII: Winston Churchill pays tribute in the House of Commons of the United Kingdom to the Royal Air Force: \"Never in the field of human conflict was so much owed by so many to so few.\""], ["1940-08-20T00:00:00", "Leon Trotsky is attacked with an ice axe in his Mexico home by NKVD agent Ramón Mercader."], ["1940-08-21T00:00:00", "Leon Trotsky dies of injuries sustained."], ["1940-08-24T00:00:00", "Howard Florey and a team including Ernst Chain and Norman Heatley at the Sir William Dunn School of Pathology, University of Oxford, publish their laboratory results showing the in vivo bactericidal action of penicillin. They have also purified the drug."], ["1940-08-26T00:00:00", "WWII: Chad is the first French colony to proclaim its support for the Allies."], ["1940-08-30T00:00:00", "Second Vienna Award: Germany and Italy compel Romania to cede half of Transylvania to Hungary."], ["1940-09-02T00:00:00", "WWII: An agreement between America and Great Britain is announced to the effect that 50 U.S. destroyers needed for escort work will be transferred to Great Britain. In return, America gains 99-year leases on British bases in the North Atlantic, West Indies and Bermuda."], ["1940-09-04T00:00:00", "WWII: In Berlin, Adolf Hitler declares in a speech that Nazi Germany will avenge all night air raids carried out by England."], ["1940-09-05T00:00:00", "WWII: Commerce raiding German auxiliary cruiser Komet enters the Pacific Ocean via the Bering Strait after crossing the Arctic Ocean from the North Sea with the help of Soviet icebreakers Lenin, Stalin, and Kaganovich."], ["1940-09-07T00:00:00", "Treaty of Craiova: Romania loses Southern Dobruja to Bulgaria."], ["1940-09-07T00:00:00", "WWII: The Blitz - Nazi Germany begins to rain bombs on London (the first of 57 consecutive nights of strategic bombing)."], ["1940-09-09T00:00:00", "Treznea massacre: The Hungarian Army, supported by local Hungarians kill 93 Romanian civilians in Treznea, Sălaj, a village in Northern Transylvania, as part of attempts to ethnic cleansing."], ["1940-09-12T00:00:00", "In Lascaux, France, 17,000-year-old cave paintings are discovered by a group of young Frenchmen hiking through Southern France. The paintings depict animals and date to the Stone Age."], ["1940-09-12T00:00:00", "The Hercules Munitions Plant in Succasunna-Kenvil, New Jersey explodes, killing 55 people."], ["1940-09-14T00:00:00", "Ip massacre: The Hungarian Army, supported by local Hungarians, kill 158 Romanian civilians in Ip, Sălaj, a village in Northern Transylvania, as part of attempts at ethnic cleansing."], ["1940-09-16T00:00:00", "WWII: The Selective Training and Service Act of 1940 is signed into law by Franklin D. Roosevelt, creating the first peacetime draft in U.S. history."], ["1940-09-22T00:00:00", "Japan enters French Indochina: an agreement is signed in which Japan promises to station no more than 6,000 troops there, and never have more than 25,000 transiting the colony. Rights were also given for three airfields."], ["1940-09-25T00:00:00", "Occupation of Norway by Nazi Germany: German Reichskommissar Josef Terboven appoints a provisional council of state from the pro-Nazi Nasjonal Samling party under Vidkun Quisling as a puppet government for Norway."], ["1940-09-26T00:00:00", "A group of Japanese officers in violation of an agreement signed four days earlier with French Indochina, take Đồng Đăng and Lam Sơn with 40 Franco-Vietnamese troops killed and around 1,000 deserting. The same day the United States imposes a total embargo on all scrap metal shipments to Japan."], ["1940-09-27T00:00:00", "WWII: Germany, Italy and Japan sign the Tripartite Pact."], ["1940-10-11T00:00:00", "Carmen Miranda makes her American film debut in Down Argentine Way one of the first films produced to promote The Good Neighbor Policy"], ["1940-10-14T00:00:00", "The Balham tube station disaster in London, England, occurs during the Nazi Luftwaffe air raids on Great Britain."], ["1940-10-15T00:00:00", "Charlie Chaplin releases his brilliant and controversial wartime satire The Great Dictator"], ["1940-10-16T00:00:00", "The draft registration of approximately 16 million men begins in the United States."], ["1940-10-28T00:00:00", "WWII: Italian troops invade Greece, meeting strong resistance from Greek troops and civilians. This action signals the beginning of the Balkan Campaign."], ["1940-10-29T00:00:00", "The Selective Service System lottery is held in Washington, D.C.."], ["1940-11-05T00:00:00", "United States presidential election, 1940: Democrat incumbent Franklin D. Roosevelt defeats Republican challenger Wendell Willkie and becomes the United States' first and only third-term president."], ["1940-11-06T00:00:00", "Agatha Christie's mystery novel And Then There Were None is published in book form in the United States."], ["1940-11-07T00:00:00", "In Tacoma, Washington, the 600-foot (180 m)-long center span of the Tacoma Narrows Bridge (known as Galloping Gertie) collapses."], ["1940-11-08T00:00:00", "WWII: MS City of Rayville is sunk by a naval mine, the first United States Merchant Marine loss of the war, off Cape Otway, Australia"], ["1940-11-09T00:00:00", "Joaquín Rodrigo's Concierto de Aranjuez premieres in Barcelona, Spain."], ["1940-11-10T00:00:00", "1940 Vrancea earthquake: An earthquake in Romania kills 1,000."], ["1940-11-11T00:00:00", "WWII: The Royal Navy launches the first aircraft carrier strike in history, on the Italian battleship fleet anchored at Taranto naval base."], ["1940-11-11T00:00:00", "WWII: German auxiliary cruiser Atlantis captures top secret British mail intended for British Far East Command from the SS Automedon and sends it to Japan."], ["1940-11-11T00:00:00", "Armistice Day Blizzard: An unexpected blizzard kills 144 in the Midwestern United States."], ["1940-11-13T00:00:00", "Walt Disney's Fantasia is released. It is the first box office failure for Disney, though it eventually recoups its cost years later, and becomes one of the most highly regarded of Disney's films."], ["1940-11-14T00:00:00", "WWII: The city centre of Coventry, England is destroyed by 500 Luftwaffe bombers: 150,000 fire bombs, 503 tons of high explosives, and 130 parachute mines level 60,000 of the city's 75,000 buildings; 568 people are killed, during the Coventry Blitz."], ["1940-11-15T00:00:00", "Abbott and Costello make their film debut in One Night in the Tropics."], ["1940-11-16T00:00:00", "WWII: In response to Germany levelling Coventry 2 days before, the Royal Air Force begins to bomb Hamburg (by war's end, 50,000 Hamburg residents will have died from Allied attacks)."], ["1940-11-16T00:00:00", "An unexploded pipe bomb is found in the Consolidated Edison office building (only years later is the culprit, George Metesky, apprehended)."], ["1940-11-16T00:00:00", "The Jamaica Association of Local Government Officers is founded."], ["1940-11-18T00:00:00", "WWII: German leader Adolf Hitler and Italian Foreign Minister Galeazzo Ciano meet to discuss Benito Mussolini's disastrous invasion of Greece."], ["1940-11-20T00:00:00", "WWII: Hungary, Romania and Slovakia join the Axis powers."], ["1940-11-25T00:00:00", "Patria disaster: As British authorities attempt to deport Jewish refugees (originating from German-occupied Europe) from Mandatory Palestine to Mauritius aboard the requisitioned emigrant liner SS Patria at Haifa, the Jewish paramilitary organization Haganah sinks the ship with a bomb, killing around 250 refugees and crew."], ["1940-11-25T00:00:00", "de Havilland Mosquito and Martin B-26 Marauder military aircraft both make their first flights."], ["1940-11-25T00:00:00", "Cartoon character Woody Woodpecker makes his debut in the animated short, Knock Knock."], ["1940-11-27T00:00:00", "WWII: The British Royal Navy and Italian Regia Marina fight the Battle of Cape Spartivento."], ["1940-12-01T00:00:00", "Manuel Ávila Camacho takes office as President of Mexico."], ["1940-12-06T00:00:00", "British submarine HMS Regulus is sunk near Taranto."], ["1940-12-08T00:00:00", "The Chicago Bears, in what will become the most one-sided victory in National Football League history, defeat the Washington Redskins 73-0 in the 1940 NFL Championship Game."], ["1940-12-09T00:00:00", "WWII: Operation Compass - British forces in North Africa begin their first major offensive with an attack on Italian forces at Sidi Barrani, Egypt."], ["1940-12-14T00:00:00", "WWII British destroyers HMS Hereward and HMS Hyperion sink an Italian submarine off Bardia."], ["1940-12-14T00:00:00", "Royal Navy Fairey Swordfish based on Malta bomb Tripoli."], ["1940-12-14T00:00:00", "Plutonium is first synthesized in the laboratory by a team led by Glenn T. Seaborg and Edwin McMillan at the University of California, Berkeley."], ["1940-12-16T00:00:00", "WWII: Operation Abigail Rachel - RAF bombing of Mannheim."], ["1940-12-17T00:00:00", "President Roosevelt, at his regular press conference, first sets forth the outline of his plan to send aid to Great Britain that will become known as Lend-Lease."], ["1940-12-23T00:00:00", "WWII: Winston Churchill, in a broadcast address to the people of Italy, blames Benito Mussolini for leading his nation to war against the British, contrary to Italy's historic friendship with them: \"One man has arrayed the trustees and inheritors of ancient Rome upon the side of the ferocious pagan barbarians.\""], ["1940-12-24T00:00:00", "Mahatma Gandhi, Indian spiritual non-violence leader writes his second letter to Adolf Hitler addressing him \"My friend\", requesting him to stop the war Germany had begun."], ["1940-12-29T00:00:00", "Franklin D. Roosevelt, in a fireside chat to the nation, declares that the United States must become \"the great arsenal of democracy.\""], ["1940-12-29T00:00:00", "WWII: \"Second Great Fire of London\" - Luftwaffe carries out a massive incendiary bombing raid, starting 1,500 fires. Many famous buildings, including the Guildhall and Trinity House, are either damaged or destroyed."], ["1940-12-30T00:00:00", "California's first modern freeway, the future State Route 110, opens to traffic in Pasadena, California, as the Arroyo Seco Parkway (now the Pasadena Freeway)."], ["1940-12-30T00:00:00", "In Sweden, Victor Hasselblad forms the Victor Hasselblad AB Camera Company."]]