[["2008-01-01T00:00:00", "Cyprus and Malta adopt the euro."], ["2008-01-01T00:00:00", "A suicide bombing occurs in Zayouna, Baghdad, killing over 25 people during a funeral over the deaths from the preceding attack."], ["2008-01-23T00:00:00", "Polish Air Force EADS CASA C-295 crashes on approach to the 12th Air Base near Mirosławiec; all 20 personnel on board die."], ["2008-01-23T00:00:00", "Thousands of Palestinians cross into Egypt, as the border wall with Gaza in Rafah is blown up by militants."], ["2008-02-04T00:00:00", "Iran opens its first space center and launches a rocket into space."], ["2008-02-04T00:00:00", "A Palestinian suicide bomber kills 1 and wounds 13 in a Dimona, Israel shopping center."], ["2008-02-12T00:00:00", "PDVSA, a state oil company in Venezuela, suspends sales of crude oil to ExxonMobil, in response to a legal challenge by them."], ["2008-02-12T00:00:00", "Bridgestone, under investigation for an alleged price-fixing cartel, uncovers improper payments of at least 150 million Japanese yen to foreign governments and withdraws from the marine hose business."], ["2008-02-18T00:00:00", "The British government introduces emergency legislation temporarily to nationalize Northern Rock, the 5th largest mortgage bank in the UK, due to the bank's financial crisis."], ["2008-02-18T00:00:00", "A general election is held in Pakistan, delayed from January 8 due to riots in the wake of the assassination of Benazir Bhutto. Opposition parties, including Bhutto's, take more than half of the seats, while President Pervez Musharraf's party suffers a huge defeat."], ["2008-02-19T00:00:00", "Fidel Castro announces his resignation as President of Cuba, effective February 24."], ["2008-02-20T00:00:00", "The United States Navy destroys a spy satellite containing toxic fuel, by shooting it down with a missile launched from the USS Lake Erie in the Pacific Ocean."], ["2008-02-20T00:00:00", "A total lunar eclipse crosses North and South America, Europe, Africa, and Southwest Asia."], ["2008-02-22T00:00:00", "Former building society Northern Rock is the first bank in Europe to be taken into state control, due to the U.S. subprime mortgage financial crisis."], ["2008-02-22T00:00:00", "No survivors are found after a rescue helicopter discovers the wreckage of Santa Bárbara Airlines Flight 518 just northeast of Mérida, Venezuela. The commercial plane had 46 people on board, including crew."], ["2008-03-25T00:00:00", "A 414 square kilometer (160 sq. mi.2) chunk of Antarctica's Wilkins Ice Shelf disintegrates, leaving the entire shelf at risk."], ["2008-03-25T00:00:00", "African Union and Comoros forces invade the rebel-held island of Anjouan."], ["2008-04-28T00:00:00", "India sets a world record by sending 10 satellites into orbit in a single launch."], ["2008-04-28T00:00:00", "71 die in a train crash in Shandong, China."], ["2008-05-23T00:00:00", "The Union of South American Nations, a supranational union, is created by a union between the Andean Community and Mercosur."], ["2008-05-23T00:00:00", "The International Court of Justice awards Middle Rocks to Malaysia and Pedra Branca to Singapore, ending a 29-year territorial dispute between the 2 countries."], ["2008-06-11T00:00:00", "The Fermi Gamma-ray Space Telescope is launched."], ["2008-06-11T00:00:00", "Canadian Prime Minister Stephen Harper apologizes to Canada's First Nations for the Canadian Indian residential school system."], ["2008-06-14T00:00:00", "A 6.9 magnitude earthquake in Iwate Prefecture, Japan, kills 12 and injures more than 400."], ["2008-06-14T00:00:00", "Expo 2008 starts in Zaragoza, Spain (ends in September) with the topic \"Water and sustainable development\"."], ["2008-06-27T00:00:00", "Zimbabwean President Robert Mugabe is reelected with 85.5 per cent of the vote in the second round of the controversial presidential election."], ["2008-06-27T00:00:00", "After three decades as the Chairman of Microsoft Corporation, Bill Gates steps down from daily duties to concentrate on philanthropy."], ["2008-08-01T00:00:00", "A total eclipse of the Sun is visible from Canada and extends across northern Greenland, the Arctic, central Russia, Mongolia, and China."], ["2008-08-01T00:00:00", "George Tupou V is crowned as the new King of Tonga, an event that had been delayed for over 2 years following the 2006 Nuku‘alofa riots."], ["2008-08-19T00:00:00", "Taliban insurgents kill 10 and injure 21 French soldiers in an ambush in Afghanistan."], ["2008-08-19T00:00:00", "A suicide bomber rams a car into an Algerian military academy, killing 43 and injuring 45."], ["2008-08-24T00:00:00", "An aircraft crashes in Guatemala, killing 10, including 4 Americans on a humanitarian mission."], ["2008-08-24T00:00:00", "Iran Aseman Airlines Flight 6895 crashes upon takeoff near Manas International Airport in Bishkek, Kyrgyzstan, killing 68."], ["2008-09-03T00:00:00", "Prime Minister Yousaf Raza Gillani of Pakistan survives an assassination attempt near Islamabad, while on his way to meet British Leader of the Opposition David Cameron."], ["2008-09-03T00:00:00", "Presidents Demetris Christofias and Mehmet Ali Talat hold peace talks in Nicosia, aimed at reunifying Cyprus."], ["2008-09-10T00:00:00", "The proton beam is circulated for the first time in the Large Hadron Collider, the world's largest and highest-energy particle accelerator, located at CERN, near Geneva, under the Franco-Swiss border."], ["2008-09-10T00:00:00", "The 2008 Bandar Abbas earthquake strikes southern Iran, killing 7 and injuring 45 people."], ["2008-09-14T00:00:00", "Aeroflot Flight 821 crashes near the city of Perm, Russia, killing all 88 on board."], ["2008-09-14T00:00:00", "Churches are attacked in Mangalore and southern Karnataka, India, leading to Christian protests and strong police suppression."], ["2008-09-15T00:00:00", "Following negotiations, President Robert Mugabe and opposition leaders Morgan Tsvangirai and Arthur Mutambara sign a power-sharing deal, making Tsvangirai the new Prime Minister of Zimbabwe."], ["2008-09-15T00:00:00", "Lehman Brothers files for Chapter 11 bankruptcy protection, laying the catalyst for the Global financial crisis."], ["2008-10-06T00:00:00", "NASA's MESSENGER spacecraft makes its second of three flybys of Mercury, decreasing the velocity for orbital insertion on March 18, 2011."], ["2008-10-06T00:00:00", "An earthquake measuring 6.6 magnitude kills at least 65 in Kyrgyzstan."], ["2008-10-06T00:00:00", "Symantec acquires PC Tools for $262,000,000."], ["2008-10-07T00:00:00", "Global financial crisis: Russia agrees to provide Iceland with a four-billion-euro loan."], ["2008-10-07T00:00:00", "The meteoroid 2008 TC3 impacts Earth, becoming the first such object to be discovered prior to impact."], ["2008-10-29T00:00:00", "Global financial crisis: Hungary's currency and stock markets rise on the news that it will receive an international economic bailout package worth $25 billion from the IMF, European Union, and World Bank."], ["2008-10-29T00:00:00", "Delta Air Lines merges with Northwest Airlines, forming the world's largest commercial carrier."], ["2008-11-25T00:00:00", "Greenland holds a referendum for increased autonomy from Denmark. The vote is over 75% in favour."], ["2008-11-25T00:00:00", "Political crisis in Thailand: Protesters from the People's Alliance for Democracy party storm into Suvarnabhumi Airport and block flights from taking off. More protesters seize control of Don Mueang Airport the following day."], ["2008-11-25T00:00:00", "A car bomb in St. Petersburg, Russia, kills 3 people and injures 1."], ["2008-12-11T00:00:00", "Bernard Madoff is arrested by U.S. federal authorities on charges of running a massive decades-long Ponzi scheme swindling thousands of investors - the largest financial fraud in history."], ["2008-12-12T00:00:00", "Switzerland becomes the 25th European country to join the Schengen Agreement, whereby cross-border passport checks will be abolished."], ["2008-12-12T00:00:00", "The Moon moves into its nearest point to Earth, called perigee, at the same time as its fullest phase of the lunar cycle. The Moon appears to be 14% bigger and 30% brighter than the year's other full moons. The next time these two events coincide will be in 2016."], ["2008-01-22T00:00:00", "Heath Ledger, Australian actor (b. 1979)"], ["2008-01-22T00:00:00", "Claude Piron, Swiss linguist and psychologist (b. 1931)"], ["2008-01-27T00:00:00", "Gordon B. Hinckley, American Mormon leader (b. 1910)"], ["2008-01-27T00:00:00", "Suharto, 2nd President of Indonesia (b. 1921)"], ["2008-02-11T00:00:00", "Alfredo Reinado, East Timorese rebel (b. 1967)"], ["2008-02-11T00:00:00", "Tom Lantos, American politician (b. 1928)"], ["2008-02-12T00:00:00", "Imad Mughniyah, Lebanese militant (b. 1962)"], ["2008-02-12T00:00:00", "Badri Patarkatsishvili, Georgian businessman and politician (b. 1955)"], ["2008-02-13T00:00:00", "Kon Ichikawa, Japanese film director (b. 1915)"], ["2008-02-13T00:00:00", "Henri Salvador, French singer (b. 1917)"], ["2008-02-19T00:00:00", "Natalia Bessmertnova, Russian ballerina (b. 1941)"], ["2008-02-19T00:00:00", "Yegor Letov, Russian singer (b. 1964)"], ["2008-02-23T00:00:00", "Janez Drnovšek, Slovenian President and Prime Minister of (b. 1950)"], ["2008-02-23T00:00:00", "Paul Frère, Belgian racing driver (b. 1917)"], ["2008-02-27T00:00:00", "William F. Buckley, Jr., American author and conservative commentator (b. 1925)"], ["2008-02-27T00:00:00", "Ivan Rebroff, German singer (b. 1931)"], ["2008-03-03T00:00:00", "Giuseppe Di Stefano, Italian operatic tenor (b. 1921)"], ["2008-03-03T00:00:00", "Norman Smith, English singer and record producer (b. 1923)"], ["2008-03-19T00:00:00", "Arthur C. Clarke, English author, inventor, and futurist (b. 1917)"], ["2008-03-19T00:00:00", "Hugo Claus, Flemish writer, painter and film director (b. 1929)"], ["2008-03-19T00:00:00", "Paul Scofield, English actor (b. 1922)"], ["2008-03-24T00:00:00", "Neil Aspinall, British record producer and business executive (b. 1942)"], ["2008-03-24T00:00:00", "Richard Widmark, American actor (b. 1914)"], ["2008-05-12T00:00:00", "Robert Rauschenberg, American pop artist (b. 1925)"], ["2008-05-12T00:00:00", "Irena Sendler, Polish humanitarian (b. 1910)"], ["2008-05-13T00:00:00", "Saad Al-Abdullah Al-Salim Al-Sabah, Emir of Kuwait (b. 1930)"], ["2008-05-13T00:00:00", "Bernardin Gantin, Beninese cardinal (b. 1922)"], ["2008-06-01T00:00:00", "Yves Saint Laurent, French fashion designer (b. 1936)"], ["2008-06-01T00:00:00", "Tommy Lapid, Israeli television presenter, journalist, and politician (b. 1931)"], ["2008-06-09T00:00:00", "Algis Budrys, Lithuanian-American science fiction writer (b. 1931)"], ["2008-06-09T00:00:00", "Karen Asrian, Armenian chess grandmaster (b. 1980)"], ["2008-06-11T00:00:00", "Ove Andersson, Swedish rally driver (b. 1939)"], ["2008-06-11T00:00:00", "Võ Văn Kiệt, Vietnamese prime minister (b. 1922)"], ["2008-07-04T00:00:00", "Jesse Helms, American politician (b. 1921)"], ["2008-07-04T00:00:00", "Evelyn Keyes, American actress (b. 1916)"], ["2008-07-25T00:00:00", "Johnny Griffin, American saxophonist (b. 1928)"], ["2008-07-25T00:00:00", "Randy Pausch, American author and computer scientist (b. 1960)"], ["2008-08-09T00:00:00", "Bernie Mac, American actor and comedian (b. 1957)"], ["2008-08-09T00:00:00", "Mahmoud Darwish, Palestinian poet (b. 1941)"], ["2008-08-16T00:00:00", "Ronnie Drew, Irish singer (b. 1934)"], ["2008-08-16T00:00:00", "Masanobu Fukuoka, Japanese microbiologist (b. 1913)"], ["2008-09-06T00:00:00", "Antonio Innocenti, Italian cardinal (b. 1915)"], ["2008-09-06T00:00:00", "Anita Page, American actress (b. 1910)"], ["2008-10-10T00:00:00", "Kazuyoshi Miura, Japanese businessman (b. 1947)"], ["2008-10-10T00:00:00", "Alexey Prokurorov, Russian cross-country skier (b. 1964)"], ["2008-10-13T00:00:00", "Guillaume Depardieu, French actor (b. 1971)"], ["2008-10-13T00:00:00", "Antonio José González Zumárraga, Ecuadorian cardinal (b. 1925)"], ["2008-10-13T00:00:00", "Alexei Cherepanov, Russian Hockey Player (b. 1989)"], ["2008-10-18T00:00:00", "Hector Lombana, Colombian sculptor, painter and architect (b. 1930)"], ["2008-10-27T00:00:00", "John Goetz, American professional baseball player (b. 1937)"], ["2008-10-29T00:00:00", "William Wharton (author), American Author (b. 1925)"], ["2008-11-01T00:00:00", "Jacques Piccard, Swiss explorer and engineer (b. 1922)"], ["2008-11-01T00:00:00", "Yma Sumac, Peruvian soprano (b. 1922)"], ["2008-11-04T00:00:00", "Michael Crichton, American author and producer (b. 1942)"], ["2008-11-04T00:00:00", "Juan Camilo Mouriño, Mexican politician (b. 1971)"], ["2008-11-10T00:00:00", "Kiyoshi Itō, Japanese mathematician (b. 1915)"], ["2008-11-10T00:00:00", "Arthur Shawcross. American serial killer, (b. 1945)"], ["2008-12-05T00:00:00", "Patriarch Alexy II of Moscow (b. 1929)"], ["2008-12-05T00:00:00", "Nina Foch, Dutch-born American actress (b. 1924)"], ["2008-12-09T00:00:00", "Yury Glazkov, Russian cosmonaut (b. 1939)"], ["2008-12-09T00:00:00", "Dražan Jerković, Croatian football player and manager (b. 1936)"], ["2008-12-11T00:00:00", "Daniel Carleton Gajdusek, American physician, Nobel Prize laureate (b. 1923)"], ["2008-12-11T00:00:00", "Bettie Page, American pin-up model (b. 1923)"], ["2008-12-12T00:00:00", "Avery Dulles, American Roman Catholic Cardinal (b. 1918)"], ["2008-12-12T00:00:00", "Van Johnson, American actor (b. 1916)"], ["2008-12-12T00:00:00", "Tassos Papadopoulos, 5th President of Cyprus (b. 1934)"], ["2008-12-18T00:00:00", "Majel Barrett, American actress (b. 1932)"], ["2008-12-18T00:00:00", "W. Mark Felt, American FBI agent, \"Deep Throat\" from the Watergate scandal (b. 1913)"], ["2008-12-20T00:00:00", "Olga Lepeshinskaya, Russian ballerina (b. 1916)"], ["2008-12-20T00:00:00", "Robert Mulligan, American director (b. 1925)"], ["2008-12-24T00:00:00", "Harold Pinter, English playwright (b. 1930)"], ["2008-12-24T00:00:00", "Samuel P. Huntington, American political scientist (b. 1927)"]]