[["2001-01-11T00:00:00", "The U.S. Federal Trade Commission approves the merger of America Online and Time Warner to form AOL Time Warner."], ["2001-01-13T00:00:00", "A 7.6 magnitude earthquake hits all of El Salvador, killing at least 800 people and leaving thousands homeless."], ["2001-01-15T00:00:00", "Wikipedia, a free Wiki content encyclopedia, goes online."], ["2001-01-17T00:00:00", "Impeachment proceedings against Philippine President Joseph Estrada, accused of playing Jueteng, end preeminently and trigger the second EDSA People Power Revolution or People Power II. His Vice-President Gloria Macapagal-Arroyo succeeds him as the 14th President of the Republic."], ["2001-01-20T00:00:00", "George W. Bush is sworn into office, succeeding Bill Clinton as President of the United States, over candidate contender Al Gore in the disputed U.S. presidential election, 2000."], ["2001-01-23T00:00:00", "The Tiananmen Square self-immolation incident occurs."], ["2001-01-26T00:00:00", "An earthquake hits Gujarat, India, killing almost 20,000."], ["2001-01-31T00:00:00", "The Congressional Budget Office of the United States forecasts a $5,600,000,000,000 budget surplus for the next 10 years."], ["2001-02-08T00:00:00", "Disney California Adventure opens in Anaheim, California."], ["2001-02-09T00:00:00", "The submarine USS Greeneville accidentally strikes and sinks the Japanese fishing vessel Ehime-Maru near Hawaii."], ["2001-02-12T00:00:00", "The NEAR Shoemaker spacecraft touches down in the \"saddle\" region of 433 Eros, becoming the first spacecraft to land on an asteroid."], ["2001-02-13T00:00:00", "A 6.6 magnitude earthquake hits El Salvador, killing at least 400."], ["2001-02-16T00:00:00", "Iraq disarmament crisis: British and U.S. forces carry out bombing raids, attempting to disable Iraq's air defense network."], ["2001-02-18T00:00:00", "FBI agent Robert Hanssen is arrested and charged with spying for Russia for 25 years."], ["2001-02-20T00:00:00", "The 2001 UK foot-and-mouth crisis begins."], ["2001-02-28T00:00:00", "The Great Heck rail crash occurs."], ["2001-03-02T00:00:00", "The Taliban begins destruction of the Bamiyan Buddhas."], ["2001-03-04T00:00:00", "A bomb explodes at BBC Television Centre in London, UK."], ["2001-03-23T00:00:00", "The deorbit of Russian space station Mir is carried out near Nadi, Fiji, with Mir falling into the Pacific Ocean."], ["2001-03-23T00:00:00", "The World Wrestling Federation (WWF/now WWE) purchases rival organization World Championship Wrestling (WCW) for an estimated US$7 million."], ["2001-03-24T00:00:00", "The first release of Mac OS X is released as the successor to Mac OS 9 and the Mac OS X Public Beta, which would not cease to function until May 14."], ["2001-04-01T00:00:00", "Hainan Island incident: A Chinese fighter jet bumps into a U.S. EP-3E surveillance aircraft, which is forced to make an emergency landing in Hainan, China. The U.S. crew is detained for 10 days and the F-8 Chinese pilot, Wang Wei, goes missing and is presumed dead."], ["2001-04-01T00:00:00", "Former Federal Republic of Yugoslavia President Slobodan Milošević surrenders to police special forces, to be tried on charges of war crimes."], ["2001-04-01T00:00:00", "In the Netherlands, the Act on the Opening up of Marriage goes into effect. The Act allows same-sex couples to marry legally for the first time in the world since the reign of Nero."], ["2001-04-28T00:00:00", "Soyuz TM-32 lifts off from the Baikonur Cosmodrome, carrying the first space tourist, American Dennis Tito."], ["2001-05-06T00:00:00", "Space tourist Dennis Tito returns to Earth aboard Soyuz TM-31. (Soyuz TM-32 is left docked at the International Space Station as a new lifeboat.)"], ["2001-05-07T00:00:00", "In Banja Luka, Bosnia and Herzegovina, an attempt is made to reconstruct the Ferhadija mosque. However, the ceremony results in mass riots by Serb nationalists, who beat and stone 300 elderly Bosnian Muslims."], ["2001-05-13T00:00:00", "Silvio Berlusconi wins the general election and becomes Prime Minister of Italy for the second time."], ["2001-05-14T00:00:00", "The Mac OS X Public Beta expires and its Aqua user interface ceases to function."], ["2001-05-22T00:00:00", "A large trans-Neptunian object (28978 Ixion) is found during the Deep Ecliptic Survey."], ["2001-05-24T00:00:00", "Sherpa Temba Tsheri, 16, becomes the youngest person to summit Mount Everest."], ["2001-05-24T00:00:00", "The Versailles wedding hall disaster kills 23 in Jerusalem, Israel."], ["2001-06-01T00:00:00", "Crown Prince Dipendra of Nepal kills his father, the king, his mother and other members of the royal family with an assault rifle and then shoots himself in the Nepalese royal massacre. Dipendra dies June 4, as King of Nepal. His uncle Gyanendra accedes to the throne."], ["2001-06-01T00:00:00", "A Hamas suicide bomber kills 21, mostly teenagers, in the Dolphinarium disco in Tel Aviv, Israel."], ["2001-06-07T00:00:00", "George W. Bush signs the Economic Growth and Tax Relief Reconciliation Act of 2001, the first tax cut of a series now known as the Bush tax cuts."], ["2001-06-11T00:00:00", "In Terre Haute, Indiana, Timothy McVeigh is executed for the Oklahoma City bombing."], ["2001-06-19T00:00:00", "A missile hits a soccer field in northern Iraq (Tel Afr County), killing 23 and wounding 11. According to U.S. officials, it was an Iraqi missile that malfunctioned."], ["2001-06-20T00:00:00", "Andrea Yates drowns all 5 of her young children in Houston, as a way to save them from Satan."], ["2001-06-21T00:00:00", "The world's longest train is set up by BHP Iron Ore and is recorded going between Newman and Port Hedland in Western Australia (a distance of 275 km, or 170 miles) and the train consists of 682 loaded iron ore wagons and 8 GE AC6000CW locomotives, giving a gross weight of almost 100,000 tonnes and moves 82,262 tonnes of ore; the train is 7.353 km (4.569 mi) long."], ["2001-06-23T00:00:00", "An earthquake (7.9 on the Richter scale) hits the south of Peru."], ["2001-07-02T00:00:00", "The world's first self-contained artificial heart is implanted in Robert Tools."], ["2001-07-03T00:00:00", "Vladivostok Air Flight 352 crashes on approach to landing at Irkutsk Airport, Russia, killing 145."], ["2001-07-07T00:00:00", "Race riots erupt in Bradford after National Front members reportedly stabbed an Asian man outside a pub."], ["2001-07-16T00:00:00", "The People's Republic of China and the Russian Federation sign the Treaty of Good-Neighborliness and Friendly Cooperation."], ["2001-07-16T00:00:00", "The FBI arrests Dmitry Sklyarov at a convention in Las Vegas, for violating a provision of the DMCA."], ["2001-07-18T00:00:00", "In Baltimore, a 60-car train derailment occurs in a tunnel, sparking a fire that lasts days and virtually shuts down downtown Baltimore."], ["2001-07-19T00:00:00", "UK politician and novelist Jeffrey Archer is sentenced to 4 years in prison for perjury and perverting the course of justice."], ["2001-07-24T00:00:00", "Tamil Tigers attack Bandaranaika International Airport in Sri Lanka, causing an estimated $500 million of damages."], ["2001-08-09T00:00:00", "Sbarro Restaurant in Jerusalem is attacked by a Palestinian militant, who kills 15 civilians and wounds 130."], ["2001-08-24T00:00:00", "Windows XP is launched by Microsoft."], ["2001-08-31T00:00:00", "September 1 - The 2001 Vancouver TV realignment occurs in British Columbia, Canada."], ["2001-08-31T00:00:00", "September 8 - The World Conference against Racism 2001 is held in Durban, South Africa."], ["2001-09-03T00:00:00", "The United States, Canada and Israel withdraw from the U.N. Conference on Racism because they feel that the issue of Zionism is overemphasized."], ["2001-09-06T00:00:00", "United States v. Microsoft Corp.: The United States Justice Department announces that it no longer seeks to break up software maker Microsoft, and will instead seek a lesser antitrust penalty."], ["2001-09-09T00:00:00", "A suicide bomber kills Ahmad Shah Massoud, military commander of the Afghan Northern Alliance."], ["2001-09-09T00:00:00", "68 people die of methanol poisoning in Pärnu County, Estonia."], ["2001-09-10T00:00:00", "Donald Rumsfeld gives a speech regarding $2.3 trillion in Pentagon spending that cannot be accounted for."], ["2001-09-11T00:00:00", "2,977 victims are killed in the September 11 attacks at the World Trade Center in New York City, New York, The Pentagon in Arlington County, Virginia, and in rural Shanksville, Pennsylvania after American Airlines Flight 11 and United Airlines Flight 175 are hijacked and crash into the World Trade Center's Twin Towers, American Airlines Flight 77 is hijacked and crashes into the Pentagon, and United Airlines Flight 93 is hijacked and crashes into grassland in Shanksville, due to the passengers fighting to regain control of the airplane. The World Trade Center towers collapse as a result of the crashes. The attacks remain the deadliest act of Terrorism in history in terms of casualties."], ["2001-09-12T00:00:00", "Ansett Australia Airlines is placed into administration, the company's fleet is grounded 2 days later on September 14."], ["2001-09-18T00:00:00", "The 2001 anthrax attacks commence as letters containing anthrax spores are mailed from Princeton, New Jersey to ABC News, CBS News, NBC News, the New York Post, and the National Enquirer. 22 in total are exposed; 5 of them die."], ["2001-09-21T00:00:00", "In Toulouse, France, the AZote Fertilisant chemical factory explodes, killing 29 and seriously wounding over 2,500."], ["2001-09-25T00:00:00", "Mac OS X v10.1 is released as the successor to Mac OS X v10.0, which introduces bug fixes and performance improvements."], ["2001-09-26T00:00:00", "The sixth Star Trek TV series Enterprise premieres on UPN."], ["2001-10-02T00:00:00", "Swissair seeks for bankruptcy protection and grounds its entire fleet."], ["2001-10-04T00:00:00", "Siberia Airlines Flight 1812 crashes over the Black Sea en route from Tel Aviv, Israel, to Novosibirsk, Russia; 78 are killed."], ["2001-10-07T00:00:00", "War in Afghanistan (2001-present): The United States invades Afghanistan, with participation from other nations."], ["2001-10-08T00:00:00", "Scandinavian Airlines Flight SK686 collides first with a private plane and then a building in Milan Linate Airport; 118 are killed."], ["2001-10-15T00:00:00", "NASA's Galileo spacecraft passes within 112 miles (180 km) of Jupiter's moon Io."], ["2001-10-19T00:00:00", "SIEV X sinks en route to Christmas Island, killing 353 people."], ["2001-10-23T00:00:00", "The Provisional Irish Republican Army of Northern Ireland commences disarmament after peace talks."], ["2001-10-23T00:00:00", "The iPod is first introduced by Apple."], ["2001-10-26T00:00:00", "U.S. President George W. Bush signs the Patriot Act into law."], ["2001-11-02T00:00:00", "The Glocal Forum, leading international organization in the field of city-to-city cooperation, is established by Ambassador Uri Savir."], ["2001-11-04T00:00:00", "Hurricane Michelle hits Cuba, destroying crops and thousands of homes."], ["2001-11-04T00:00:00", "The Police Service of Northern Ireland is established, replacing the controversial Royal Ulster Constabulary."], ["2001-11-10T00:00:00", "The People's Republic of China is admitted to the World Trade Organization after 15 years of negotiations."], ["2001-11-10T00:00:00", "Heavy rains and mudslides in Algeria kill more than 900."], ["2001-11-10T00:00:00", "John Howard, the Prime Minister of Australia, is elected to a third term."], ["2001-11-12T00:00:00", "In New York City, American Airlines Flight 587, headed to the Dominican Republic, crashes in Queens minutes after takeoff from John F. Kennedy International Airport, killing all 260 on board."], ["2001-11-13T00:00:00", "In the first such act since World War II, U.S. President George W. Bush signs an executive order allowing military tribunals against any foreigners suspected of having connections to terrorist acts or planned acts against the United States."], ["2001-11-30T00:00:00", "Gary Ridgway, a.k.a. The Green River Killer, is arrested outside of the truck factory where he had worked in Renton, Washington. His arrest marked the end of one of the longest running homicide investigations in US history."], ["2001-12-02T00:00:00", "Enron files for Chapter 11 bankruptcy protection 5 days after Dynegy cancels a US$8.4 billion buyout bid (to that point, the largest bankruptcy in U.S. history)."], ["2001-12-02T00:00:00", "During economic crisis in Argentina government effectively froze all bank accounts for twelve months which led to riots."], ["2001-12-03T00:00:00", "Officials announce that one of the Taliban prisoners captured after the prison uprising at Mazar-i-Sharif, Afghanistan is John Walker Lindh, an American citizen."], ["2001-12-11T00:00:00", "The United States government indicts Zacarias Moussaoui for involvement in the September 11, 2001 attacks."], ["2001-12-11T00:00:00", "Law enforcement raid members of DrinkOrDie in Operation Buccaneer."], ["2001-12-13T00:00:00", "The Parliament of India is attacked; 12 are killed. This brings India and Pakistan to the brink of war."], ["2001-12-13T00:00:00", "U.S. President George W. Bush announces the US withdrawal from the 1972 Anti-Ballistic Missile Treaty."], ["2001-12-22T00:00:00", "A Paris-Miami flight is diverted to Boston after passenger Richard Reid attempts to set his shoe, filled with explosives, on fire."], ["2001-12-27T00:00:00", "The People's Republic of China is granted permanent normal trade status with the United States."], ["2001-12-27T00:00:00", "Typhoon Vamei forms within 1.5 degrees of the equator. No other tropical cyclone in recorded history has come as close to the equator."]]