[["1952-01-08T00:00:00", "West Germany has 8 million refugees inside its borders."], ["1952-01-12T00:00:00", "The University of Tennessee admits its first black student."], ["1952-02-02T00:00:00", "A tropical storm forms just north of Cuba moving northeast. The storm makes landfall in southern Florida the next day. It is the earliest reported landfall from a tropical storm, and the earliest formation of a tropical storm on record in the Atlantic basin."], ["1952-02-06T00:00:00", "George VI (King of the United Kingdom and the Dominions: Canada, Australia, New Zealand, South Africa, Pakistan and Ceylon) dies aged 56 after a long illness. He is succeeded by his daughter The Princess Elizabeth, Duchess of Edinburgh (now Elizabeth II), who is on a visit to Kenya. She is proclaimed Queen of Canada at Rideau Hall, Ottawa."], ["1952-02-06T00:00:00", "In the United States, a mechanical heart is used for the first time in a human patient."], ["1952-02-07T00:00:00", "Elizabeth II is proclaimed Queen of the United Kingdom at St James's Palace, London, England."], ["1952-02-14T00:00:00", "February 25 - The Winter Olympics held in Oslo, Norway."], ["1952-02-15T00:00:00", "The funeral of George VI takes place at St George's Chapel, Windsor Castle."], ["1952-02-18T00:00:00", "Greece and Turkey join the North Atlantic Treaty Organization."], ["1952-02-20T00:00:00", "Emmett Ashford becomes the first African-American umpire in organized baseball, by being authorized to be a substitute umpire in the Southwestern International League."], ["1952-02-20T00:00:00", "Winston Churchill scraps UK compulsory national identity cards."], ["1952-02-21T00:00:00", "In Dhaka, East Pakistan (present-day Bangladesh) police open fire on a procession of students, killing 4 people and starting a country-wide protest which leads to the recognition of Bengali as one of the national languages of Pakistan. The day is later declared \"International Mother Language Day\" by UNESCO."], ["1952-02-25T00:00:00", "The Parícutin active volcano in Michoacán, west central Mexico, ceases its discontinuous eruption after spewing forth a gigaton of lava and burying San Juan Parangaricutiro."], ["1952-02-26T00:00:00", "United Kingdom Prime Minister Winston Churchill announces that the United Kingdom has an atomic bomb."], ["1952-02-26T00:00:00", "Vincent Massey is sworn in as the first Canada-born Governor General of Canada."], ["1952-03-01T00:00:00", "The British Psychological Society is founded."], ["1952-03-10T00:00:00", "General Fulgencio Batista re-takes power in Cuba."], ["1952-03-20T00:00:00", "The United States Senate ratifies a peace treaty with Japan."], ["1952-03-21T00:00:00", "The last two executions in the Netherlands take place."], ["1952-03-21T00:00:00", "Dr. Kwame Nkrumah is elected Prime Minister of the Gold Coast."], ["1952-03-21T00:00:00", "Tornadoes ravage the lower Mississippi River Valley, leaving 208 dead, through March 22."], ["1952-03-22T00:00:00", "Wernher von Braun publishes the first in his series of articles titled Man Will Conquer Space Soon!, including ideas for manned flights to Mars and the Moon."], ["1952-03-27T00:00:00", "Konrad Adenauer survives an assassination attempt."], ["1952-03-29T00:00:00", "U.S. President Harry S. Truman announces that he will not seek reelection."], ["1952-04-04T00:00:00", "In the Hague Tribunal, Israel demands reparations worth $3 billion from Germany."], ["1952-04-04T00:00:00", "West Ice accidents: During a severe storm in the West Ice, east of Greenland, 78 seal hunters on 5 Norwegian seal hunting vessels vanish without a trace."], ["1952-04-07T00:00:00", "The American Research Bureau reports that the I Love Lucy episode, \"The Marriage License\" was the first TV show in history to be seen in around 10,000,000 homes the evening the episode aired."], ["1952-04-08T00:00:00", "Youngstown Sheet & Tube Co. v. Sawyer: The U.S. Supreme Court limits the power of the President to seize private business, after President Harry S. Truman nationalizes all steel mills in the United States, just before the 1952 steel strike begins."], ["1952-04-09T00:00:00", "Hugo Ballivián's government is overthrown by the Bolivian National Revolution, which starts a period of agrarian reform, universal suffrage and the nationalization of tin mines."], ["1952-04-11T00:00:00", "Battle of Nanri Island: The Republic of China seizes the island from the Peoples' Republic of China."], ["1952-04-15T00:00:00", "The United States B-52 Stratofortress flies for the first time."], ["1952-04-18T00:00:00", "Bolivia National Revolution: A universal vote enables indigenous peoples and women to vote, nationalizes mines and enacts agrarian reform."], ["1952-04-18T00:00:00", "West Germany and Japan form diplomatic relations."], ["1952-04-26T00:00:00", "The United States Navy aircraft carrier Wasp collides with the destroyer Hobson while on exercises in the Atlantic Ocean, killing 175 men."], ["1952-04-28T00:00:00", "The Treaty of San Francisco goes into effect, formally ending the war between Japan and the Allies, and simultaneously ending the occupation of the four main Japanese islands."], ["1952-04-29T00:00:00", "Lever House officially opens at 390 Park Avenue in New York City, heralding a new age of commercial architecture in the United States. Designed by Gordon Bunshaft of Skidmore, Owings & Merrill, it is the first International Style skyscraper."], ["1952-05-01T00:00:00", "East Germany threatens to form its own army."], ["1952-05-02T00:00:00", "The first passenger jet flight route opens between London and Johannesburg."], ["1952-05-03T00:00:00", "U.S. lieutenant colonels Joseph O. Fletcher and William P. Benedict land a plane at the geographic North Pole."], ["1952-05-06T00:00:00", "Farouk of Egypt has himself announced as a descendant of the Islamic prophet, Muhammad."], ["1952-05-13T00:00:00", "Pandit Nehru forms his first government in India."], ["1952-05-15T00:00:00", "Diplomatic relations are established between Israel and Japan at the level of legations."], ["1952-05-18T00:00:00", "Ann Davison becomes the first woman to single-handedly sail the Atlantic Ocean."], ["1952-06-01T00:00:00", "The Roman Catholic Church bans the books of André Gide."], ["1952-06-01T00:00:00", "Navigation opens on the Volga-Don Canal, connecting the Caspian Sea basin with that of the Black Sea."], ["1952-06-14T00:00:00", "The keel is laid for the U.S. nuclear submarine USS Nautilus."], ["1952-06-14T00:00:00", "Myxomatosis is introduced to Europe on the French estate of Dr. Paul-Félix Armand-Delille."], ["1952-06-15T00:00:00", "The Diary of a Young Girl is published."], ["1952-06-19T00:00:00", "The Special Forces (United States Army) are created."], ["1952-06-21T00:00:00", "The Philippine School of Commerce, through a government act, is converted to the Philippine College of Commerce (later the Polytechnic University of the Philippines)."], ["1952-06-26T00:00:00", "The Pan-Malayan Labour Party is founded in Malaya, as a union of statewise labour parties."], ["1952-06-27T00:00:00", "Decree 900 in Guatemala orders redistribution of uncultivated land."], ["1952-06-29T00:00:00", "Finnish contestant Armi Kuusela wins the title of Miss Universe."], ["1952-07-03T00:00:00", "The ocean liner SS United States makes her maiden crossing of the Atlantic."], ["1952-07-13T00:00:00", "East Germany announces the formation of its National People's Army."], ["1952-07-19T00:00:00", "August 3 - The 1952 Summer Olympics are held in Helsinki, Finland."], ["1952-07-21T00:00:00", "A magnitude 7.5 earthquake (Richter scale) strikes Tehachapi, California, destroying unreinforced brick buildings."], ["1952-07-23T00:00:00", "The European Coal and Steel Community is established."], ["1952-07-23T00:00:00", "General Mohammed Naguib leads The Free Officers (formed by Gamal Abdel Nasser - the real power behind the coup) in the overthrow of King Farouk of Egypt."], ["1952-07-25T00:00:00", "Puerto Rico becomes a self-governing commonwealth of the United States."], ["1952-08-05T00:00:00", "The Treaty of Taipei between Japan and the Republic of China goes into effect, to officially end the Second Sino-Japanese War."], ["1952-08-11T00:00:00", "The Jordanian army forces King Talal to resign due to mental illness; he is succeeded by his son Hussein of Jordan."], ["1952-08-13T00:00:00", "Japan joins the IMF."], ["1952-08-14T00:00:00", "West Germany joins the IMF and the World Bank."], ["1952-08-16T00:00:00", "Lynmouth, North Devon, England is devastated by floods; 34 die."], ["1952-08-26T00:00:00", "A British passenger jet makes a return crossing of the Atlantic Ocean in the same day."], ["1952-08-27T00:00:00", "Reparation negotiations between West Germany and Israel end in Luxembourg: Germany will pay 3 billion Deutsche Marks."], ["1952-08-29T00:00:00", "Composer John Cage's 4′33″, during which the performer does not play, premieres in Woodstock, New York."], ["1952-08-30T00:00:00", "The last Finnish war reparations are sent to the Soviet Union."], ["1952-08-31T00:00:00", "The Grenzlandring racetrack closes in Wegberg, Germany."], ["1952-09-02T00:00:00", "Dr. C. Walton Lillehei and Dr. F. John Lewis perform the first open-heart surgery at the University of Minnesota."], ["1952-09-06T00:00:00", "Television debuts in Canada as the CBC in Montreal, Quebec airs."], ["1952-09-08T00:00:00", "CBC Toronto debuts."], ["1952-09-10T00:00:00", "The European Parliamentary Assembly (from March 1962, European Parliament) opens."], ["1952-09-18T00:00:00", "The Soviet Union vetoes Japan's application for membership in the United Nations."], ["1952-09-30T00:00:00", "The Revised Standard Version of the Bible was published and released to the public."], ["1952-10-03T00:00:00", "The first British nuclear weapon is detonated in Australia making the United Kingdom the third nuclear weapons state."], ["1952-10-08T00:00:00", "Negotiations for a ceasefire in Korea are postponed."], ["1952-10-08T00:00:00", "A three-train crash at Harrow railway station in England kills 112 people."], ["1952-10-12T00:00:00", "The Gamma Sigma Sigma National Service Sorority is founded in New York City at Panhellenic Tower."], ["1952-10-14T00:00:00", "The United Nations begins work in the new United Nations building in New York City, designed by Le Corbusier and Oscar Niemeyer."], ["1952-10-16T00:00:00", "Limelight opens in London; writer/actor/director/producer Charlie Chaplin arrives by ocean liner; in transit his re-entry permit to the USA is revoked by J. Edgar Hoover."], ["1952-10-17T00:00:00", "Indonesian troops led by General Nasution surround the presidential palace, seeking the dismissal of the People's Representative Council; Sukarno avoids confrontation."], ["1952-10-19T00:00:00", "Alain Bombard begins to sail from the Canary Islands to Barbados in 65 days; he reaches them December 23."], ["1952-10-19T00:00:00", "John Bamford, aged 15, rescues victims of a house fire and becomes the youngest person to be awarded the George Cross."], ["1952-10-20T00:00:00", "Martial law is declared in Kenya due to the Mau Mau uprising."], ["1952-11-01T00:00:00", "Nuclear testing and Operation Ivy: The United States successfully detonates the first hydrogen bomb, codenamed \"Mike\", at Eniwetok Atoll in the Marshall Islands in the central Pacific Ocean, with a yield of 10.4 megatons."], ["1952-11-04T00:00:00", "Kamchatka earthquake: An 8.25 Richter scale (9.0 moment magnitude scale) earthquake hits the Kamchatka Peninsula of the Soviet Union, equal only to the 2011 Japanese earthquake."], ["1952-11-04T00:00:00", "United States presidential election, 1952: Republican President Dwight D. Eisenhower defeats Democrat Governor of Illinois Adlai Stevenson (correctly predicted by the UNIVAC computer)."], ["1952-11-04T00:00:00", "The U.S. National Security Agency is founded."], ["1952-11-04T00:00:00", "The Pace-Finletter MOU 1952: A Memorandum of understanding is signed between \"...Air Force Secretary Finletter and Army Secretary Pace that established a fixed wing weight limit [for the Army] of five thousand pounds empty, but weight restrictions on helicopters were eliminated...\""], ["1952-11-18T00:00:00", "Jomo Kenyatta is arrested in Kenya for an alleged connection to the Mau Mau Uprising."], ["1952-11-20T00:00:00", "Slánský trials: A series of largely anti-Semitic show trials are held in Czechoslovakia."], ["1952-11-20T00:00:00", "A fireball crashes in a backyard in Havelock North, New Zealand."], ["1952-11-20T00:00:00", "The first official passenger flight over the North Pole is made from Los Angeles to Copenhagen."], ["1952-11-20T00:00:00", "The first successful sex reasignment surgery was performed in Copenhagen, making George Jorgensen Jr. become Christine Jorgensen."], ["1952-11-25T00:00:00", "Agatha Christie's murder-mystery play The Mousetrap opens at the Ambassadors Theatre in London; as of 2015, it continues next door at the St. Martin's Theatre, and remains the longest continuously running production of a play in history."], ["1952-11-29T00:00:00", "Korean War: U.S. President-elect Dwight D. Eisenhower fulfills a political campaign promise, by traveling to Korea to find out what can be done to end the conflict."], ["1952-12-01T00:00:00", "Adolfo Ruiz Cortines takes office as President of Mexico."], ["1952-12-01T00:00:00", "The New York Daily News carries a front page story announcing that Christine Jorgensen, a transsexual woman in Denmark, has become the recipient of the first successful sexual reassignment operation."], ["1952-12-04T00:00:00", "the Great Smog: A \"killer fog\" descends on London (in the process coining the word \"Smog\", for \"smoke\" and \"fog\")."], ["1952-12-14T00:00:00", "The first successful surgical separation of Siamese twins is conducted in Mount Sinai Hospital, Cleveland, Ohio."], ["1952-12-20T00:00:00", "The crash of a U.S. Air Force C-124 Globemaster at Moses Lake, WA kills 86 servicemen."], ["1952-12-25T00:00:00", "One West German soldier is killed in a shooting incident in West Berlin."], ["1952-12-26T00:00:00", "Joseph Ivor Linton, the first Israeli Minister Plenipotentiary in Japan, presents his credentials to the Emperor of Japan."]]