[["2012-01-23T00:00:00", "Iran-European Union relations: The European Union adopts an embargo against Iran in protest of that nation's continued effort to enrich uranium."], ["2012-02-06T00:00:00", "The Diamond Jubilee of Queen Elizabeth II marks the 60th anniversary of her accession to the thrones of the United Kingdom, Canada, Australia and New Zealand, and the 60th anniversary of her becoming Head of the Commonwealth."], ["2012-02-19T00:00:00", "Iran suspends oil exports to Britain and France, following sanctions put in place by the European Union and the United States in January."], ["2012-02-21T00:00:00", "Greek government-debt crisis: Eurozone finance ministers reach an agreement on a second, €130-billion Greek bailout."], ["2012-02-27T00:00:00", "Arab Spring: As a result of continuing protests, Yemeni President Ali Abdullah Saleh is succeeded by his Vice President Abd Rabbuh Mansur Hadi."], ["2012-03-04T00:00:00", "A series of explosions are reported at a munitions dump in Brazzaville, the capital of the Republic of the Congo, with at least 250 people dead."], ["2012-03-13T00:00:00", "After 244 years since its first publication, the Encyclopædia Britannica discontinues its print edition."], ["2012-03-22T00:00:00", "The President of Mali, Amadou Toumani Touré, is ousted in a coup d'état after mutinous soldiers attack government offices."], ["2012-04-06T00:00:00", "The National Movement for the Liberation of Azawad unilaterally declares the independence of Azawad from Mali."], ["2012-04-12T00:00:00", "Mutinous soldiers in Guinea-Bissau stage a coup d'état and take control of the capital city, Bissau. They arrest interim President Raimundo Pereira and leading presidential candidate Carlos Gomes Júnior in the midst of a presidential election campaign."], ["2012-04-13T00:00:00", "Kwangmyŏngsŏng-3, a North Korean Earth observation satellite, explodes shortly after launch. The United States and other countries had called the impending launch a violation of United Nations Security Council demands. The launch was planned to mark the centenary of the birth of Kim Il-sung, the founder of the republic."], ["2012-04-26T00:00:00", "Former Liberian President Charles Taylor is found guilty on 11 counts of aiding and abetting war crimes and crimes against humanity during the Sierra Leone Civil War."], ["2012-05-02T00:00:00", "A pastel version of The Scream, by the Norwegian painter Edvard Munch, sells for US$120 million in a New York City auction, setting a new world record for an auctioned work of art."], ["2012-05-12T00:00:00", "August 12 - The 2012 World Expo takes place in Yeosu, South Korea."], ["2012-05-22T00:00:00", "Tokyo Skytree, the tallest self-supporting tower in the world at 634 metres high, is opened to the public."], ["2012-06-18T00:00:00", "Shenzhou 9, a Chinese spacecraft carrying three Chinese astronauts, including the first-ever female, docks manually with orbiting module Tiangong-1, making them the third country, after the United States and Russia, to successfully perform the mission."], ["2012-06-24T00:00:00", "Lonesome George, the last known individual of the Pinta Island tortoise subspecies, dies in Galápagos National Park, thus making the subspecies extinct."], ["2012-07-04T00:00:00", "CERN announces the discovery of a new particle with properties consistent with the Higgs boson after experiments at the Large Hadron Collider."], ["2012-07-27T00:00:00", "August 12 - The 2012 Summer Olympics are held in London, England, United Kingdom."], ["2012-08-06T00:00:00", "Curiosity, the Mars Science Laboratory mission's rover, successfully lands on Mars."], ["2012-08-31T00:00:00", "Researchers successfully perform the first implantation of an early prototype bionic eye with 24 electrodes."], ["2012-08-31T00:00:00", "Armenia severs diplomatic relations with Hungary, following the extradition to Azerbaijan and subsequent pardoning of Ramil Safarov, who was convicted of killing an Armenian soldier in Hungary in 2004. The move is also met with fierce criticism from other countries."], ["2012-09-07T00:00:00", "Canada officially cuts diplomatic ties with Iran by closing its embassy in Tehran, and orders the expulsion of Iranian diplomats from Ottawa, over support for Syria, nuclear plans and human rights abuses."], ["2012-10-14T00:00:00", "Austrian skydiver Felix Baumgartner becomes the first person to break the sound barrier without any machine assistance during a record space dive out of the Red Bull Stratos helium-filled balloon from 24 miles (39 kilometers) over Roswell, New Mexico in the United States."], ["2012-10-16T00:00:00", "Seven paintings worth $25 million are stolen from the Kunsthal in Rotterdam, the Netherlands."], ["2012-11-25T00:00:00", "December 9 - Typhoon Bopha, known as \"Pablo\" in the Philippines, kills at least 1,067 with around 838 people still missing. The typhoon causes considerable damage in the island of Mindanao."], ["2012-11-29T00:00:00", "The UN General Assembly approves a motion granting Palestine non-member observer state status."], ["2012-12-08T00:00:00", "In Qatar, the UN Climate Change Conference agrees to extend the Kyoto Protocol until 2020."]]