[["1914-01-01T00:00:00", "The St. Petersburg-Tampa Airboat Line in the United States starts services between St. Petersburg and Tampa, Florida, becoming the first airline to provide scheduled regular commercial passenger services with heavier-than-air aircraft, with Tony Jannus (the first federally-licensed pilot) conveying passengers in a Benoist XIV flying boat. Abram C. Pheil, mayor of St. Petersburg, is the first airline passenger and over 3,000 people witness the first departure."], ["1914-01-05T00:00:00", "Ford Motor Company announces an eight-hour workday and a daily wage of $5."], ["1914-01-09T00:00:00", "The Phi Beta Sigma fraternity is founded by African American students at Howard University in Washington, D.C."], ["1914-01-11T00:00:00", "The Sakurajima volcano in Japan begins to erupt, becoming effusive after a very large earthquake on January 13. The lava flows cause the island which it forms to be linked to the Ōsumi Peninsula."], ["1914-02-02T00:00:00", "Charlie Chaplin makes his film début in the comedy short Making a Living."], ["1914-02-07T00:00:00", "Release of Charlie Chaplin's second film, the Keystone comedy Kid Auto Races at Venice, in which his character of The Tramp is introduced to audiences (although first filmed in Mabel's Strange Predicament, released two days later)."], ["1914-02-08T00:00:00", "The Luxembourg national football team has its first victory, beating France 5-4 in a friendly match, for the first and only time in football history."], ["1914-02-10T00:00:00", "Release of the film Hearts Adrift; the name of Mary Pickford, the star, is displayed above the title on movie marquees."], ["1914-02-12T00:00:00", "In Washington, D.C., the first stone of the Lincoln Memorial is put into place."], ["1914-02-13T00:00:00", "Copyright: In New York City the American Society of Composers, Authors and Publishers is established to protect the copyrighted musical compositions of its members."], ["1914-02-17T00:00:00", "Karl Staaff steps down as Prime Minister of Sweden in the aftermath of the Courtyard Crisis. He is replaced by the public official Hjalmar Hammarskjöld, father of Dag Hammarskjöld."], ["1914-02-26T00:00:00", "The ocean liner that will become HMHS Britannic, sister to the RMS Titanic, is launched at the Harland and Wolff shipyards in Belfast."], ["1914-02-28T00:00:00", "Autonomous Republic of Northern Epirus proclaimed by ethnic Greeks in Northern Epirus."], ["1914-03-01T00:00:00", "The Republic of China joins the Universal Postal Union."], ["1914-03-06T00:00:00", "Founding of FK Vojvodina football club in Novi Sad (Serbia)."], ["1914-03-07T00:00:00", "Prince William of Wied arrives in Albania to begin his reign."], ["1914-03-08T00:00:00", "First transfer of aircraft to Don Muang Royal Thai Air Force Base."], ["1914-03-10T00:00:00", "Suffragette Mary Richardson damages Velázquez' painting Rokeby Venus in London's National Gallery with a meat chopper."], ["1914-03-16T00:00:00", "Henriette Caillaux, wife of French minister Joseph Caillaux, murders Gaston Calmette, editor of Le Figaro, fearing publication of letters showing she and Caillaux were romantically involved during his first marriage. (She is acquitted on July 28)."], ["1914-03-27T00:00:00", "Belgian surgeon Albert Hustin makes the first successful non-direct blood transfusion, using anticoagulants."], ["1914-03-29T00:00:00", "Katherine Routledge and her husband arrive in Easter Island to make the first true study of it (they depart August 1915)."], ["1914-04-09T00:00:00", "Tampico Affair, involving United States Navy sailors in Mexico."], ["1914-04-11T00:00:00", "Canadian Margaret C. MacDonald is appointed Matron-in-Chief of the Canadian Nursing service band and becomes the first woman in the British Empire to reach the rank of major."], ["1914-04-11T00:00:00", "Alpha Rho Chi, a professional architecture fraternity, is founded in the Hotel Sherman in Chicago."], ["1914-04-20T00:00:00", "Ludlow Massacre (Colorado Coalfield War): The Colorado National Guard attacks a tent colony of 1,200 striking coal miners in Ludlow, Colorado in the United States, killing 24 people."], ["1914-04-20T00:00:00", "President Woodrow Wilson asks the United States Congress to use military force in Mexico in reaction to the Tampico Affair."], ["1914-04-21T00:00:00", "United States occupation of Veracruz: 2,300 U.S. Navy sailors and Marines from the South Atlantic fleet land in the port city of Veracruz, Mexico, which they will occupy for over 6 months. The Ypiranga incident occurs when they attempt to enforce an arms embargo against Mexico by preventing the German cargo steamer SS Ypiranga from unloading arms for the Mexican government in the port."], ["1914-04-22T00:00:00", "Mexico ends diplomatic relations with the United States for the time being."], ["1914-05-09T00:00:00", "J. T. Hearne becomes the first bowler to take 3,000 first-class wickets."], ["1914-05-14T00:00:00", "Woodrow Wilson signs a Mother's Day proclamation."], ["1914-05-17T00:00:00", "Protocol of Corfu provides for the provinces of Korçë and Gjirokastër, constituting Northern Epirus, to be granted autonomy under the nominal sovereignty of Albania."], ["1914-05-25T00:00:00", "The United Kingdom's House of Commons passes Irish Home Rule."], ["1914-05-29T00:00:00", "The ocean liner RMS Empress of Ireland sinks in the Gulf of St. Lawrence; 1,012 lives are lost."], ["1914-05-30T00:00:00", "The ocean liner RMS Aquitania makes her maiden voyage."], ["1914-06-01T00:00:00", "Woodrow Wilson's envoy Edward Mandell House meets with Kaiser Wilhelm II."], ["1914-06-08T00:00:00", "The Brazilian Football Confederation is founded, with Álvaro Zamith as its first president. The Brazilian Olympic Committee is founded on the same day."], ["1914-06-09T00:00:00", "Pittsburgh Pirate Honus Wagner becomes the first baseball player in the 20th century with 3000 career hits."], ["1914-06-12T00:00:00", "Greek genocide: Ottoman Greeks in Phocaea are massacred by Turkish irregular troops."], ["1914-06-18T00:00:00", "Mexican Revolution: The Constitutionals take San Luis Potosí; Venustiano Carranza demands Victoriano Huerta's surrender."], ["1914-06-23T00:00:00", "After it had been closed so that it could be deepened, the Kaiser-Wilhelm-Kanal is reopened by the Kaiser; the British Fleet under Sir George Warrender visits; the Kaiser inspects the Dreadnought HMS King George V."], ["1914-06-24T00:00:00", "In Manchester, New Hampshire, a downtown fire causes $400,000 damage and injures 19 firemen."], ["1914-06-28T00:00:00", "Assassination of Archduke Franz Ferdinand of Austria: 19-year-old Serbian nationalist Gavrilo Princip assassinates Archduke Franz Ferdinand of Austria and his wife, Duchess Sophie, in Sarajevo, Bosnia and Herzegovina, triggering the July Crisis and World War I."], ["1914-06-29T00:00:00", "Austria-Hungary: The Secretary of the Legation at Belgrade sends a dispatch to Vienna suggesting Serbian complicity in the crime of Sarajevo. Anti-Serb riots erupt in Sarajevo and throughout Bosnia generally."], ["1914-06-29T00:00:00", "Khioniya Guseva attempts and fails to assassinate Grigori Rasputin at his home town in Siberia."], ["1914-06-29T00:00:00", "International Exhibition opens at the \"White City\", Ashton Gate, Bristol (England). It closes on August 15 and the site is used as a military depot."], ["1914-06-30T00:00:00", "Among those addressing the Parliament of the United Kingdom on the murdered Archduke are Lords Crewe and Lansdowne in the House of Lords and Messrs Asquith and Law in the Commons."], ["1914-07-02T00:00:00", "The German Kaiser announces that he will not attend the Archduke's funeral."], ["1914-07-04T00:00:00", "The Archduke's funeral takes place at Artstetten Castle (50 miles west of Vienna), Austria-Hungary."], ["1914-07-04T00:00:00", "Lexington Avenue bombing: 4 people are killed in New York City when an anarchist bomb intended to kill John D. Rockefeller explodes prematurely in the plotters' apartment."], ["1914-07-05T00:00:00", "A council is held at Potsdam, powerful leaders within Austria-Hungary and Germany meet to discuss possibilities of war with Serbia, Russia, and France."], ["1914-07-07T00:00:00", "Austria-Hungary convenes a Council of Ministers, including Ministers for Foreign Affairs and War, the Chief of the General Staff and Naval Commander-in-Chief; the Council lasts from 11.30 a.m. to 6.15 p.m."], ["1914-07-09T00:00:00", "The Emperor of Austria-Hungary receives the report of Austro-Hungarian investigation into the Assassination of Archduke Franz Ferdinand of Austria at Sarajevo. The Times publishes an account of the Austro-Hungarian press campaign against the Serbians (who are described as \"pestilent rats\")."], ["1914-07-10T00:00:00", "Nicholas Hartwig, Russian Minister to Serbia, dies suddenly while visiting Austrian minister Wladimir Giesl von Gieslingen at the Austrian Legation in Belgrade."], ["1914-07-11T00:00:00", "Baseball legend Babe Ruth makes his major league debut with the Boston Red Sox."], ["1914-07-11T00:00:00", "USS Nevada, the United States Navy's first \"super-dreadnought\" battleship, is launched."], ["1914-07-11T00:00:00", "Over 5,000 attend a rally in Union Square, Manhattan, called by the Anti-Militarist League to commemorate the anarchists killed in the July 4 Lexington Avenue bombing."], ["1914-07-12T00:00:00", "Supreme Court of the United States justice Horace H. Lurton succumbs to a heart attack at age 70."], ["1914-07-13T00:00:00", "Reports surface of a projected Serbian attack upon the Austro-Hungarian Legation at Belgrade."], ["1914-07-14T00:00:00", "The Government of Ireland Bill completes its passage through the House of Lords of the U.K. It allows Ulster counties to vote on whether or not they wish to participate in Home Rule from Dublin."], ["1914-07-15T00:00:00", "Mexican Revolution: Victoriano Huerta resigns the presidency of Mexico and leaves for Coatzacoalcos, Veracruz."], ["1914-07-18T00:00:00", "The Signal Corps of the United States Army is formed, giving definite status to its air service for the first time."], ["1914-07-18T00:00:00", "British Fleet review at Spithead by George V."], ["1914-07-18T00:00:00", "Gandhi leaves South Africa for the last time, sailing out of Cape Town for England on board the SS Kinfauns Castle."], ["1914-07-19T00:00:00", "George V summons a conference to discuss the Irish Home Rule problem. This meets from July 21 to 24 without reaching consensus."], ["1914-07-23T00:00:00", "July Ultimatum: Austria-Hungary presents Serbia with an unconditional ultimatum."], ["1914-07-25T00:00:00", "Austria-Hungary severs diplomatic ties with Serbia and begins to mobilize its own forces. Radomir Putnik, Chief of the Serbian General Staff, is arrested in Budapest but subsequently allowed to return to Serbia."], ["1914-07-26T00:00:00", "King's Own Scottish Borderers of the British Army fire on Dubliners on Bachelor's Walk, killing 3 and injuring 38."], ["1914-07-27T00:00:00", "Brother Felix Ysagun Manalo registers the Iglesia ni Cristo (Church of Christ) with the government of the Philippines."], ["1914-07-28T00:00:00", "World War I: Austria-Hungary declares war on Serbia by telegram and its army bombards Belgrade. Tsar Nicholas II of Russia orders a partial mobilization against Austria-Hungary."], ["1914-07-28T00:00:00", "Henriette Caillaux, wife of French minister Joseph Caillaux is acquitted of murder by reason of crime passionnel."], ["1914-07-29T00:00:00", "In Massachusetts, the new Cape Cod Canal opens; it shortens the trip between New York and Boston by 66 miles, but also turns Cape Cod into an island."], ["1914-07-30T00:00:00", "Austrian artillery bombards Belgrade, capital of Serbia."], ["1914-07-31T00:00:00", "Russia orders full mobilization."], ["1914-07-31T00:00:00", "French antimilitarist socialist leader Jean Jaurès is assassinated by a nationalist in Paris."], ["1914-08-01T00:00:00", "The German Empire declares war on the Russian Empire, following Russia's military mobilization in support of Serbia; Germany also begins mobilization."], ["1914-08-01T00:00:00", "France orders general mobilization."], ["1914-08-01T00:00:00", "New York Stock Exchange closed due to war in Europe, where nearly all stock exchanges are already closed."], ["1914-08-01T00:00:00", "Marcus Garvey founds the Universal Negro Improvement Association in Jamaica."], ["1914-08-02T00:00:00", "German troops occupy Luxembourg in accordance with its Schlieffen Plan."], ["1914-08-02T00:00:00", "A secret treaty between the Ottoman Empire and Germany secures Ottoman neutrality."], ["1914-08-02T00:00:00", "At 7:00 pm (local time) Germany issues a 12-hour ultimatum to neutral Belgium to allow German passage into France."], ["1914-08-03T00:00:00", "Germany declares war on Russia's ally, France."], ["1914-08-03T00:00:00", "At 7:00 am (local time) Belgium declines to accept Germany's ultimatum of August 2."], ["1914-08-04T00:00:00", "German troops invade Belgium at 8:02 am (local time). Declaration of war by the United Kingdom on Germany for this violation of Belgian neutrality. This effectively means a declaration of war by the whole British Empire against the German Empire. The United States declares neutrality. By then the First World War had began."], ["1914-08-04T00:00:00", "Imperial German Navy Rear-Admiral Wilhelm Souchon bombards the French Algerian ports of Bône and Philippeville from battlecruiser Goeben and light cruiser Breslau."], ["1914-08-04T00:00:00", "Gandhi is in the English Channel (en route from South Africa) when he learns that war has been declared. Later this day he arrives in London."], ["1914-08-05T00:00:00", "Germany declares war on Belgium."], ["1914-08-05T00:00:00", "The Kingdom of Montenegro declares war on Austria-Hungary."], ["1914-08-05T00:00:00", "The guns of Point Nepean fort at Port Phillip Heads in Victoria (Australia) fire across the bows of the Norddeutscher Lloyd steamer SS Pfalz which is attempting to leave the Port of Melbourne in ignorance of the declaration of war and she is detained; this is said to be the first Allied shot of the War."], ["1914-08-05T00:00:00", "SS Königin Luise, taken over two days earlier by the Imperial German Navy as a minelayer, lays mines 40 miles (64 km) off the east coast of England. She is intercepted and sunk by the British Royal Navy light cruiser HMS Amphion, the first German naval loss of the war. The following day, Amphion strikes mines laid by the Königin Luise and is sunk with some loss of life, the first British casualties of the war."], ["1914-08-05T00:00:00", "German zeppelins drop bombs on Liége in Belgium, killing 9 civilians."], ["1914-08-05T00:00:00", "First electric traffic light is installed between Euclid Avenue and East 105 Street, Cleveland, Ohio."], ["1914-08-06T00:00:00", "World War I: - Austria-Hungary declares war on Russia."], ["1914-08-06T00:00:00", "World War I: - First engagement between ships (light cruisers) of the British Royal Navy and the Imperial German Navy when HMS Bristol pursues the SMS Karlsruhe (which escapes) in the West Indies."], ["1914-08-07T00:00:00", "World War I: - Battle of Mulhouse: France launches its first attack of the war in an ultimately unsuccessful attempt to recover the province of Alsace from Germany, beginning the Battle of the Frontiers."], ["1914-08-07T00:00:00", "World War I: - British colonial troops of the British Gold Coast Regiment entering the German West African colony of Togoland encounter the German-led police force at a factory in Nuatja, near Lomé, and the police open fire on the patrol. Alhaji Grunshi returns fire, the first soldier in British service to fire a shot in the war."], ["1914-08-08T00:00:00", "German colonial forces execute Martin-Paul Samba for high treason."], ["1914-08-08T00:00:00", "Sir Ernest Shackleton's Imperial Trans-Antarctic Expedition sets sail on the Endurance from England in an attempt to cross Antarctica."], ["1914-08-09T00:00:00", "World War I: British Royal Navy light cruiser HMS Birmingham rams and sinks German submarine U-15 off Fair Isle, the first U-boat lost in action."], ["1914-08-12T00:00:00", "World War I: - Battle of Haelen: Belgian troops repulse the Germans."], ["1914-08-12T00:00:00", "World War I: - Formal declaration of war by the United Kingdom on Austria-Hungary."], ["1914-08-13T00:00:00", "Treaties of Teoloyucan(Spanish) are signed in the State of Mexico."], ["1914-08-15T00:00:00", "The Panama Canal is inaugurated with the passage of the SS Ancon."], ["1914-08-15T00:00:00", "Mexican Revolution: Venustiano Carranza's troops under general Álvaro Obregón enter Mexico City."], ["1914-08-15T00:00:00", "A dismissed servant kills seven people at American architect Frank Lloyd Wright's studio and home, Taliesin in Wisconsin (including his mistress, Mamah Borthwick), and sets it on fire."], ["1914-08-16T00:00:00", "German warships SMS Goeben and Breslau (both commissioned in 1912), which reached Constantinople on August 10, are transferred to the Ottoman Navy, Goeben becoming its flagship, Yavuz Sultan Selim."], ["1914-08-20T00:00:00", "World War I: German forces occupy Brussels."], ["1914-08-22T00:00:00", "World War I: Battle of Rossignol: German forces decisively defeat the French."], ["1914-08-23T00:00:00", "World War I: - Battle of Mons: In its first major action, the British Expeditionary Force holds the German forces but then begins a month-long fighting Great Retreat to the Marne."], ["1914-08-23T00:00:00", "World War I: - Japan declares war on Germany."], ["1914-08-26T00:00:00", "The German West African colony of Togoland (now Togo from 1960) surrenders to Britain and France."], ["1914-08-26T00:00:00", "Battle of Río de Oro: British Royal Navy protected cruiser HMS Highflyer forces the SS Kaiser Wilhelm der Grosse, sailing as an auxiliary cruiser, to scuttle."], ["1914-08-28T00:00:00", "Battle of Heligoland Bight: British cruisers under Admiral Beatty sink three German cruisers."], ["1914-09-01T00:00:00", "Saint Petersburg in Russia changes its name to Petrograd."], ["1914-09-01T00:00:00", "The last known passenger pigeon \"Martha\" dies in the Cincinnati Zoo."], ["1914-09-02T00:00:00", "World War I: The French village of Moronvilliers is occupied by the Germans."], ["1914-09-03T00:00:00", "Pope Benedict XV (Giacomo della Chiesa) succeeds Pope Pius X as the 258th pope."], ["1914-09-03T00:00:00", "William, Prince of Albania leaves the country after just six months due to opposition to his rule."], ["1914-09-05T00:00:00", "World War I: - London Agreement: No member of the Triple Entente (Britain, France, or Russia) may seek a separate peace with the Central Powers."], ["1914-09-05T00:00:00", "World War I: - First Battle of the Marne begins: Northeast of Paris, the French 6th Army under General Maunoury attacks German forces nearing Paris. Over two million fight (500,000 are killed/wounded) in the Allied victory. A French and British counterattack at the Marne ends the German advance on Paris."], ["1914-09-05T00:00:00", "World War I: - British Royal Navy scout cruiser HMS Pathfinder is sunk by German submarine U-21 in the Firth of Forth (Scotland), the first ship ever to be sunk by a locomotive torpedo fired from a submarine."], ["1914-09-07T00:00:00", "World War I: Turkey declares war on Belgium."], ["1914-09-08T00:00:00", "World War I: Private Thomas Highgate became the first British soldier to be executed for desertion during the War."], ["1914-09-13T00:00:00", "World War I: - Conclusion of Battle of Grand Couronné ends the Battle of the Frontiers with the north-east segment of the Western Front stabilizing."], ["1914-09-13T00:00:00", "World War I: - South African troops open hostilities in German South-West Africa (modern-day Namibia) with an assault on the Ramansdrift police station."], ["1914-09-15T00:00:00", "Maritz Rebellion of disaffected Boers against the government of the Union of South Africa begins."], ["1914-09-17T00:00:00", "World War I: Race to the Sea by opposing forces on the Western Front begins."], ["1914-09-17T00:00:00", "Andrew Fisher becomes Prime Minister of Australia for the third time."], ["1914-09-21T00:00:00", "World War I: British Imperial police forces capture Schuckmannsburg in the Caprivi Strip of German South-West Africa."], ["1914-09-22T00:00:00", "World War I: Action of 22 September 1914: German submarine U-9 torpedoes three British Royal Navy armoured cruisers, HMS Aboukir, Cressy and Hogue, with the death of more than 1,400 men, in the North Sea."], ["1914-09-25T00:00:00", "The Battle of Albert begins."], ["1914-09-26T00:00:00", "The United States Federal Trade Commission (FTC) is established by the Federal Trade Commission Act."], ["1914-09-28T00:00:00", "The First Battle of the Aisne ends indecisively."], ["1914-09-30T00:00:00", "The Flying Squadron of America is established to promote the temperance movement."], ["1914-10-03T00:00:00", "World War I: 25,000 Canadian troops depart for Europe."], ["1914-10-09T00:00:00", "World War I: Siege of Antwerp: Antwerp (Belgium) falls to German troops."], ["1914-10-14T00:00:00", "World War I: The Canadian Expeditionary Force arrives on 32 ocean liners in Plymouth Sound."], ["1914-10-19T00:00:00", "World War I: - First Battle of Ypres begins."], ["1914-10-19T00:00:00", "World War I: - Effective end of the Race to the Sea, with the Western Front reaching the Belgian coast."], ["1914-10-27T00:00:00", "World War I: The British super-dreadnought battleship HMS Audacious (23,400 tons), is sunk off Tory Island, north-west of Ireland, by a minefield laid by the armed German merchant-cruiser Berlin."], ["1914-10-27T00:00:00", "The Greek army occupies Northern Epirus with the approval of the Allies."], ["1914-10-28T00:00:00", "World War I: Battle of Penang, Malaya: The German cruiser Emden sinks a Russian cruiser and French destroyer before escaping."], ["1914-10-28T00:00:00", "Sentencing of participants in the Assassination of Archduke Franz Ferdinand of Austria at Sarajevo. Gavrilo Princip, being under 20 at the date of the assassination, cannot be given a death sentence and is given twenty years imprisonment."], ["1914-10-29T00:00:00", "World War I: Ottoman warships shell Russian Black Sea ports; Russia, France, and Britain declare war on November 1-November 5."], ["1914-10-31T00:00:00", "World War I: Battle of the Vistula River concludes in Russian victory over German and Austro-Hungarian forces around Warsaw."], ["1914-11-01T00:00:00", "World War I: Battle of Coronel: A Royal Navy squadron commanded by Rear-Admiral Sir Christopher Cradock is met in the eastern Pacific and defeated by superior German forces led by Vice-Admiral Maximilian von Spee, in the first British naval defeat of the war, resulting in the loss of HMS Good Hope and HMS Monmouth."], ["1914-11-05T00:00:00", "World War I: Britain and France declare war on Turkey. The United Kingdom annexes Cyprus, which it controls until 1960."], ["1914-11-05T00:00:00", "Alpha Phi Delta is founded as a Greek social fraternity at Syracuse University in the United States."], ["1914-11-07T00:00:00", "Siege of Tsingtao: The Japanese and British seize Jiaozhou Bay in China, the base of the German East Asia Squadron."], ["1914-11-09T00:00:00", "World War I: Battle of Cocos: The German cruiser Emden is sunk by the Australian cruiser Sydney."], ["1914-11-16T00:00:00", "A year after being created by passage of the Federal Reserve Act of 1913, the Federal Reserve Bank of the United States officially opens for business."], ["1914-11-21T00:00:00", "In New Haven, Connecticut the new Yale Bowl officially opens; Harvard defeats Yale 36-0 in the first football game held here."], ["1914-11-23T00:00:00", "U.S. troops withdraw from Veracruz. Venustiano Carranza's troops take over and Carranza makes the town his headquarters."], ["1914-11-24T00:00:00", "Benito Mussolini is expelled from the Italian Socialist Party."], ["1914-11-28T00:00:00", "World War I: Following a war-induced closure in July, the New York Stock Exchange re-opens for bond trading."], ["1914-12-02T00:00:00", "Serbian Campaign (World War I): Austro-Hungarian forces occupy Belgrade, Serbia."], ["1914-12-08T00:00:00", "World War I: Battle of the Falkland Islands: A superior British Royal Navy squadron under Doveton Sturdee defeats ships of the Imperial German Navy under Maximilian von Spee."], ["1914-12-12T00:00:00", "The New York Stock Exchange re-opens, having been closed since August 1 except for bond trading."], ["1914-12-15T00:00:00", "A gas explosion at the Mitsubishi Hojyo coal mine, Kyūshū, Japan, kills 687 (the worst coal mine disaster in Japanese history)."], ["1914-12-16T00:00:00", "World War I: Raid on Scarborough, Hartlepool and Whitby: Imperial German Navy battlecruisers attack English North Sea ports, resulting in 137 deaths."], ["1914-12-17T00:00:00", "President of the United States Woodrow Wilson signs the Harrison Narcotics Tax Act (initially introduced by Francis Burton Harrison)."], ["1914-12-18T00:00:00", "Egypt becomes a British protectorate."], ["1914-12-19T00:00:00", "Serbian Campaign (World War I): The Battle of Kolubara ends, resulting in a decisive Serbian victory over Austria-Hungary."], ["1914-12-19T00:00:00", "Mohandas Gandhi leaves England sailing for India on this date (accompanied by his wife Kasturba). He begins to learn the Bengali language whilst on board."], ["1914-12-24T00:00:00", "World War I: - Unofficial temporary Christmas truce between British and German soldiers on the Western Front begins."], ["1914-12-24T00:00:00", "World War I: - German air raid on Dover, England."], ["1914-12-25T00:00:00", "World War I: Cuxhaven Raid: British aircraft launched from warships attack the German port of Cuxhaven with submarine support, although little damage is caused."]]