[["1948-01-01T00:00:00", "General Agreement on Tariffs and Trade (GATT) inaugurated."], ["1948-01-01T00:00:00", "Railways of Britain are nationalized to form British Railways."], ["1948-01-01T00:00:00", "The Constitution of the Italian Republic goes into effect."], ["1948-01-01T00:00:00", "The latest Constitution of New Jersey goes into effect."], ["1948-01-04T00:00:00", "Burma gains its independence from the United Kingdom, becoming an independent republic, named the Union of Burma, with Sao Shwe Thaik as its first President and U Nu its first Prime Minister."], ["1948-01-05T00:00:00", "Warner Brothers shows the first color newsreel (Tournament of Roses Parade and the Rose Bowl)."], ["1948-01-12T00:00:00", "Mahatma Gandhi begins his fast-unto-death in Delhi to stop communal violence during the Partition of India."], ["1948-01-17T00:00:00", "A truce is declared between nationalist Indonesian and Dutch troops in Java."], ["1948-01-22T00:00:00", "British foreign secretary Ernest Bevin proposes the formation of a Western Union between Britain, France and the Benelux countries to stand up against the Soviet Union. The Treaty of Brussels is signed March 17 as a consequence, a predecessor to NATO."], ["1948-01-26T00:00:00", "Teigin poison case: a man masquerading as a doctor poisons 12 of 16 bank employees of the Tokyo branch of Imperial Bank and takes the money; artist Sadamichi Hirasawa is later sentenced to death for the crime, but is never executed."], ["1948-01-29T00:00:00", "The Pakistan Socialist Party is founded in Karachi."], ["1948-01-29T00:00:00", "Plane crash at Los Gatos Creek, near Coalinga, California, kills four US citizens and 28 deportees, commemorated in a protest song (\"Deportee (Plane Wreck at Los Gatos)\") by Woody Guthrie."], ["1948-01-30T00:00:00", "Assassination of Mahatma Gandhi: Indian pacifist and leader Mahatma Gandhi is shot by Nathuram Godse in New Delhi. Also on this day Orville Wright of the pioneering aviators the Wright Brothers dies in Dayton, Ohio."], ["1948-01-30T00:00:00", "1948 Winter Olympics open in St. Moritz, Switzerland."], ["1948-01-31T00:00:00", "The British crown colony of the Malayan Union, Penang and Malacca form the Federation of Malaya."], ["1948-02-01T00:00:00", "The Soviet Union begins to jam Voice of America broadcasts."], ["1948-02-01T00:00:00", "The proclamation of Federation of Malaya"], ["1948-02-04T00:00:00", "Ceylon (now Sri Lanka) becomes an independent kingdom within the British Commonwealth."], ["1948-02-16T00:00:00", "Miranda, the innermost moon of Uranus, is discovered by Gerard Kuiper."], ["1948-02-18T00:00:00", "Éamon de Valera, Irish head of government since 1932, loses power to an opposition coalition. John A. Costello is appointed Taoiseach by President Seán O'Kelly."], ["1948-02-19T00:00:00", "The Conference of Youth and Students of Southeast Asia Fighting for Freedom and Independence convenes in Calcutta."], ["1948-02-21T00:00:00", "The stock car racing organization NASCAR is founded by Bill France, Sr."], ["1948-02-25T00:00:00", "The Communist Party seizes control of Czechoslovakia, a day celebrated by that regime as \"Victorious February\" (Czech: Vítězný únor; Slovak: Víťazný Február) until November 1989."], ["1948-02-28T00:00:00", "Riots take place in Accra, capital of the British colony of Gold Coast, when a peaceful protest march by ex-servicemen was broken up by police, leaving several members of the group dead, among them Sergeant Adjetey, one of the leaders."], ["1948-03-08T00:00:00", "McCollum v. Board of Education: The United States Supreme Court rules that religious instruction in public schools violates the U.S. Constitution."], ["1948-03-12T00:00:00", "The Costa Rican Civil War begins."], ["1948-03-16T00:00:00", "The largest flood in the history of Brampton, Ontario, occurs."], ["1948-03-17T00:00:00", "Treaty of Brussels signed by Belgium, France, Luxembourg, the Netherlands and the United Kingdom, providing for economic, social and cultural collaboration and collective self-defence."], ["1948-03-17T00:00:00", "The Hells Angels motorcycle gang is founded in California."], ["1948-03-18T00:00:00", "The Round Table Conference in The Hague, Netherlands for the preparation of the decolonization process for Aruba and the other Dutch Colonies. Aruba presents the mandate of the Aruban People for Aruba to become an Independent Country, under the souvereignty of the House of Orange, based on Aruba's first state constitution presented officially since August 1947, and a (4th) Member State of the future Dutch Commonwealth."], ["1948-03-20T00:00:00", "Singapore holds its first elections."], ["1948-03-20T00:00:00", "Renowned Italian conductor Arturo Toscanini makes his television debut, conducting the NBC Symphony Orchestra in an all-Wagner program in the United States."], ["1948-03-20T00:00:00", "The 20th Academy Awards ceremony is held in Los Angeles. Gentleman's Agreement wins the Academy Award for Best Picture."], ["1948-04-01T00:00:00", "Physicists Ralph Asher Alpher and George Gamow publish the Alpher-Bethe-Gamow paper about the Big Bang."], ["1948-04-03T00:00:00", "United States President Harry S. Truman signs the Marshall Plan, which authorizes $5 billion in aid for 16 countries."], ["1948-04-03T00:00:00", "Jeju Uprising - residents revolt on Jeju island, South Korea, eventually leading to the deaths of between 14,000 and 30,000."], ["1948-04-03T00:00:00", "Beethoven's Symphony No. 9 is played on television in its entirety for the first time in a series of concerts featuring Arturo Toscanini conducting the NBC Symphony Orchestra in the United States. The chorus is conducted by Robert Shaw."], ["1948-04-05T00:00:00", "1947-48 Civil War in Mandatory Palestine: Haganah launches Operation Nachshon; beginning of the 1948 Palestinian exodus."], ["1948-04-07T00:00:00", "The World Health Organization is established by the United Nations."], ["1948-04-07T00:00:00", "A fire in a Buddhist monastery in Shanghai kills 20 monks."], ["1948-04-09T00:00:00", "Jorge Eliécer Gaitán's assassination provokes a violent riot in Bogotá (the Bogotazo), and a further 10 years of violence (La Violencia) across Colombia."], ["1948-04-09T00:00:00", "The Deir Yassin massacre takes place in British Mandatory Palestine."], ["1948-04-13T00:00:00", "The Hadassah medical convoy massacre takes place in British Mandatory Palestine."], ["1948-04-16T00:00:00", "The Organisation for Economic Co-operation and Development is founded as the Organisation for European Economic Co-operation (OEEC)."], ["1948-04-18T00:00:00", "Italian general election, 1948:: The first democratic general election with universal suffrage is held in Italy. The Christian Democracy party achieves a majority over the Popular Democratic Front Communist-Socialist coalition."], ["1948-04-19T00:00:00", "Burma joins the United Nations."], ["1948-04-24T00:00:00", "The Costa Rican Civil War ends."], ["1948-04-30T00:00:00", "Organization of American States (OAS) founded."], ["1948-04-30T00:00:00", "The English-built Land Rover is unveiled at the Amsterdam Motor Show."], ["1948-05-04T00:00:00", "Laurence Olivier's film version of Hamlet makes its world premiere in London."], ["1948-05-11T00:00:00", "Luigi Einaudi becomes President of the Italian Republic."], ["1948-05-14T00:00:00", "The Israeli Declaration of Independence is made."], ["1948-05-15T00:00:00", "1948 Arab-Israeli War: The British Mandate of Palestine is officially terminated; expeditionary forces from Egypt, Transjordan, Syria and Iraq invade Israel and clash with Israeli forces."], ["1948-05-15T00:00:00", "The murder of a 3-year-old girl in Blackburn, England leads to the fingerprinting of more than 40,000 men in the city in an attempt to find the murderer."], ["1948-05-16T00:00:00", "Chaim Weizmann is elected as the first President of Israel."], ["1948-05-18T00:00:00", "The first Legislative Yuan of the Republic of China officially convenes in Nanking."], ["1948-05-22T00:00:00", "The Soviets launched the largest Lithuanian deportation to Siberia."], ["1948-05-25T00:00:00", "The United Church of Christ in the Philippines (UCCP) was founded on this date at Ellinwood Malate Church in Manila, Philippines."], ["1948-05-26T00:00:00", "The U.S. Congress passes Public Law 557, which permanently establishes the Civil Air Patrol as the auxiliary of the United States Air Force."], ["1948-05-28T00:00:00", "Daniel François Malan defeats Jan Smuts and becomes Prime Minister of South Africa, ushering in the era of apartheid, which is finally dismantled by F. W. de Klerk in 1994."], ["1948-05-30T00:00:00", "A dike along the Columbia River breaks, obliterating Vanport, Oregon within minutes; 15 people die and tens of thousands are left homeless."], ["1948-06-03T00:00:00", "The Palomar Observatory telescope is finished in California."], ["1948-06-10T00:00:00", "Hasan Saka forms the new government of Turkey. (17th government; Hasan Saka had served twice as a prime minister)"], ["1948-06-11T00:00:00", "The first monkey astronaut, Albert I, is launched into space from White Sands, New Mexico."], ["1948-06-16T00:00:00", "Communist guerrillas kill 3 rubber planters in Malaya."], ["1948-06-16T00:00:00", "Three armed men hijack the Cathay Pacific passenger plane Miss Macao and shoot the pilot; the plane crashes, killing 26 of 27 people on board."], ["1948-06-17T00:00:00", "A Douglas DC-6 carrying United Airlines Flight 624 crashes near Mount Carmel, Pennsylvania, killing all 43 people on board."], ["1948-06-18T00:00:00", "Malayan Emergency: A state of emergency is declared in the Malayan Union due to a communist insurgency."], ["1948-06-18T00:00:00", "LP record - Columbia Records introduced its long playing 33 1/3 rpm phonograph format."], ["1948-06-20T00:00:00", "The U.S. Congress recesses for the remainder of 1948, after an overtime session closes at 7:00 a.m. D.C. time (to be shortly interrupted by Truman's recall from Congressional recess for July 20, 1948)."], ["1948-06-21T00:00:00", "The Deutsche Mark becomes official currency of the future Federal Republic of Germany."], ["1948-06-22T00:00:00", "The ship MV Empire Windrush brings a large group of Afro-Caribbean immigrants to Tilbury near London, the start of a large wave of immigration to Britain."], ["1948-06-24T00:00:00", "Cold War: The Berlin Blockade begins."], ["1948-06-24T00:00:00", "The first World Health Assembly of the World Health Organization is held in Geneva."], ["1948-06-26T00:00:00", "William Shockley files the original patent for the grown-junction transistor, the first bipolar junction transistor."], ["1948-06-28T00:00:00", "The Cominform Resolution marks the beginning of the Informbiro period in Yugoslavia and the Soviet/Yugoslav split."], ["1948-06-28T00:00:00", "David Lean's Oliver Twist, based on Charles Dickens's famous novel, premieres in the UK. It is banned for 3 years in the U.S. because of alleged antisemitism in depicting master criminal Fagin, played by Alec Guinness."], ["1948-06-28T00:00:00", "1948 Fukui earthquake strikes Fukui, Japan. 3,769 dead, 22,203 injured."], ["1948-07-05T00:00:00", "The National Health Service Acts are enacted in United Kingdom."], ["1948-07-06T00:00:00", "The world's first Air Car-ferry service is flown by a Bristol Freighter of Silver City Airways from Lympne to Le Touquet."], ["1948-07-13T00:00:00", "The Coptic Orthodox Church of Alexandria and Ethiopian Orthodox Tewahedo Churches reach an agreement leading to the promotion of the Ethiopian church to the rank of an autocephalous Patriarchate. Five bishops are immediately consecrated by the Patriarch of Alexandria, and the successor to Abuna Qerellos IV is granted the power to consecrate new bishops, who are empowered to elect a new Patriarch for their church."], ["1948-07-15T00:00:00", "Attempted assassination of Palmiro Togliatti, general secretary of the Italian Communist Party results in numerous strikes all over the country."], ["1948-07-15T00:00:00", "First London chapter of Alcoholics Anonymous is founded."], ["1948-07-20T00:00:00", "Cold War: - President Harry S. Truman issues the second peacetime military draft in the United States, amid increasing tensions with the Soviet Union (the first peacetime draft occurred in 1940 under President Roosevelt)"], ["1948-07-20T00:00:00", "Cold War: - Eugene Dennis, William Z. Foster, and ten other CPUSA leaders are arrested and charged under the Alien Registration Act"], ["1948-07-22T00:00:00", "The Dominion of Newfoundland votes to join Canada after a referendum."], ["1948-07-24T00:00:00", "A great oil fire breaks out in the harbor of Naantali, Finland."], ["1948-07-26T00:00:00", "U.S. President Truman signs Executive Order 9981, ending racial segregation in the United States Armed Forces."], ["1948-07-28T00:00:00", "Around 200 die in explosion at a chemical plant in Ludwigshafen, Germany."], ["1948-07-29T00:00:00", "The 1948 Summer Olympics begin in London, the first since the 1936 Summer Olympics"], ["1948-07-31T00:00:00", "- At Idlewild Field in New York, New York International Airport (later renamed John F. Kennedy International Airport) is dedicated"], ["1948-07-31T00:00:00", "- Elizabeth Bentley appears under subpoena before HUAC regarding Communist espionage; implicates Whittaker Chambers"], ["1948-08-01T00:00:00", "The U.S. Air Force Office of Special Investigations is founded."], ["1948-08-03T00:00:00", "Whittaker Chambers appears under subpoena before HUAC and alleges that several former U.S. Federal official were communists, including Harry Dexter White and Alger Hiss"], ["1948-08-05T00:00:00", "Alger Hiss appears before HUAC to deny the allegations of Whittaker Chambers"], ["1948-08-10T00:00:00", "August 23 - The Herrenchiemsee Convent prepares the draft for the Basic Law for the Federal Republic of Germany"], ["1948-08-13T00:00:00", "Harry Dexter White and Donald Hiss refute allegations of Communism by Whittaker Chambers before HUAC"], ["1948-08-14T00:00:00", "1948 Ashes series: The Australian batsman Don Bradman, playing his last Test cricket match, against England at The Oval, is bowled by Eric Hollies for a duck; however, \"The Invincibles\" win the match by an innings and 149 runs, and The Ashes 4-0."], ["1948-08-15T00:00:00", "The southern half of Korea is established as South Korea."], ["1948-08-16T00:00:00", "Babe Ruth dies in his sleep at the age of 53."], ["1948-08-17T00:00:00", "HUAC holds a private session between Alger Hiss and Whittaker Chambers"], ["1948-08-18T00:00:00", "Danube Commission created by Belgrade Convention (enters into force 11 May 1949)."], ["1948-08-20T00:00:00", "Lee Pressman, Nathan Witt, and John Abt, represented by Harold I. Cammer, plead the Fifth Amendment in response to allegations of Communism by Whittaker Chambers before HUAC"], ["1948-08-23T00:00:00", "The World Council of Churches is established."], ["1948-08-24T00:00:00", "The first meeting of the charter members of the American Chamber of Commerce in Japan (ACCJ) is held."], ["1948-08-25T00:00:00", "HUAC holds its first-ever televised congressional hearing, featuring \"Confrontation Day\" between Whittaker Chambers and Alger Hiss"], ["1948-08-27T00:00:00", "Whittaker Chambers states that Alger Hiss was a communist on Meet the Press radio"], ["1948-09-04T00:00:00", "Queen Wilhelmina of the Netherlands abdicates for health reasons."], ["1948-09-05T00:00:00", "Robert Schuman becomes Prime Minister of France."], ["1948-09-06T00:00:00", "Juliana is formally inaugurated as Queen of the Netherlands."], ["1948-09-09T00:00:00", "The northern half of Korea is formally declared North Korea, with Kim Il-sung as prime minister."], ["1948-09-11T00:00:00", "Quaid-e-Azam Muhammad Ali Jinnah, founder and first Governor-General of Pakistan, dies. Pakistan is in a state of shock as it mourns the departure of the father of the nation. The day is a public holiday nation-wide."], ["1948-09-12T00:00:00", "The State of Hyderabad is invaded by the Indian Army on the day after Pakistani leader Jinnah's death, to assist damage control. Operation Polo leads to the independence of Hyderabad state and its amalgamation into the Indian union."], ["1948-09-17T00:00:00", "Lehi members, also known as the Stern Gang, assassinate Swedish count Folke Bernadotte, United Nations Mediator in Palestine, in Jerusalem."], ["1948-09-20T00:00:00", "Establishment of the city Rabwah, Pakistan"], ["1948-09-27T00:00:00", "Alger Hiss files a slander suit against Whittaker Chambers for his August 27 radio statement"], ["1948-09-29T00:00:00", "Laurence Olivier's Hamlet opens in the United States."], ["1948-10-06T00:00:00", "The 1948 Ashgabat earthquake kills 110,000."], ["1948-10-10T00:00:00", "R-1 missile on test becomes the first Soviet launch to enter space."], ["1948-10-16T00:00:00", "The 57th Street Art Fair, the oldest juried art fair in the American Midwest, is founded."], ["1948-10-26T00:00:00", "Killer smog settles into Donora, Pennsylvania."], ["1948-10-28T00:00:00", "The massacre of Dawaymeh begins."], ["1948-11-01T00:00:00", "Foley Square trial of Eugene Dennis and ten other CPUSA leaders begins in New York City"], ["1948-11-02T00:00:00", "United States presidential election, 1948: Democratic incumbent Harry S. Truman defeats Republican Thomas E. Dewey and \"Dixiecrat\" Strom Thurmond."], ["1948-11-12T00:00:00", "In Tokyo, an international war crimes tribunal sentences seven Japanese military and government officials to death, including General Hideki Tojo, for their roles in World War II."], ["1948-11-15T00:00:00", "Louis Stephen St. Laurent becomes Canada's 12th prime minister."], ["1948-11-16T00:00:00", "Operation Magic Carpet to transport Jews from Yemen to Israel begins."], ["1948-11-16T00:00:00", "The University of the Andes (Universidad de los Andes) is founded in Bogotá, Colombia."], ["1948-11-17T00:00:00", "- Mohammad Reza Shah Pahlavi divorces his second wife, the former Princess Fawzia of Egypt."], ["1948-11-17T00:00:00", "- Whittaker Chambers produces secret government papers handwritten and typewritten by Alger Hiss during pretrial examination."], ["1948-11-20T00:00:00", "Geoffrey B. Orbell rediscovers the Takahē, last seen 50 years previously, near Lake Te Anau, New Zealand."], ["1948-11-24T00:00:00", "In Venezuela, president Rómulo Gallegos is ousted by a military junta."], ["1948-11-27T00:00:00", "The Calgary Stampeders defeat the Ottawa Rough Riders 12-7 before 20,013 fans at Toronto's Varsity Stadium to capture their first Grey Cup and complete the only perfect season to date in Canadian Football."], ["1948-12-01T00:00:00", "José Figueres Ferrer abolishes the army in Costa Rica, making it the first country in history to do so"], ["1948-12-02T00:00:00", "HUAC subpoenas and retrieves the \"Pumpkin Papers\" from the farm of Whittaker Chambers"], ["1948-12-06T00:00:00", "Richard Nixon parades microfilm from the \"Pumpkin Papers\" to the press"], ["1948-12-10T00:00:00", "The United Nations General Assembly adopts the Universal Declaration of Human Rights"], ["1948-12-15T00:00:00", "The United States Department of Justice indicts Alger Hiss on two counts of perjury"], ["1948-12-20T00:00:00", "Laurence Duggan falls to his death from the 16th storey window of his Manhattan office"], ["1948-12-26T00:00:00", "The last Soviet troops withdraw from North Korea"], ["1948-12-28T00:00:00", "A Muslim Brotherhood member assassinates Egyptian Prime Minister Mahmud Fahmi Nokrashi"], ["1948-12-30T00:00:00", "The musical Kiss Me, Kate opens for the first of 1,077 performances"], ["1948-12-31T00:00:00", "1948 Arab-Israeli War: Israeli troops drive the Egyptians from Negev"]]