[["1944-01-02T00:00:00", "WWII: - Free French General Jean de Lattre de Tassigny is appointed to command French Army B, part of the Sixth United States Army Group in North Africa."], ["1944-01-02T00:00:00", "WWII: - Landing at Saidor: 13,000 US and Australian troops land on Papua New Guinea in an attempt to cut off a Japanese retreat."], ["1944-01-08T00:00:00", "WWII: Philippine Commonwealth troops enter the province of Ilocos Sur in northern Luzon and attack Japanese forces."], ["1944-01-11T00:00:00", "President of the United States Franklin D. Roosevelt proposes a Second Bill of Rights for social and economic security in his State of the Union address."], ["1944-01-11T00:00:00", "Nazi German administration expandend Kraków-Płaszów concentration camp into larger and standalone 'Konzentrationslager Plaszow bei Krakau'."], ["1944-01-12T00:00:00", "Winston Churchill and Charles de Gaulle begin a 2-day wartime conference in Marrakech. - Battle of Monte Cassino: U.S. Fifth Army commanded by Lieutenant-General Mark W. Clark arrive on the River Garigliano and begin their attack against the Gustav Line south of Rome. The French Expeditionary Corps under command of General Alphonse Juin moves into the mountains north of Monte Cassino."], ["1944-01-14T00:00:00", "WWII: Soviet troops start the offensive at Leningrad and Novgorod."], ["1944-01-15T00:00:00", "WWII: The 27th Polish Home Army Infantry Division is re-created, marking the start of Operation Tempest by the Polish Home Army."], ["1944-01-15T00:00:00", "1944 San Juan earthquake: An earthquake hits San Juan, Argentina, killing an estimated 10,000 people in the worst natural disaster in Argentina's history."], ["1944-01-17T00:00:00", "WWII: - British forces in Italy cross the Garigliano river."], ["1944-01-17T00:00:00", "WWII: - The Battle of Monte Cassino begins in Italy."], ["1944-01-17T00:00:00", "WWII: - The Soviet Union ceases production of the Mosin-Nagant 1891/30 sniper rifle."], ["1944-01-17T00:00:00", "WWII: - Meat rationing ends in Australia."], ["1944-01-20T00:00:00", "WWII: - The Royal Air Force drops 2,300 tons of bombs on Berlin."], ["1944-01-20T00:00:00", "WWII: - The United States 36th Infantry Division, in Italy, attempts to cross the Rapido River."], ["1944-01-22T00:00:00", "WWII: Operation Shingle: The Allies begin the assault on Anzio, Italy. The U.S. 45th Infantry Division stand their ground at Anzio against violent assaults for 4 months."], ["1944-01-27T00:00:00", "WWII: The 2-year Siege of Leningrad is lifted."], ["1944-01-29T00:00:00", "WWII: - Koniuchy massacre: Soviet and Jewish partisans kill at least 38 villagers in Koniuchy, Poland (modern-day Kaniūkai, Lithuania)."], ["1944-01-29T00:00:00", "WWII: - Light cruiser HMS Spartan (95) is sunk by a Henschel Hs 293 guided missile from a German aircraft off Anzio, western Italy, with the loss of 46."], ["1944-01-30T00:00:00", "WWII - The Battle of Cisterna opens as United States Army Rangers attempt to break out of the Anzio beachhead."], ["1944-01-30T00:00:00", "WWII - United States troops invade Majuro, Marshall Islands."], ["1944-01-31T00:00:00", "WWII: Battle of Kwajalein: American forces land on Kwajalein Atoll and other islands in the Japanese-held Marshall Islands."], ["1944-02-01T00:00:00", "WWII: Pacific War - United States troops land in the Marshall Islands."], ["1944-02-02T00:00:00", "The first issue of Human Events is published in Washington, D.C.."], ["1944-02-03T00:00:00", "WWII: United States troops capture the Marshall Islands."], ["1944-02-07T00:00:00", "WWII: At Anzio, German forces launch a counteroffensive."], ["1944-02-08T00:00:00", "WWII: - 2,765 drown when USS Snook torpedoes Lima Maru."], ["1944-02-08T00:00:00", "WWII: - 2,670 drown when HMS Sportsman torpedoes Petrella."], ["1944-02-14T00:00:00", "WWII: An anti-Japanese revolt breaks out on Java."], ["1944-02-15T00:00:00", "WWII - Battle of Monte Cassino: The monastery atop Monte Cassino is destroyed by Allied bombing."], ["1944-02-17T00:00:00", "WWII: Pacific War - The Battle of Eniwetok begins when U.S. forces invade the atoll in the Marshall Islands."], ["1944-02-18T00:00:00", "WWII: HMS Penelope torpedoed by the German U-boat. 417 of the crew, including the captain, went down with the ship; 206 survived."], ["1944-02-20T00:00:00", "WWII: - The \"Big Week\" begins with American bomber raids on German aircraft manufacturing centers."], ["1944-02-20T00:00:00", "WWII: - The United States takes Eniwetok Island."], ["1944-02-22T00:00:00", "United States Strategic Air Forces in Europe organized from the Eighth Air Force's strategic planning staff; subsuming strategic planning for all US Army Air Forces in Europe and Africa."], ["1944-02-23T00:00:00", "WWII - The Chechen and Ingush are forcibly deported to Central Asia."], ["1944-02-23T00:00:00", "WWII - Battle of Eniwetok concludes when U.S. forces secure the last islands in the Eniwetok Atoll."], ["1944-02-24T00:00:00", "WWII: 7,998 drown when USS Rasher torpedoes Ryusei Maru and Tango Maru."], ["1944-02-26T00:00:00", "Kurt Gerron begins shooting the Nazi propaganda film, Theresienstadt in Theresienstadt concentration camp. He and many others who featured in it are transferred to Auschwitz and gassed upon the film's completion."], ["1944-02-26T00:00:00", "First woman appointed to the substantive rank of captain in the United States Navy Nurse Corps, Sue S. Dauser."], ["1944-02-29T00:00:00", "WWII: Pacific War - Admiralty Islands campaign (Operation Brewer) opens when U.S. forces land on Los Negros Island in the Admiralty Islands."], ["1944-03-01T00:00:00", "WWII: - USS Tarawa and USS Kearsarge are laid down."], ["1944-03-01T00:00:00", "WWII: - An anti-fascist strike begins in northern Italy."], ["1944-03-01T00:00:00", "WWII: - 2,495 drown when USS Trout torpedoes Sakito Maru."], ["1944-03-02T00:00:00", "Balvano train disaster: A train stalls inside a railway tunnel outside Salerno, Italy; 521 choke to death."], ["1944-03-02T00:00:00", "The 16th Academy Awards ceremony is held, the first Oscar ceremony held at a large public venue, Grauman's Chinese Theatre in Hollywood. Casablanca (directed by Michael Curtiz), wins the Best Picture award."], ["1944-03-03T00:00:00", "WWII: The Order of Nakhimov and the Order of Ushakov are instituted in the USSR."], ["1944-03-04T00:00:00", "In Ossining, New York, Louis Buchalter, the leader of 1930s crime syndicate Murder, Inc., is executed at Sing Sing, along with Emanuel Weiss, and Louis Capone."], ["1944-03-06T00:00:00", "WWII: Soviet Army planes attack Narva, Estonia, destroying almost the entire old town."], ["1944-03-09T00:00:00", "WWII: Soviet Army planes attack Tallinn, Estonia."], ["1944-03-10T00:00:00", "In Britain, the prohibition on married women working as teachers is lifted."], ["1944-03-10T00:00:00", "Resistance leader Joop Westerweel is arrested while returning to the Netherlands having escorted a group of Jewish children to safety in Spain."], ["1944-03-12T00:00:00", "WWII: the Political Committee of National Liberation is created in Greece."], ["1944-03-15T00:00:00", "WWII: Battle of Monte Cassino: Allied aircraft bomb the monastery and an assault is staged."], ["1944-03-15T00:00:00", "WWII: The National Council of the French Resistance approves the Resistance programme."], ["1944-03-15T00:00:00", "In Sweden, the 1864 law which had criminalized homosexuality is abolished."], ["1944-03-17T00:00:00", "WWII: The Nazis execute almost 400 prisoners, Soviet citizens and anti-fascist Romanians at Rîbnița."], ["1944-03-18T00:00:00", "The last eruption of Mount Vesuvius in Italy kills 26 and causes thousands to flee their homes."], ["1944-03-19T00:00:00", "WWII: German forces occupy Hungary in Operation Margarethe."], ["1944-03-20T00:00:00", "WWII: RAF Flight Sergeant Nicholas Alkemade's bomber is hit over Germany, and he has to bail out without a parachute from a height of over 4,000 meters. Tree branches interrupt his fall and he lands safely on deep snow."], ["1944-03-23T00:00:00", "WWII: Members of the Italian Resistance attack Nazis marching in Via Rasella, killing 33."], ["1944-03-24T00:00:00", "WWII: - Ardeatine massacre: 335 Italians are killed, including 75 Jews and over 200 members of the Italian Resistance from various groups, in Rome."], ["1944-03-24T00:00:00", "WWII: - In the Polish village of Markowa, German police kill Józef and Wiktoria Ulm, their six children and eight Jews they were hiding."], ["1944-03-24T00:00:00", "WWII: - The \"Great Escape\": 76 Royal Air Force prisoners of war escape by tunnel \"Harry\" from Stalag Luft III this night. Only three men, two Norwegians and a Dutchman, return to the UK; of those recaptured, fifty are executed."], ["1944-04-02T00:00:00", "WWII: Ascq massacre members of the 12th SS Panzer Division Hitlerjugend shoot 85 civilians suspected of blowing up their train on its approach to the Gare d'Ascq in France."], ["1944-04-04T00:00:00", "WWII: An Allied surveillance aircraft of 60 Squadron SAAF photographs part of Auschwitz concentration camp."], ["1944-04-05T00:00:00", "Rudolf Vrba and Alfréd Wetzler escape from Auschwitz concentration camp."], ["1944-04-14T00:00:00", "Bombay Explosion: The freighter SS Fort Stikine, carrying a mixed cargo of ammunition, cotton bales and gold, explodes in harbour at Bombay (India), sinking surrounding ships and killing around 800 people."], ["1944-04-19T00:00:00", "WWII: The Japanese launch the Operation Ichi-Go offensive in central and south China."], ["1944-04-25T00:00:00", "The Holocaust: SS-Obersturmbannführer Adolf Eichmann opens \"blood for goods\" negotiations with Joel Brand to offer the release of thousands of Jews from eastern Europe to the Hungarian Aid and Rescue Committee in exchange for supplies for the German Eastern Front."], ["1944-04-25T00:00:00", "The United Negro College Fund is incorporated in the U.S."], ["1944-04-26T00:00:00", "Kidnap of General Kreipe on Crete, Greece."], ["1944-04-26T00:00:00", "WWII: 2,649 drown when USS Jack torpedoes Yoshida Maru."], ["1944-04-28T00:00:00", "WWII: Allied convoy T4, forming part of amphibious Exercise Tiger (a full-scale rehearsal for the Normandy landings) in Start Bay off the Devon coast of England, is attacked by E-boats, resulting in the deaths of 749 American servicemen from LSTs."], ["1944-05-01T00:00:00", "WWII: Two hundred Communist prisoners are shot by the Germans at Kaisariani in Athens, Greece in reprisal for the killing of General Franz Krech by partisans at Molaoi."], ["1944-05-05T00:00:00", "WWII: Mohandas Gandhi is released in India."], ["1944-05-09T00:00:00", "WWII: In the Ukrainian city of Sevastopol, Soviet troops completely drive out German forces, who had been ordered by Hitler to “fight to the last man.”"], ["1944-05-12T00:00:00", "WWII: Soviet troops finalize the liberation of the Crimea."], ["1944-05-14T00:00:00", "The Holocaust: Predominantly Muslim Albanian troops of the 21st Waffen Mountain Division of the SS Skanderbeg (1st Albanian) round up 281 Jews in Pristina and hand them over to the Germans for transportation to Bergen-Belsen concentration camp."], ["1944-05-18T00:00:00", "WWII: - Battle of Monte Cassino: The Germans evacuate Monte Cassino and Allied forces led by Władysław Anders from Polish II Corps, take the stronghold after a struggle that has claimed 20,000 lives."], ["1944-05-18T00:00:00", "WWII: - Deportation of the Crimean Tatars by the government of the Soviet Union."], ["1944-05-24T00:00:00", "WWII: Six LSTs are accidentally destroyed and 163 men killed in Pearl Harbor's West Loch disaster."], ["1944-05-30T00:00:00", "Princess Charlotte Louise Juliette Louvet Grimaldi of Monaco, heir to the throne, resigns from her rights in favor of her son Prince Rainier Louis Henri Maxence Bertrand Grimaldi, later reigning Prince Rainier III of Monaco."], ["1944-05-31T00:00:00", "WWII: Destroyer escort USS England (DE-635) sinks the sixth Japanese submarine in two weeks. This anti-submarine warfare performance remains unmatched through the twentieth century."], ["1944-06-01T00:00:00", "WWII: The BBC transmits a coded message (the first line of the poem \"Chanson d'automne\" by Paul Verlaine) to the French Resistance, warning that the invasion of Europe is imminent."], ["1944-06-01T00:00:00", "Two K-class blimps of the United States Navy complete the first transatlantic crossing by non-rigid airships, from the U.S. to French Morocco with two stops."], ["1944-06-02T00:00:00", "WWII: The provisional French government is established."], ["1944-06-03T00:00:00", "Hans Asperger publishes his paper on Asperger syndrome."], ["1944-06-04T00:00:00", "WWII: - Rome falls to the Allies, the first Axis capital to fall."], ["1944-06-04T00:00:00", "WWII: - A hunter-killer group of the United States Navy captures the German submarine U-505, marking the first time a U.S. Navy vessel has captured an enemy vessel at sea since the 19th century. Some significant intelligence data is acquired."], ["1944-06-05T00:00:00", "WWII: - The German navy's Enigma messages are decoded almost in real time."], ["1944-06-05T00:00:00", "WWII: - British Group Captain James Stagg correctly forecasts a brief improvement in weather conditions over the English Channel which will permit the following day's Normandy landings to take place (having been deferred from today due to unfavourable weather)."], ["1944-06-05T00:00:00", "WWII: - At 10:15 p.m. local time, the BBC transmits the second line of the Paul Verlaine poem to the French Resistance, indicating that the invasion of Europe is about to begin."], ["1944-06-05T00:00:00", "WWII: - More than 1,000 British bombers drop 5,000 tons of bombs on German gun batteries on the Normandy coast in preparation for D-Day."], ["1944-06-05T00:00:00", "WWII: - US and British paratrooper divisions jump over Normandy, in preparation for D-Day, including 82nd and 101st Airborne divisions of the United States."], ["1944-06-05T00:00:00", "WWII: - D-Day naval deceptions are launched."], ["1944-06-06T00:00:00", "WWII - D-Day: 155,000 Allied troops shipped from England land on the beaches of Normandy in northern France, beginning Operation Overlord and the Invasion of Normandy. The Allied soldiers quickly break through the Atlantic Wall and push inland, in the largest amphibious military operation in history. This operation helps liberate France from Germany, and also weakens the Nazi hold on Europe."], ["1944-06-07T00:00:00", "WWII: - The steamer Danae (Greek: Δανάη), carrying 600 Cretans including 350 Greek Jews on the first leg of the journey to Auschwitz, is sunk, with no known survivors, off Santorini."], ["1944-06-07T00:00:00", "WWII: - Joel Brand is intercepted by British agents in Aleppo."], ["1944-06-07T00:00:00", "WWII: - Bayeux is liberated by British troops."], ["1944-06-09T00:00:00", "WWII: Soviet leader Joseph Stalin launches the Vyborg-Petrozavodsk Offensive against Finland, with the intent of defeating Finland before pushing for Berlin."], ["1944-06-10T00:00:00", "WWII: 642 men, women and children are killed in the Oradour-sur-Glane Massacre in France."], ["1944-06-13T00:00:00", "WWII: Germany launches the first V-1 flying bomb attack on London."], ["1944-06-15T00:00:00", "WWII: Battle of Saipan: United States forces land on Saipan."], ["1944-06-16T00:00:00", "At age 14, George Stinney becomes the youngest person ever executed in the United States."], ["1944-06-17T00:00:00", "Iceland declares full independence from Denmark."], ["1944-06-19T00:00:00", "A severe storm badly damages the Mulberry harbours on the Normandy coast."], ["1944-06-22T00:00:00", "WWII: - Operation Bagration: A general attack by Soviet forces clears the German forces from Belarus, resulting in the destruction of German Army Group Centre, possibly the greatest defeat of the Wehrmacht during WWII."], ["1944-06-22T00:00:00", "WWII: - Burma Campaign: The Battle of Kohima ends in a British victory."], ["1944-06-24T00:00:00", "David Ben-Gurion presents the One Million Plan to the Jewish Agency for Israel, proposing a million-strong Jewish exodus from Arab and Muslim countries as well as from Europe to Mandatory Palestine."], ["1944-06-25T00:00:00", "WWII - The Battle of Tali-Ihantala (the largest battle ever in the Nordic countries) begins between Finnish and Soviet troops. Finland is able to resist the attack and thus manages to stay as an independent nation."], ["1944-06-25T00:00:00", "WWII - Bombardment of Cherbourg by ships of the United States Navy and British Royal Navy in support of U.S. ground troops."], ["1944-06-26T00:00:00", "WWII: American troops enter Cherbourg."], ["1944-06-29T00:00:00", "WWII: 5,400 drown when USS Sturgeon torpedoes Toyama Maru."], ["1944-06-30T00:00:00", "WWII: 3,219 drown when USS Tang torpedoes Nikkin Maru."], ["1944-07-01T00:00:00", "The United Nations Monetary and Financial Conference begins at Bretton Woods, New Hampshire, United States."], ["1944-07-03T00:00:00", "WWII: - Soviet troops liberate Minsk."], ["1944-07-03T00:00:00", "WWII: - Battle of Imphal: Japanese forces call off their advance, ending the battle with a British victory."], ["1944-07-06T00:00:00", "Hartford circus fire: More than 100 children die in one of the worst fire disasters in the history of the United States."], ["1944-07-06T00:00:00", "WWII: At Camp Hood, Texas, future baseball star and 1st Lt. Jackie Robinson is arrested and later court-martialed for refusing to move to the back of a segregated U.S. Army bus. He is eventually acquitted."], ["1944-07-09T00:00:00", "WWII: British and Canadian forces capture Caen."], ["1944-07-10T00:00:00", "WWII: Soviet troops begin operations to liberate the Baltic countries."], ["1944-07-13T00:00:00", "WWII: Vilnius is freed by USSR."], ["1944-07-16T00:00:00", "WWII: The first contingent of the Brazilian Expeditionary Force arrives in Italy."], ["1944-07-17T00:00:00", "WWII: - The largest convoy of the war embarks from Halifax, Nova Scotia, under Royal Canadian Navy protection."], ["1944-07-17T00:00:00", "WWII: - The SS E. A. Bryan, loaded with ammunition, explodes at the Port Chicago naval base; 320 are killed."], ["1944-07-18T00:00:00", "WWII: - American forces push back the Germans in Saint-Lô, capturing the city."], ["1944-07-18T00:00:00", "WWII: - British forces launch Operation Goodwood, an armoured offensive aimed at driving the Germans from the high ground to the south of Caen. The offensive ends 2 days later with minimal gains."], ["1944-07-18T00:00:00", "WWII: - Hideki Tōjō resigns as Prime Minister of Japan due to numerous setbacks in the war effort and is succeeded (on July 22) by Kuniaki Koiso."], ["1944-07-20T00:00:00", "WWII: Adolf Hitler survives an assassination attempt led by Claus von Stauffenberg."], ["1944-07-21T00:00:00", "WWII: - Battle of Guam: American troops land on Guam (the battle ends August 10)."], ["1944-07-21T00:00:00", "WWII: - The Polish Committee of National Liberation is created."], ["1944-07-22T00:00:00", "The Bretton Woods Conference ends with agreements signed to set up the International Bank for Reconstruction and Development, General Agreement on Tariffs and Trade and International Monetary Fund."], ["1944-07-22T00:00:00", "United States v. Masaaki Kuwabara, the only Japanese American draft avoidance case to be dismissed on a due process violation of the U.S. Constitution."], ["1944-07-25T00:00:00", "WWII - Operation Spring: One of the bloodiest days for Canadian forces during the war results in 1,550 casualties, including 450 killed, during the Normandy Campaign."], ["1944-07-25T00:00:00", "WWII - Beginning of the Battle of Tannenberg Line or the \"Battle of the Blue Hills\" in Northeastern Estonia, where the Red Army will result in a Pyrrhic victory by 10 August."], ["1944-07-26T00:00:00", "WWII: A Messerschmitt Me 262 becomes the first jet fighter aircraft to have an operational victory."], ["1944-07-31T00:00:00", "WWII: 2,495 drown when USS Parche torpedoes Yoshino Maru."], ["1944-08-01T00:00:00", "WWII: The Warsaw Uprising begins."], ["1944-08-02T00:00:00", "WWII: - Turkey ends diplomatic and economic relations with Germany."], ["1944-08-02T00:00:00", "WWII: - The First Assembly of ASNOM (the Anti-Fascist Assembly for the People's Liberation of Macedonia) is held in the Prohor Pčinjski monastery."], ["1944-08-03T00:00:00", "The Education Act in the United Kingdom, promoted by Rab Butler, creates a Tripartite system of education in England, Wales and Northern Ireland."], ["1944-08-04T00:00:00", "The Holocaust: A tip from a Dutch informer leads the Gestapo to a sealed-off area in an Amsterdam warehouse, where they find Jewish diarist Anne Frank, her family, and others in hiding. All would die in the Holocaust except for Otto Frank, Anne's father."], ["1944-08-05T00:00:00", "WWII: - The Warsaw Uprising:\nThe Wola massacre begins. Between now and August 12, thousands of Polish civilians will be indiscriminately killed by occupying SS troops.\nThe Holocaust: Polish insurgents liberate a German labor camp in Warsaw, freeing 348 Jewish prisoners.\n"], ["1944-08-05T00:00:00", "WWII: - The Wola massacre begins. Between now and August 12, thousands of Polish civilians will be indiscriminately killed by occupying SS troops."], ["1944-08-05T00:00:00", "WWII: - The Holocaust: Polish insurgents liberate a German labor camp in Warsaw, freeing 348 Jewish prisoners."], ["1944-08-05T00:00:00", "WWII: - Cowra breakout: Over 500 Japanese prisoners of war attempt a mass breakout from the Cowra camp in Australia. In the ensuing manhunt, 231 Japanese escapees and four Australian soldiers are killed."], ["1944-08-07T00:00:00", "IBM dedicates the first program-controlled calculator, the Automatic Sequence Controlled Calculator (known best as the Harvard Mark I)."], ["1944-08-09T00:00:00", "The United States Forest Service and the Wartime Advertising Council release posters featuring Smokey Bear for the first time."], ["1944-08-12T00:00:00", "WWII: - The Allies capture Florence, Italy."], ["1944-08-12T00:00:00", "WWII: - Operation Pluto: The world's first undersea oil pipeline is laid between England and France."], ["1944-08-15T00:00:00", "WWII: Operation Dragoon lands Allies in southern France. The U.S. 45th Infantry Division participates in its fourth assault landing at Sainte-Maxime, spearheading the drive for the Belfort Gap."], ["1944-08-18T00:00:00", "WWII: Submarine USS Rasher sinks Teia Maru, Eishin Maru, Teiyu Maru, and carrier Taiyō from Japanese convoy HI71 in one of the most effective American \"wolfpack\" attacks of the war."], ["1944-08-19T00:00:00", "WWII: - More than 4,400 Japanese seamen drown when USS Spadefish torpedoes Tamatsu Maru."], ["1944-08-19T00:00:00", "WWII: - An insurrection starts in Paris."], ["1944-08-20T00:00:00", "WWII: - American forces successfully defeat Nazi forces at Chambois, closing the Falaise Gap."], ["1944-08-20T00:00:00", "WWII: - 168 captured allied airmen, including Phil Lamason, accused of being \"terror fliers\" by the Gestapo, arrive at Buchenwald concentration camp."], ["1944-08-21T00:00:00", "Dumbarton Oaks Conference (Washington Conversations on International Peace and Security Organization) opens in Washington, D.C.: U.S., British, Chinese, French and Soviet representatives meet to plan the foundation of the United Nations."], ["1944-08-22T00:00:00", "WWII: Tsushima Maru, a Japanese unmarked passenger/cargo ship, is sunk by torpedoes launched by the submarine USS Bowfin off Akuseki-jima, killing 1,484 civilians including 767 schoolchildren."], ["1944-08-23T00:00:00", "WWII: In King Michael's Coup, Ion Antonescu, prime minister of Romania, is arrested and a new government established. Romania leaves the war against the Soviet Union, joining the Allies."], ["1944-08-24T00:00:00", "WWII: - Liberation of Paris: The Allies enter Paris, successfully completing Operation Overlord."], ["1944-08-24T00:00:00", "WWII: - Japanese vessels attack and sink the submarine USS Harder off Luzon."], ["1944-08-25T00:00:00", "WWII: - German surrender of Paris: General Dietrich von Choltitz surrenders Paris to the Allies in defiance of Hitler's orders to destroy it."], ["1944-08-25T00:00:00", "WWII: - Maillé massacre: Massacre of 129 civilians (70% women and children) by the Gestapo at Maillé, Indre-et-Loire."], ["1944-08-25T00:00:00", "WWII: - Hungary decides to continue the war together with Germany."], ["1944-08-25T00:00:00", "WWII: - The Red Ball Express convoy system begins operation supplying tons of materiel to Allied forces in France."], ["1944-08-29T00:00:00", "WWII: The Slovak National Uprising against the Axis powers begins."], ["1944-08-31T00:00:00", "The Mad Gasser of Mattoon apparently resumes their mysterious attacks in Mattoon, Illinois for two weeks."], ["1944-09-01T00:00:00", "WWII: In Bulgaria, the Bagryanov government resigns."], ["1944-09-02T00:00:00", "The Holocaust: Diarist Anne Frank and her family are placed on the last transport train from Westerbork to Auschwitz concentration camp, arriving 3 days later."], ["1944-09-02T00:00:00", "¡Hola! magazine launched in Barcelona."], ["1944-09-03T00:00:00", "WWII: The Allies liberate Brussels."], ["1944-09-04T00:00:00", "WWII: - The British 11th Armoured Division liberates the city of Antwerp in Belgium."], ["1944-09-04T00:00:00", "WWII: - Finland breaks off relations with Germany."], ["1944-09-05T00:00:00", "WWII: The Soviet Union declares war on Bulgaria."], ["1944-09-06T00:00:00", "WWII: Tartu Offensive in Estonia concludes with Soviet forces capturing Tartu."], ["1944-09-07T00:00:00", "WWII: The Belgian government in exile returns to Brussels from London."], ["1944-09-08T00:00:00", "WWII: - The first V-2 rocket attack on London takes place."], ["1944-09-08T00:00:00", "WWII: - The French town of Menton is liberated from German forces."], ["1944-09-09T00:00:00", "WWII: An insurrection breaks out in Sofia."], ["1944-09-12T00:00:00", "WWII: Allied forces from Operation Overlord (in the north) and Operation Dragoon (in the south of France) link up near Dijon."], ["1944-09-14T00:00:00", "The Great Atlantic hurricane makes landfall in the New York City area."], ["1944-09-15T00:00:00", "WWII: The Battle of Peleliu begins in the Pacific."], ["1944-09-17T00:00:00", "WWII: Operation Market Garden begins, Allied airborne landings in the Netherlands and Germany."], ["1944-09-18T00:00:00", "WWII: 5,620 drown when HMS Tradewind torpedoes Jun'yō Maru."], ["1944-09-19T00:00:00", "WWII: - An armistice between Finland and the Soviet Union is signed, ending the Continuation War."], ["1944-09-19T00:00:00", "WWII: - The Battle of Hürtgen Forest begins east of the Belgian-German border."], ["1944-09-22T00:00:00", "WWII: The Red Army captures Tallinn, Estonia. Prime Minister in Duties of the President of Estonia Jüri Uluots and 80,000 Estonian civilians manage to escape to Sweden."], ["1944-09-24T00:00:00", "WWII: The U.S. 45th Infantry Division takes the strongly defended city of Épinal before crossing the Moselle river and entering the western foothills of the Vosges."], ["1944-09-26T00:00:00", "WWII: - Operation Market Garden ends in an Allied withdrawal."], ["1944-09-26T00:00:00", "WWII: - On the middle front of the Gothic Line, Brazilian troops control the Serchio valley region after 10 days of fighting."], ["1944-10-02T00:00:00", "WWII: Nazi troops end the Warsaw Uprising."], ["1944-10-05T00:00:00", "WWII: Royal Canadian Air Force pilots shoot down the first German jet fighter over the Netherlands."], ["1944-10-06T00:00:00", "WWII: The Battle of Debrecen starts on the Eastern Front (it lasts until October 29)."], ["1944-10-07T00:00:00", "Holocaust: Members of the Sonderkommando (Jewish work units) in Auschwitz stage a revolt, killing more than seventy SS men before being massacred themselves."], ["1944-10-07T00:00:00", "Dumbarton Oaks Conference concludes."], ["1944-10-08T00:00:00", "The Adventures of Ozzie and Harriet radio show debuts in the United States."], ["1944-10-09T00:00:00", "WWII: Fourth Moscow Conference: British Prime Minister Winston Churchill and Soviet Premier Joseph Stalin begin a 9-day conference in Moscow to discuss the future of Europe."], ["1944-10-10T00:00:00", "The Holocaust/Porajmos: 800 Romani children are systematically murdered at the Auschwitz concentration camp."], ["1944-10-12T00:00:00", "WWII: The Allies land in Athens."], ["1944-10-12T00:00:00", "Canadian Arctic explorer Henry Larsen returns to Vancouver, becoming the first person successfully to navigate the Northwest Passage in both directions, in the Royal Canadian Mounted Police schooner St. Roch. His westbound voyage is the first completed in a single season and the first passage through the Prince of Wales Strait."], ["1944-10-13T00:00:00", "WWII: - Riga, the capital of Latvia, is taken by the Red Army."], ["1944-10-13T00:00:00", "WWII: - The first V-2 rocket attack on Antwerp takes place."], ["1944-10-14T00:00:00", "WWII: German Field Marshal Erwin Rommel commits suicide rather than face execution for allegedly conspiring against Adolf Hitler."], ["1944-10-18T00:00:00", "WWII: The Volkssturm Nazi militia is founded on Adolf Hitler's orders."], ["1944-10-19T00:00:00", "Guatemalan Revolution begins, with the overthrow of Federico Ponce Vaides by a popular leftist movement."], ["1944-10-20T00:00:00", "WWII: - Belgrade is liberated by Yugoslav Partisans and the Red Army."], ["1944-10-20T00:00:00", "WWII: - American forces land on Red Beach in Palo, Leyte, as General Douglas MacArthur returns to the Philippines with Philippine Commonwealth president Sergio Osmeña, and Armed Forces of the Philippines Generals Basilio J. Valdes and Carlos P. Romulo."], ["1944-10-20T00:00:00", "WWII: - United States and Filipino troops with Filipino guerrillas begin the Battle of Leyte."], ["1944-10-20T00:00:00", "WWII: - American forces land on the beaches in Dulag, Leyte, the Philippines, accompanied by Filipino troops entering the town, and fiercely opposed by the Japanese occupation forces. The combined forces liberate Tacloban."], ["1944-10-20T00:00:00", "A liquefied natural gas explosion destroys a square mile (2.6 km²) of Cleveland, Ohio."], ["1944-10-21T00:00:00", "WWII: Aachen, the first German city to fall, is captured by American troops."], ["1944-10-23T00:00:00", "WWII: The Naval Battle of Leyte Gulf in the Philippines begins (lasts until October 26)."], ["1944-10-23T00:00:00", "The Allies recognise Charles de Gaulle's cabinet as the provisional government of France."], ["1944-10-25T00:00:00", "WWII: The Red Army liberates Kirkenes, the first town in Norway to be liberated."], ["1944-10-25T00:00:00", "WWII: USS Tang (the United States Navy submarine credited with sinking more ships than any other American submarine) is sunk in the Formosa Strait by one of her own torpedoes. Medal of Honor-winning submarine ace Richard O'Kane becomes a prisoner of war."], ["1944-10-25T00:00:00", "Florence Foster Jenkins gives a recital in Carnegie Hall."], ["1944-10-30T00:00:00", "The Holocaust: Anne Frank and her sister Margot are deported from Auschwitz to the Bergen-Belsen concentration camp."], ["1944-10-30T00:00:00", "Appalachian Spring, a ballet by Martha Graham with music by Aaron Copland, debuts at the Library of Congress in Washington, D.C., with Graham in the lead role."], ["1944-10-31T00:00:00", "Mass murderer Marcel Petiot is apprehended at a Paris Métro station."], ["1944-11-03T00:00:00", "WWII: Two supreme commanders of the Slovak National Uprising, Generals Ján Golian and Rudolf Viest, are captured, tortured and later executed by German forces."], ["1944-11-07T00:00:00", "United States presidential election: Franklin D. Roosevelt wins reelection over Republican challenger Thomas E. Dewey, becoming the only U.S. president elected to a fourth term."], ["1944-11-07T00:00:00", "Election day rail accident in Puerto Rico: A passenger train derails at Aguadilla due to excessive speed on a downgrade; 16 are killed, 50 injured."], ["1944-11-10T00:00:00", "WWII: Ammunition ship USS Mount Hood (AE-11) disintegrates from accidental detonation of 3800 tons of cargo in the Seeadler Harbor fleet anchorage at Manus Island. 22 small boats are destroyed, 36 nearby ships damaged, 432 men are killed and 371 more are injured."], ["1944-11-12T00:00:00", "WWII: Sinking of the German battleship Tirpitz by British Royal Air Force Lancaster bombers."], ["1944-11-14T00:00:00", "WWII: 2,246 drown when USS Queenfish torpedoes Akitsu Maru."], ["1944-11-16T00:00:00", "WWII: U.S. forces begin the month-long Operation Queen in the Rur valley."], ["1944-11-18T00:00:00", "The Popular Socialist Youth is founded in Cuba"], ["1944-11-18T00:00:00", "WWII: 3,546 drown when USS Picuda torpedoes Mayasan Maru."], ["1944-11-22T00:00:00", "Conscription Crisis: Prime Minister of Canada William Mackenzie King agrees a one-time conscription levy in Canada for overseas service."], ["1944-11-22T00:00:00", "Laurence Olivier's film Henry V, based on Shakespeare's play, opens in London. It is the most acclaimed and the most successful movie version of a Shakespeare play made up to that time, and the first in Technicolor. Olivier both stars and directs."], ["1944-11-24T00:00:00", "WWII: German forces evacuate from West Estonian Archipelago."], ["1944-11-27T00:00:00", "RAF Fauld explosion: Between 3,450 and 3,930 tons (3,500 and 4,000 tonnes) of ordnance explodes at an underground storage depot in Staffordshire, England, leaving about 75 dead and a crater 1,200 metres (0.75 miles) across and 120 metres (400 ft) deep. The blast is one of the largest non-nuclear explosions in history and the largest on UK soil."], ["1944-11-29T00:00:00", "WWII: Submarine USS Archerfish (SS-311) sinks Japanese aircraft carrier Shinano. Shinano is the largest carrier built to this date, and will remain through the twentieth century the largest ship sunk by a submarine."], ["1944-12-03T00:00:00", "WWII: - Fighting breaks out between Communists and royalists in newly liberated Greece, eventually leading to a full-scale Greek Civil War."], ["1944-12-03T00:00:00", "WWII: - The British Home Guard is stood down."], ["1944-12-07T00:00:00", "Convention on International Civil Aviation signed in Chicago to create the International Civil Aviation Organization."], ["1944-12-10T00:00:00", "Italian conductor Arturo Toscanini leads a concert performance of the first half of Beethoven's Fidelio (minus its spoken dialogue) on NBC Radio, starring Rose Bampton. He chooses this opera for its political message - a statement against tyranny and dictatorship. Conducting it in German, Toscanini intends it as a tribute to the German people who are being oppressed by Hitler. The second half is broadcast a week later. The performance is later released on LP and CD, the first of 7 operas that Toscanini conducts on radio."], ["1944-12-13T00:00:00", "Battle of Mindoro: United States, Australian and Philippine Commonwealth troops land on Mindoro Island in the Philippines."], ["1944-12-14T00:00:00", "The Soviet government changes Turkish place names to Russian in the Crimea."], ["1944-12-14T00:00:00", "United States release of the film National Velvet, which brings a young Elizabeth Taylor to stardom."], ["1944-12-15T00:00:00", "A private airplane carrying bandleader Glenn Miller disappears in heavy fog over the English Channel while flying to Paris."], ["1944-12-16T00:00:00", "WWII: - Germany begins the Ardennes offensive, later known as Battle of the Bulge."], ["1944-12-16T00:00:00", "WWII: - General George C. Marshall becomes the first U.S. Five-Star General."], ["1944-12-17T00:00:00", "WWII: Malmedy massacre: German SS troops under Joachim Peiper machine gun American prisoners of war captured during the Battle of the Bulge near Malmedy and elsewhere in Belgium."], ["1944-12-19T00:00:00", "The daily newspaper Le Monde begins publication in Paris."], ["1944-12-20T00:00:00", "The United States Women Airforce Service Pilots are disbanded."], ["1944-12-22T00:00:00", "WWII: Brigadier General Anthony C. McAuliffe, commander of the U.S. forces defending Bastogne, refuses to accept demands for surrender by sending a one-word reply, \"Nuts!\", to the German command."], ["1944-12-22T00:00:00", "The Vietnam People's Army is formed in French Indochina."], ["1944-12-24T00:00:00", "WWII: Troopship SS Léopoldville is sunk in the English Channel by German submarine U-486. Approximately 763 soldiers of the U.S. 66th Infantry Division bound for the Battle of the Bulge drown."], ["1944-12-24T00:00:00", "WWII: German tanks reach the furthest point of the Bulge at Celles."], ["1944-12-24T00:00:00", "WWII: Fifty German V-1 flying bombs, air-launched from Heinkel He 111 bombers flying over the North Sea, target Manchester in England, killing at least 27 and injuring more than 100 in the Oldham area."], ["1944-12-24T00:00:00", "WWII: Bande massacre. 34 men between the ages of 17 and 32 are executed by the Sicherheitsdienst near Bande, Belgium in retaliation for the killing of three German soldiers."], ["1944-12-24T00:00:00", "The first complete U.S. production of Tchaikovsky's ballet The Nutcracker is presented in San Francisco, choreographed by Willam Christensen. It will become an annual tradition there, and for the next ten years, the San Francisco Ballet will be the only company in the United States performing the complete work."], ["1944-12-26T00:00:00", "WWII: American troops repulse German forces at Bastogne."], ["1944-12-26T00:00:00", "The original stage version of The Glass Menagerie by Tennessee Williams premieres in Chicago."], ["1944-12-30T00:00:00", "Edward Stettinius, Jr., becomes the last United States Secretary of State of the Roosevelt administration, filling the seat left by Cordell Hull."], ["1944-12-30T00:00:00", "King George II of Greece declares a regency, leaving his throne vacant."], ["1944-12-30T00:00:00", "\"Stage Door Cartoon\" is the first cartoon produced by Eddie Selzer."], ["1944-12-31T00:00:00", "WWII: - Hungary declares war on Nazi Germany."], ["1944-12-31T00:00:00", "WWII: - Battle of Leyte: Tens of thousands of Imperial Japanese Army soldiers are killed in action, in a significant Filipino/Allied military victory."]]