[["1906-01-12T00:00:00", "Persian Constitutional Revolution: a nationalistic coalition of merchants, religious leaders and intellectuals in Persia forces the shah to grant a constitution and establish a national assembly, the Majlis."], ["1906-01-22T00:00:00", "The SS Valencia strikes a reef off Vancouver Island, Canada, killing over 100 (officially 136) in the ensuing disaster."], ["1906-01-31T00:00:00", "Ecuador-Colombia earthquake (8.8 on the Moment magnitude scale) and associated tsunami."], ["1906-02-10T00:00:00", "HMS Dreadnought is launched and sparks the naval race between Britain and Germany."], ["1906-02-11T00:00:00", "Pope Pius X publishes the encyclical Vehementer Nos denouncing the 1905 French law on the Separation of the Churches and the State."], ["1906-03-10T00:00:00", "Courrières mine disaster: an explosion in a coal mine in France kills 1,060."], ["1906-03-18T00:00:00", "Traian Vuia makes a short flight in a self-propelled, heavier-than-air aircraft."], ["1906-04-07T00:00:00", "Mount Vesuvius erupts and devastates Naples."], ["1906-04-14T00:00:00", "The Azusa Street Revival, the primary catalyst for the revival of Pentecostalism this century, opens in Los Angeles."], ["1906-04-18T00:00:00", "San Francisco earthquake (estimated magnitude 7.8) on the San Andreas Fault destroys much of San Francisco, California, USA, killing at least 3,000, with 225,000-300,000 left homeless, and $350 million in damages."], ["1906-04-23T00:00:00", "In Tsarist Russia, the Fundamental Laws are announced at the first state Duma."], ["1906-05-29T00:00:00", "Karl Staaff steps down as Prime Minister of Sweden over the issue of expanded voting rights. He is replaced by the right-wing naval officer and public official, Arvid Lindman."], ["1906-06-07T00:00:00", "Cunard liner RMS Lusitania is launched in Glasgow as the world's largest ship."], ["1906-07-06T00:00:00", "The Second Geneva Convention meets."], ["1906-07-12T00:00:00", "Alfred Dreyfus is exonerated. He is reinstalled in the French Army on July 21, thus ending the Dreyfus affair."], ["1906-08-04T00:00:00", "The first Imperial German Navy submarine, U-1, is launched."], ["1906-08-16T00:00:00", "A magnitude 8.2 earthquake in Valparaíso, Chile leaves approximately 20,000 dead."], ["1906-08-22T00:00:00", "The first Victor Victrola, a phonographic record player, is manufactured."], ["1906-08-23T00:00:00", "Unable to control a rebellion Cuban President Tomás Estrada Palma requests United States intervention. The subsequent provisional occupation administration lasts until 1909."], ["1906-09-11T00:00:00", "Mahatma Gandhi coins the term Satyagraha to characterize the Non-Violence movement in South Africa."], ["1906-09-18T00:00:00", "A typhoon and tsunami kill an estimated 10,000 in Hong Kong."], ["1906-09-30T00:00:00", "The first Gordon Bennett Cup in ballooning is held, starting in Paris. The winning team, piloting the balloon United States, lands in Fylingdales, Yorkshire, England."], ["1906-10-01T00:00:00", "The Grand Duchy of Finland becomes the first nation to include the right of women to stand as candidates when it adopts universal suffrage."], ["1906-10-06T00:00:00", "The Majlis of Iran convenes for the first time."], ["1906-10-11T00:00:00", "A United States diplomatic crisis with Japan arises when the San Francisco public school board orders Japanese students to be taught in racially segregated schools."], ["1906-10-16T00:00:00", "Imposter Wilhelm Voigt impersonates a Prussian officer and takes over the city hall in Köpenick for a short time."], ["1906-10-23T00:00:00", "An aeroplane of Alberto Santos-Dumont takes off at Bagatelle in France and flies 60 meters (200 feet). This is the first officially recorded powered flight in Europe."], ["1906-10-28T00:00:00", "The Union Minière du Haut Katanga, a Belgian mining trust, is created in the Congo."], ["1906-11-03T00:00:00", "SOS becomes an international distress signal."], ["1906-11-22T00:00:00", "Russian Prime Minister Pyotr Stolypin introduces agrarian reforms aimed at creating a large class of land-owning peasants."], ["1906-12-24T00:00:00", "Reginald Fessenden makes the first radio broadcast: a poetry reading, a violin solo, and a speech."], ["1906-12-26T00:00:00", "The world's first feature film, The Story of the Kelly Gang, is released."]]