[["1931-01-02T00:00:00", "South Dakota native Ernest Lawrence invents the cyclotron, used to accelerate particles to study nuclear physics."], ["1931-01-03T00:00:00", "Albert Einstein begins doing research at the California Institute of Technology, along with astronomer Edwin Hubble."], ["1931-01-04T00:00:00", "German pilot Elly Beinhorn begins her flight to Africa."], ["1931-01-06T00:00:00", "Thomas Edison submits his last patent application."], ["1931-01-22T00:00:00", "Sir Isaac Isaacs is sworn in as the first Australian-born Governor-General of Australia."], ["1931-01-25T00:00:00", "Mohandas Gandhi is again released from imprisonment in India."], ["1931-01-27T00:00:00", "Pierre Laval forms a government in France."], ["1931-01-30T00:00:00", "Release of the movie City Lights starring Charlie Chaplin."], ["1931-02-03T00:00:00", "Hawke's Bay earthquake: Much of the New Zealand cities of Napier and Hastings are destroyed in an earthquake measuring 7.9 on the Richter scale killing 256 people."], ["1931-02-04T00:00:00", "Soviet leader Joseph Stalin gives speech calling for rapid industrialization, arguing that only strong industrialized countries will win wars while \"weak\" nations are \"beaten\". Stalin states : \"We are fifty or a hundred years behind the advanced countries. We must make good this distance in ten years. Either we do it, or they will crush us.\" Intensification of the First Five-Year Plan in the Soviet Union for industrialization and collectivization of agriculture."], ["1931-02-10T00:00:00", "Official inauguration ceremonies for New Delhi as the capital of India begin."], ["1931-02-11T00:00:00", "National Socialist (NSDAP) and National Party (DNVP) members walk out of the German Reichstag in protest against changes in the parliament's protocol intended to limit heckling."], ["1931-02-12T00:00:00", "Vatican Radio first broadcasts."], ["1931-02-14T00:00:00", "The original film version of Dracula with Bela Lugosi is released in the United States."], ["1931-02-16T00:00:00", "Pehr Evind Svinhufvud is elected president of Finland."], ["1931-02-20T00:00:00", "California gets the go-ahead by the United States Congress to build the San Francisco-Oakland Bay Bridge."], ["1931-02-21T00:00:00", "Peruvian revolutionaries hijack a Ford Trimotor aeroplane and demand that the pilot drop propaganda leaflets over Lima."], ["1931-03-01T00:00:00", "The USS Arizona is placed back in full commission after a refit."], ["1931-03-01T00:00:00", "Sir Oswald Mosley founds the New Party as a breakaway from the Labour Party in the United Kingdom."], ["1931-03-03T00:00:00", "The Star-Spangled Banner is adopted as the United States' National anthem."], ["1931-03-05T00:00:00", "The British viceroy of India and Mohandas Gandhi sign the Gandhi-Irwin Pact."], ["1931-03-07T00:00:00", "The new House of Representatives opens in Helsinki, Finland."], ["1931-03-11T00:00:00", "The Ready for Labour and Defence of the USSR programme, abbreviated as GTO, is introduced in the Soviet Union."], ["1931-03-17T00:00:00", "Nevada legalizes gambling."], ["1931-03-19T00:00:00", "Westminster St George's by-election in the U.K. results in the victory of the Conservative candidate Duff Cooper. The by-election has been treated virtually as a referendum on the leadership of the Conservative leader Stanley Baldwin, and Duff Cooper's victory ends the campaign by the press barons Lord Beaverbrook and Viscount Rothermere to oust Baldwin."], ["1931-03-23T00:00:00", "Indian revolutionary leaders Bhagat Singh, Shivaram Rajguru and Sukhdev Thapar are hanged for conspiracy to murder in the British Raj."], ["1931-03-25T00:00:00", "The Scottsboro Boys are arrested in Alabama and charged with rape."], ["1931-03-26T00:00:00", "American television actor Leonard Nimoy is born in the West End of Boston, Massachusetts."], ["1931-03-27T00:00:00", "English writer Arnold Bennett dies of typhoid in London shortly after returning from a visit to Paris, where he drank local water to prove it was safe."], ["1931-03-31T00:00:00", "An earthquake destroys Managua, Nicaragua, killing 2,000 people."], ["1931-04-01T00:00:00", "The Second Encirclement Campaign against Jiangxi Soviet in China is launched by the Kuomintang government to destroy the Communist forces in Jiangxi province."], ["1931-04-06T00:00:00", "The Portuguese government declares martial law in Madeira and in the Azores because of an attempted military takeover in Funchal."], ["1931-04-09T00:00:00", "Argentinian anarchist Severino Digiovanni is executed."], ["1931-04-12T00:00:00", "Municipal elections in Spain, which are treated as a virtual referendum on the monarchy, result in the triumph for the republican parties."], ["1931-04-14T00:00:00", "The Second Spanish Republic is proclaimed in Madrid."], ["1931-04-15T00:00:00", "The Castellammarese War ends with the assassination of Joe \"The Boss\" Masseria, briefly leaving Salvatore Maranzano as capo di tutti i capi (\"boss of all bosses\") and undisputed ruler of the American Mafia. Maranzano is himself assassinated less than 6 months later, leading to the establishment of the Five Families."], ["1931-04-22T00:00:00", "Austria, Britain, Denmark, Germany, Italy, Sweden and the USA recognize the Spanish Republic."], ["1931-04-25T00:00:00", "The automobile manufacturer Porsche is founded by Ferdinand Porsche in Stuttgart."], ["1931-05-01T00:00:00", "Construction of the Empire State Building is completed in New York City."], ["1931-05-04T00:00:00", "Kemal Atatürk is re-elected president of Turkey."], ["1931-05-05T00:00:00", "İsmet İnönü forms a new government in Turkey (7th government)."], ["1931-05-11T00:00:00", "The Creditanstalt, Austria's largest bank, goes bankrupt, beginning the banking collapse in Central Europe that causes a worldwide financial meltdown."], ["1931-05-13T00:00:00", "Paul Doumer is elected president of France."], ["1931-05-14T00:00:00", "Ådalen shootings: Five people are killed in Ådalen, Sweden, when soldiers open fire on an unarmed trade union demonstration."], ["1931-05-15T00:00:00", "The Chinese Communists inflict a sharp defeat on the Kuomintang forces."], ["1931-05-15T00:00:00", "Pope Pius XI issues the encyclical Quadragesimo anno on the \"reconstruction of the social order\"."], ["1931-05-31T00:00:00", "The Second Encirclement Campaign against Jiangxi Soviet ends in defeat of the Kuomintang."], ["1931-06-03T00:00:00", "Salvador Dalí's The Persistence of Memory is put on display for the first time in Paris at the Galerie Pierre Colle."], ["1931-06-05T00:00:00", "German Chancellor Dr. Heinrich Brüning visits London, where he warns the British Prime Minister Ramsay MacDonald that the collapse of the Austrian banking system, caused by the bankruptcy of the Creditanstalt, has left the entire German banking system on the verge of collapse."], ["1931-06-12T00:00:00", "English cricketer Charlie Parker equals J. T. Hearne's record for the earliest date to reach 100 wickets."], ["1931-06-14T00:00:00", "The overloaded pleasure craft Saint-Philibert, carrying trippers home to Nantes from the Île de Noirmoutier, sinks at the mouth of the river Loire in France; over 450 drown."], ["1931-06-19T00:00:00", "In an attempt to stop the banking crisis in Central Europe from causing a worldwide financial meltdown, U.S. President Herbert Hoover issues the Hoover Moratorium."], ["1931-06-19T00:00:00", "The Geneva Convention (1929) relative to the treatment of prisoners of war enters into force."], ["1931-07-01T00:00:00", "Rebuilt Milano Centrale railway station officially opens in Italy."], ["1931-07-09T00:00:00", "Irish racing driver Kaye Don breaks the world water speed record at Lake Garda, Italy."], ["1931-07-13T00:00:00", "Royal soldiers shoot and kill 22 people demonstrating against the Maharaja Hari Singh of the Indian princely state of Kashmir and Jammu."], ["1931-07-16T00:00:00", "Emperor Haile Selassie signs the first constitution of Ethiopia."], ["1931-07-26T00:00:00", "The millennialist Bible Student movement adopts the name Jehovah's Witnesses at a meeting in Columbus, Ohio."], ["1931-07-31T00:00:00", "The May Report in the United Kingdom recommends extensive cuts to government expenditure. This produces a political crisis as many members of the Labour Party (at this time in government) object to the proposals."], ["1931-08-09T00:00:00", "Referendum in Prussia for dissolving the Landtag ends with the \"yes\" side winning 37% of the vote, which is insufficient for calling the early elections. The elections are intended to remove the Social Democratic Party (SPD) government of Otto Braun, which is one of the strongest forces for democracy in Germany. Supporting the \"yes\" side were the NSDAP, the DNVP and the Communist Party (KPD) while supporting the \"no\" side were the SPD and Zentrum."], ["1931-08-11T00:00:00", "Run on the British pound leads to political and economic crisis in Britain."], ["1931-08-24T00:00:00", "The Labour Government of Ramsay MacDonald resigns in Britain, replaced by a National Government of people drawn from all parties, also under MacDonald."], ["1931-09-05T00:00:00", "John Thomson, Scottish football player, dies as the result of an accident during a Celtic-Rangers match."], ["1931-09-07T00:00:00", "Second Round Table Conference on the constitutional future of India opens in London. Mahatma Gandhi represents the Indian National Congress."], ["1931-09-10T00:00:00", "The worst hurricane in British Honduras history kills an estimated 1,500."], ["1931-09-15T00:00:00", "Invergordon Mutiny: Strikes are called in the British Royal Navy due to decreased pay."], ["1931-09-16T00:00:00", "Hanging of resistance leader Omar Mukhtar in Italian Libya."], ["1931-09-18T00:00:00", "Japanese military stage the Mukden Incident as a pretext for the Japanese invasion of Manchuria."], ["1931-09-18T00:00:00", "Geli Raubal commits suicide in her uncle Adolf Hitler's apartment."], ["1931-09-20T00:00:00", "With a gun literally pointed to his head the Chinese commander of Kirin province announces the annexation of that territory to Japan."], ["1931-09-22T00:00:00", "The United Kingdom abandons the gold standard."], ["1931-10-04T00:00:00", "Dick Tracy, the comic strip detective character created by cartoonist Chester Gould, makes his debut appearance in the Detroit Mirror newspaper."], ["1931-10-05T00:00:00", "American aviators Clyde Edward Pangborn and Hugh Herndon, Jr., complete the first non-stop flight across the Pacific Ocean, from Misawa, Japan, to East Wenatchee, Washington, in 41½ hours."], ["1931-10-11T00:00:00", "Rally in Bad Harzburg, Germany leads to the Harzburg Front being founded, uniting the NSDAP, the DNVP, the Stahlhelm and various other right-wing fractions."], ["1931-10-17T00:00:00", "American gangster Al Capone is sentenced to 11 years in prison for tax evasion in Chicago."], ["1931-10-17T00:00:00", "Leeds Bradford International Airport is opened as Leeds and Bradford Municipal Aerodrome in England."], ["1931-10-24T00:00:00", "The George Washington Bridge across the Hudson River in the United States is dedicated; it opens to traffic the following day. At 3,500 feet (1,100 m), it nearly doubles the previous record for the longest main span in the world."], ["1931-10-27T00:00:00", "United Kingdom general election results in the victory of the National Government and the defeat of Labour Party in the country's greatest ever electoral landslide."], ["1931-11-07T00:00:00", "The Chinese Soviet Republic is proclaimed by Mao Zedong."], ["1931-11-08T00:00:00", "French police launch a large-scale raid against Corsican bandits."], ["1931-11-08T00:00:00", "The Panama Canal is closed for a couple of weeks due to damage caused by earthquakes."], ["1931-11-08T00:00:00", "Our Gang kid Darla Hood is born in Leedey, Oklahoma."], ["1931-11-21T00:00:00", "The infamous Red-and-White Party, given by Arthur Jeffress in Maud Allan’s Regent's Park townhouse in London, marks the end of the \"Bright young things\" subculture in Britain."], ["1931-11-25T00:00:00", "Heavy hydrogen, later named deuterium, is discovered by chemist Harold Clayton Urey."], ["1931-11-25T00:00:00", "Ali Fethi Okyar forms a new government in Turkey (third government)."], ["1931-11-25T00:00:00", "Release of James Whale's film of Frankenstein in New York."], ["1931-12-05T00:00:00", "Original Cathedral of Christ the Saviour in Moscow (1883) is dynamited by order of Joseph Stalin."], ["1931-12-08T00:00:00", "Carl Friedrich Goerdeler is appointed Reich Price Commissioner in Germany to enforce the deflationary policies of the Brüning government."], ["1931-12-10T00:00:00", "Jane Addams became the first American woman to be awarded the Nobel Peace Prize."], ["1931-12-10T00:00:00", "Niceto Alcalá-Zamora is elected president of the Spanish Republic."], ["1931-12-11T00:00:00", "The Parliament of the United Kingdom enacts the Statute of Westminster, which establishes a status of legislative equality between the self-governing dominions of the Commonwealth of Australia, the Dominion of Canada, the Irish Free State, Newfoundland, the Dominion of New Zealand and the Union of South Africa."], ["1931-12-13T00:00:00", "Wakatsuki Reijirō resigns as Prime Minister of Japan."], ["1931-12-26T00:00:00", "Phi Iota Alpha, the oldest existing Latino fraternity, is founded."]]