[["1976-01-05T00:00:00", "The Pol Pot regime proclaims a new constitution for Democratic Kampuchea."], ["1976-01-11T00:00:00", "The 1976 Philadelphia Flyers-Red Army game results in a 4-1 victory for the National Hockey League's Philadelphia Flyers over HC CSKA Moscow of the Soviet Union."], ["1976-01-15T00:00:00", "Would-be Gerald Ford presidential assassin Sara Jane Moore is sentenced to life in prison."], ["1976-01-16T00:00:00", "The trial against jailed members of the Red Army Faction begins in Stuttgart, West Germany."], ["1976-01-18T00:00:00", "Full diplomatic relations are established between Bangladesh and Pakistan 5 years after the Bangladesh Liberation War."], ["1976-01-18T00:00:00", "The Scottish Labour Party is formed."], ["1976-01-18T00:00:00", "Super Bowl X: The Pittsburgh Steelers defeat the Dallas Cowboys, 21-17, in Miami."], ["1976-01-19T00:00:00", "Jimmy Carter wins the Iowa Democratic Caucus."], ["1976-01-21T00:00:00", "The first commercial Concorde flight takes off."], ["1976-01-27T00:00:00", "The United States vetoes a United Nations resolution that calls for an independent Palestinian state."], ["1976-01-27T00:00:00", "The First Battle of Amgala breaks out between Morocco and Algeria in the Spanish Sahara."], ["1976-01-29T00:00:00", "Twelve Provisional Irish Republican Army bombs explode in the West End of London."], ["1976-01-30T00:00:00", "Live from Lincoln Center debuts on PBS."], ["1976-02-04T00:00:00", "The 1976 Winter Olympics begin in Innsbruck, Austria."], ["1976-02-04T00:00:00", "In Guatemala and Honduras an earthquake kills more than 22,000."], ["1976-02-05T00:00:00", "Nearly 2,000 students become involved in a racially charged riot at Escambia High School in Pensacola, Florida; 30 students are injured in the 4-hour fray."], ["1976-02-09T00:00:00", "The Australian Defence Force is formed by unification of the Australian Army, the Royal Australian Navy and the Royal Australian Air Force."], ["1976-02-11T00:00:00", "Clifford Alexander, Jr. is confirmed as the first African American Secretary of the United States Army."], ["1976-02-13T00:00:00", "General Murtala Mohammed of Nigeria is assassinated in a military coup."], ["1976-02-15T00:00:00", "The 1976 Constitution of Cuba is adopted by national referendum."], ["1976-02-24T00:00:00", "Cuba's current constitution is enacted."], ["1976-02-26T00:00:00", "The Spanish Armed Forces withdraw from Western Sahara."], ["1976-02-27T00:00:00", "The Polisario Front, Western Sahara's national liberation movement, declares independence of the territory under the name \"Sahrawi Arab Democratic Republic\"."], ["1976-02-28T00:00:00", "Madagascar becomes the first country to recognise the Sahrawi Arab Democratic Republic."], ["1976-03-01T00:00:00", "U.K. Home Secretary Merlyn Rees ends Special Category Status for those sentenced for scheduled terrorist crimes relating to the civil violence in Northern Ireland."], ["1976-03-01T00:00:00", "Burundi recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-02T00:00:00", "Vietnam recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-04T00:00:00", "The Maguire Seven are found guilty of possessing explosives and subsequently jailed for 14 years."], ["1976-03-04T00:00:00", "The Northern Ireland Constitutional Convention is formally dissolved in Northern Ireland, resulting in direct rule of Northern Ireland from London via the British Parliament."], ["1976-03-06T00:00:00", "Algeria recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-09T00:00:00", "A cable car disaster in Cavalese, Italy leaves 42 dead."], ["1976-03-09T00:00:00", "March 11 - Two coal mine explosions claim 26 lives at the Blue Diamond Coal Co. Scotia Mine, in Letcher County, Kentucky."], ["1976-03-11T00:00:00", "Angola and Benin recognize the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-13T00:00:00", "Mozambique recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-14T00:00:00", "After eight years on NBC, The Wizard of Oz returns to CBS, where it will remain until 1999, setting what was likely then a record for the most telecasts of a Hollywood film on a commercial television network. That record is broken by The Ten Commandments in 1996, which began its annual network telecasts on ABC in 1973 and is still (as of 2012) telecast by that network."], ["1976-03-15T00:00:00", "Guinea-Bissau recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-16T00:00:00", "Harold Wilson resigns as Prime Minister of the United Kingdom."], ["1976-03-16T00:00:00", "North Korea recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-17T00:00:00", "Rubin \"Hurricane\" Carter is retried in New Jersey."], ["1976-03-17T00:00:00", "Togo recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-03-20T00:00:00", "Patty Hearst is found guilty of armed robbery of a San Francisco bank."], ["1976-03-24T00:00:00", "Argentina military forces depose president Isabel Perón."], ["1976-03-24T00:00:00", "A general strike takes place in the People's Republic of the Congo."], ["1976-03-26T00:00:00", "The Toronto Blue Jays are created."], ["1976-03-27T00:00:00", "The first 4.6 miles of the Washington Metro subway system open."], ["1976-03-29T00:00:00", "The military dictatorship of General Jorge Videla comes to power in Argentina."], ["1976-03-31T00:00:00", "The New Jersey Supreme Court rules that coma patient Karen Ann Quinlan can be disconnected from her ventilator. She remains comatose and dies in 1985."], ["1976-04-01T00:00:00", "Apple Computer Company is formed by Steve Jobs and Steve Wozniak."], ["1976-04-01T00:00:00", "Conrail (Consolidated Rails Corporation) is formed by the U.S. government, to take control of 13 major Northeast Class-1 railroads that had filed for bankruptcy protection. Conrail takes control at midnight, as a government-owned and operated railroad until 1986, when it is sold to the public."], ["1976-04-01T00:00:00", "The Jovian-Plutonian gravitational effect is first reported by astronomer Patrick Moore."], ["1976-04-01T00:00:00", "Rwanda recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1976-04-02T00:00:00", "Norodom Sihanouk is forced to resign as Head of State of Kampuchea by the Khmer Rouge led by Pol Pot and is placed under house arrest."], ["1976-04-03T00:00:00", "The Eurovision Song Contest 1976 is won by Brotherhood of Man, representing the United Kingdom, with their song \"Save Your Kisses for Me\"."], ["1976-04-05T00:00:00", "James Callaghan becomes Prime Minister of the United Kingdom."], ["1976-04-05T00:00:00", "Tiananmen Incident: Large crowds lay wreaths at Beijing's Monument of the Martyrs to commemorate the death of Premier Zhou Enlai. Poems against the Gang of Four are also displayed, provoking a police crackdown."], ["1976-04-10T00:00:00", "Frampton Comes Alive!, the multi-platinum selling live album by English rock musician Peter Frampton hits #1 in the Billboard 200 and remains there for 10 weeks, becoming the best-selling album of the year."], ["1976-04-13T00:00:00", "An explosion in an ammunition factory in Lapua, Finland kills 40."], ["1976-04-13T00:00:00", "The United States Treasury Department reintroduces the two-dollar bill as a Federal Reserve Note on Thomas Jefferson's 233rd birthday as part of the United States Bicentennial celebration."], ["1976-04-16T00:00:00", "As a measure to curb population growth, the minimum age for marriage in India is raised to 21 years for men and 18 years for women."], ["1976-04-21T00:00:00", "The Great Bookie Robbery in Melbourne: Bandits steal A$1.4 million in bookmakers' settlements from Queen Street, Melbourne."], ["1976-04-23T00:00:00", "The punk rock group the Ramones release their first self-titled album."], ["1976-04-25T00:00:00", "Portugal's new constitution is enacted."], ["1976-04-29T00:00:00", "Sino-Soviet split: A concealed bomb explodes at the gates of the Soviet embassy in China, killing four Chinese. The targets were embassy employees, returning from lunch, but on that day they returned to the embassy earlier."], ["1976-05-01T00:00:00", "Neville Wran becomes Premier of New South Wales."], ["1976-05-04T00:00:00", "The first LAGEOS (Laser Geodynamics Satellite) is launched."], ["1976-05-04T00:00:00", "A train crash in Schiedam, the Netherlands, kills 24 people."], ["1976-05-06T00:00:00", "An earthquake hits the Friuli area in Italy, killing more than 900 people and making another 100,000 homeless."], ["1976-05-09T00:00:00", "Ulrike Meinhof of the Red Army Faction is found hanged in an apparent suicide, in her Stuttgart-Stammheim prison cell."], ["1976-05-11T00:00:00", "U.S. President Gerald Ford signs the Federal Election Campaign Act."], ["1976-05-11T00:00:00", "An accident involving a tanker truck carrying anhydrous ammonia takes place in Houston, Texas, resulting in the deaths of 7 people."], ["1976-05-21T00:00:00", "The Yuba City bus disaster, the worst bus crash in U.S. history to date, with 28 students and one teacher killed."], ["1976-05-24T00:00:00", "Washington, D.C. Concorde service begins."], ["1976-05-25T00:00:00", "U.S. President Gerald Ford defeats challenger Ronald Reagan in 3 Republican presidential primaries: Kentucky, Tennessee and Oregon."], ["1976-05-30T00:00:00", "Indianapolis 500-Mile Race: Johnny Rutherford wins the (rain-shortened) shortest race in event history to date, at 102 laps or 255 miles (408 km)."], ["1976-05-31T00:00:00", "Syria intervenes in the Lebanese Civil War in opposition to the Palestine Liberation Organization, whom it had previously supported."], ["1976-06-01T00:00:00", "The UK and Iceland end the Cod War."], ["1976-06-02T00:00:00", "A car bomb fatally injures Arizona Republic reporter Don Bolles."], ["1976-06-02T00:00:00", "The Philippine government opens relations with the Soviet Union."], ["1976-06-04T00:00:00", "The Boston Celtics defeat the Phoenix Suns 128-126 in triple overtime in Game 5 of the NBA Finals at the Boston Garden. In 1997, the game is selected by a panel of experts as the greatest of the NBA's first 50 years."], ["1976-06-05T00:00:00", "The Teton Dam collapses in southeast Idaho in the U.S., killing 11 people."], ["1976-06-06T00:00:00", "The Double Six Crash, a plane crash in Kota Kinabalu, Malaysia, kills everyone on board, including Sabahan Chief Minister Tun Fuad Stephens."], ["1976-06-12T00:00:00", "Alberto Demicheli, a jurist, is inaugurated as a civilian de facto President of Uruguay after Juan María Bordaberry is deposed by the military."], ["1976-06-13T00:00:00", "Savage thunderstorms roll through the state of Iowa, spawning several tornadoes, including an F-5 tornado that destroys the town of Jordan, Iowa."], ["1976-06-14T00:00:00", "The trial begins at Oxford Crown Court of Donald Neilson, the killer known as the Black Panther."], ["1976-06-16T00:00:00", "The Soweto uprising in South Africa begins."], ["1976-06-17T00:00:00", "The National Basketball Association and the American Basketball Association agree on the ABA-NBA merger."], ["1976-06-20T00:00:00", "Hundreds of Western tourists are moved from Beirut and taken to safety in Syria by the U.S. military, following the murder of the U.S. ambassador."], ["1976-06-20T00:00:00", "General elections are held in Italy."], ["1976-06-20T00:00:00", "Czechoslovakia beats West Germany 5-3 on penalties to win Euro 76, when the game had ended 2-2 after extra time."], ["1976-06-25T00:00:00", "Strikes start in Poland (Ursus, Radom, Płock) after communists raise food prices; they end on June 30."], ["1976-06-26T00:00:00", "The CN Tower is built in Toronto; the tallest free-standing land structure opens to the public."], ["1976-06-27T00:00:00", "G-6 is renamed \"Group of 7\" (G-7)."], ["1976-06-27T00:00:00", "Palestinian militants hijack an Air France plane in Greece with 246 passengers and 12 crew. They take it to Entebbe, Uganda."], ["1976-06-29T00:00:00", "Seychelles gains independence from the United Kingdom."], ["1976-06-29T00:00:00", "The Conference of Communist and Workers Parties of Europe convenes in East Berlin."], ["1976-07-02T00:00:00", "North Vietnam and South Vietnam unite to form the Socialist Republic of Vietnam."], ["1976-07-03T00:00:00", "Gregg v. Georgia: The Supreme Court of the United States rules that the death penalty is not inherently cruel or unusual and is a constitutionally acceptable form of punishment overturning the Furman v. Georgia case of 1972."], ["1976-07-03T00:00:00", "The great heat wave in the United Kingdom, which is currently suffering from drought conditions, reaches its peak."], ["1976-07-04T00:00:00", "United States Bicentennial: From coast to coast, the United States celebrates the 200th anniversary of the Declaration of Independence."], ["1976-07-04T00:00:00", "Entebbe Raid: Israeli airborne commandos free 103 hostages being held by Palestinian hijackers of an Air France plane at Uganda's Entebbe Airport; Yonatan Netanyahu and several Ugandan soldiers are killed in the raid."], ["1976-07-06T00:00:00", "The first class of women is inducted at the United States Naval Academy in Annapolis, Maryland."], ["1976-07-07T00:00:00", "German left-wing terrorists Monika Berberich, Gabriella Rollnick, Juliane Plambeck and Inge Viett escape from the Lehrter Straße maximum security prison in West Berlin."], ["1976-07-07T00:00:00", "David Steel becomes leader of the UK's Liberal Party in the aftermath of the scandal which forced out Jeremy Thorpe."], ["1976-07-10T00:00:00", "Four mercenaries, three British and one American, are shot by firing squad in Angola."], ["1976-07-10T00:00:00", "An explosion in Seveso, Italy, causes extended pollution to a large area in the neighborhood of Milano, with many evacuations and a large number of people affected by the toxic cloud."], ["1976-07-12T00:00:00", "Barbara Jordan is the first African-American to keynote a political convention."], ["1976-07-15T00:00:00", "Jimmy Carter is nominated for U.S. President at the Democratic National Convention in New York City."], ["1976-07-16T00:00:00", "July 20 - Albert Spaggiari and his gang break into the vault of the Societe Generale Bank in Nice, France."], ["1976-07-17T00:00:00", "The 1976 Summer Olympics begin in Montreal, Canada."], ["1976-07-17T00:00:00", "East Timor is declared the 27th province of Indonesia."], ["1976-07-18T00:00:00", "Nadia Comăneci earns the first of 7 perfect scores of 10 at the 1976 Summer Olympics."], ["1976-07-19T00:00:00", "Sagarmatha National Park in Nepal is created."], ["1976-07-20T00:00:00", "Viking program: The Viking 1 lander successfully lands on Mars."], ["1976-07-21T00:00:00", "A bomb kills Christopher Ewart-Biggs, British ambassador to the Irish Republic."], ["1976-07-26T00:00:00", "In Los Angeles, Ronald Reagan announces his choice of liberal U.S. Senator Richard Schweiker as his vice presidential running mate, in an effort to woo moderate Republican delegates away from President Gerald Ford."], ["1976-07-27T00:00:00", "The United Kingdom breaks diplomatic relations with its former colony Uganda in response to the hijacking of Air France Flight 139."], ["1976-07-27T00:00:00", "Delegates attending an American Legion convention at The Bellevue-Stratford Hotel in Philadelphia, US, begin falling ill with a form of pneumonia: this will eventually be recognised as the first outbreak of Legionnaires' disease and will end in the deaths of 29 attendees."], ["1976-07-28T00:00:00", "The Tangshan earthquake flattens Tangshan, China, killing 242,769 people, and injuring 164,851."], ["1976-07-29T00:00:00", "In New York City, the \"Son of Sam\" pulls a gun from a paper bag, killing 1 and seriously wounding another, in the first of a series of attacks that terrorize the city for the next year."], ["1976-07-30T00:00:00", "In Santiago, Chile, Cruzeiro from Brazil beats River Plate from Argentina and are the Copa Libertadores de América champions."], ["1976-07-31T00:00:00", "NASA releases the famous Face on Mars photo, taken by Viking 1."], ["1976-07-31T00:00:00", "The Big Thompson River in northern Colorado floods, destroying more than 400 cars and houses and killing 143 people."], ["1976-08-01T00:00:00", "The Caribbean nation of Trinidad and Tobago becomes a republic, replacing Elizabeth II with President Ellis Clarke as its head of state."], ["1976-08-01T00:00:00", "The Seattle Seahawks play their first football game."], ["1976-08-01T00:00:00", "Racing Champion Niki Lauda suffers serious burns in the German Grand Prix."], ["1976-08-02T00:00:00", "A gunman murders Andrea Wilborn and Stan Farr and injures Priscilla Davis and Gus Gavrel, in an incident at Priscilla's mansion in Fort Worth, Texas. T. Cullen Davis, Priscilla's husband and one of the richest men in Texas, is tried and found innocent for Andrea's murder, involvement in a plot to kill several people (including Priscilla and a judge), and a wrongful death lawsuit. Cullen goes broke afterwards."], ["1976-08-05T00:00:00", "The Great Clock of Westminster (or Big Ben) suffers internal damage and stops running for over 9 months."], ["1976-08-06T00:00:00", "Former UK Postmaster General John Stonehouse is sentenced to 7 years' jail for fraud, theft and forgery."], ["1976-08-07T00:00:00", "Viking program: Viking 2 enters into orbit around Mars."], ["1976-08-08T00:00:00", "As part of the ABA-NBA merger agreement, a dispersal draft was conducted to assign teams for the players on the two ABA franchises which had folded."], ["1976-08-11T00:00:00", "A sniper rampage in Wichita, Kansas on a Holiday Inn results in 3 deaths while 7 others are wounded."], ["1976-08-14T00:00:00", "Ten thousand Protestant and Catholic women demonstrate for peace in Northern Ireland."], ["1976-08-14T00:00:00", "The Senegalese political party PAI-Rénovation is legally recognized, becoming the third legal party in the country."], ["1976-08-16T00:00:00", "The Ramones make their first \"professional\" performance at CBGB."], ["1976-08-18T00:00:00", "At Panmunjom, North Korea, two United States soldiers are killed while trying to chop down part of a tree in the Korean Demilitarized Zone which had obscured their view."], ["1976-08-19T00:00:00", "U.S. President Gerald Ford edges out challenger Ronald Reagan to win the Republican Party presidential nomination in Kansas City."], ["1976-08-24T00:00:00", "In Uruguay, the army captures Marcelo Gelman and his pregnant wife. Marcelo is later killed and his wife (and unborn child) disappear."], ["1976-08-25T00:00:00", "Jacques Chirac resigns as Prime Minister of France; he is succeeded by Raymond Barre."], ["1976-08-25T00:00:00", "Landslide disaster in Sau Mau Ping, Hong Kong."], ["1976-08-26T00:00:00", "The first known outbreak of Ebola virus occurs in Yambuku, Zaire."], ["1976-08-26T00:00:00", "Prince Bernhard of Lippe-Biesterfeld, husband of Queen Juliana of the Netherlands, resigns from various posts over a scandal involving alleged corruption, in connection with business dealings with the Lockheed Corporation."], ["1976-08-30T00:00:00", "James Alexander George Smith \"Jags\" McCartney is sworn in as the first Chief Minister of the Turks and Caicos Islands."], ["1976-09-01T00:00:00", "Cigarette and tobacco advertising is banned on Australian television and radio."], ["1976-09-01T00:00:00", "Aparicio Méndez, a jurist, is inaugurated as a civilian de facto President of Uruguay in the framework of a dictatorship."], ["1976-09-01T00:00:00", "The state of emergency, being in force since 1939, is lifted in the Republic of Ireland."], ["1976-09-03T00:00:00", "Viking program: The Viking 2 spacecraft lands at Utopia Planitia on Mars, taking the first close-up color photos of the planet's surface."], ["1976-09-06T00:00:00", "Cold War: Soviet Air Force pilot Lt. Viktor Belenko lands a MiG-25 jet fighter at Hakodate, on the island of Hokkaidō in Japan, and requests political asylum in the United States."], ["1976-09-06T00:00:00", "Frank Sinatra brings Jerry Lewis's former partner Dean Martin onstage, unannounced, at the 1976 Jerry Lewis MDA Telethon in Las Vegas, reuniting the comedy team for the first (and only) time in over 20 years."], ["1976-09-09T00:00:00", "Chairman Mao Zedong, of the People's Republic of China, dies of a heart attack."], ["1976-09-10T00:00:00", "Zagreb mid-air collision: A British Airways Trident and a Yugoslav DC-9 collide near Zagreb, Yugoslavia (present-day Zagreb, Croatia), killing all 176 aboard."], ["1976-09-10T00:00:00", "Osamu Tezuka begins serialising MW, a manga inspired by the 1974 Kakuei Tanaka government scandal."], ["1976-09-13T00:00:00", "The Muppet Show is broadcast for the first time on ITV."], ["1976-09-16T00:00:00", "Shavarsh Karapetyan saves 20 people from a trolleybus that had fallen into a Yerevan reservoir."], ["1976-09-16T00:00:00", "Beginning with the Night of the Pencils, a series of kidnappings and forced disappearances followed by torture, rape, and murder of students under the Argentine dictatorship takes place."], ["1976-09-17T00:00:00", "The space shuttle Enterprise is rolled out of a Palmdale, California hangar."], ["1976-09-20T00:00:00", "The International Organization of Space Communications (Intersputnik) is founded."], ["1976-09-20T00:00:00", "September 21 - The semi-legendary 100 Club Punk Festival ignites the careers of several influential punk and post-punk bands, arguably sparking the punk movement's introduction into mainstream culture."], ["1976-09-21T00:00:00", "The Seychelles join the United Nations."], ["1976-09-21T00:00:00", "Orlando Letelier is assassinated in Washington, D.C. by agents of Chilean dictator Augusto Pinochet."], ["1976-09-24T00:00:00", "Patty Hearst is sentenced to 7 years in prison for her role in a 1974 bank robbery (an executive clemency order from U.S. President Jimmy Carter will set her free after only 22 months)."], ["1976-09-25T00:00:00", "The Irish rock band U2 is formed after drummer Larry Mullen, Jr. posts a note seeking members for a band on the notice board of his Dublin school."], ["1976-09-28T00:00:00", "American singer Stevie Wonder releases his hit album Songs in the Key of Life."], ["1976-10-04T00:00:00", "The brand new InterCity 125 high-speed train is introduced in the United Kingdom."], ["1976-10-06T00:00:00", "Cubana de Aviación Flight 455 crashes due to a bomb placed by anti-Fidel Castro terrorists, after taking off from Bridgetown, Barbados; all 73 people on board are killed."], ["1976-10-06T00:00:00", "Students gathering at Thammasat University in Bangkok, Thailand are massacred, while protesting the return of ex-dictator Thanom Kittikachorn by a coalition of right-wing paramilitary and government forces, triggering the return of the military to government."], ["1976-10-06T00:00:00", "In San Francisco, during his second televised debate with Jimmy Carter, U.S. President Gerald Ford stumbles when he declares that \"there is no Soviet domination of Eastern Europe\" (there is at the time)."], ["1976-10-06T00:00:00", "The Cultural Revolution in China concludes upon the capture of the Gang of Four."], ["1976-10-08T00:00:00", "Thorbjörn Fälldin replaces Olof Palme as Prime Minister of Sweden ."], ["1976-10-10T00:00:00", "Taiwan Governor Hsieh Tung-min is injured by a letter bomb from a pro-independence activist."], ["1976-10-12T00:00:00", "The People's Republic of China announces that Hua Guofeng is the successor to Mao Zedong, as Chairman of the Communist Party of China."], ["1976-10-13T00:00:00", "The United States Commission on Civil Rights releases the report, Puerto Ricans in the Continental United States: An Uncertain Future, that documents that Puerto Ricans in the United States have a poverty rate of 33 percent in 1974 (up from 29 percent in 1970), the highest of all major racial-ethnic groups in the country (not including Puerto Rico, a U.S. territory)."], ["1976-10-18T00:00:00", "Ford officially launches volume production of the Fiesta car at its Valencia plant."], ["1976-10-19T00:00:00", "The Copyright Act of 1976 extends copyright duration for an additional 20 years in the United States."], ["1976-10-19T00:00:00", "The Battle of Aishiya is fought in Lebanon."], ["1976-10-19T00:00:00", "The Chimpanzee (Pan troglodytes) is placed on the list of endangered species."], ["1976-10-20T00:00:00", "The Mississippi River ferry MV George Prince is struck by a ship while crossing from Destrehan, Louisiana to Luling, Louisiana, killing 78 passengers and crew."], ["1976-10-22T00:00:00", "Cearbhall Ó Dálaigh, the 5th President of Ireland, resigns after being publicly insulted by the Minister for Defense."], ["1976-10-25T00:00:00", "Clarence Norris, the last known survivor of the Scottsboro Boys, is pardoned."], ["1976-11-02T00:00:00", "U.S. presidential election, 1976: Jimmy Carter defeats incumbent Gerald Ford, becoming the first candidate from the Deep South to win since the Civil War."], ["1976-11-15T00:00:00", "The first megamouth shark is discovered off Oahu in Hawaii."], ["1976-11-19T00:00:00", "Jaime Ornelas Camacho takes office as the first President of the Regional Government of Madeira, Portugal."], ["1976-11-24T00:00:00", "At least 3,840 are killed in a Richter scale magnitude 7.3 earthquake of Van and Muradiye in Turkey."], ["1976-11-25T00:00:00", "In San Francisco, The Band holds its farewell concert, The Last Waltz."], ["1976-11-26T00:00:00", "Microsoft is officially registered with the Office of the Secretary of the State of New Mexico."], ["1976-11-26T00:00:00", "The Warsaw Treaty Organization joint secretariat is established."], ["1976-12-01T00:00:00", "Angola joins the United Nations."], ["1976-12-01T00:00:00", "José López Portillo takes office as President of Mexico."], ["1976-12-01T00:00:00", "The Sex Pistols achieve public notoriety, as they unleash several 4-letter words live on Bill Grundy's early evening TV show."], ["1976-12-01T00:00:00", "Sir Douglas Nicholls is appointed the 28th Governor of South Australia, the first Australian Aboriginal appointed to vice-regal office."], ["1976-12-03T00:00:00", "Bob Marley and his manager Don Taylor are shot in an assassination attempt in Kingston, Jamaica."], ["1976-12-03T00:00:00", "Patrick Hillery is elected unopposed as the 6th President of Ireland."], ["1976-12-06T00:00:00", "The Viet Cong is disbanded, and its former members become a part of the Vietnam People's Army."], ["1976-12-08T00:00:00", "The Congressional Hispanic Caucus is established by the 5 Latinos in the United States Congress: Herman Badillo of the Bronx, E. de la Garza and Henry B. Gonzalez of Texas, Edward R. Roybal of California, and the nonvoting Resident Commissioner of Puerto Rico, Baltasar Corrada del Río."], ["1976-12-08T00:00:00", "Hotel California by the Eagles is released."], ["1976-12-10T00:00:00", "The United Nations General Assembly adopts the Convention on the Prohibition of Military or Any Other Hostile Use of Environmental Modification Techniques."], ["1976-12-10T00:00:00", "The 9th Congress of the Sammarinese Communist Party convenes."], ["1976-12-15T00:00:00", "Samoa joins the United Nations."], ["1976-12-15T00:00:00", "Denis Healey announces to the British Parliament that he has successfully negotiated a £2.3bn loan from the International Monetary Fund."], ["1976-12-20T00:00:00", "Richard J. Daley, Mayor of Chicago for 21 years, dies."], ["1976-12-23T00:00:00", "A new volcano, Murara, erupts in eastern Zaire."], ["1976-12-28T00:00:00", "Legendary guitarist Freddie King dies."]]