[["1942-01-01T00:00:00", "WWII: - Declaration by United Nations signed by China, UK, USA, and USSR in which they agree \"not to make any separate peace with the Axis powers\"."], ["1942-01-01T00:00:00", "WWII: - United States and Philippines troops fight the Battle of Bataan against Japanese forces."], ["1942-01-02T00:00:00", "WWII: Japanese warplanes bomb Manila, Philippines"], ["1942-01-07T00:00:00", "WWII: Operation Typhoon, the German attempt to take Moscow, ends in failure."], ["1942-01-07T00:00:00", "WWII: The siege of the Bataan Peninsula begins."], ["1942-01-11T00:00:00", "WWII: - Dutch East Indies campaign: Japan declares war on the Netherlands and invades the Dutch East Indies."], ["1942-01-11T00:00:00", "WWII: - Malayan Campaign: The Japanese capture Kuala Lumpur, the capital of the Federated Malay States."], ["1942-01-13T00:00:00", "Sikorsky R-4 first flies, in the United States; it will become the first mass-produced helicopter."], ["1942-01-13T00:00:00", "Heinkel test pilot Helmut Schenk becomes the first person to escape from a stricken aircraft with an ejection seat."], ["1942-01-16T00:00:00", "American film actress Carole Lombard and her mother are among all 22 aboard TWA Flight 3 killed when the Douglas DC-3 plane crashes into Potosi Mountain near Las Vegas while she is returning from a tour to promote the sale of war bonds."], ["1942-01-17T00:00:00", "Boxer Muhammad Ali is born Cassius Marcellus Clay, Jr. in Louisville, Kentucky."], ["1942-01-19T00:00:00", "WWII: - Japanese forces invade Burma."], ["1942-01-19T00:00:00", "WWII: - Establishment of United States VIII Bomber Command, later to become the Eighth Air Force, in Savannah, Georgia."], ["1942-01-20T00:00:00", "The Holocaust: Nazis at the Wannsee Conference in Berlin decide that the \"Final Solution (Endlösung) to the Jewish problem\" is relocation, and later extermination."], ["1942-01-21T00:00:00", "WWII: Erwin Rommel launches his new offensive in Cyrenaica."], ["1942-01-23T00:00:00", "WWII: The Battle of Rabaul begins."], ["1942-01-25T00:00:00", "WWII: Thailand declares war on the United States and United Kingdom."], ["1942-01-26T00:00:00", "WWII: The first American forces arrive in Europe, landing in Northern Ireland."], ["1942-01-31T00:00:00", "WWII: Malayan Campaign: The last organized Allied forces leave British Malaya, ending the 54-day campaign, and the Johor-Singapore Causeway is severed."], ["1942-02-01T00:00:00", "WWII: The Command staff of the Eighth Air Force reaches England."], ["1942-02-02T00:00:00", "WWII: President of the United States Franklin D. Roosevelt signs an executive order directing the internment of Japanese Americans and the seizure of their property."], ["1942-02-03T00:00:00", "WWII: Rommel suspends his offensive in Cyrenaica."], ["1942-02-07T00:00:00", "United States Maritime Commission fleet operations transferred to the War Shipping Administration (lasting until September 1, 1946)."], ["1942-02-08T00:00:00", "António Óscar Carmona is elected president of Portugal."], ["1942-02-08T00:00:00", "WWII: Top United States military leaders hold their first formal meeting to discuss American military strategy in the war."], ["1942-02-08T00:00:00", "Daylight saving time goes into effect in the United States."], ["1942-02-09T00:00:00", "The ocean liner SS Normandie catches fire while being converted into the troopship USS Lafayette (AP-53) for WWII at pier 88 in New York City: she capsizes early the following morning."], ["1942-02-11T00:00:00", "Operation Cerberus: A flotilla of Kriegsmarine ships dash from Brest through the English Channel to northern ports; the British fail to sink any of them."], ["1942-02-15T00:00:00", "WWII: Singapore surrenders to Japanese forces."], ["1942-02-18T00:00:00", "WWII: More than 200 American sailors die in Newfoundland when the USS Truxtun runs aground near Chambers Cove and the USS Pollux runs aground at Lawn Point."], ["1942-02-19T00:00:00", "WWII: - Japanese warplanes bomb Darwin, Australia."], ["1942-02-19T00:00:00", "WWII: - A returning Japanese fighter plane crashes on Melville Island (Australia) and its pilot, Hajime Toyoshima, becomes the first Japanese captured on Australian soil when indigenous resident Matthias Ulungura takes him prisoner."], ["1942-02-19T00:00:00", "WWII: - United States President Franklin D. Roosevelt signs Executive Order 9066 allowing the United States military to define areas as exclusionary zones. These zones affect the Japanese on the West Coast, and Germans and Italians primarily on the East Coast."], ["1942-02-20T00:00:00", "Lieutenant Edward O'Hare becomes America's first U.S. Navy WWII flying ace."], ["1942-02-22T00:00:00", "General George Marshall transmits a direct order to General MacArthur in President Roosevelt's name, ordering MacArthur himself to turn over command of the Philippines to a subordinate and report to Australia to assume command of the large American force being built up there. The orders are worded to allow MacArthur to choose the exact moment of his departure; for various reasons, he will not leave until March 12 (Eastern Date)."], ["1942-02-23T00:00:00", "The Japanese submarine I-17 fires 17 high-explosive shells toward an oil refinery near Santa Barbara, California, causing little damage."], ["1942-02-24T00:00:00", "Struma disaster: MV Struma, carrying Jewish refugees from Axis-allied Romania to British-administered Palestine, is torpedoed and sunk by the Soviet submarine Shch-213, killing about 791 men, women and children, with only one survivor."], ["1942-02-24T00:00:00", "Propaganda: The Voice of America begins broadcasting."], ["1942-02-25T00:00:00", "The Princess Elizabeth registers for war service in the U.K."], ["1942-02-25T00:00:00", "Battle of Los Angeles: Over 1,400 AA shells are fired at an unidentified, slow-moving object in the skies over Los Angeles. The appearance of the object triggers an immediate wartime blackout over most of Southern California, with thousands of air raid wardens being deployed throughout the city. In total there are 6 deaths. Despite the several-hour barrage no planes are downed."], ["1942-02-26T00:00:00", "The worst coal dust explosion to date, in Honkeiko, China, claims 1,549 lives."], ["1942-02-26T00:00:00", "The 14th Academy Awards ceremony is held in Los Angeles; How Green Was My Valley wins Best Picture."], ["1942-02-27T00:00:00", "WWII: Battle of the Java Sea: An allied (ABDA) task force of 14 vessels under Dutch command, trying to stem a Japanese invasion of the Dutch East Indies, is defeated by a 19 vessel Japanese task force in the Java Sea; 2.300 sailors die, including the commander, admiral Karel Doorman; Japanese attain naval hegemony in East-Asia"], ["1942-03-09T00:00:00", "WWII: Executive order 9082 (February 28, 1942) comes into effect reorganizing the United States Army into three major commands: Army Ground Forces, Army Air Forces, and Services of Supply, later redesignated Army Service Forces, with Henry H. Arnold as Commanding General of the United States Army Air Forces."], ["1942-03-12T00:00:00", "WWII: U.S. General Douglas MacArthur, his family, and key members of his staff are evacuated by PT boat, under cover of darkness, from Corregidor in the Philippines. Command of U.S. forces in the Philippines passes to Major General Jonathan M. Wainwright."], ["1942-03-16T00:00:00", "WWII: New Zealand and Australia declare war on Thailand."], ["1942-03-17T00:00:00", "The Holocaust: the Nazi German Bełżec extermination camp opens in occupied Poland about 1 km south of the railroad station at Bełżec in the Lublin district of the General Government. At least 434,508 people are killed here up to December 1942."], ["1942-03-18T00:00:00", "Franklin D. Roosevelt, President of the United States, signs Executive Order 9102, creating the War Relocation Authority (WRA), which becomes responsible for the internment of Americans of Japanese and, to a lesser extent, German and Italian descent, many of them legal citizens."], ["1942-03-20T00:00:00", "WWII: After being forced to flee the Philippines, U.S. General Douglas MacArthur announces (in Terowie, South Australia), \"I came through and I shall return.\""], ["1942-03-23T00:00:00", "WWII: The Germans burn down the Ukrainian village of Yelino (Koriukivka Raion), killing 296 civilians."], ["1942-03-24T00:00:00", "The evacuation of Polish nationals from the Soviet Union begins. It is conducted in two phases: until 5 April; and between 10 and 30 August 1942, by sea from Krasnovodsk to Pahlavi (Anzali), and (to a lesser extent) overland from Ashkabad to Mashhad. In all, 115,000 people are evacuated, 37,000 of them civilians, 18,000 children (7% of the number of Polish citizens originally exiled to the Soviet Union)."], ["1942-03-28T00:00:00", "WWII: St Nazaire Raid (Operation Chariot) - British Commandos raid Saint-Nazaire on the coast of Western France to put its dockyard facilities out of action."], ["1942-04-03T00:00:00", "WWII: Japanese forces begin an all-out assault on the United States and Filipino troops on the Bataan Peninsula."], ["1942-04-05T00:00:00", "WWII: Easter Sunday Raid - Aircraft of the Japanese Navy attack Colombo in Ceylon (Sri Lanka). Royal Navy cruisers HMS Cornwall and HMS Dorsetshire are sunk southwest of the island."], ["1942-04-09T00:00:00", "WWII: - The Bataan Peninsula falls and the Bataan Death March begins."], ["1942-04-09T00:00:00", "WWII: - The Japanese Navy launches an air raid on Trincomalee in Ceylon (Sri Lanka); the Royal Navy aircraft carrier HMS Hermes (95) and Royal Australian Navy destroyer HMAS Vampire are sunk off the country's East Coast."], ["1942-04-13T00:00:00", "The United States Federal Communications Commission's minimum programming time required of TV stations is cut from 15 hours to 4 hours a week during the war."], ["1942-04-14T00:00:00", "WWII: The submarine HMS Upholder is sunk."], ["1942-04-14T00:00:00", "WWII: The German submarine U-85 is sunk by USS Roper."], ["1942-04-15T00:00:00", "WWII: Award of the George Cross to Malta: King George VI awards the George Cross to the island of Malta to mark the Siege of Malta, saying, \"To honour her brave people I award the George Cross to the Island Fortress of Malta, to bear witness to a heroism and a devotion that will long be famous in history\" (from January 1 to July 24, there is only one 24-hour period during which no bombs fall on this tiny island)."], ["1942-04-17T00:00:00", "WWII: Henri Giraud the French commander captured in 1940, escapes from Königstein Fortress."], ["1942-04-18T00:00:00", "WWII: Tokyo, Japan, is attacked by the Doolittle Raid, a small force of B-25 Mitchell bomber aircraft commanded by then-Lieutenant Colonel James \"Jimmy\" Doolittle."], ["1942-04-23T00:00:00", "WWII: Exeter becomes the first historic English city bombed as part of the Baedeker Blitz in retaliation for the British bombing of Lübeck."], ["1942-04-23T00:00:00", "Exeter-born William Temple enthroned as Archbishop of Canterbury."], ["1942-04-26T00:00:00", "WWII: The Reichstag meets for the last time, dissolving itself and proclaiming Adolf Hitler the \"Supreme Judge of the German People\", granting him the power of life and death over every German citizen."], ["1942-04-27T00:00:00", "WWII: A national plebiscite is held in Canada on the issue of conscription."], ["1942-04-27T00:00:00", "The Jewish Star of David is required wearing for all Jews in the Netherlands and Belgium; Jews in other Nazi-controlled countries have already been wearing it."], ["1942-04-29T00:00:00", "WWII: An explosion at a chemical factory in Tessenderlo, Belgium leaves 200 dead and 1,000 injured."], ["1942-05-05T00:00:00", "WWII - Operation Ironclad: British forces invade the French colony of Madagascar."], ["1942-05-07T00:00:00", "WWII: On Corregidor, the last American and Filipino forces in the Philippines surrender to the Japanese under command of 2Lt. Robert L. Obourn (92nd Coastal Artillery Corps Battalion, G Battery) from Fort Mills."], ["1942-05-08T00:00:00", "WWII: The Battle of the Kerch Peninsula: The German 11th Army begins Operation Trappenjagd (Bustard Hunt) and destroys the bridgehead of the three Soviet Armies (44th, 47th, and 51st) defending the Kerch Peninsula, in the eastern part of the Crimea."], ["1942-05-08T00:00:00", "WWII: The Battle of the Coral Sea (first battle in naval history where 2 enemy fleets fight without seeing each other's fleets) ends in an Allied victory."], ["1942-05-08T00:00:00", "WWII: The Battle of the Kerch Peninsula: German and Romanian forces launches Unternehmen Trappenjagd (Operation Busted Hunt) aiming at defeating the Soviet Crimean Front defending the Kerch Peninsula. The battle ends in Axis victory. Part of the Eastern Front."], ["1942-05-12T00:00:00", "WWII - Second Battle of Kharkov: In the eastern Ukraine, the Soviet Army initiates a major offensive. During the battle the Soviets capture the city of Kharkov from the German Army, only to be encircled and destroyed."], ["1942-05-12T00:00:00", "WWII: The Japanese minelayer Okinoshima is sunk by the American submarine USS S-42."], ["1942-05-14T00:00:00", "Aaron Copland's Lincoln Portrait is performed for the first time by the Cincinnati Symphony Orchestra."], ["1942-05-15T00:00:00", "WWII: In the United States, a bill creating the Women's Auxiliary Army Corps (WAAC) is signed into law."], ["1942-05-20T00:00:00", "The first African-American seamen are taken into the United States Navy."], ["1942-05-21T00:00:00", "WWII: Mexico declares war against Nazi Germany after the sinking of the Mexican tanker Faja de Oro by German submarine U-160 off Key West."], ["1942-05-26T00:00:00", "WWII - Battle of Bir Hakeim: The Free French and British troops slow the German advance in North Africa."], ["1942-05-26T00:00:00", "WWII: Anglo-Soviet Treaty of 1942 to help establish military and political alliance between the USSR and the British Empire is signed in London by foreign Secretary Anthony Eden and by Soviet foreign minister Vyacheslav Molotov."], ["1942-05-27T00:00:00", "WWII - Operation Anthropoid: Czech paratroopers attempt to assassinate Reinhard Heydrich in Prague."], ["1942-06-01T00:00:00", "WWII: Mexico declares war on Germany, Italy and Japan."], ["1942-06-01T00:00:00", "The Grand Coulee Dam is finished on the Columbia River."], ["1942-06-04T00:00:00", "WWII: Reinhard Heydrich succumbs to wounds sustained on May 27 from Czechoslovakian paratroopers acting in Operation Anthropoid."], ["1942-06-05T00:00:00", "The United States declares war on Bulgaria, Hungary & Romania."], ["1942-06-07T00:00:00", "WWII: Japanese forces invade the Aleutian Islands (the first invasion of American soil in 128 years)."], ["1942-06-08T00:00:00", "WWII: Attack on Sydney Harbour: The Australian cities of Sydney and Newcastle are shelled by Japanese submarines. The eastern suburbs of both cities are damaged and the east coast is blacked out."], ["1942-06-09T00:00:00", "WWII: - Nazis burn the Czech village of Lidice in reprisal for the killing of Reinhard Heydrich."], ["1942-06-09T00:00:00", "WWII: - (12:30 a.m.) - B-17 Flying Fortress air crash near Auckland."], ["1942-06-10T00:00:00", "WWII: The Gestapo massacres 173 male residents of Lidice, Czechoslovakia in retaliation for the killing of Reinhard Heydrich."], ["1942-06-12T00:00:00", "The Holocaust: On her 13th birthday, Anne Frank makes the first entry in her new diary."], ["1942-06-13T00:00:00", "WWII: The United States opens its Office of War Information, a propaganda center."], ["1942-06-18T00:00:00", "WWII: The SS surrounds the church where Jan Kubiš and Jozef Gabčík, the assassins of Reinhard Heydrich, are hiding. To avoid capture, the two men commit suicide."], ["1942-06-29T00:00:00", "WWII: The Germans launch Case Blue, Army Group South's drive to Stalingrad and the Baku Oil fields."], ["1942-06-29T00:00:00", "WWII: The German Eleventh Army under Erich von Manstein takes Sevastopol, although fighting rages until July 9."], ["1942-07-03T00:00:00", "WWII: Guadalcanal, occupied only by aborigines falls to the Japanese Naval construction force deployed to construct an air field on the island."], ["1942-07-04T00:00:00", "WWII in the European Theater of Operations: - Twenty-four ships are sunk by German bombers and submarines after Convoy PQ 17 to the Soviet Union is scattered in the Arctic Ocean to evade the German battleship Tirpitz."], ["1942-07-04T00:00:00", "WWII in the European Theater of Operations: - US Eighth Air Force inauspiciously flies its first mission in Europe using borrowed British planes and bombs targets in the Netherlands, such as De Kooy airfield attached to Den Helder naval base. Three of six aircraft return; Captain Charles C. Kegelman is the first member of 8th Airforce to be awarded DFC for this mission."], ["1942-07-06T00:00:00", "The Holocaust: Anne Frank's family goes into hiding in an attic above her father's office in an Amsterdam warehouse."], ["1942-07-08T00:00:00", "Turkish prime minister Refik Saydam died while working in office. For one day he is succeeded by Ahmet Fikri Tüzer"], ["1942-07-09T00:00:00", "Şükrü Saracoğlu forms the new (13th) government in Turkey."], ["1942-07-13T00:00:00", "WWII: German U-boats sink 3 more merchant ships in the Gulf of St. Lawrence."], ["1942-07-14T00:00:00", "WWII: Germany introduces the Ostvolk Medal for Soviet personnel in the Wehrmacht."], ["1942-07-16T00:00:00", "The Holocaust: By order of the Vichy France government headed by Pierre Laval, French police officers round-up 13,000-20,000 Jews and imprison them in the Winter Velodrome."], ["1942-07-16T00:00:00", "Georges Bégué and others escape from the Mauzac prison camp."], ["1942-07-18T00:00:00", "WWII: The Germans test fly the Messerschmitt Me 262 (using only its jets) for the first time."], ["1942-07-19T00:00:00", "WWII: Battle of the Atlantic: German Grand Admiral Karl Dönitz orders the last U-boats to withdraw from their United States Atlantic coast positions, in response to an effective American convoy system."], ["1942-07-21T00:00:00", "The Japanese establish a beachhead on the north coast of New Guinea in the Buna-Gona area; a small Australian force begins a rearguard action on the Kokoda Track campaign."], ["1942-07-22T00:00:00", "The Holocaust: The systematic deportation of Jews from the Warsaw Ghetto begins."], ["1942-07-23T00:00:00", "Holocaust: The gas chambers at Treblinka extermination camp begin operation, killing 6,500 Jews newly arrived from the Warsaw Ghetto."], ["1942-07-29T00:00:00", "The Presidium of the Supreme Soviet of the USSR institutes the Order of Suvorov, the Order of Kutuzov, and reinstates the Order of Alexander Nevsky."], ["1942-07-30T00:00:00", "WAVES (Women Accepted for Volunteer Emergency Service) in the United States."], ["1942-07-30T00:00:00", "SS Robert E. Lee sunk in the Gulf of Mexico by U-166 which is itself sunk by the escorting patrol craft."], ["1942-07-31T00:00:00", "The Oxford Committee for Famine Relief (Oxfam) is founded in England."], ["1942-08-07T00:00:00", "WWII: Guadalcanal Campaign begins - The U.S. Navy and the U.S. Marine Corps begin the first American offensive of the war with an amphibious landing on the island of Guadalcanal in the Solomon Islands."], ["1942-08-08T00:00:00", "WWII: Convoy SC 94 loses ten ships as the first to be heavily attacked by U-boats resuming mid-Atlantic wolf pack attacks through the climactic winter of 1942\\43."], ["1942-08-08T00:00:00", "WWII: In Washington, D.C., six German saboteurs are executed for their role in a failed mission of Operation Pastorius. (Two others are cooperative and receive sentences of life imprisonment instead, being freed a few years after the end of the war.)"], ["1942-08-08T00:00:00", "Walt Disney's fifth animated feature film Bambi receives its world première in London."], ["1942-08-09T00:00:00", "Indian leader, Mohandas Gandhi is arrested in Bombay by British forces."], ["1942-08-09T00:00:00", "Start, led by the goalkeeper Nikolai Trusevich, play football against the German Luftwaffe team Flakelf in Nazi-occupied Kiev. Against all odds, they win 5-3. Eight of them are later arrested and tortured, and at least four are killed."], ["1942-08-09T00:00:00", "Leningrad première of Shostakovich's Symphony No. 7 with the city still under siege."], ["1942-08-13T00:00:00", "Quit India resolution is passed by the Bombay session of the All India Congress Committee (AICC), which leads to the start of a historical civil disobedience movement across India."], ["1942-08-14T00:00:00", "A massive burst of cosmic rays is detected by instruments in London."], ["1942-08-15T00:00:00", "WWII: The American tanker Ohio reaches Malta as part of the convoy of Operation Pedestal."], ["1942-08-16T00:00:00", "Polish-Jewish teacher Janusz Korczak follows a group of Jewish children into the Treblinka extermination camp."], ["1942-08-16T00:00:00", "The U.S. Navy blimp L-8 (Flight 101) comes ashore near San Francisco, eventually coming down in Daly City (the crew is missing)."], ["1942-08-17T00:00:00", "WWII: First raid by heavy bombers of U.S. Eighth Air Force against occupied France."], ["1942-08-19T00:00:00", "WWII: Dieppe Raid: Allied forces raid Dieppe, France."], ["1942-08-20T00:00:00", "Plutonium is isolated for the first time at the Metallurgical Laboratory of the University of Chicago."], ["1942-08-22T00:00:00", "WWII: Brazil declares war on Germany and Italy."], ["1942-08-23T00:00:00", "WWII: Battle of Stalingrad begins: German troops reach the suburbs of Stalingrad."], ["1942-08-24T00:00:00", "WWII: - Charge of the Savoia Cavalleria at Isbuscenskij: An Italian cavalry regiment attacks Soviet forces with drawn sabres at Isbuscenskij in Russia, one of the last major cavalry charges."], ["1942-08-24T00:00:00", "WWII: - North Atlantic convoy ON 122 is attacked by U-boats sinking four ships."], ["1942-08-25T00:00:00", "WWII: Japanese marines land at Milne Bay."], ["1942-08-25T00:00:00", "Prince George, Duke of Kent, brother to King George VI and King Edward VIII, dies in a flying accident over Morven in Scotland at the age of 39."], ["1942-08-30T00:00:00", "Luxembourg is formally annexed to the German Reich."], ["1942-08-31T00:00:00", "A general strike is launched in Luxembourg to protest against forced conscription."], ["1942-09-03T00:00:00", "The Holocaust: A German attempt to liquidate the Jewish Łachwa Ghetto in occupied Poland leads to an uprising, probably the first ghetto uprising of the war."], ["1942-09-05T00:00:00", "WWII: Battle of Milne Bay: Japanese forces suffer their first defeat on land."], ["1942-09-05T00:00:00", "The Holocaust: The Jews of Wolbrom in occupied Poland are rounded up by the Germans and their Ukrainian collaborators. What was once a flourishing community suddenly ceases to exist."], ["1942-09-09T00:00:00", "WWII: A Japanese floatplane drops incendiary devices at Mount Emily, near Brookings, Oregon, in the first of two \"Lookout Air Raids\", the first bombing of the continental United States."], ["1942-09-10T00:00:00", "WWII: North Atlantic convoy ON 127 is attacked by U-boats sinking six ships."], ["1942-09-10T00:00:00", "Women's Auxiliary Ferrying Squadron (WAFS) begins operation in the United States."], ["1942-09-12T00:00:00", "The RMS Laconia, carrying civilians, Allied soldiers and Italian Prisoners of War, is torpedoed off the coast of West Africa and sinks."], ["1942-09-15T00:00:00", "Women's Flying Training Detachment (WFTD) established in the United States."], ["1942-09-24T00:00:00", "WWII: Andrée Borrel and Lise de Baissac become the first female SOE agents to be parachuted into occupied France."], ["1942-09-27T00:00:00", "WWII: Both commerce raiding German auxiliary cruiser Stier and American Liberty ship SS Stephen Hopkins sink following a gun battle in the South Atlantic. Hilfskreuzer Stier is the only commerce raider to be sunk by a defensively equipped merchant ship."], ["1942-10-02T00:00:00", "The British cruiser HMS Curacoa collides with the liner RMS Queen Mary (carrying troops from the United States) off the coast of Donegal and sinks; 338 drown."], ["1942-10-03T00:00:00", "The first A-4 rocket is successfully launched from Test Stand VII at Peenemünde, Germany. The rocket flies 147 kilometres wide and reaches a height of 84.5 kilometres, becoming the first man-made object to reach space."], ["1942-10-09T00:00:00", "The Statute of Westminster Adoption Act passed by the Parliament of Australia formalizes Australian autonomy from the United Kingdom."], ["1942-10-11T00:00:00", "WWII - Battle of Cape Esperance: On the northwest coast of Guadalcanal, United States Navy ships intercept and defeat a Japanese fleet on their way to reinforce troops on the island."], ["1942-10-13T00:00:00", "WWII: North Atlantic convoy SC 104 is attacked by U-boats sinking seven ships."], ["1942-10-14T00:00:00", "A German U-boat sinks the ferry SS Caribou off Newfoundland, killing 137."], ["1942-10-16T00:00:00", "A hurricane and flood in Bombay kill 40,000."], ["1942-10-16T00:00:00", "The Mouse of Tomorrow featuring the debut of Mighty Mouse is released."], ["1942-10-18T00:00:00", "WWII - Hitler issues Commando Order which stipulates that all Allied commandos encountered by German forces should be executed immediately without trial, even in proper uniforms, in response to the Dieppe Raid and Operation Basalt conducted by the Allies. After the war, the Nuremberg trials found this order a direct violation of the laws and customs of war."], ["1942-10-23T00:00:00", "Award-winning composer and Hollywood songwriter Ralph Rainger (\"Thanks for the Memory\") is among 12 people killed in the mid-air collision between an American Airlines DC-3 airliner and a U.S. Army bomber near Palm Springs, California."], ["1942-10-26T00:00:00", "WWII: Battle of the Santa Cruz Islands: Two Japanese aircraft carriers are heavily damaged and one U.S. Navy carrier is sunk."], ["1942-10-28T00:00:00", "The Alaska Highway is completed."], ["1942-10-29T00:00:00", "The Holocaust: In the United Kingdom, leading clergymen and political figures hold a public meeting to register outrage over Nazi Germany's persecution of Jews."], ["1942-10-30T00:00:00", "WWII: - U-boats sink eleven ships attacking diversionary convoy SL 125, but move out of the path of approaching troopships carrying Allied Operation Torch invasion forces."], ["1942-10-30T00:00:00", "WWII: - British sailors board U-559 as it sinks in the Mediterranean and retrieve its Enigma machine and codebooks."], ["1942-11-01T00:00:00", "WWII: North Atlantic convoy SC 107 is heavily attacked by U-boats sinking fifteen ships."], ["1942-11-02T00:00:00", "A USAAF squadron, including B-24 Liberators, intercepts many Luftwaffe patrols off the coast of Oran, Algeria."], ["1942-11-03T00:00:00", "WWII: Second Battle of El Alamein: German forces under Erwin Rommel are forced to retreat during the night."], ["1942-11-08T00:00:00", "WWII: - Operation Torch: United States and United Kingdom forces land in French North Africa."], ["1942-11-08T00:00:00", "WWII: - French Resistance Coup in Algiers: 400 French civil resisters neutralize the Vichyist XIXth Army Corps and the Vichyist generals (Juin, Darlan, etc.) thus allowing the immediate success of Operation Torch in Algiers, and ultimately the whole of French North Africa."], ["1942-11-09T00:00:00", "WWII: U.S serviceman Edward Leonski is hanged at Melbourne's Pentridge Prison for the \"Brown-Out\" murders of 3 women in May."], ["1942-11-10T00:00:00", "WWII: In violation of a 1940 armistice, Germany invades Vichy France, following French Admiral François Darlan's agreement to an armistice with the Allies in North Africa."], ["1942-11-12T00:00:00", "WWII: Guadalcanal Campaign: A naval battle near Guadalcanal starts between Japanese and American forces."], ["1942-11-13T00:00:00", "WWII: - Guadalcanal Campaign: Aviators from the USS Enterprise sink the Japanese battleship Hiei."], ["1942-11-13T00:00:00", "WWII: - British forces capture Tobruk."], ["1942-11-15T00:00:00", "WWII: - The Naval Battle of Guadalcanal ends: Although the United States Navy suffers heavy losses, it retains control of Guadalcanal."], ["1942-11-15T00:00:00", "WWII: - A BOAC scheduled passenger flight, a DC-3 with registration G-AGBB, (formerly KLM PH-ALI, Ibis), en route between Lisbon and Bristol, is attacked over the Bay of Biscay by German fighters. Although damaged, it escapes and lands in England. Other attacks follow on the same aircraft and scheduled route: April 19 and June 1, 1943 (fatal)."], ["1942-11-15T00:00:00", "WWII: - British forces capture Derna, Libya."], ["1942-11-18T00:00:00", "WWII: North Atlantic convoy ON 144 is attacked by U-boats sinking five ships."], ["1942-11-19T00:00:00", "WWII: Battle of Stalingrad: Soviet Union forces under General Georgy Zhukov launch the Operation Uranus counter-attacks at Stalingrad, turning the tide of the battle in the USSR's favor."], ["1942-11-20T00:00:00", "WWII: British forces capture Benghazi."], ["1942-11-21T00:00:00", "The completion of the Alaska Highway (also known as the Alcan Highway) is celebrated (however, the \"highway\" is not usable by general vehicles until 1943)."], ["1942-11-22T00:00:00", "WWII: Battle of Stalingrad: The situation for the German attackers of Stalingrad seems desperate during the Soviet counter-attack Operation Uranus, and General Friedrich Paulus sends Adolf Hitler a telegram saying that the German Sixth Army is surrounded."], ["1942-11-23T00:00:00", "WWII - A German U-boat sinks the SS Ben Lomond off the coast of Brazil. One crewman, Chinese second steward Poon Lim, is separated from the others and spends 130 days adrift until he is rescued on April 3, 1943."], ["1942-11-23T00:00:00", "WWII - Legislation approves the United States Coast Guard Women's Reserve to help fill jobs and free men to serve during the war effort. They are known as the SPARS (\"Semper Paratus, Always Ready!\")"], ["1942-11-26T00:00:00", "The movie Casablanca premières at the Hollywood Theater in New York City."], ["1942-11-27T00:00:00", "WWII: At Toulon, the French navy scuttles its ships and submarines to keep them out of Nazi hands."], ["1942-11-28T00:00:00", "Cocoanut Grove fire: A fire in the Cocoanut Grove night club in Boston, Massachusetts, kills 491."], ["1942-11-28T00:00:00", "The large-scale German \"pacification\" of the Zamojszczyzna region of Poland begins."], ["1942-11-29T00:00:00", "The Blue Star Line cargo liner MV Dunedin Star runs aground on the Skeleton Coast of Namibia. Crew and passengers survive following a 26-day overland trek to Windhoek."], ["1942-12-01T00:00:00", "Gasoline rationing begins in the United States."], ["1942-12-02T00:00:00", "Manhattan Project: Below the bleachers of Stagg Field at the University of Chicago, a team led by Enrico Fermi initiates the first self-sustaining nuclear chain reaction (a coded message, \"The Italian navigator has landed in the new world\" is then sent to U.S. President Franklin D. Roosevelt)."], ["1942-12-04T00:00:00", "The Holocaust: In Warsaw, two women, Zofia Kossak and Wanda Filipowicz, risk their lives by setting up the Council for the Assistance of the Jews."], ["1942-12-04T00:00:00", "WWII: USAAF bombers make their first raid on Italy."], ["1942-12-07T00:00:00", "WWII: British commandos conduct Operation Frankton, a raid on shipping in Bordeaux harbour."], ["1942-12-08T00:00:00", "A fire at Seacliff Lunatic Asylum in New Zealand kills 39 patients."], ["1942-12-17T00:00:00", "The Allies issue the Joint Declaration by Members of the United Nations, the first time they publicly acknowledge the Holocaust."], ["1942-12-22T00:00:00", "An avalanche in Aliquippa, Pennsylvania kills 26, including Vulcan Crucible Steel heir-apparent Samuel A. Stafford Sr., when two 100 ton boulders fall on a bus filled with wartime steel workers on their way home."], ["1942-12-22T00:00:00", "An airplane carrying prominent Ustashe general Jure Francetić crashes. Francetić dies as result of the injuries on December 27."], ["1942-12-24T00:00:00", "French Admiral Darlan, the former Vichy leader who has switched over to the Allies following the Torch landings, is assassinated in Algiers."], ["1942-12-27T00:00:00", "The Union of Pioneers of Yugoslavia is founded."], ["1942-12-28T00:00:00", "North Atlantic Convoy ON 154 is heavily attacked by U-boats sinking thirteen ships."]]