[["1928-01-01T00:00:00", "Estonia changes its currency from the mark to the kroon."], ["1928-01-12T00:00:00", "Convicted American murderer Ruth Snyder is executed at Sing Sing."], ["1928-01-17T00:00:00", "The OGPU arrests Leon Trotsky in Moscow; he assumes a status of passive resistance."], ["1928-01-26T00:00:00", "The volcanic island Anak Krakatau appears."], ["1928-01-31T00:00:00", "Leon Trotsky is exiled to Alma-Ata."], ["1928-02-12T00:00:00", "Heavy hail kills 11 in Britain."], ["1928-02-20T00:00:00", "The Japanese general election produces a hung parliament."], ["1928-02-25T00:00:00", "Charles Jenkins Laboratories of Washington, D.C., becomes the first holder of a television license from the Federal Radio Commission."], ["1928-03-12T00:00:00", "In California, the St. Francis Dam north of Los Angeles fails, killing 600."], ["1928-03-21T00:00:00", "Charles Lindbergh is presented the Medal of Honor for his first Transatlantic flight."], ["1928-03-26T00:00:00", "The China Academy of Art is founded in Hangzhou (originally named the National Academy of Art)."], ["1928-04-10T00:00:00", "\"Pineapple Primary\": The United States Republican Party primary elections in Chicago are preceded by violence, bombings and assassination attempts (two politicians are killed, Octavius C. Granady and Giuseppe Esposito)."], ["1928-04-12T00:00:00", "A bomb attack against Italian Fascist leader Benito Mussolini in Milan kills 17 bystanders."], ["1928-04-14T00:00:00", "Two earthquakes in Chirpan and Plovdiv in Bulgaria destroy more than 21,000 buildings and kill almost 130 people."], ["1928-04-22T00:00:00", "An earthquake destroys 200,000 buildings in Corinth."], ["1928-04-28T00:00:00", "28 inches of snow fall in southern-central Pennsylvania."], ["1928-05-03T00:00:00", "Jinan Incident: An armed conflict between the Imperial Japanese Army allied with Northern Chinese warlords against the Kuomintang's southern army, occurs in Jinan, China."], ["1928-05-07T00:00:00", "Passage of the Representation of the People Act in the United Kingdom lowers the voting age for women from 30 to 21 giving them equal suffrage with men from July 2."], ["1928-05-10T00:00:00", "The first regular schedule of television programming begins in Schenectady, New York by the General Electric's television station W2XB (the station is popularly known as WGY Television, after its sister radio station WGY)."], ["1928-05-15T00:00:00", "The Royal Flying Doctor Service of Australia commences operations."], ["1928-05-15T00:00:00", "The animated short Plane Crazy is released by Disney Studios in Los Angeles, featuring the first appearances of Mickey and Minnie Mouse."], ["1928-05-23T00:00:00", "A bomb attack against the Italian consulate in Buenos Aires, Argentina kills 22 and injures 43."], ["1928-05-24T00:00:00", "The airship Italia crashes at the North Pole; one of the occupants is Italian general Umberto Nobile. A rescue expedition leaves for the Pole on May 30."], ["1928-05-30T00:00:00", "Rookie driver Louis Meyer wins his first Indianapolis 500. He would win that race again in 1933 and 1936."], ["1928-06-03T00:00:00", "American serial killer Albert Fish kidnaps and kills 10-year-old Grace Budd."], ["1928-06-04T00:00:00", "Huanggutun Incident: Zhang Zuolin, a warlord, is killed by Japanese agents."], ["1928-06-08T00:00:00", "By seizing Beijing and renaming it Běipíng, the National Revolutionary Army puts an end to the 'Fengtian warlords' Beiyang government there."], ["1928-06-09T00:00:00", "Australian aviator Charles Kingsford Smith and his crew complete the first flight across the Pacific Ocean from the mainland United States to Australia in Fokker F.VII aircraft Southern Cross. Having left Oakland, California on May 31, they reach Brisbane via Honolulu and Fiji."], ["1928-06-11T00:00:00", "A medical doctors' strike begins in Vienna."], ["1928-06-14T00:00:00", "Students take over the medical wing of Rosario University in Argentina."], ["1928-06-20T00:00:00", "Puniša Račić kills three opposition representatives in the Yugoslavian Parliament, and injures three others in gun attack."], ["1928-06-24T00:00:00", "A Swedish aeroplane rescues part of the Italian North Pole expedition, including Umberto Nobile. The Soviet icebreaker Krasin saves the rest July 12."], ["1928-06-28T00:00:00", "The International Railway (New York-Ontario) switches to one-man crews for its trolleys in Canada."], ["1928-06-29T00:00:00", "At the 1928 Democratic National Convention in Houston, Governor of New York Al Smith becomes the first Catholic nominated by a major political party for President of the United States."], ["1928-07-02T00:00:00", "Charles Jenkins Laboratories' W3XK station begins broadcasting on 6.42 MHz using 48 lines."], ["1928-07-03T00:00:00", "British inventor John Logie Baird demonstrates the world's first colour television transmission."], ["1928-07-07T00:00:00", "The first machine-sliced and machine-wrapped loaf of bread is sold in Chillicothe, Missouri, using Otto Frederick Rohwedder's technology."], ["1928-07-12T00:00:00", "Mexican aviator Emilio Carranza dies in a solo plane crash in the New Jersey Pine Barrens, while returning from a goodwill flight to New York City."], ["1928-07-17T00:00:00", "José de León Toral assassinates Álvaro Obregón, president of Mexico."], ["1928-07-25T00:00:00", "The United States recalls its troops from China."], ["1928-07-27T00:00:00", "English cricketer Tich Freeman becomes the only bowler ever to take 200 first-class wickets before the end of July."], ["1928-07-27T00:00:00", "Radclyffe Hall's novel The Well of Loneliness, with its theme of lesbian love, is published in London."], ["1928-08-02T00:00:00", "Italy and Ethiopia sign the Italo-Ethiopian Treaty."], ["1928-08-16T00:00:00", "Serial killer Carl Panzram is arrested in Washington, D.C., for burglary. According to his confession, \"In my lifetime I have murdered 21 human beings, I have committed thousands of burglaries, robberies, larcenies, arsons and, last but not least, I have committed sodomy on more than 1,000 male human beings. For all these things I am not in the least bit sorry.\""], ["1928-08-22T00:00:00", "Al Smith accepts the Democratic presidential nomination, with WGY/W2XB simulcasting the event on radio and television."], ["1928-08-25T00:00:00", "Ahmet Zogu proclaims himself King Zog of Albania; he is crowned September 1."], ["1928-08-26T00:00:00", "In Scotland, May Donoghue finds the remains of a snail in her ginger beer, leading to the landmark negligence case Donoghue v Stevenson."], ["1928-08-27T00:00:00", "The Kellogg-Briand Pact is signed in Paris, the first treaty to outlaw aggressive war."], ["1928-08-29T00:00:00", "C.D. Motagua is founded as an association football club in Honduras."], ["1928-08-31T00:00:00", "The Threepenny Opera (German: Die Dreigroschenoper) by Bertolt Brecht and Kurt Weill opens at the Theater am Schiffbauerdamm, Berlin."], ["1928-09-01T00:00:00", "Ahmet Zogu, President of the Albanian Republic, declares the country to be a constitutional monarchy, the Albanian Kingdom, with himself as King Zog I."], ["1928-09-01T00:00:00", "Richard E. Byrd leaves New York for the Arctic."], ["1928-09-03T00:00:00", "Philo Farnsworth demonstrates to the Press in San Francisco the world's first working all-electronic television system, employing electronic scanning in both the pickup and display devices."], ["1928-09-03T00:00:00", "Alexander Fleming, at St Mary's Hospital, London, accidentally rediscovers the antibiotic Penicillin."], ["1928-09-11T00:00:00", "The Queen's Messenger is the first melodrama broadcast by Ernst F.W. Alexanderson at W2XAD (Schenectady, New York); WMAK (Kenmore) begins broadcasting in Buffalo, New York."], ["1928-09-15T00:00:00", "Tich Freeman sets an all-time record for the number of wickets taken in an English cricket season."], ["1928-09-16T00:00:00", "The Okeechobee hurricane kills at least 2,500 people in Florida."], ["1928-09-25T00:00:00", "Paul and Joseph Galvin incorporate the Galvin Manufacturing Corporation (later known as Motorola and Freescale)."], ["1928-10-01T00:00:00", "Joseph Stalin launches the First Five-Year Plan (1928-1932 - The average nonfarm wage falls by 50% in the Soviet Union). - October 2 - Josemaría Escrivá founds Opus Dei."], ["1928-10-01T00:00:00", "Joseph Stalin launches the First Five-Year Plan (1928-1932 - The average nonfarm wage falls by 50% in the Soviet Union). - Arvid Lindman returns as Prime Minister of Sweden , with right-wing rival Ernst Trygger as Foreign Minister of Sweden ."], ["1928-10-02T00:00:00", "Josemaría Escrivá founds Opus Dei."], ["1928-10-07T00:00:00", "Haile Selassie is crowned king (not yet emperor) of Abyssinia."], ["1928-10-08T00:00:00", "Chiang Kai-shek is named as Generalissimo (Chairman of the National Military Council) of the Nationalist Government of the Republic of China."], ["1928-10-12T00:00:00", "An iron lung respirator is used for the first time at Children's Hospital, Boston."], ["1928-10-19T00:00:00", "William Edward Hickman is executed at San Quentin State Prison for the 1927 murder of 12-year-old Marion Parker."], ["1928-10-22T00:00:00", "The Phi Sigma Alpha Fraternity is founded at the University of Puerto Rico, Río Piedras Campus."], ["1928-10-26T00:00:00", "The International Red Cross and Red Crescent Movement (ICRM) is formally established, with the adoption of the “Statutes of the International Red Cross”"]]