[["1938-01-01T00:00:00", "The California Golden Bears defeat the Alabama Crimson Tide in the 1938 Rose Bowl. Final score 13-0."], ["1938-01-01T00:00:00", "The Company 1938 OEM Industrial Groups was officially registered."], ["1938-01-01T00:00:00", "The new Constitution of Estonia enters into force, ending the Era of Silence and the authoritarian regime."], ["1938-01-01T00:00:00", "Sir Alexander Cadogan succeeds Sir Robert Vansittart as permanent under-secretary at the British Foreign Office; Vansittart is \"kicked upstairs\" by being given the new and unimportant office of Chief Diplomatic Advisor to the Government."], ["1938-01-01T00:00:00", "The Merrie Melodies cartoon short Daffy Duck & Egghead is released, being the first cartoon to give Daffy Duck his current name, as well as his second appearance."], ["1938-01-03T00:00:00", "The March of Dimes is established by Franklin Delano Roosevelt."], ["1938-01-12T00:00:00", "The German War Minister Field Marshal Werner von Blomberg marries Eva Gruhn in Berlin; Hermann Göring is best man at the wedding."], ["1938-01-16T00:00:00", "Two landmark live recordings are produced this day: the very first of Mahler's Ninth by the Vienna Philharmonic under Bruno Walter in the face of dire circumstance; and Benny Goodman and his orchestra become the first jazz musicians to headline a concert at Carnegie Hall in New York City."], ["1938-01-20T00:00:00", "King Farouk of Egypt marries Queen Farida Zulficar in Cairo."], ["1938-01-22T00:00:00", "Thornton Wilder's play Our Town is performed for the first time anywhere in Princeton, New Jersey. It premieres in New York City on February 4."], ["1938-01-25T00:00:00", "A brilliant aurora borealis described variously as \"a curtain of fire\" and a \"huge blood-red beam of light\" startles people across Europe and is visible as far south as Gibraltar."], ["1938-01-27T00:00:00", "The Niagara Bridge at Niagara Falls, New York collapses due to an ice jam."], ["1938-01-27T00:00:00", "German War Minister Field Marshal Werner von Blomberg resigns, following the revelation that his new wife had previously posed for pornographic photos."], ["1938-01-28T00:00:00", "The first ski tow in America begins operation in Vermont."], ["1938-02-04T00:00:00", "Adolf Hitler abolishes the War Ministry and creates the Oberkommando der Wehrmacht (High Command of the Armed Forces), giving him direct control of the German military. In addition, Hitler sacks political and military leaders considered unsympathetic to his philosophy or policies. General Werner von Fritsch is forced to resign as Commander of Chief of the German Army following accusations of homosexuality, and replaced by General Walther von Brauchitsch. Foreign Minister Baron Konstantin von Neurath is sacked and replaced by Joachim von Ribbentrop."], ["1938-02-04T00:00:00", "Walt Disney's Snow White and the Seven Dwarfs, the first cel-animated feature in motion picture history, is released in the United States following a premiere the previous year."], ["1938-02-06T00:00:00", "Black Sunday at Bondi Beach, Sydney, Australia: 300 swimmers are dragged out to sea in 3 freak waves; 80 lifesavers save all but 5."], ["1938-02-10T00:00:00", "Carol II of Romania takes dictatorial powers."], ["1938-02-12T00:00:00", "Chancellor Kurt von Schuschnigg of Austria meets Adolf Hitler at Berchtesgaden and, under threat of invasion, is forced to yield to German demands for greater Nazi participation in the Austrian government."], ["1938-02-14T00:00:00", "The British naval base at Singapore begins operations."], ["1938-02-20T00:00:00", "Sir Anthony Eden resigns as British Foreign Secretary following major disagreements with Prime Minister Neville Chamberlain over the best policy to follow in regards to Italy, and is succeeded by Lord Halifax."], ["1938-02-24T00:00:00", "A nylon bristle toothbrush becomes the first commercial product to be made with nylon yarn."], ["1938-03-03T00:00:00", "The Santa Ana River in California spills over its banks during a rainy winter, killing 58 people in Orange County and causing trouble as far inland as Palm Springs."], ["1938-03-03T00:00:00", "Oil is discovered in Saudi Arabia."], ["1938-03-03T00:00:00", "Sir Nevile Henderson, British Ambassador to Germany, presents a proposal to Hitler for an international consortium to rule much of Africa (in which Germany would be assigned a leading role) in exchange for a German promise never to resort to war to change her frontiers; Hitler rejects the British offer."], ["1938-03-12T00:00:00", "Anschluss: German troops occupy Austria; annexation is declared the following day."], ["1938-03-14T00:00:00", "French Premier Léon Blum reassures the Czechoslovak government that France will honor its treaty obligations to aid Czechoslovakia in event of German invasion."], ["1938-03-15T00:00:00", "Soviet Union announces officially that Nikolai Bukharin has been executed."], ["1938-03-17T00:00:00", "Poland presents an ultimatum to Lithuania, to establish normal diplomatic relations that were severed over the Vilnius Region."], ["1938-03-18T00:00:00", "Mexico nationalizes all foreign-owned oil properties within its borders."], ["1938-03-18T00:00:00", "General Werner von Fritsch is acquitted of charges of homosexuality at his court-martial."], ["1938-03-27T00:00:00", "Italian mathematician Ettore Majorana disappears suddenly under mysterious circumstances while going by ship from Palermo to Naples."], ["1938-03-28T00:00:00", "Hitler and Konrad Henlein meet in Berlin. Henlein is ordered to think of a demand which the Czech government could not possibly agree to, and to make that the main demand of the Sudetenland Nazi party."], ["1938-03-30T00:00:00", "Italy's Duce Benito Mussolini is granted equal power over the Italian military to that of King Victor Emmanuel III as First Marshal of the Empire held exclusively by Victor Emmanuel and Mussolini."], ["1938-04-10T00:00:00", "Édouard Daladier becomes prime minister of France. He appoints as Foreign Minister a leading advocate of the policy of appeasement, Georges Bonnet, effectively negating Blum's reassurances of March 14."], ["1938-04-10T00:00:00", "In a result that astonished even Hitler, the Austrian electorate in a national referendum approved Anschluss by an overwhelming 99.73%."], ["1938-04-16T00:00:00", "London and Rome sign an agreement that sees Britain recognise Italian control of Ethiopia in return for an Italian pledge to withdraw all its troops from Spain at the conclusion of the civil war there."], ["1938-04-18T00:00:00", "First appearance of Superman (as a backup story), in Action Comics #1 (cover date June). The date is established in court documents released during the legal battle over the rights to Superman."], ["1938-04-24T00:00:00", "Konstantin Päts becomes the first President of Estonia."], ["1938-04-25T00:00:00", "Erie Railroad Co. v. Tompkins: The U.S. Supreme Court overturns a century of federal common law."], ["1938-04-28T00:00:00", "The towns of Dana, Enfield, Greenwich, and Prescott in Massachusetts are disincorporated to make way for the Quabbin Reservoir."], ["1938-05-05T00:00:00", "The Vatican recognizes Francisco Franco's government in Spain."], ["1938-05-05T00:00:00", "General Ludwig Beck, Chief of the German Army's General Staff, submits a memorandum to Hitler opposing Fall Grün (Case Green), the plan for a war with Czechoslovakia, under the grounds that Germany is ill-prepared for the world war likely to result from such an attack."], ["1938-05-12T00:00:00", "U.S. Secretary of State Cordell Hull rejects Russia's offer of a joint defence pact to counter rise of Nazi Germany."], ["1938-05-14T00:00:00", "Chile withdraws from the League of Nations."], ["1938-05-17T00:00:00", "Information Please debuts on NBC Radio."], ["1938-05-20T00:00:00", "Czechoslovakia orders a partial mobilization of its armed forces along the German border."], ["1938-05-21T00:00:00", "Matsuo Toi kills 30 people in a village in Okayama, Japan, in the Tsuyama massacre, the world's worst spree killing by an individual until 1982."], ["1938-05-23T00:00:00", "Temporarily stymied by the Czechoslovak mobilization and international diplomatic unity in the face of German demands over the Sudetenland, Hitler orders the Foreign Office to tell the Czechoslovaks that he has no demands on their territory. The world at large mistakenly believes the crisis is averted."], ["1938-05-25T00:00:00", "Spanish Civil War: Alicante is bombed by fascist rebels, resulting in 313 deaths."], ["1938-05-25T00:00:00", "The Soviet ambassador to the United States, A.A. Troyanovsky, declares Moscow ready to defend Czechoslovakia."], ["1938-05-28T00:00:00", "In a conference at the Reichs Chancellery, Hitler declares his decision to destroy Czechoslovakia by military force, and orders the immediate mobilization of 96 Wehrmacht divisions."], ["1938-06-11T00:00:00", "Fire destroys 212 buildings in Ludza, Latvia."], ["1938-06-15T00:00:00", "László Bíró patents the ballpoint pen in Britain."], ["1938-06-19T00:00:00", "Italy beats Hungary 4-2 to win the 1938 World Cup."], ["1938-06-22T00:00:00", "Heavyweight boxing champion Joe Louis knocks out Max Schmeling in the first round of their rematch at Yankee Stadium in New York City."], ["1938-06-23T00:00:00", "The Civil Aeronautics Act is signed into law, forming the Civil Aeronautics Authority in the United States."], ["1938-06-23T00:00:00", "Marineland opens near St. Augustine, Florida."], ["1938-06-24T00:00:00", "A 450-metric-ton (496-short-ton) meteorite explodes about 12 miles (19 km) above the earth near Chicora, Pennsylvania."], ["1938-06-25T00:00:00", "Dr. Douglas Hyde is elected the first President of Ireland."], ["1938-07-03T00:00:00", "The steam locomotive Mallard sets the world speed record for steam by reaching 125.88 mph."], ["1938-07-03T00:00:00", "The last reunion of the Blue and Gray commemorates the 75th anniversary of the Battle of Gettysburg in Gettysburg, Pennsylvania."], ["1938-07-05T00:00:00", "The Non-Intervention Committee reaches an agreement to withdraw all foreign volunteers from the Spanish Civil War. The agreement is respected by most Republican foreign volunteers, notably by those from England and the United States, but is ignored by the governments of Germany and Italy."], ["1938-07-06T00:00:00", "The Evian Conference on Refugees is convened in France. No country in Europe is prepared to accept Jews fleeing persecution and the United States will only take 27,370. The prospect for European Jewry looks bleak."], ["1938-07-14T00:00:00", "Howard Hughes sets a new record by completing a 91-hour airplane flight around the world."], ["1938-07-18T00:00:00", "Wrong Way Corrigan takes off from New York, ostensibly heading for California. He lands in Ireland instead."], ["1938-07-22T00:00:00", "Britain rejected a proposal from its ambassador in Berlin, Nevile Henderson, for a four power summit on Czechoslovakia consisting of Britain, France, Germany and the U.S.S.R. London would under no circumstances accept the U.S.S.R. as a diplomatic partner."], ["1938-07-24T00:00:00", "First ascent of the Eiger north face."], ["1938-07-28T00:00:00", "A revolt against the Ioannis Metaxas dictatorship is put down in Chania, Greece."], ["1938-07-28T00:00:00", "Hawaii Clipper disappears with six passengers and nine crew en route from Guam to Manila."], ["1938-07-30T00:00:00", "The first ever issue of The Beano is published."], ["1938-08-04T00:00:00", "Lord Runciman arrives in Prague to act as Neville Chamberlain's special envoy in the continuing Sudetenland disturbances."], ["1938-08-06T00:00:00", "The Looney Tunes animated short Porky & Daffy is released."], ["1938-08-10T00:00:00", "At a secret summit with his leading generals, Hitler attacks General Beck's arguments against Fall Grün, winning the majority of his senior officers over to his point of view."], ["1938-08-18T00:00:00", "The Thousand Islands Bridge, connecting the United States with Canada, is dedicated by U.S. President Franklin D. Roosevelt."], ["1938-08-18T00:00:00", "Colonel General Ludwig Beck, convinced that Hitler's decision to attack Czechoslovakia will lead to a general European war, resigns his position as Chief of the Army General Staff in protest."], ["1938-08-18T00:00:00", "Ewald von Kleist-Schmenzin arrives in London looking for British support for an anti-Nazi putsch, using the looming crisis over the Sudetenland as a pretext. His private mission is dismissed by Neville Chamberlain as unimportant (Chamberlain refers to von Kleist as a \"Jacobite\"), but he finds a sympathetic if powerless audience in Winston Churchill."], ["1938-08-22T00:00:00", "Civil Aeronautics Authority (independent agency)."], ["1938-08-23T00:00:00", "Hitler, hosting a dinner on board the ocean liner Patria in Kiel Bay, tells the Regent of Hungary, Admiral Horthy, that action against Czechoslovakia is imminent and that \"he who wants to sit at the table must at least help in the kitchen\", a reference to Horthy's designs on Carpathian Ruthenia."], ["1938-08-27T00:00:00", "General Beck leaves office as Chief of the General Staff; he is replaced by General Franz Halder."], ["1938-08-28T00:00:00", "Lord Runciman's mission to mitigate the Sudetenland crisis begins to break down. British Prime Minister Neville Chamberlain recalls the British Ambassador Nevile Henderson from Berlin, to instruct Henderson to set up a personal meeting between Chamberlain and Hitler."], ["1938-08-31T00:00:00", "Winston Churchill, still believing France and Britain mean to honor their promises to defend Czechoslovakia against Nazi aggression, suggests in a personal note to Neville Chamberlain that His Majesty's Government may want to set up a broad international alliance including the United States (specifically mentioning U.S. President Franklin Delano Roosevelt as possibly receptive to the idea) and the Soviet Union."], ["1938-09-02T00:00:00", "Soviet Ambassador to Britain Ivan Maisky calls on Winston Churchill, to tell him that Soviet Foreign Commissar Maxim Litvinov has expressed to the French chargé d'affaires in Moscow that the Soviet Union is willing to fight over the territorial integrity of Czechoslovakia."], ["1938-09-04T00:00:00", "During the ceremony marking the unveiling of a plaque at Pointe de Grave, France celebrating Franco-American friendship, American Ambassador William Bullitt in a speech states, \"France and the United States were united in war and peace\", leading to much speculation in the press that if war did break out over Czechoslovakia, then the United States would join the war on the Allied side."], ["1938-09-05T00:00:00", "Czechoslovakian President Edvard Beneš invites mid-level representatives of the Sudeten Germans to the Hradčany palace, to tell them he will accept whatever demands they care to make, provided the Sudetenland remains part of the Republic of Czechoslovakia."], ["1938-09-06T00:00:00", "What eventually proves to be the last of the \"Nuremberg Rallies\" begins. It draws worldwide attention because it is widely assumed Hitler, in his closing remarks, will signal whether there will be peace with or war over Czechoslovakia."], ["1938-09-07T00:00:00", "The Times publishes a lead article which calls on Czechoslovakia to cede the Sudetenland to Germany."], ["1938-09-09T00:00:00", "U.S. President Franklin D. Roosevelt disallows the popular interpretation of Bullitt's speech at a press conference at the White House. Roosevelt states it is \"100% wrong\" the U.S. would join a \"stop-Hitler bloc\" under any circumstances, and makes it quite clear that in the event of German aggression against Czechoslovakia, the U.S. would remain neutral."], ["1938-09-10T00:00:00", "Hermann Göring, in a speech at Nuremberg, calls the Czechs a \"miserable pygmy race\" who are \"harassing the human race.\" That same evening, Edvard Beneš, President of Czechoslovakia, makes a broadcast in which he appeals for calm."], ["1938-09-12T00:00:00", "Hitler makes his much-anticipated closing address at Nuremberg, in which he vehemently attacks the Czech people and President Beneš. American news commentator Hans von Kaltenborn begins his famous marathon of broadcast bulletins over the CBS Radio Network with a summation of Hitler's address."], ["1938-09-13T00:00:00", "The followers of Konrad Henlein begin an armed revolt against the Czechoslovak government in Sudetenland. Martial law is declared and after much bloodshed on both sides order is temporarily restored. Neville Chamberlain personally sends a telegram to Hitler urgently requesting that they both meet."], ["1938-09-15T00:00:00", "Neville Chamberlain arrives in Berchtesgaden to begin negotiations with Hitler over the Sudetenland."], ["1938-09-17T00:00:00", "Neville Chamberlain returns temporarily to London to confer with his cabinet. The Russian army masses along the Ukrainian frontier. Rumania agrees to allow Russian soldiers free passage across her territory to defend Czechoslovakia."], ["1938-09-18T00:00:00", "During a meeting between Neville Chamberlain and the recently elected Premier of France, Édouard Daladier, and Daladier's Foreign Minister, Georges Bonnet, it becomes apparent neither the English nor the French governments are prepared to go to war over the Sudetenland. The Soviet Union declares it will come to the defence of Czechoslovakia only if France honours her commitment to defend Czech independence."], ["1938-09-18T00:00:00", "Mussolini makes a speech in Trieste, Italy where he indicates that Italy is supporting Germany in the Sudeten crisis."], ["1938-09-21T00:00:00", "In the early hours of the day, representatives of the French and British governments call on Czechoslovak President Edvard Beneš to tell him France and Britain will not fight Hitler if he decides to annex the Sudetenland by force. Late in the afternoon the Czechoslovak government capitulates to the French and British demands."], ["1938-09-21T00:00:00", "Winston Churchill warns of grave consequences to European security if Czechoslovakia is partitioned. The same day, Soviet Foreign Commissar Maxim Litvinov makes a similar statement in the League of Nations."], ["1938-09-21T00:00:00", "The 1938 New England hurricane strikes Long Island and southern New England, killing over 300 along the Rhode Island shoreline and 600 altogether."], ["1938-09-21T00:00:00", "Following the capitulation of the Czech government to Germany's demands both Poland and Hungary demand slices of Czech territory where their nationals reside."], ["1938-09-22T00:00:00", "Unable to survive the previous day's capitulation to the demands of the English and French governments, Czechoslovak premier Milan Hodža resigns. General Jan Syrový takes his place."], ["1938-09-22T00:00:00", "Neville Chamberlain arrives in the city of Bad Godesberg for another round of talks with Hitler over the Sudetenland crisis. Hitler raises his demands to include occupation of all German Sudeten territories by October 1. That night after a telephone conference, Chamberlain reverses himself and advises the Czechoslovaks to mobilize."], ["1938-09-22T00:00:00", "Olsen and Johnson's musical comedy revue Hellzapoppin begins its 3-year run on Broadway."], ["1938-09-23T00:00:00", "The Czechoslovak army mobilizes."], ["1938-09-23T00:00:00", "As the Polish army masses along the Czech border the Soviet Union warns Poland if it crosses the Czech frontier Russia will regard the 1932 non-aggression pact between the two countries void."], ["1938-09-24T00:00:00", "Sir Eric Phipps, British Ambassador to France, reports to London, \"all that is best in France is against war, almost at any price\", being opposed only by a \"small, but noisy and corrupt, war group\". Phipps's report creates major doubts about the ability and/or willingness of France to go to war."], ["1938-09-24T00:00:00", "At 1:30 AM, Adolf Hitler and Neville Chamberlain conclude their talks on the Sudetenland. Chamberlain agrees to take Hitler's demands, codified in the Godesberg Memorandum, personally to the Czech Government. The Czech Government rejects the demands, as does Chamberlain's own cabinet. The French Government also initially rejects the terms and orders a partial mobilization of the French army."], ["1938-09-26T00:00:00", "In a vitriolic speech at Berlin's Sportpalast, Hitler defies the world and implies war with Czechoslovakia will begin at any time."], ["1938-09-28T00:00:00", "As his self-imposed October 1 deadline for occupation of the Sudetenland approaches, Adolf Hitler invites Italian Duce Benito Mussolini, French Premier Edourd Deladier, and British Prime Minister Neville Chamberlain to one last conference in Munich. The Czechs themselves are not invited."], ["1938-09-29T00:00:00", "Colonel Graham Christie, former British military attaché in Berlin, is told by Carl Friedrich Goerdeler that the mobilization of the Royal Navy has badly damaged the popularity of the Nazi regime, as the German public realizes that Fall Grün is likely to cause a world war."], ["1938-09-29T00:00:00", "Munich Agreement: German, Italian, British and French leaders agree to German demands regarding annexation of the Sudetenland in Czechoslovakia. The Czechoslovak government is largely excluded from the negotiations and is not a signatory to the agreement."], ["1938-09-29T00:00:00", "The Republic of Hatay is declared in Syria"], ["1938-09-30T00:00:00", "Neville Chamberlain returns to Britain from meeting with Adolf Hitler and declares \"Peace for our time\"."], ["1938-10-01T00:00:00", "German troops march into the Sudetenland. The Polish government gives the Czech government an ultimatum stating that Zaolzie region must be handed over within twenty-four hours. The Czechs have little choice but to comply. Polish forces occupy Zaolzie."], ["1938-10-02T00:00:00", "Tiberias massacre: Arab raiders murder 19 Jewish immigrants."], ["1938-10-02T00:00:00", "Disgusted with Neville Chamberlain's conduct at Munich, Duff Cooper resigns his post as First Lord of the Admiralty. With his resignation, formal debate begins in the Parliament of the United Kingdom on the Munich Agreement, but with Chamberlain at the peak of his popularity, there can be little doubt His Majesty's Government will receive a vote of confidence."], ["1938-10-04T00:00:00", "The Republican forces in the Spanish Civil War begin withdrawing their foreign volunteers from combat as agreed on July 5."], ["1938-10-05T00:00:00", "Edvard Beneš, president of Czechoslovakia, resigns."], ["1938-10-05T00:00:00", "In Nazi Germany, Jews' passports were invalidated, and those who needed a passport for emigration purposes were given one marked with the letter J (\"Jude\" - \"Jew\")."], ["1938-10-10T00:00:00", "The Blue Water Bridge opens, connecting Port Huron, Michigan and Sarnia, Ontario."], ["1938-10-16T00:00:00", "Winston Churchill, in a broadcast address to the United States, condemns the Munich Agreement as a defeat and calls upon America and western Europe to prepare for armed resistance against Hitler."], ["1938-10-18T00:00:00", "The German government expels 12,000 Polish Jews living in Germany; the Polish government accepts 4,000 and refuses admittance to the remaining 8,000, who are forced to live in the no-man's land on the German-Polish frontier."], ["1938-10-21T00:00:00", "In direct contravention of the recently signed Munich Agreement, Adolf Hitler circulates among his high command a secret memorandum stating that they should prepare for the \"liquidation of the rest of Czechoslovakia\" and the occupation of Memel."], ["1938-10-24T00:00:00", "The minimum wage is established by law in the United States."], ["1938-10-24T00:00:00", "French Foreign Minister Georges Bonnet carries out a major purge of the Qui d'Orsay, sacking or exiling a number of anti-appeasement officials such as Pierre Comert and René Massigli."], ["1938-10-24T00:00:00", "At a \"friendly luncheon\" in Berchtesgaden, German foreign minister Joachim von Ribbentrop tells Józef Lipski, the Polish ambassador to Germany, that the Free City of Danzig must return to Germany, that the Germans must be given extraterritorial rights in the Polish Corridor, and that Poland must sign the Anti-Comintern Pact."], ["1938-10-27T00:00:00", "DuPont announces a name for its new synthetic yarn: \"nylon\"."], ["1938-10-27T00:00:00", "Jews with Polish citizenship are evicted from Nazi Germany."], ["1938-10-30T00:00:00", "Orson Welles' radio adaptation of The War of the Worlds is broadcast, causing panic in various parts of the United States."], ["1938-10-31T00:00:00", "Great Depression: In an effort to try restore investor confidence, the New York Stock Exchange unveils a 15-point program aimed to upgrade protection for the investing public."], ["1938-11-01T00:00:00", "Horse racing: Seabiscuit defeats War Admiral by four lengths in their famous match race at Pimlico Race Course in Baltimore."], ["1938-11-02T00:00:00", "Arising from The Munich Agreement Hungary is \"awarded\" the Felvidek region of South Slovakia and Ruthenia."], ["1938-11-04T00:00:00", "At a public meeting in Epping, Winston Churchill narrowly survives an attempt by fellow Conservative and constituent Sir Colin Thornton-Kemsley to remove him from Parliament."], ["1938-11-07T00:00:00", "Ernst vom Rath, the Third Secretary at the German Embassy in Paris, is assassinated by Herschel Grynszpan."], ["1938-11-09T00:00:00", "Holocaust - Kristallnacht: In Germany, the \"night of broken glass\" begins as Nazi activists and sympathizers loot and burn Jewish businesses (the all night affair sees 7,500 Jewish businesses destroyed, 267 synagogues burned, 91 Jews killed, and at least 25,000 Jewish men arrested)."], ["1938-11-10T00:00:00", "On the eve of Armistice Day, Kate Smith sings Irving Berlin's God Bless America for the first time on her weekly radio show."], ["1938-11-10T00:00:00", "İsmet İnönü becomes the second president of Turkey."], ["1938-11-11T00:00:00", "Celâl Bayar forms the new government of Turkey. (10th government; Celal Bayar had served twice as a prime minister)"], ["1938-11-12T00:00:00", "French Finance Minister Paul Reynaud brings into effect a series of laws aiming at improving French productivity (thus aiming to undo the economic weaknesses which led to Munich), and undoes most of the economic and social laws of the Popular Front."], ["1938-11-16T00:00:00", "The first reported \"attack\" of the Halifax Slasher mass hysteria incident."], ["1938-11-16T00:00:00", "Britain formally recognised Italy's control of Ethiopia. In return Mussolini agreed to withdraw 10,000 troops from Spain."], ["1938-11-18T00:00:00", "Trade union members elect John L. Lewis as the first president of the Congress of Industrial Organizations."], ["1938-11-25T00:00:00", "French Foreign Minister Georges Bonnet informs Léon Noël, the French Ambassador to Poland, that France should find an excuse for terminating the 1921 Franco-Polish alliance."], ["1938-11-30T00:00:00", "The Czechoslovak parliament elects Emil Hácha as the new president of Czechoslovakia."], ["1938-11-30T00:00:00", "Benito Mussolini and his Foreign Minister Count Galeazzo Ciano order \"spontaneous\" demonstrations in the Italian Chamber of Deputies, demanding that France cede Tunisia, Nice, Corsica and French Somaliland to Italy. This begins an acute crisis in Franco-Italian relations that lasts until March 1939."], ["1938-11-30T00:00:00", "Corneliu Zelea Codreanu, leader of the Romanian fascist Iron Guard, is murdered on the orders of King Carol II. Officially, Codreanu and the 13 other Iron Guard leaders are \"shot while trying to escape\"."], ["1938-11-30T00:00:00", "A general strike is called in France by the French Communist Party to protest the laws of November 12."], ["1938-12-01T00:00:00", "Slovakia granted the status of an autonomous state under the Catholic priest Fr. Joseph Tiso."], ["1938-12-06T00:00:00", "German Foreign Minister Joachim von Ribbentrop visits Paris, where he is allegedly informed by French Foreign Minister Georges Bonnet that France now recognizes all of Eastern Europe as being in Germany's exclusive sphere of influence. Bonnet's alleged statement (Bonnet always denied making the remark) to Ribbentrop is a major factor in German policy in 1939."], ["1938-12-11T00:00:00", "Kingdom of Yugoslavia parliamentary election: The opposition gains votes but not seats."], ["1938-12-11T00:00:00", "Following elections in the Lithuanian city of Memel the Lithuanian Nazi party wins over 90% of the votes."], ["1938-12-13T00:00:00", "The Neuengamme concentration camp opens near Hamburg."], ["1938-12-16T00:00:00", "MGM releases its successful film version of Charles Dickens's A Christmas Carol. The film is originally intended to star Lionel Barrymore as Ebenezer Scrooge, but Barrymore, ill with arthritis, is replaced by Reginald Owen."], ["1938-12-17T00:00:00", "Otto Hahn discovers the nuclear fission of Uranium, the scientific and technological basis of nuclear energy, which marks the beginning of the Atomic Age."], ["1938-12-23T00:00:00", "A coelacanth, a fish thought to have been extinct, is caught off the coast of South Africa near Chalumna River."], ["1938-12-27T00:00:00", "A massive avalanche of snow hits a construction worker dormitory site in Kurobe, Japan, killing 87."], ["1938-12-30T00:00:00", "The ballet Romeo and Juliet with music by Prokofiev receives its first full performance at the Mahen Theatre in Brno, Czechoslovakia."]]