[["1943-01-01T00:00:00", "WWII: The Soviet Union announces that 22 German divisions have been encircled at Stalingrad, with 175,000 killed and 137,650 captured."], ["1943-01-04T00:00:00", "WWII: Greek-Polish athlete and saboteur Jerzy Iwanow-Szajnowicz is executed by the Germans at Kaisariani."], ["1943-01-04T00:00:00", "Culbert Olson, 29th Governor of California, is succeeded by Earl Warren."], ["1943-01-11T00:00:00", "The United States and United Kingdom give up territorial rights in China."], ["1943-01-13T00:00:00", "36 people are executed and 200 arrested in anti-Nazi protests in Sofia."], ["1943-01-15T00:00:00", "WWII: Guadalcanal Campaign - Operation Ke: Japanese forces begin to withdraw from Guadalcanal in the Solomon Islands."], ["1943-01-15T00:00:00", "The world's largest office building, The Pentagon, is dedicated in Arlington, Virginia."], ["1943-01-16T00:00:00", "Iraq declares war on the Axis powers."], ["1943-01-18T00:00:00", "WWII: Soviet officials announce that the Red Army has broken the Wehrmacht's siege of Leningrad as part of Operation Iskra, opening a narrow land corridor to the city. Georgy Zhukov is promoted to Marshal of the Soviet Union."], ["1943-01-18T00:00:00", "The first Warsaw Ghetto Uprising begins."], ["1943-01-22T00:00:00", "WWII: Battle of Buna-Gona ends with American and Australian forces securing control of the territory of Papua."], ["1943-01-22T00:00:00", "The Holocaust: Over 4,000 Jews are detained in Nazi-occupied Marseille as part of \"Action Tiger\" before being transported to extermination camps in Poland."], ["1943-01-23T00:00:00", "WWII: British forces capture Tripoli from the Italians."], ["1943-01-23T00:00:00", "Duke Ellington plays at New York City's Carnegie Hall for the first time."], ["1943-01-23T00:00:00", "American critic and commentator Alexander Woollcott suffers an eventually fatal heart attack during a regular broadcast of the CBS Radio round-table program People's Platform."], ["1943-01-27T00:00:00", "WWII: 50 bombers mount the first all American air raid against Germany: Wilhelmshaven is the target."], ["1943-01-29T00:00:00", "Nazi German police arrest alleged necrophiliac and serial killer Bruno Lüdke."], ["1943-01-29T00:00:00", "United States Marine Corps Women's Reserve (MCWR) created."], ["1943-02-02T00:00:00", "WWII: In Russia, the Battle of Stalingrad comes to an end with the surrender of the German 6th Army."], ["1943-02-03T00:00:00", "WWII: The Four Chaplains of the U.S. Army are among those drowned when their ship, Dorchester, is struck by a German torpedo in the North Atlantic."], ["1943-02-05T00:00:00", "Lt. General Frank M. Andrews is selected to command the U.S. armies in Europe, while General Dwight D. Eisenhower is assigned command in North Africa; General Andrews will serve only three months before dying in an airplane crash."], ["1943-02-07T00:00:00", "WWII: - North Atlantic convoy SC 118 is attacked by U-boats sinking eight ships."], ["1943-02-07T00:00:00", "WWII: - In the United States, it is announced that shoe rationing will go into effect in 2 days."], ["1943-02-09T00:00:00", "WWII: - Guadalcanal Campaign in the Solomon Islands ends with United States forces in command of Guadalcanal, the evacuation of Japanese forces in Operation Ke having been completed two days earlier."], ["1943-02-09T00:00:00", "WWII: - Massacres of Poles in Volhynia and Eastern Galicia by the Ukrainian Insurgent Army begin with the Parośla I massacre within the Reichskommissariat Ukraine."], ["1943-02-14T00:00:00", "WWII: Rostov-on-Don in Russia is liberated."], ["1943-02-16T00:00:00", "WWII: The Soviet Union reconquers Kharkov, but is later driven out in the Third Battle of Kharkov."], ["1943-02-18T00:00:00", "In a Sportpalast speech in Berlin, German Propaganda Minister Joseph Goebbels declares a \"total war\" against the Allies, tacitly admitting that Nazi Germany faces serious dangers."], ["1943-02-18T00:00:00", "The Nazis arrest the members of the White Rose German Resistance movement."], ["1943-02-20T00:00:00", "American movie studio executives agree to allow the Office of War Information to censor movies."], ["1943-02-20T00:00:00", "The Parícutin volcano begins to appear in a cornfield in Mexico."], ["1943-02-21T00:00:00", "WWII: North Atlantic convoy ON 166 is attacked by U-boats sinking eleven ships."], ["1943-02-22T00:00:00", "Members of White Rose are executed in Nazi Germany."], ["1943-02-27T00:00:00", "Smith Mine disaster: an explosion at Smith Mine #3 in Bearcreek, Montana, United States kills 74 coal miners."], ["1943-02-28T00:00:00", "Operation Gunnerside: 6 Norwegians led by Joachim Ronneberg successfully attack the heavy water plant at Vemork."], ["1943-03-01T00:00:00", "Heinz Guderian becomes the Inspector-General of the Armoured Troops for the German Army."], ["1943-03-02T00:00:00", "WWII: Battle of the Bismarck Sea - United States and Australian forces sink Japanese convoy ships."], ["1943-03-03T00:00:00", "173 people are killed in a crush while trying to enter an air-raid shelter at Bethnal Green, London."], ["1943-03-04T00:00:00", "The 15th Academy Awards ceremony is held in Los Angeles. Mrs. Miniver wins the Best Picture award."], ["1943-03-05T00:00:00", "The Gloster Meteor, the first operational military jet aircraft for the Allies, has its first test flight, in England."], ["1943-03-06T00:00:00", "WWII: North Atlantic convoy SC 121 is attacked by U-boats sinking seven ships."], ["1943-03-09T00:00:00", "Şükrü Saracoğlu forms the new government of Turkey (14th government; Şükrü Saracoğlu had served twice as a prime minister)."], ["1943-03-10T00:00:00", "Banco Bradesco is founded in Marília, São Paulo, Brazil."], ["1943-03-13T00:00:00", "The Holocaust: Nazi German forces liquidate the Jews of the Kraków Ghetto in Occupied Poland."], ["1943-03-14T00:00:00", "WWII: British submarine HMS Thunderbolt is sunk off Sicily by an Italian corvette, the second time this vessel has been lost with all hands."], ["1943-03-15T00:00:00", "WWII - The Italian submarine Leonardo da Vinci sinks the Canadian Pacific liner RMS Empress of Canada off Sierra Leone. Nearly half of the 392 fatalities are Italian prisoners of war."], ["1943-03-15T00:00:00", "WWII - German forces recapture Kharkov after four days of house-to-house fighting against Soviet troops, ending the month-long Third Battle of Kharkov."], ["1943-03-22T00:00:00", "WWII: Khatyn massacre - The entire population of Khatyn in Belarus is burnt alive by the German occupation forces."], ["1943-03-23T00:00:00", "The drugs Vicodin and Lortab are first produced in Germany."], ["1943-03-26T00:00:00", "WWII - Battle of the Komandorski Islands: In the Aleutian Islands, the battle begins when United States Navy forces intercept Japanese troops attempting to reinforce a garrison at Kiska."], ["1943-03-27T00:00:00", "WWII - British Royal Navy escort carrier HMS Dasher (D37) is destroyed by an accidental explosion in the Firth of Clyde, killing 379 of the crew of 528."], ["1943-03-28T00:00:00", "In Italy a ship full of weapons and ammunition explodes in the port of Naples, killing 600."], ["1943-03-31T00:00:00", "Rodgers and Hammerstein's Oklahoma! opens on Broadway, heralds a new era in \"integrated\" stage musicals, becomes an instantaneous stage classic, and goes on to be Broadway's longest-running musical up to that time (1948)."], ["1943-04-03T00:00:00", "Shipwrecked steward Poon Lim is rescued by Brazilian fishermen after being adrift for 130 days."], ["1943-04-13T00:00:00", "WWII: Radio Berlin announces the discovery by Wehrmacht of mass graves of Poles killed by Soviets in the Katyn massacre."], ["1943-04-19T00:00:00", "Albert Hofmann self-administers the psychedelic drug LSD (which he first synthesized in 1938) for the first time in history, and records the details of his experience.\n"], ["1943-04-19T00:00:00", "The Holocaust: The Warsaw Ghetto Uprising begins when Nazi troops enter the Warsaw Ghetto to round up remaining Jews."], ["1943-04-21T00:00:00", "WWII: Worst bombing of Aberdeen, Scotland, killing 125 people."], ["1943-04-25T00:00:00", "Easter occurs on the latest possible date (last time 1886; next time 2038) in the Western Christian Church."], ["1943-04-26T00:00:00", "The Easter Riots in Uppsala, Sweden."], ["1943-04-27T00:00:00", "The U.S. Federal Writers' Project ceases operation."], ["1943-05-06T00:00:00", "WWII: Six U-boats are sunk after sinking 12 ships from Convoy ONS 5 in the last major North Atlantic U-boat \"wolfpack\" attack of the war."], ["1943-05-11T00:00:00", "WWII: American troops invade Attu in the Aleutian Islands, in an attempt to expel occupying Japanese forces."], ["1943-05-12T00:00:00", "The Trident Conference begins in Washington, D.C., with Franklin D. Roosevelt and Winston Churchill taking part."], ["1943-05-13T00:00:00", "WWII: German Afrika Korps and Italian troops in North Africa surrender to Allied forces."], ["1943-05-14T00:00:00", "The Australian Hospital Ship Centaur is sunk off the coast of Queensland by Japanese submarine  I-177, killing 268 of the 332 medical personnel and civilian crew aboard."], ["1943-05-14T00:00:00", "358th Bombardment Squadron, 303d Bombardment Group B-17F Hell's Angels is the first USAAF bomber to complete 25 missions."], ["1943-05-15T00:00:00", "The Comintern is dissolved in Moscow."], ["1943-05-16T00:00:00", "Holocaust: The Warsaw Ghetto Uprising ends."], ["1943-05-17T00:00:00", "WWII: - The United States Army contracts with the University of Pennsylvania's Moore School to develop the computer ENIAC."], ["1943-05-17T00:00:00", "WWII: - The Memphis Belle's crew becomes the first aircrew in the 8th Air Force to complete its 25-mission tour of duty. The aircraft and crew are the first to return to the U.S. intact for a War Bond drive."], ["1943-05-19T00:00:00", "Winston Churchill addresses a joint session of the United States Congress."], ["1943-05-29T00:00:00", "Norman Rockwell's illustration of Rosie the Riveter first appears on the cover of The Saturday Evening Post."], ["1943-05-30T00:00:00", "The Holocaust: Dr. Josef Mengele begins his service as a medical officer in the Auschwitz-Birkenau concentration camp."], ["1943-06-01T00:00:00", "BOAC Flight 777, a DC-3 with registration G-AGBB (formerly KLM PH-ALI, Ibis), on a scheduled passenger flight, is shot down over the Bay of Biscay by eight German Junkers Ju 88s; all 17 persons aboard perish, including the actor Leslie Howard. There is speculation that the downing was an attempt to kill the Prime Minister of the United Kingdom, Winston Churchill, as the Germans may have had wrong information he was aboard."], ["1943-06-03T00:00:00", "The Zoot Suit Riots erupt between military personnel and Mexican American youths in East Los Angeles."], ["1943-06-04T00:00:00", "A military coup d'état in Argentina ousts Ramón Castillo."], ["1943-06-08T00:00:00", "WWII: Japanese battleship Mutsu is destroyed by an accidental magazine explosion in Hashirajima anchorage"], ["1943-06-20T00:00:00", "Race riots in Detroit: killed 34 people — 25 African Americans, nine whites — wounded hundreds more and damaged and destroyed property worth millions."], ["1943-06-21T00:00:00", "WWII: British saboteurs blow up the strategically significant railway viaduct at Asopos in Greece."], ["1943-06-22T00:00:00", "WWII: The U.S. Army 45th Infantry Division lands in North Africa, prior to training at Arzew, French Morocco."], ["1943-06-30T00:00:00", "United States Civilian Conservation Corps abolished."], ["1943-07-01T00:00:00", "United States Women's Army Corps (WAC) converted to full status."], ["1943-07-04T00:00:00", "1943 Gibraltar B-24 crash: The aircraft carrying General Władysław Sikorski, Prime Minister of the Polish government-in-exile, crashes, killing him and fifteen others, leading to a lasting controversy over the circumstances."], ["1943-07-05T00:00:00", "WWII: - Battle of Kursk - The largest tank battle in history begins."], ["1943-07-05T00:00:00", "WWII: - A fleet sets sail for the Allied invasion of Sicily."], ["1943-07-05T00:00:00", "WWII: - Conclusion of the National Bands Agreement in Greece."], ["1943-07-06T00:00:00", "WWII: Americans and Japanese fight the Battle of Kula Gulf off Kolombangara."], ["1943-07-11T00:00:00", "WWII: - United States Army forces make an assault on Piano Lupo, just outside Gela, Sicily."], ["1943-07-11T00:00:00", "WWII: - Massacres of Poles in Volhynia and Eastern Galicia by the Ukrainian Insurgent Army within the Reichskommissariat Ukraine (Volhynia) peak."], ["1943-07-12T00:00:00", "WWII: Main engagement of the Battle of Prokhorovka - The Wehrmacht and the Red Army fight to a draw in one of the largest tank battles in military history."], ["1943-07-19T00:00:00", "WWII: Rome is bombed by the Allies for the first time in the war."], ["1943-07-24T00:00:00", "WWII: Operation Gomorrha begins: British and Canadian aeroplanes bomb Hamburg by night; the American planes bomb the city by day. By the end of the operation in November, 9,000 tons of explosives will have killed more than 42,000 people and destroyed 280,000 buildings."], ["1943-07-25T00:00:00", "Benito Mussolini, the Fascist Prime Minister of Italy since 1925, is arrested after the Grand Council of Fascism withdraws its support. \"Il Duce\" is replaced by General Pietro Badoglio."], ["1943-08-01T00:00:00", "Operation Tidal Wave: 177 B-24 Liberator bombers from the U.S. Army Air Force bomb oil refineries at Ploiești, Romania."], ["1943-08-02T00:00:00", "WWII: John F. Kennedy's Motor Torpedo Boat PT-109 is rammed by a destroyer."], ["1943-08-04T00:00:00", "WWII: The aircraft carrier USS Intrepid (CV-11) is launched at Newport News, Virginia."], ["1943-08-05T00:00:00", "WWII: - United States Women Airforce Service Pilots (WASPs) formed, consolidating the Women's Auxiliary Ferrying Squadron (WAFS) and Women Airforce Service Pilots (WFTD)."], ["1943-08-05T00:00:00", "WWII: - John F. Kennedy and crew are found by Solomon Islands coastwatchers Biuku Gasa and Eroni Kumana with their dugout canoe."], ["1943-08-06T00:00:00", "WWII - Battle of Vella Gulf: Americans defeat a Japanese convoy off Kolombangara, as the U.S. Army drives the Japanese out of Munda airfield on New Georgia."], ["1943-08-14T00:00:00", "WWII: Rome is declared an open city by the Italian government, with Italy offering to demilitarize the capital in return for an Allied agreement not to bomb the city further."], ["1943-08-14T00:00:00", "The Quadrant Conference begins in Quebec City; Canadian Prime Minister MacKenzie King meets with Winston Churchill and Franklin D. Roosevelt."], ["1943-08-17T00:00:00", "WWII: - The US 7th Army under General George S. Patton meets the British 8th Army under General Montgomery in Messina, Sicily, completing the Allied invasion of Sicily."], ["1943-08-17T00:00:00", "WWII: - Operation Hydra: The British Royal Air Force sets out to bomb the Peenemünde Army Research Center to disrupt the German V-weapons programme."], ["1943-08-23T00:00:00", "WWII: The Battle of Kursk ends with a serious strategic defeat for the German forces."], ["1943-08-24T00:00:00", "WWII: - Heinrich Himmler is named Reichminister of the Interior in Germany ."], ["1943-08-26T00:00:00", "WWII: Lord Mountbatten named Supreme Allied Commander for Southeast Asia."], ["1943-08-28T00:00:00", "WWII: King Boris III of Bulgaria dies under suspicious circumstances; his 6-year-old son, Simeon II (who would be elected in 2001 as Prime Minister under the name Simeon Sakskoburggotski), ascends to the throne."], ["1943-08-29T00:00:00", "WWII: Occupation of Denmark - Germany dissolves the Danish government after it refuses to deal with a wave of strikes and disturbances to the satisfaction of the German authorities."], ["1943-09-03T00:00:00", "WWII: Allied invasion of Italy: Mainland Italy is invaded by Allied forces under General Sir Bernard Montgomery, for the first time in the war."], ["1943-09-05T00:00:00", "WWII: The 503rd Parachute Regiment under American General Douglas MacArthur lands and occupies Nadzab, just east of the port city of Lae in northeastern Papua New Guinea."], ["1943-09-07T00:00:00", "Gulf Hotel fire: A fire at the Gulf Hotel in Houston, Texas kills 55."], ["1943-09-08T00:00:00", "- WWII: United States General Dwight D. Eisenhower publicly announces the surrender of Italy to the Allies."], ["1943-09-08T00:00:00", "- WWII: Frascati air raid: The USAAF bombs the German General Headquarters for the Mediterranean zone."], ["1943-09-08T00:00:00", "- The first classes commence at Grace University in Omaha, Nebraska."], ["1943-09-09T00:00:00", "Bertolt Brecht's play Life of Galileo (German: Leben des Galilei) receives its first theatrical production at the Schauspielhaus Zürich."], ["1943-09-12T00:00:00", "WWII: Gran Sasso raid - German paratroopers rescue Mussolini from imprisonment, in Unternehmen Eiche (\"Operation Oak\")."], ["1943-09-16T00:00:00", "WWII: The Salerno Mutiny occurs when soldiers of the British Army's X Corps refuse postings to new units."], ["1943-09-17T00:00:00", "WWII: Villefranche-de-Rouergue Mutiny - a group of pro-Partisan soldiers led by Ferid Džanić and others within the 13th Waffen Mountain Division of the SS Handschar (1st Croatian) training in Occupied France rise against Nazi German troops in the Division; the revolt is rapidly suppressed."], ["1943-09-23T00:00:00", "WWII: The Italian Social Republic (\"Republic of Salò\") is founded in northern Italy as a puppet state of Nazi Germany."], ["1943-09-27T00:00:00", "WWII: Four days of Naples begins: a popular uprising drives German occupying forces from the city."], ["1943-10-01T00:00:00", "WWII: United States forces enter liberated Naples."], ["1943-10-06T00:00:00", "WWII: Americans and Japanese fight the naval Battle of Vella Lavella."], ["1943-10-07T00:00:00", "WWII: The Naples Naples post-office bombing kills 100."], ["1943-10-10T00:00:00", "The Order of Bogdan Khmelnitsky is instituted in the Soviet Union."], ["1943-10-13T00:00:00", "WWII: The new government of Italy sides with the Allies and declares war on Germany."], ["1943-10-14T00:00:00", "WWII: During the Second Raid on Schweinfurt, the United States VIII Bomber Command suffers so many losses that it loses air supremacy over Germany for several months."], ["1943-10-14T00:00:00", "The Holocaust: Uprising in Sobibór extermination camp; about half the inmates escape. Three days later, the camp is closed."], ["1943-10-14T00:00:00", "José P. Laurel takes the oath of office as President of the Philippines (Second Philippine Republic)."], ["1943-10-17T00:00:00", "WWII: The last commerce raider hilfskreuzer Michel, is sunk off Japan by United States submarine Tarpon."], ["1943-10-18T00:00:00", "Chiang Kai-shek takes the oath of office as Chairman of the National Government of China."], ["1943-10-21T00:00:00", "Lucie Aubrac and others in her French Resistance cell liberate Raymond Aubrac from Gestapo imprisonment."], ["1943-10-22T00:00:00", "WWII: The British Royal Air Force delivers a highly destructive airstrike on the German industrial and population center of Kassel."], ["1943-10-24T00:00:00", "WWII: British Royal Navy destroyer HMS Eclipse (H08) is sunk by a mine in the Aegean Sea with the loss of 119 of the ship's company and 134 troops."], ["1943-10-28T00:00:00", "Alleged date of the Philadelphia Experiment, in which the destroyer escort USS Eldridge (DE-173) was supposed to be rendered invisible to human observers for a brief period."], ["1943-10-30T00:00:00", "WWII: Moscow Declaration."], ["1943-10-30T00:00:00", "WWII: The Four Power Declaration is signed by the United States, the United Kingdom, the Soviet Union, and the Republic of China."], ["1943-10-30T00:00:00", "The Merrie Melodies animated cartoon Falling Hare, one of the only shorts with Bugs Bunny getting out-smarted, is released in the United States."], ["1943-11-01T00:00:00", "WWII: Operation Goodtime: United States Marines land on Bougainville Island in the Solomon Islands."], ["1943-11-02T00:00:00", "WWII: In the early morning hours, American and Japanese ships fight the inconclusive Battle of Empress Augusta Bay off Bougainville Island."], ["1943-11-02T00:00:00", "WWII: British troops in Italy reach the Garigliano River."], ["1943-11-09T00:00:00", "Agreement for foundation of the United Nations Relief and Rehabilitation Administration signed by 44 countries in the White House, Washington, D.C."], ["1943-11-10T00:00:00", "Execution of the Lübeck martyrs, four men of religion, for supposedly treasonable views."], ["1943-11-14T00:00:00", "Leonard Bernstein, substituting at the last minute for ailing principal conductor Bruno Walter, directs the New York Philharmonic in its regular Sunday afternoon broadcast concert over CBS Radio. The event receives front-page coverage in The New York Times the following day."], ["1943-11-15T00:00:00", "Porajmos: German SS leader Heinrich Himmler orders that Gypsies and \"part-Gypsies\" be put \"on the same level as Jews and placed in Nazi concentration camps.\""], ["1943-11-16T00:00:00", "WWII: After flying from Britain, 160 American bombers strike a hydro-electric power facility and heavy water factory in German-controlled Vemork, Norway."], ["1943-11-16T00:00:00", "WWII: A Japanese submarine sinks the surfaced U.S. submarine USS Corvina near Chuuk Lagoon (Truk)."], ["1943-11-18T00:00:00", "WWII: Battle of Berlin - The British Royal Air Force opens its bombing campaign against Berlin with 440 planes causing only light damage and killing 131. The RAF loses 9 aircraft and 53 aviators."], ["1943-11-19T00:00:00", "The Holocaust: Inmates of Janowska concentration camp near Lwów (at this time in German-occupied Poland), stage a failed uprising, after which the SS liquidates the camp, resulting in at least 6,000 deaths."], ["1943-11-20T00:00:00", "WWII: Battle of Tarawa: United States Marines land on Tarawa and Makin atolls in the Gilbert Islands (Kiribati from 1979) and take heavy fire from Japanese shore guns."], ["1943-11-22T00:00:00", "Lebanon gains independence on ending of the French Mandate."], ["1943-11-23T00:00:00", "The Deutsches Opernhaus on Bismarckstraße in the Berlin district of Charlottenburg is destroyed in an air raid (It is reopened in 1961 as the Deutsche Oper Berlin)."], ["1943-11-25T00:00:00", "WWII: Americans and Japanese fight the naval Battle of Cape St. George between Buka and New Ireland."], ["1943-11-28T00:00:00", "WWII - Tehran Conference: U.S. President Franklin D. Roosevelt, British Prime Minister Winston Churchill and Soviet leader Joseph Stalin meet in Tehran to discuss war strategy. On November 30, they establish an agreement concerning a planned June 1944 invasion of Europe codenamed Operation Overlord."], ["1943-11-29T00:00:00", "The second session of AVNOJ, the Anti-Fascist Council of National Liberation of Yugoslavia, is held in Jajce, Bosnia and Herzegovina, to determine the post-war ordering of the country."], ["1943-12-02T00:00:00", "WWII: Bari chemical warfare disaster: A surprise Luftwaffe air raid on Bari in Italy sinks 28 Allied ships in the harbor, including the American Liberty ship SS John Harvey, releasing its secret cargo of mustard gas bombs, inflating the number of casualties."], ["1943-12-03T00:00:00", "In reprisal for an act of sabotage, the SS and Gestapo execute 100 Warsaw Tramway workers."], ["1943-12-03T00:00:00", "Edward R. Murrow delivers his classic \"Orchestrated Hell\" broadcast over CBS Radio, describing a Royal Air Force nighttime bombing raid on Berlin."], ["1943-12-04T00:00:00", "WWII: In Yugoslavia, resistance leader Marshal Tito proclaims a provisional democratic Yugoslav government-in-exile."], ["1943-12-04T00:00:00", "The Great Depression officially ends in the United States: With unemployment figures falling fast due to WWII-related employment, U.S. President Franklin D. Roosevelt closes the Works Progress Administration"], ["1943-12-04T00:00:00", "WWII: Bolivia declares war on Romania and Hungary."], ["1943-12-07T00:00:00", "Chiara Lubich starts the humanitarian Focolare Movement in Trento, Italy."], ["1943-12-13T00:00:00", "WWII: Massacre of Kalavryta: The occupying 117th Jäger Division (Wehrmacht) machine-gun all adult males from Kalavryta in Greece, subsequently burning the town."], ["1943-12-20T00:00:00", "A military coup is staged in Bolivia."], ["1943-12-24T00:00:00", "WWII: U.S. General Dwight D. Eisenhower becomes Supreme Allied Commander Europe. He establishes Supreme Headquarters Allied Expeditionary Force in London."], ["1943-12-30T00:00:00", "Subhas Chandra Bose sets up a pro-Japanese Indian government at Port Blair, India."]]