[["1904-01-07T00:00:00", "The distress signal CQD is established, only to be replaced 2 years later by SOS."], ["1904-01-12T00:00:00", "Henry Ford sets a new automobile land speed record of 91.37 mph (147.05 km/h)."], ["1904-01-16T00:00:00", "The first large-scale bodybuilding competition in America takes place at Madison Square Garden in New York City."], ["1904-01-18T00:00:00", "The Herero Rebellion in German South-West Africa begins."], ["1904-01-23T00:00:00", "The Ålesund Fire destroys most buildings in the town of Ålesund, Norway, leaving about 10,000 people without shelter."], ["1904-01-25T00:00:00", "Halford Mackinder presents a paper on \"The Geographical Pivot of History\" to the Royal Geographical Society of London in which he formulates the Heartland Theory, originating the study of geopolitics."], ["1904-02-07T00:00:00", "The Great Baltimore Fire in Baltimore, Maryland destroys over 1,500 buildings in 30 hours."], ["1904-02-08T00:00:00", "A Japanese surprise attack on Port Arthur (Lushun) starts the Russo-Japanese War."], ["1904-02-10T00:00:00", "Roger Casement publishes his account of Belgian atrocities in the Congo."], ["1904-02-23T00:00:00", "For $10 million, the United States gains control of the Panama Canal Zone."], ["1904-02-28T00:00:00", "Sport Lisboa e Benfica is founded in Portugal."], ["1904-03-03T00:00:00", "Kaiser Wilhelm II of Germany becomes the first person to make a political recording of a document, using Thomas Edison's cylinder."], ["1904-03-04T00:00:00", "Russo-Japanese War: Russian troops in Korea retreat toward Manchuria, followed by 100,000 Japanese troops."], ["1904-03-26T00:00:00", "80,000 demonstrators gather in Hyde Park, London, to protest against the importation of Chinese labourers to South Africa by the British government."], ["1904-03-31T00:00:00", "British expedition to Tibet - Battle of Guru: British troops under Colonel Francis Younghusband defeat ill-equipped Tibetan troops."], ["1904-04-06T00:00:00", "Joseph F. Smith announces the Second Manifesto in General Conference of The Church of Jesus Christ of Latter-day Saints, ending in fact the practice of plural marriage which had continued to be practiced by many of its leaders in violation of the 1890 Manifesto officially banning the practice."], ["1904-04-08T00:00:00", "The Entente Cordiale is signed between the UK and France."], ["1904-04-08T00:00:00", "Longacre Square in Midtown Manhattan is renamed Times Square after The New York Times."], ["1904-04-08T00:00:00", "Aleister Crowley begins writing Liber Al vel Legis, better known as The Book of the Law, a text central to Thelema. He completes this task on April 10."], ["1904-04-19T00:00:00", "The Great Toronto Fire destroys much of that city's downtown, but there are no fatalities."], ["1904-04-27T00:00:00", "The Australian Labor Party becomes the first such party to gain national government, under Chris Watson."], ["1904-04-30T00:00:00", "The Louisiana Purchase Exposition World's Fair opens in St. Louis, Missouri (closes December 1)."], ["1904-05-04T00:00:00", "United States Army engineers begin work on the Panama Canal."], ["1904-05-04T00:00:00", "German football club FC Schalke 04 is established."], ["1904-05-05T00:00:00", "Pitching against the Philadelphia Athletics, Cy Young of the Boston Americans throws the first perfect game in the modern era of baseball."], ["1904-05-05T00:00:00", "Hundreds of Tibetans attacked the camp at Changlo and, for a while, held the advantage before being defeated by the British's superior weapons and losing at least 200 men."], ["1904-05-09T00:00:00", "GWR 3440 City of Truro becomes the first railway locomotive to exceed 100 mph."], ["1904-05-21T00:00:00", "The International Federation of Association Football, FIFA, is established."], ["1904-05-30T00:00:00", "Alpha Gamma Delta, now an international women's fraternity, is founded by 11 women at Syracuse University."], ["1904-06-10T00:00:00", "Irish author James Joyce meets his future wife Nora Barnacle."], ["1904-06-15T00:00:00", "A fire aboard the steamboat General Slocum in New York City's East River kills 1,021."], ["1904-06-16T00:00:00", "Eugen Schauman assassinates Nikolai Bobrikov, Governor-General of Finland."], ["1904-06-16T00:00:00", "James Joyce walks to Ringsend with Nora Barnacle; he later uses this date (Bloomsday) as the setting for his novel Ulysses."], ["1904-06-28T00:00:00", "The Danish ocean liner SS Norge runs aground and sinks close to Rockall, killing 635, including 225 Norwegian emigrants."], ["1904-06-28T00:00:00", "The original icon of Our Lady of Kazan was stolen and subsequently destroyed in Russia."], ["1904-06-29T00:00:00", "The 1904 Moscow tornado occurs."], ["1904-07-01T00:00:00", "The third Modern Olympic Games opens in St. Louis, Missouri, United States as part of the World's Fair."], ["1904-08-03T00:00:00", "British expedition to Tibet: The British expedition under Colonel Francis Younghusband takes Lhasa in Tibet."], ["1904-08-11T00:00:00", "Battle of Waterberg: Lothar von Trotha defeats the Herero in German South-West Africa and drives them into the Omaheke desert, start of the Herero and Namaqua Genocide."], ["1904-08-14T00:00:00", "Ismael Montes becomes President of Bolivia."], ["1904-08-17T00:00:00", "Russo-Japanese War: A Japanese infantry charge fails to take Port Arthur."], ["1904-08-18T00:00:00", "Chris Watson resigns as Prime Minister of Australia and is succeeded by George Reid."], ["1904-08-22T00:00:00", "China's Deng Xiaoping (邓小平）is born in Sichuan Province."], ["1904-09-07T00:00:00", "British expedition to Tibet: The Dalai Lama signs the Anglo-Tibetan Treaty with Colonel Francis Younghusband."], ["1904-09-25T00:00:00", "The Church of Jesus Christ of Latter-day Saints President Joseph F. Smith issues a Second Manifesto against polygamy."], ["1904-09-26T00:00:00", "New Zealand dolphin Pelorus Jack is individually protected by Order in Council under the Sea Fisheries Act."], ["1904-10-01T00:00:00", "Phi Delta Epsilon, the international medical fraternity, is founded by Aaron Brown and eight of his friends at Cornell University Medical College."], ["1904-10-05T00:00:00", "Alpha Kappa Psi, the co-ed Professional Business Fraternity, is founded on the campus of New York University."], ["1904-10-09T00:00:00", "German journalist Anna Rüling, in a speech to the Scientific-Humanitarian Committee in Berlin, makes the first known public statement of the socio-legal problems faced by lesbians."], ["1904-10-15T00:00:00", "Theta Tau, the Professional Engineering Fraternity, is founded at the University of Minnesota in Minneapolis."], ["1904-10-19T00:00:00", "Polytechnic University of the Philippines is founded as Manila Business School through the superintendence of the American C.A. O'Reilley."], ["1904-10-21T00:00:00", "Russo-Japanese War - Dogger Bank incident: The Russian Baltic Fleet fires on British trawlers it mistakes for Japanese torpedo boats in the North Sea."], ["1904-10-27T00:00:00", "The first underground line of the New York City Subway opens."], ["1904-10-28T00:00:00", "Panama and Uruguay establishes diplomatic links."], ["1904-11-08T00:00:00", "U.S. presidential election, 1904: Republican incumbent Theodore Roosevelt defeats Democrat Alton B. Parker."], ["1904-11-16T00:00:00", "The settlement at Grytviken on the British South Atlantic island territory of South Georgia is established by Norwegian sea captain Carl Anton Larsen as a whaling station for his Compañía Argentina de Pesca."], ["1904-11-24T00:00:00", "The first successful caterpillar track is made (it later revolutionizes construction vehicles and land warfare)."], ["1904-12-02T00:00:00", "The St. Petersburg Soviet urges a run on the banks: the attempt fails and the executive committee is arrested."], ["1904-12-03T00:00:00", "Charles Dillon Perrine discovers Jupiter's largest irregular satellite, Himalia."], ["1904-12-04T00:00:00", "The K.U. or Konservativ Ungdom (Young Conservatives) is founded by Carl F. Herman von Rosen in Denmark."], ["1904-12-06T00:00:00", "Theodore Roosevelt announced his \"Corollary\" to the Monroe Doctrine, stating that the United States would intervene in the Western Hemisphere should Latin American governments prove incapable or unstable."], ["1904-12-10T00:00:00", "The Pi Kappa Phi fraternity is founded at the College of Charleston in Charleston, SC."], ["1904-12-27T00:00:00", "The stage play Peter Pan, or The Boy Who Wouldn't Grow Up premieres in London."], ["1904-12-30T00:00:00", "The East Boston Tunnel opens."], ["1904-12-31T00:00:00", "In New York City, the first New Year's Eve celebration is held in Times Square."]]