[["1994-01-01T00:00:00", "The North American Free Trade Agreement (NAFTA) is established."], ["1994-01-01T00:00:00", "The Zapatista Army of National Liberation begins their war in Chiapas, Mexico."], ["1994-01-06T00:00:00", "In Detroit, Nancy Kerrigan is clubbed on the right leg by an assailant, under orders from figure skating rival Tonya Harding's ex-husband."], ["1994-01-08T00:00:00", "Soyuz TM-18: Valeri Polyakov begins his 437.7 day orbit, eventually setting the world record for days spent in orbit."], ["1994-01-11T00:00:00", "The Irish government announces the end of a 15-year broadcasting ban on the Provisional Irish Republican Army and its political arm Sinn Féin."], ["1994-01-11T00:00:00", "The Superhighway Summit is held at UCLA's Royce Hall. It is the first conference to discuss the growing information superhighway and is presided over by U.S. Vice President Al Gore."], ["1994-01-14T00:00:00", "U.S. President Bill Clinton and Russian President Boris Yeltsin sign the Kremlin accords, which stop the preprogrammed aiming of nuclear missiles toward each country's targets, and also provide for the dismantling of the nuclear arsenal in Ukraine."], ["1994-01-15T00:00:00", "The SS American Star breaks tow in the Atlantic Ocean and is beached at Fuerteventura in the Canary Islands a few days later."], ["1994-01-17T00:00:00", "The 1994 Northridge earthquake, magnitude 6.7, hits the San Fernando Valley of Los Angeles at 4:31 a.m., killing 72 and leaving 26,029 homeless."], ["1994-01-19T00:00:00", "Record cold temperatures hit the eastern United States. The coldest temperature ever measured in Indiana state history, −36 °F (−38 °C), is recorded in New Whiteland, Indiana."], ["1994-01-20T00:00:00", "In South Carolina, Shannon Faulkner becomes the first female cadet to attend The Citadel, but soon drops out."], ["1994-01-21T00:00:00", "Lorena Bobbitt is found not guilty by reason of insanity on charges of mutilating her husband John."], ["1994-01-25T00:00:00", "U.S. President Bill Clinton delivers his first State of the Union address, calling for health care reform, a ban on assault weapons, and welfare reform."], ["1994-01-26T00:00:00", "A man fires 2 blank shots at Charles, Prince of Wales in Sydney, Australia."], ["1994-02-01T00:00:00", "In Portland, Oregon, Tonya Harding's ex-husband Jeff Gillooly pleads guilty for his role in attacking figure skater Nancy Kerrigan. He accepts a plea bargain, admitting to racketeering charges in exchange for testimony against Harding."], ["1994-02-01T00:00:00", "Punk rock band Green Day releases their album Dookie, which will eventually sell over 20 million copies worldwide."], ["1994-02-03T00:00:00", "William J. Perry is sworn in as the United States Secretary of Defense."], ["1994-02-03T00:00:00", "In the aftermath of the Chadian-Libyan conflict, the International Court of Justice rules that the Aouzou Strip belongs to the Republic of Chad."], ["1994-02-04T00:00:00", "The Federal Open Market Committee raises the Fed Funds target rate for the first time since May 1989. The rate is raised by 25 basis points to 3¼ percent."], ["1994-02-05T00:00:00", "Byron De La Beckwith is convicted of the 1963 murder of civil rights leader Medgar Evers."], ["1994-02-06T00:00:00", "Markale massacres: A Bosnian Serb Army mortar shell kills 68 civilians and wounds about 200 in a Sarajevo marketplace."], ["1994-02-09T00:00:00", "The Vance-Owen Peace plan for Bosnia and Herzegovina is announced."], ["1994-02-12T00:00:00", "Edvard Munch's painting \"The Scream\" is stolen in Oslo (it is recovered on May 7)."], ["1994-02-12T00:00:00", "The 1994 Winter Olympics begin in Lillehammer."], ["1994-02-22T00:00:00", "Aldrich Ames and his wife are charged with spying for the Soviet Union by the United States Department of Justice. Ames is later convicted and sentenced to life imprisonment; his wife receives 5 years in prison."], ["1994-02-24T00:00:00", "In Gloucester, local police begin excavations at 25 Cromwell Street, the home of Fred West, a suspect in multiple murders. On February 28, he and his wife are arrested."], ["1994-02-25T00:00:00", "Israeli Kahanist Baruch Goldstein opens fire inside the Cave of the Patriarchs in the West Bank; he kills 29 Muslims before worshippers beat him to death."], ["1994-02-27T00:00:00", "Australian Federal Sports & Environment Minister Ros Kelly resigns over \"The Sports Rorts Affair\", where she allegedly apportioned money for community sporting projects in a pork barreling fashion."], ["1994-02-28T00:00:00", "4 United States F-16s shoot down 4 Serbian J-21s over Bosnia and Herzegovina for violation of the Operation Deny Flight and its no-fly zone."], ["1994-03-01T00:00:00", "A lone terrorist kills Ari Halberstam during an attack on 14 Jewish students on the Brooklyn Bridge in New York City."], ["1994-03-01T00:00:00", "South Africa cedes Walvis Bay to Namibia."], ["1994-03-01T00:00:00", "Mary Ellen Withrow begins her term of office as Treasurer of the United States, serving under President Bill Clinton."], ["1994-03-06T00:00:00", "A referendum in Moldova results in the electorate voting against possible reunification with Romania."], ["1994-03-07T00:00:00", "Campbell v. Acuff-Rose Music, Inc.: The Supreme Court of the United States rules that parodies of an original work are generally covered by the doctrine of fair use."], ["1994-03-12T00:00:00", "A photo by Marmaduke Wetherell, previously touted as \"proof\" of the Loch Ness Monster, is confirmed to be a hoax."], ["1994-03-12T00:00:00", "The Church of England ordains its first female priests."], ["1994-03-14T00:00:00", "Apple Computer, Inc. releases the first Macintosh computers to use the new PowerPC Microprocessors. This is considered to be a major leap in personal computer, as well as Macintosh history."], ["1994-03-15T00:00:00", "U.S. troops are withdrawn from Somalia."], ["1994-03-16T00:00:00", "In Portland, Oregon, Tonya Harding pleads guilty to conspiracy to hinder prosecution for trying to cover-up an attack on figure skating rival Nancy Kerrigan. She is fined $100,000 and banned from the sport."], ["1994-03-20T00:00:00", "Italian journalist Ilaria Alpi and TV cameraman Miran Hrovatin are assassinated in Somalia."], ["1994-03-21T00:00:00", "The 66th Academy Awards, hosted by Whoopi Goldberg, are held at the Dorothy Chandler Pavilion in Los Angeles. Steven Spielberg's Holocaust drama, Schindler's List, wins 7 Oscars including Best Picture and Best Director (Spielberg)."], ["1994-03-23T00:00:00", "Green Ramp disaster: Two military aircraft collide over Pope Air Force Base, North Carolina causing 24 fatalities."], ["1994-03-27T00:00:00", "TV tycoon Silvio Berlusconi's right-wing coalition wins the Italian general election."], ["1994-03-27T00:00:00", "The biggest tornado outbreak in 1994 occurs in the southeastern United States; 1 tornado kills 22 people at the Goshen United Methodist Church in Piedmont, Alabama."], ["1994-03-28T00:00:00", "Shell House massacre: Inkatha Freedom Party and ANC supporters battle in central Johannesburg South Africa."], ["1994-03-31T00:00:00", "The journal Nature reports the finding in Ethiopia of the first complete Australopithecus afarensis skull (see Human evolution)."], ["1994-04-02T00:00:00", "The National Convention of New Sudan of the SPLA/M opens in Chukudum."], ["1994-04-06T00:00:00", "Rwandan President Juvénal Habyarimana and Burundi President Cyprien Ntaryamira die when a missile shoots down their jet near Kigali, Rwanda. This is taken as a pretext to begin the Rwandan Genocide."], ["1994-04-07T00:00:00", "The Rwandan Genocide begins in Kigali, Rwanda."], ["1994-04-07T00:00:00", "Federal Express Flight 705 experiences an attempted suicidal hijacking. The crew manages to subdue the attacker and land at the airport."], ["1994-04-08T00:00:00", "Michelangelo's Universal Judgement is reopened to the public after 10 years of restorations."], ["1994-04-08T00:00:00", "Kurt Cobain, songwriter and frontman for the band Nirvana, is found dead at his Lake Washington home, apparently of a single self-inflicted gunshot wound."], ["1994-04-16T00:00:00", "Voters in Finland decide to join the European Union in a referendum."], ["1994-04-19T00:00:00", "A Los Angeles jury awards $3.8 million to Rodney King for violation of his civil rights."], ["1994-04-20T00:00:00", "Paul Touvier is found guilty of ordering the execution of 7 Jews when he served in the Vichy France Milice."], ["1994-04-21T00:00:00", "The Red Cross estimates that hundreds of thousands of Tutsi have been killed in Rwanda."], ["1994-04-22T00:00:00", "Richard Nixon dies in New York City, nearly 20 years after he resigned in 1974. His funeral is the first funeral of a U.S. President since the death of Lyndon B. Johnson in 1973."], ["1994-04-25T00:00:00", "Sultan Azlan Muhibbudin Shah ibni Almarhum Sultan Yusuff Izzudin Shah Ghafarullahu-lahu ends his term as the 9th Yang di-Pertuan Agong of Malaysia."], ["1994-04-25T00:00:00", "The largest high school arson ever in the United States is started at Burnsville High School, in Burnsville, Minnesota, resulting in over 15 million dollars in damages. The same arsonist also goes on to set arsons at Edina High School and Minnetonka High School."], ["1994-04-26T00:00:00", "Tuanku Jaafar ibni Almarhum Tuanku Abdul Rahman, Yang di-Pertuan Besar of Negeri Sembilan, becomes the 10th Yang di-Pertuan Agong of Malaysia."], ["1994-04-26T00:00:00", "China Airlines Flight 140, an Airbus A300, crashes while landing at Nagoya, Japan, killing 264 people."], ["1994-04-27T00:00:00", "South Africa holds its first fully multiracial elections, marking the final end of apartheid. Nelson Mandela wins the elections and is sworn in as the first democratic president."], ["1994-04-29T00:00:00", "Commodore International declares bankruptcy."], ["1994-05-01T00:00:00", "Three-time Formula One world champion Ayrton Senna is killed in an accident during the San Marino Grand Prix in Imola, Italy."], ["1994-05-05T00:00:00", "The Bishkek Protocol between Armenia and Azerbaijan is signed in Bishkek, Kyrgyzstan; effectively freezing the Nagorno-Karabakh conflict."], ["1994-05-06T00:00:00", "The Channel Tunnel, which took 15,000 workers over 7 years to complete, opens between England and France, enabling passengers to travel between the 2 countries in 35 minutes."], ["1994-05-10T00:00:00", "Nelson Mandela is inaugurated as South Africa's first black president."], ["1994-05-10T00:00:00", "Illinois executes serial killer John Wayne Gacy by lethal injection for the murder of 33 young men and boys between 1972 and 1978."], ["1994-05-10T00:00:00", "An annular eclipse of the Sun is visible across much of North America."], ["1994-05-12T00:00:00", "Ice hockey becomes Canada's official winter sport."], ["1994-05-17T00:00:00", "Malawi holds its first multiparty elections."], ["1994-05-20T00:00:00", "After a funeral in Cluny Parish Church, Edinburgh attended by 900 people and after which 3,000 people lined the streets, John Smith is buried in a private family funeral on the island of Iona, at the sacred burial ground of Reilig Odhráin, which contains the graves of several Scottish kings as well as monarchs of Ireland, Norway and France."], ["1994-05-21T00:00:00", "Italian former minister and Christian Democrat leader Giulio Andreotti is accused of Mafia allegiance by the court of Palermo."], ["1994-05-22T00:00:00", "Pope John Paul II issues the Apostolic Letter Ordinatio Sacerdotalis from the Vatican, expounding the Catholic Church's position requiring \"the reservation of priestly ordination to men alone\"."], ["1994-06-01T00:00:00", "The Republic of South Africa rejoins the British Commonwealth after the first democratic election. South Africa left the British Commonwealth in 1961."], ["1994-06-12T00:00:00", "Nicole Brown Simpson and Ronald Lyle Goldman are murdered outside the Simpson home in Los Angeles. O. J. Simpson is later acquitted of the killings, but is held liable in a civil suit."], ["1994-06-14T00:00:00", "Hacker Kevin Poulsen pleads guilty to 7 counts of mail fraud, wire and computer fraud, money laundering, and obstruction of justice."], ["1994-06-14T00:00:00", "The New York Rangers win the Stanley Cup, in 7 games over the Vancouver Canucks. It was New York's first Stanley Cup since 1940. Riots erupt in Vancouver in response to the victory causing $1.1 million Canadian dollars in damage."], ["1994-06-15T00:00:00", "Israel and the Vatican establish full diplomatic relations."], ["1994-06-17T00:00:00", "NFL star O. J. Simpson and his friend Al Cowlings flee from police in his white Ford Bronco. The low-speed chase ends at Simpson's Brentwood, Los Angeles mansion, where he surrenders."], ["1994-06-17T00:00:00", "The 1994 FIFA World Cup starts in the United States."], ["1994-06-20T00:00:00", "Dean Mellberg, an ex-U.S. Air Force member, enters the hospital at Fairchild Air Force Base, Washington, shoots and kills 5 people, and wounds 19."], ["1994-06-23T00:00:00", "The International Olympic Committee celebrates its first centennial."], ["1994-06-24T00:00:00", "U.S. Air Force pilot Bud Holland crashes a B-52 at Fairchild Air Force Base, as a result of pilot error. It's unclear whether the event of 4 days previous (above) was a contributing factor."], ["1994-06-24T00:00:00", "The Lion King, the highest grossing hand-drawn animated feature, is released by Walt Disney Pictures."], ["1994-06-25T00:00:00", "Cold War: The last Russian troops leave Germany."], ["1994-06-26T00:00:00", "Microsoft announces it will no longer sell or support the MS-DOS operating system separately from Microsoft Windows. This had been its mainstay since 1980."], ["1994-06-28T00:00:00", "Members of the Aum Shinrikyo cult execute the first sarin gas attack at Matsumoto, Japan, killing 8 and injuring 200."], ["1994-06-30T00:00:00", "An Airbus A330 crashes during a test flight near Toulouse, France, where Airbus is based, killing the 7-person crew. The test was meant to simulate an engine failure at low speed with maximum angle of climb."], ["1994-07-02T00:00:00", "Colombian footballer Andrés Escobar, 27, is shot dead in Medellín. His murder is commonly attributed as retaliation for the own goal Escobar scored in the 1994 FIFA World Cup against the United States soccer team."], ["1994-07-04T00:00:00", "Rwandan Patriotic Front troops capture Kigali, a major breakthrough in the Rwandan Civil War."], ["1994-07-06T00:00:00", "Fourteen firefighters die in the South Canyon wildfire on Storm King Mountain in Colorado. The event inspires the 1999 book Fire on the Mountain."], ["1994-07-07T00:00:00", "1994 civil war in Yemen: Aden is occupied by troops from North Yemen."], ["1994-07-12T00:00:00", "The Allied occupation of Berlin ends with a casing of the colors ceremony attended by U.S. President Bill Clinton."], ["1994-07-17T00:00:00", "Brazil wins the 1994 FIFA World Cup, defeating Italy by 3-2 in penalties (full-time 0-0)."], ["1994-07-18T00:00:00", "In Buenos Aires, a terrorist attack destroys a building housing several Jewish organizations, killing 85 and injuring many more (see AMIA Bombing)."], ["1994-07-18T00:00:00", "Rwandan Patriotic Front troops capture Gisenyi, forcing the interim government into Zaire and ending the Rwandan Genocide."], ["1994-07-19T00:00:00", "Four 26-pound ceiling tiles fall from the roof of the Kingdome in Seattle, just hours before a scheduled Seattle Mariners game."], ["1994-07-20T00:00:00", "Comet Shoemaker-Levy 9's Fragment Q1 hits Jupiter."], ["1994-07-25T00:00:00", "Israel and Jordan sign the Israel-Jordan Treaty of Peace, which formally ends the state of war that has existed between the nations since 1948."], ["1994-08-01T00:00:00", "Fire destroys the Norwich Central Library in the United Kingdom, including most of its historical records."], ["1994-08-01T00:00:00", "The University of London founds the School of Advanced Study, a group of postgraduate research institutes."], ["1994-08-05T00:00:00", "Groups of protesters spread from Havana, Cuba's Castillo de la Punta (\"Point Castle\"), creating the first protests against Fidel Castro's government since 1959."], ["1994-08-12T00:00:00", "The 1994-95 Major League Baseball strike is called, ending the 1994 MLB Season."], ["1994-08-12T00:00:00", "Woodstock '94 begins in Saugerties, New York. It is the 25-year anniversary of Woodstock in 1969."], ["1994-08-18T00:00:00", "Irish mobster Martin Cahill is assassinated in Dublin."], ["1994-08-20T00:00:00", "In Honolulu, Hawaii, during a circus international performance, an elephant named Tyke crushes her trainer Allen Campbell to death before hundreds of horrified spectators, at the Neal Blaisdell Arena."], ["1994-08-23T00:00:00", "Eugene Bullard is posthumously commissioned as a Second Lieutenant in the United States Air Force, 33 years after his death, and 77 years to the day after his rejection for U.S. military service in 1917."], ["1994-08-31T00:00:00", "The Provisional Irish Republican Army announces a \"complete cessation of military operations\"."], ["1994-08-31T00:00:00", "The Russian army leaves Estonia and Latvia, ending the last traces of Eastern Europe's Soviet occupation."], ["1994-09-03T00:00:00", "Cold War: Russia and the People's Republic of China agree to de-target their nuclear weapons against each other."], ["1994-09-04T00:00:00", "Kansai International Airport in Osaka, Japan opens. All international services are transferred from Itami to Kansai."], ["1994-09-05T00:00:00", "New South Wales State MP for Cabramatta John Newman is shot outside his home, in Australia's first political assassination since 1977."], ["1994-09-08T00:00:00", "USAir Flight 427, a Boeing 737 with 132 people on board, crashes on approach to Pittsburgh International Airport; there are no survivors."], ["1994-09-10T00:00:00", "Wollemia nobilis (the 'Wollemi Pine'), previously known only from fossils, is discovered living in remote rainforest gorges in the Wollemi National Park of New South Wales by canyoner David Noble, 150 km from Australia's largest city."], ["1994-09-13T00:00:00", "President Bill Clinton signs the Federal Assault Weapons Ban, which bans the manufacture of new firearms with certain features for a period of 10 years."], ["1994-09-16T00:00:00", "- Danish tour guide Louise Jensen is abducted, raped and murdered by 3 British soldiers in Cyprus."], ["1994-09-16T00:00:00", "- Britain lifts the broadcasting ban imposed on Sinn Féin and paramilitary groups from Northern Ireland."], ["1994-09-17T00:00:00", "Heather Whitestone becomes the first hearing impaired contestant to win the Miss America entitlement. Whitestone becomes Miss America 1995."], ["1994-09-19T00:00:00", "American troops stage a bloodless invasion of Haiti in order to restore the legitimate elected leader, Jean-Bertrand Aristide, to power."], ["1994-09-28T00:00:00", "The car ferry MS Estonia sinks in the Baltic Sea, killing 852 people."], ["1994-09-28T00:00:00", "José Francisco Ruiz Massieu, Mexican politician, is assassinated on orders of Raúl Salinas de Gortari."], ["1994-10-01T00:00:00", "In Slovakia, populist leader Vladimír Mečiar wins the general election."], ["1994-10-01T00:00:00", "Palau gains independence from the United Nations Trusteeship Council"], ["1994-10-04T00:00:00", "In Switzerland, 23 members of the Order of the Solar Temple cult are found dead, a day after 25 of their fellow cultists are similarly discovered in Morin-Heights, Quebec."], ["1994-10-05T00:00:00", "UNESCO inaugurates World Teachers' Day to celebrate and commemorate the signing of the Recommendation Concerning the Status of Teachers on October 5, 1966."], ["1994-10-08T00:00:00", "Iraq disarmament crisis: The President of the United Nations Security Council says that Iraq must withdraw its troops from the Kuwait border, and immediately cooperate with weapons inspectors."], ["1994-10-12T00:00:00", "NASA loses radio contact with the Magellan spacecraft as the probe descends into the thick atmosphere of Venus (the spacecraft presumably burned up in the atmosphere either October 13 or October 14)."], ["1994-10-15T00:00:00", "After 3 years of U.S. exile, Haiti's president Aristide returns to his country."], ["1994-10-15T00:00:00", "Iraq disarmament crisis: Following threats by the U.N. Security Council and the U.S., Iraq withdraws troops from its border with Kuwait."], ["1994-10-29T00:00:00", "Francisco Martin Duran fires over two dozen shots at the White House; he is later convicted of trying to assassinate President Bill Clinton."], ["1994-10-31T00:00:00", "American Eagle Flight 4184 ATR 72 crashes in Roselawn, Indiana, after circling in icy weather, killing 64 passengers."], ["1994-10-31T00:00:00", "The Duke of Edinburgh attends a ceremony in Israel, where his late mother, Princess Alice of Battenberg (Princess Andrew of Greece), is honoured as \"Righteous Among the Nations\" for sheltering Jewish families from the Nazis in Athens, during World War II."], ["1994-11-03T00:00:00", "A French magazine publishes photo of President François Mitterrand's secret daughter."], ["1994-11-03T00:00:00", "The Criminal Justice and Public Order Act 1994 is enacted in the UK. The whole of Part V, which covers collective trespass and nuisance on land, includes sections against raves, including the \"succession of repetitive beats\" definition."], ["1994-11-04T00:00:00", "San Francisco: The first conference devoted entirely to the subject of the commercial potential of the World Wide Web opens. Featured speakers include Marc Andreessen of Netscape, Mark Graham of Pandora Systems, and Ken McCarthy of E-Media."], ["1994-11-04T00:00:00", "Sydney's third runway opens, ensuring protests about noise levels."], ["1994-11-05T00:00:00", "A letter by former U.S. President Ronald Reagan, announcing that he has Alzheimer's disease, is released."], ["1994-11-05T00:00:00", "George Foreman wins the WBA and IBF World Heavyweight Championships by KO'ing Michael Moorer becoming the oldest heavyweight champion in history."], ["1994-11-05T00:00:00", "Johan Heyns, an influential Afrikaner theologian and critic of apartheid, is assassinated."], ["1994-11-06T00:00:00", "A flood in Piedmont, Italy, kills dozens of people."], ["1994-11-07T00:00:00", "WXYC, the student radio station of the University of North Carolina at Chapel Hill, provides the world's first internet radio broadcast."], ["1994-11-08T00:00:00", "Georgia Representative Newt Gingrich leads the United States Republican Party in taking control of both the House of Representatives and the Senate in midterm congressional elections, the first time in 40 years the Republicans secure control of both houses of Congress. George W. Bush is elected Governor of Texas."], ["1994-11-13T00:00:00", "Voters in Sweden decide to join the European Union in a referendum."], ["1994-11-13T00:00:00", "The first passengers travel through the Channel Tunnel."], ["1994-11-13T00:00:00", "Michael Schumacher wins his first Formula One World Championship in controversial circumstances at the Australian Grand Prix."], ["1994-11-16T00:00:00", "A Federal judge issues a temporary restraining order, prohibiting the State of California from implementing Proposition 187, that would have denied most public services to illegal aliens."], ["1994-11-19T00:00:00", "Malawi recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1994-11-20T00:00:00", "The Angolan government and UNITA rebels sign the Lusaka Protocol."], ["1994-11-28T00:00:00", "Voters in Norway decide not to join the European Union in a referendum."], ["1994-11-28T00:00:00", "The Milwaukee Cannibal Jeffrey Dahmer is beaten to death by a fellow inmate at the prison where he was incarcerated."], ["1994-11-30T00:00:00", "The National Football League announces that the Jacksonville Jaguars will become the league's 30th franchise."], ["1994-12-01T00:00:00", "Ernesto Zedillo takes office as President of Mexico."], ["1994-12-02T00:00:00", "The Australian government agrees to pay reparations to indigenous Australians who were displaced during the nuclear tests at Maralinga in the 1950s and 1960s."], ["1994-12-11T00:00:00", "Russian president Boris Yeltsin orders troops into Chechnya."], ["1994-12-11T00:00:00", "A small bomb explodes on Philippine Airlines Flight 434, killing a Japanese businessman. The bombing was a field test done by Ramzi Yousef to test explosives that would have been used in Project Bojinka."], ["1994-12-13T00:00:00", "The trial of former President Mengistu begins in Ethiopia."], ["1994-12-13T00:00:00", "Fred West, 53, a builder living in Gloucester, is remanded in custody, charged with murdering 12 people (including two of his own daughters) whose bodies are mostly found buried at his house in Cromwell Street. His wife Rose West, 41, is charged with 10 murders. Police believe that the murders took place between 1967 and 1987, and suspect that they may have killed up to 30 people."], ["1994-12-14T00:00:00", "A Learjet piloted by Richard Anderson and Brad Sexton misses an elementary school and crashes into an apartment complex in Fresno, California, killing both pilots and injuring several apartment residents."], ["1994-12-14T00:00:00", "A runaway Santa Fe freight train rear ends a Union Pacific train at the bottom of Cajon Pass, California."], ["1994-12-14T00:00:00", "British Home Secretary Michael Howard announces that Myra Hindley will serve a whole life tariff for the Moors murders of the 1960s."], ["1994-12-14T00:00:00", "Construction commences on the Three Gorges Dam, at Sandouping, China."], ["1994-12-15T00:00:00", "The first version of web browser Netscape Navigator is released."], ["1994-12-19T00:00:00", "A planned exchange rate correction of the Mexican peso to the US dollar, becomes a massive financial meltdown in Mexico, unleashing the 'Tequila' effect on global financial markets. This prompts a US$50 billion \"bailout\" by the Clinton Administration."], ["1994-12-19T00:00:00", "The Whitewater scandal investigation begins in Washington, D.C."], ["1994-12-19T00:00:00", "Civil unions between homosexuals are legalized in Sweden."], ["1994-12-26T00:00:00", "French anti-terrorist police storm a hijacked jet at Marseille and kill 4 Islamist terrorists."]]