[["1926-01-01T00:00:00", "Flooding of the Rhine River struck Cologne; 50,000 were forced to evacuate their homes."], ["1926-01-01T00:00:00", "Ireland's first regular radio service, 2RN (later Radio Éireann), began broadcasting."], ["1926-01-03T00:00:00", "Theodoros Pangalos declared himself dictator in Greece."], ["1926-01-06T00:00:00", "The airline Deutsche Luft Hansa was founded in Berlin."], ["1926-01-08T00:00:00", "Abdul-Aziz ibn Saud was crowned King of Hejaz."], ["1926-01-12T00:00:00", "Freeman Gosden and Charles Correll premiered their radio program Sam 'n' Henry, in which the two white performers portray two black characters from Harlem looking to strike it rich in the big city. It was a precursor to Gosden and Correll's more popular later program, Amos 'n' Andy."], ["1926-01-16T00:00:00", "A BBC comic radio play broadcast by Ronald Knox about a workers' revolution caused a panic in London."], ["1926-01-21T00:00:00", "The Belgian Parliament accepted the Locarno Treaties."], ["1926-01-26T00:00:00", "Scottish inventor John Logie Baird demonstrated a mechanical television system for members of the Royal Institution and a reporter from The Times at his London laboratory."], ["1926-01-29T00:00:00", "Eugene O'Neill's The Great God Brown opened at the Greenwich Theatre."], ["1926-01-31T00:00:00", "British and Belgian troops left Cologne."], ["1926-02-01T00:00:00", "Land on Broadway and Wall Street in New York City was sold at a record $7 per sq inch."], ["1926-02-08T00:00:00", "Seán O'Casey's The Plough and the Stars opened at the Abbey Theatre in Dublin."], ["1926-02-09T00:00:00", "Flooding hit London suburbs."], ["1926-02-12T00:00:00", "The Irish minister for Justice, Kevin O'Higgins, appointed the Committee on Evil Literature."], ["1926-02-20T00:00:00", "The Berlin International Green Week debuted in Berlin."], ["1926-02-25T00:00:00", "Francisco Franco became General of Spain."], ["1926-03-06T00:00:00", "The Shakespeare Memorial Theatre in Stratford-upon-Avon was destroyed by fire."], ["1926-03-16T00:00:00", "Robert Goddard launched the first liquid-fuel rocket, at Auburn, Massachusetts."], ["1926-03-23T00:00:00", "Éamon de Valera organized Fianna Fáil in Ireland."], ["1926-04-04T00:00:00", "Greek dictator Theodoros Pangalos won the presidential election with 93.3% of the vote. Turnout was light as the result was considered a foregone conclusion."], ["1926-04-07T00:00:00", "An assassination attempt against Italian Fascist leader Benito Mussolini fails."], ["1926-04-12T00:00:00", "By a vote of 45-41, the United States Senate unseats Iowa Senator Smith W. Brookhart and seats Daniel F. Steck, after Brookhart had already served for over one year."], ["1926-04-17T00:00:00", "Zhang Zuolin's army captured Beijing."], ["1926-04-24T00:00:00", "Treaty of Berlin: Germany and the Soviet Union each pledged neutrality in the event of an attack on the other by a third party for the next five years."], ["1926-04-25T00:00:00", "Rezā Khan was crowned Shah of Iran under the name \"Pahlevi\"."], ["1926-04-30T00:00:00", "African-American pilot Bessie Coleman was killed after falling 500 feet (150 m) from an airplane."], ["1926-05-03T00:00:00", "Coal miners were locked out in Britain."], ["1926-05-04T00:00:00", "The United Kingdom general strike began at midnight in support of the coal strike."], ["1926-05-09T00:00:00", "Martial law was declared in Britain because of the general strike."], ["1926-05-09T00:00:00", "The French navy bombarded Damascus because of the Druze riots."], ["1926-05-09T00:00:00", "Explorer Richard E. Byrd and co-pilot Floyd Bennett claimed to be the first to fly over the North Pole in the Josephine Ford monoplane, taking off from Spitsbergen, Norway and returning 15 hours and 44 minutes later. Both men were immediately hailed as national heroes, though some experts have since been skeptical of the claim, believing that the plane was unlikely to have covered the entire distance and back in that short an amount of time. An entry in Byrd's diary discovered in 1996 suggested that the plane actually turned back 150 miles short of the North Pole due to an oil leak."], ["1926-05-10T00:00:00", "Talks between the government and strikers began in the U.K."], ["1926-05-10T00:00:00", "Planes piloted by Major Harold Geiger and Horace Meek Hickam, students at the Air Corps Tactical School, collided in mid-air at Langley Field, Virginia. Hickam parachutes to safety."], ["1926-05-12T00:00:00", "Roald Amundsen and his crew flew over the North Pole in the airship Norge."], ["1926-05-12T00:00:00", "UK General Strike 1926: In the United Kingdom, a general strike by trade unions ended (the strike began on May 3)."], ["1926-05-18T00:00:00", "Evangelist Aimee Semple McPherson disappeared while visiting a Venice, California beach."], ["1926-05-20T00:00:00", "The United States Congress passed the Air Commerce Act, licensing pilots and planes."], ["1926-05-23T00:00:00", "The first Lebanese constitution was established."], ["1926-05-26T00:00:00", "The Rif War ended when Rif rebels surrendered in Morocco."], ["1926-05-28T00:00:00", "The 1926 coup d'état commanded by Manuel Gomes da Costa in Portugal installed the Ditadura Nacional (National Dictatorship), followed by António de Oliveira Salazar's Estado Novo."], ["1926-06-04T00:00:00", "Ignacy Mościcki became president of Poland."], ["1926-06-19T00:00:00", "DeFord Bailey was the first African-American to perform on Nashville's Grand Ole Opry."], ["1926-06-29T00:00:00", "Arthur Meighen briefly returned to office as Prime Minister of Canada during the King-Byng Affair."], ["1926-07-01T00:00:00", "The Kuomintang began a military unification campaign in northern China."], ["1926-07-03T00:00:00", "A Caudron C.61 aircraft operated by Compagnie Internationale de Navigation Aérienne crashed in Czechoslovakia."], ["1926-07-09T00:00:00", "General Óscar Carmona took power in a military coup in Portugal."], ["1926-07-10T00:00:00", "A bolt of lightning struck Picatinny Arsenal in New Jersey. The resulting fire caused several million pounds of explosives to blow up in the next two to three days."], ["1926-07-15T00:00:00", "BEST buses made their début in Bombay."], ["1926-07-23T00:00:00", "Fox Film bought the patents of the Movietone sound system for recording sound onto film."], ["1926-07-26T00:00:00", "The National Bar Association incorporated in the United States."], ["1926-08-01T00:00:00", "In Mexico, the entry into force of anticlerical measures stipulated in the constitution of 1917 caused the Cristero War."], ["1926-08-06T00:00:00", "Gertrude Ederle became the first woman to swim the English Channel from France to England."], ["1926-08-06T00:00:00", "In New York, the Warner Brothers' Vitaphone system premiered with the movie Don Juan starring John Barrymore."], ["1926-08-18T00:00:00", "The British miners' union began negotiations with the government."], ["1926-08-18T00:00:00", "A weather map was televised for the first time, sent from NAA Arlington to the Weather Bureau office in Washington, D.C."], ["1926-08-22T00:00:00", "In Greece, Georgios Kondylis ousted Theodoros Pangalos."], ["1926-08-23T00:00:00", "The sudden death of popular Hollywood actor and sex symbol Rudolph Valentino at the age of only 31 years old caused mass grief and hysteria around the world."], ["1926-08-25T00:00:00", "Pavlos Kountouriotis announced that dictatorship had ended in Greece and he was now the president."], ["1926-09-01T00:00:00", "Lebanon under the French Mandate got its first constitution, thereby becoming a republic. Charles Debbas was elected president."], ["1926-09-08T00:00:00", "The German Weimar Republic joined the League of Nations."], ["1926-09-11T00:00:00", "Aloha Tower was officially dedicated at Honolulu Harbor in the Territory of Hawai'i."], ["1926-09-11T00:00:00", "In Rome, Italy, Gino Lucetti threw a bomb at Benito Mussolini's car, but Mussolini was unhurt."], ["1926-09-14T00:00:00", "The Locarno Treaties of 1925 were ratified in Geneva and came into effect."], ["1926-09-16T00:00:00", "Philip Dunning and George Abbott's play Broadway premieres in New York City."], ["1926-09-18T00:00:00", "Great Miami Hurricane: A strong hurricane devastated Miami, leaving over 100 dead and causing several hundred million dollars in damage (equal to nearly $100 billion today)."], ["1926-09-20T00:00:00", "The North Side Gang attempted to assassinate Al Capone, spraying his headquarters in Cicero, Illinois with over a thousand rounds of machine gun fire in broad daylight as Capone was eating there. Capone escaped harm."], ["1926-09-21T00:00:00", "French war ace René Fonck and three others attempted to fly the Atlantic in pursuit of the Orteig Prize. Before the newsreel cameras at Roosevelt Field New York, the modified Sikorsky S-35 crashes on take-off and bursts into flames. Fonck survived but two of his men are killed."], ["1926-09-23T00:00:00", "Gene Tunney defeated Jack Dempsey and became heavyweight boxing champion of the world."], ["1926-09-25T00:00:00", "The League of Nations Slavery Convention abolished all types of slavery."], ["1926-09-25T00:00:00", "William Lyon Mackenzie King returned to office as Prime Minister of Canada after winning the Canadian federal election."], ["1926-10-02T00:00:00", "Józef Piłsudski became prime minister of Poland."], ["1926-10-12T00:00:00", "British miners agreed to end their strike."], ["1926-10-14T00:00:00", "A. A. Milne's children's book Winnie-the-Pooh was published in London, featuring the eponymous bear."], ["1926-10-19T00:00:00", "The 1926 Imperial Conference opened in London."], ["1926-10-20T00:00:00", "A hurricane killed 650 in Cuba."], ["1926-10-23T00:00:00", "Leon Trotsky and Lev Kamenev were removed from the Politburo of the Central Committee of the Communist Party of the Soviet Union."], ["1926-10-23T00:00:00", "A decree in Italy banned women from holding public office."], ["1926-10-23T00:00:00", "The Fazal Mosque, the first purpose-built in London and the first Ahmadiyya mosque in Britain, is completed."], ["1926-10-31T00:00:00", "Magician Harry Houdini died of gangrene and peritonitis that has developed after his appendix ruptured."], ["1926-11-05T00:00:00", "The APOEL FC is founded."], ["1926-11-10T00:00:00", "In San Francisco, a necrophiliac serial killer named Earle Nelson (dubbed \"Gorilla Man\") killed and then rapes his 9th victim, a boarding house landlady named Mrs. William Edmonds."], ["1926-11-11T00:00:00", "U.S. Route 66 was established."], ["1926-11-15T00:00:00", "The NBC radio network openedwith 24 stations (formed by Westinghouse, General Electric and RCA)."], ["1926-11-15T00:00:00", "The Balfour Declaration was approved by the 1926 Imperial Conference, making the Commonwealth dominions equal and independent."], ["1926-11-24T00:00:00", "The village of Rocquebillier in the French Riviera was almost destroyed in a massive hailstorm."], ["1926-11-24T00:00:00", "Sri Aurobindo retired, leaving The Mother to run the Sri Aurobindo Ashram in Puducherry, India."], ["1926-11-25T00:00:00", "The death penalty was re-established in Italy."], ["1926-11-26T00:00:00", "All Italian Communist deputies were arrested."], ["1926-11-27T00:00:00", "The restoration of Colonial Williamsburg began in Williamsburg, Virginia."], ["1926-12-02T00:00:00", "British prime minister Stanley Baldwin ended the martial law that had been declared due to general strike."], ["1926-12-03T00:00:00", "Agatha Christie disappeared from her home in Surrey; on December 14 she was found at a Harrogate hotel."], ["1926-12-07T00:00:00", "The Council for the Preservation of Rural England (CPRE) founded; now the Campaign to Protect Rural England."], ["1926-12-17T00:00:00", "1926 Lithuanian coup d'état: A democratically elected government was overthrown in Lithuania; Antanas Smetona assumed power."], ["1926-12-18T00:00:00", "Turkey converted to the Gregorian calendar, making the next day January 1 1927."], ["1926-12-23T00:00:00", "Nicaraguan President Adolfo Díaz requested U.S. military assistance in the ongoing civil war. American peacekeeping troops immediately set up neutral zones in Puerto Cabezas and at the mouth of the Rio Grande to protect American and foreign lives and property."], ["1926-12-26T00:00:00", "In the history of Japan, the Shōwa period began from this day due to the death of Emperor Taishō on the day before. His son Hirohito reigned as Emperor of Japan until 1989."]]