[["1971-01-02T00:00:00", "Ibrox disaster: A stairway crush at the Rangers vs. Celtic football match in Glasgow, Scotland kills 66."], ["1971-01-02T00:00:00", "A ban on radio and television cigarette advertisements goes into effect in the United States."], ["1971-01-03T00:00:00", "BBC Open University begins in the United Kingdom."], ["1971-01-05T00:00:00", "The 1st ever ODI cricket match is played between Australia & England at the M.C.G."], ["1971-01-08T00:00:00", "Tupamaros kidnap Geoffrey Jackson, British ambassador to Uruguay, in Montevideo, keeping him captive until September."], ["1971-01-09T00:00:00", "Uruguayan president Jorge Pacheco Areco demands emergency powers for 90 days due to kidnappings, and receives them the next day."], ["1971-01-12T00:00:00", "The landmark television sitcom All in the Family, starring Carroll O'Connor as Archie Bunker, debuts on CBS."], ["1971-01-14T00:00:00", "Seventy Brazilian political prisoners are released in Santiago, Chile; Giovanni Enrico Bucher is released January 16."], ["1971-01-15T00:00:00", "The Aswan High Dam officially opens in Egypt."], ["1971-01-17T00:00:00", "The Baltimore Colts defeat the Dallas Cowboys, 16-13, in Super Bowl V. The game is plagued by a record combined 11 turnovers, and is not decided until Jim O'Brien kicks a 32-yard field goal with five seconds remaining. Cowboys linebacker Chuck Howley becomes the first (and only, as of 2015) player from a losing team to be named Super Bowl MVP."], ["1971-01-18T00:00:00", "Strikes in Poland demand the resignation of Interior Minister Kazimierz Switala. He resigns January 23 and is replaced by Franciszek Szlachcic."], ["1971-01-19T00:00:00", "Representatives of 23 western oil companies begin negotiations with OPEC in Tehran to stabilize oil prices; February 14 they sign a treaty with 6 Khalij el-Arab countries."], ["1971-01-24T00:00:00", "The Guinean government sentences to death 92 Guineans who helped Portuguese troops in the failed landing attempts in November 1970; 72 are sentenced to hard labor for life; 58 of the sentenced are hanged the next day."], ["1971-01-25T00:00:00", "In Uganda, Idi Amin deposes Milton Obote in a coup, and becomes president."], ["1971-01-25T00:00:00", "In Los Angeles, Charles Manson and 3 female \"Family\" members are found guilty of the 1969 Tate-LaBianca murders."], ["1971-01-25T00:00:00", "Himachal Pradesh becomes the 18th Indian state."], ["1971-01-25T00:00:00", "Intelsat IV (F2) is launched; it enters commercial service over the Atlantic Ocean March 26."], ["1971-01-31T00:00:00", "Apollo program: Apollo 14 (carrying astronauts Alan Shepard, Stuart Roosa, and Edgar Mitchell) lifts off on the third successful lunar landing mission."], ["1971-02-04T00:00:00", "In Britain, Rolls-Royce goes bankrupt and is nationalised."], ["1971-02-05T00:00:00", "Apollo 14 lands on the Moon."], ["1971-02-07T00:00:00", "An earthquake in the city of Tuscania, Italy kills 31."], ["1971-02-07T00:00:00", "Switzerland gives women voting rights in state elections, but not in all canton-specific ones."], ["1971-02-07T00:00:00", "Władysław Gomułka is expelled from the Central Council of the Polish Communist Party."], ["1971-02-08T00:00:00", "A new stock market index called the Nasdaq Composite debuts."], ["1971-02-09T00:00:00", "The Sylmar earthquake (6.4 on the Richter scale) hits the San Fernando Valley area of California."], ["1971-02-09T00:00:00", "Satchel Paige becomes the first Negro League player to become voted into the Baseball Hall of Fame from the Negro League (Jackie Robinson was inducted July 23, 1962.)"], ["1971-02-09T00:00:00", "Apollo program: Apollo 14 returns to Earth after the third manned Moon landing."], ["1971-02-11T00:00:00", "The US, UK, USSR and others sign the Seabed Treaty, outlawing nuclear weapons on the ocean floor."], ["1971-02-13T00:00:00", "Vietnam War: Backed by American air and artillery support, South Vietnamese troops invade Laos."], ["1971-02-15T00:00:00", "Decimal Day: - The United Kingdom and Ireland both switch to decimal currency (see also decimalisation)."], ["1971-02-15T00:00:00", "Protesting Belgian farmers bring 3 live cows to crash the EEC meeting in Brussels."], ["1971-02-16T00:00:00", "In Italy, a local parliament elects the city of Catanzaro as the capital of Calabria; residents of Reggio di Calabria riot for 5 days because of the decision."], ["1971-02-20T00:00:00", "Fifty tornadoes rage in Mississippi, killing 74 people."], ["1971-02-20T00:00:00", "The U.S. Emergency Broadcast System sends an erroneous warning, meant to be a standard weekly test conducted by NORAD in Cheyenne Mountain in Colorado; many radio stations just ignore it. The most notorious warning was of WOWO (AM) in Fort Wayne, Indiana."], ["1971-02-21T00:00:00", "The Convention on Psychotropic Substances is signed at Vienna."], ["1971-02-26T00:00:00", "Secretary General U Thant signs the United Nations proclamation of the vernal equinox as Earth Day."], ["1971-02-27T00:00:00", "Doctors in the first Dutch abortion clinic (Mildredhuis in Arnhem) start to perform abortus provocatus."], ["1971-02-28T00:00:00", "Evel Knievel sets a world record and jumps 19 cars in Ontario, California."], ["1971-03-01T00:00:00", "A bomb explodes in the men's room at the United States Capitol; the Weather Underground claims responsibility."], ["1971-03-01T00:00:00", "Pakistani President Agha Muhammad Yahya Khan indefinitely postpones the pending National Assembly session, precipitating massive civil disobedience in East Pakistan."], ["1971-03-01T00:00:00", "Canadian John Robarts ends his term of office as the 17th Premier of Ontario."], ["1971-03-04T00:00:00", "The southern part of Quebec, and especially Montreal, receive 16½\" (42 cm) of snow in what becomes known as the Century's Snowstorm (la tempête du siècle)."], ["1971-03-05T00:00:00", "The Pakistani army occupies East Pakistan."], ["1971-03-06T00:00:00", "A fire in a mental hospital at Burghölzli, Switzerland, kills 28 people."], ["1971-03-07T00:00:00", "The British postal workers' strike, led by UPW General Secretary Tom Jackson, ends after 47 days."], ["1971-03-07T00:00:00", "Sheikh Mujibur Rahman, political leader of then East Pakistan (present day-Bangladesh), delivers his famous speech in the Racecourse Field in Dhaka, calling on the masses to be prepared to fight for national independence."], ["1971-03-08T00:00:00", "The Citizens' Commission to Investigate the FBI breaks into the Media, Pennsylvania offices of the Federal Bureau of Investigation and removes all the files."], ["1971-03-08T00:00:00", "'Fight of the Century': Boxer Joe Frazier defeats Muhammad Ali at Madison Square Garden."], ["1971-03-12T00:00:00", "Hafez al-Assad becomes president of Syria."], ["1971-03-16T00:00:00", "Trygve Bratteli forms a government in Norway."], ["1971-03-18T00:00:00", "A landslide at Chungar, Peru crashes into Yanawayin Lake, killing 200."], ["1971-03-23T00:00:00", "General Alejandro Lanusse of Argentina takes power in a military coup."], ["1971-03-25T00:00:00", "The Pakistani army starts Operation Searchlight in East Pakistan from midnight, after President Agha Muhammad Yahya Khan, a military ruler, voids election results that gave the Awami League an overwhelming majority in the parliament."], ["1971-03-26T00:00:00", "East Pakistan (now Bangladesh) independence is declared by Ziaur Rahman on behalf of Sheikh Mujibur Rahman, from Kalurghat Radio Station in Chittagong."], ["1971-03-26T00:00:00", "Nihat Erim (a former CHP member) forms the new government of Turkey (33rd government,composed mostly of technocrats)."], ["1971-03-27T00:00:00", "East Pakistan (now Bangladesh) independence is repeatedly declared by Army Major (later President of Bangladesh) Ziaur Rahman on behalf of Sheikh Mujibur Rahman from Kalurghat Radio Station, Chittagong."], ["1971-03-28T00:00:00", "The Ed Sullivan Show airs its final episode."], ["1971-03-29T00:00:00", "U.S. Army Lieutenant William Calley is found guilty of 22 murders in the My Lai Massacre and sentenced to life in prison (he is later pardoned)."], ["1971-03-29T00:00:00", "A Los Angeles jury recommends the death penalty for Charles Manson and 3 female followers."], ["1971-04-01T00:00:00", "The United Kingdom lifts all restrictions on gold ownership."], ["1971-04-05T00:00:00", "In Ceylon, a group calling themselves the People’s Liberation Front begins a rebellion against the Bandaranaike government."], ["1971-04-05T00:00:00", "Chile and East Germany establish diplomatic relations."], ["1971-04-05T00:00:00", "Mount Etna erupts in Sicily."], ["1971-04-07T00:00:00", "Greece releases 261 political prisoners, 50 of whom are sent into internal exile."], ["1971-04-08T00:00:00", "A right-wing coup attempt is exposed in Laos."], ["1971-04-09T00:00:00", "Charles Manson is sentenced to death; in 1972, the sentence for all California Death Row inmates is commuted to life imprisonment."], ["1971-04-12T00:00:00", "Palestinians retreat from Amman to the north of Jordan."], ["1971-04-17T00:00:00", "The People's Republic of Bangladesh forms, under Sheikh Mujibur Rahman, at Mujibnagor."], ["1971-04-17T00:00:00", "Libya, Syria and Egypt sign an agreement to form a confederation."], ["1971-04-19T00:00:00", "The government of Bangladesh flees to India."], ["1971-04-19T00:00:00", "Sierra Leone becomes a republic."], ["1971-04-19T00:00:00", "The Soviet Union launches Salyut 1."], ["1971-04-19T00:00:00", "Followers of Charles Manson, the Manson Family, are sentenced to the gas chamber."], ["1971-04-20T00:00:00", "Swann v. Charlotte-Mecklenburg Board of Education: The Supreme Court of the United States rules unanimously that busing of students may be ordered to achieve racial desegregation."], ["1971-04-20T00:00:00", "Cambodian Prime Minister Lon Nol resigns, but remains effectively in power until the next elections."], ["1971-04-21T00:00:00", "Siaka Stevens is elected the first president of Sierra Leone."], ["1971-04-21T00:00:00", "François Duvalier, president of Haiti, dies; his son Jean-Claude Duvalier follows him as president-for-life."], ["1971-04-24T00:00:00", "Soyuz 10 docks with Salyut 1."], ["1971-04-24T00:00:00", "Five hundred thousand people in Washington, D.C. and 125,000 in San Francisco march in protest against the Vietnam War."], ["1971-04-24T00:00:00", "A tsunami 85 m high rises over the Ryukyu Islands in Japan. It throws a 750-ton block of coral 2.5 km inland."], ["1971-04-25T00:00:00", "Todor Zhivkov is re-elected as the leader of the Bulgarian Communist Party."], ["1971-04-25T00:00:00", "Franz Jonas is re-elected as president of Austria."], ["1971-04-26T00:00:00", "The government of Turkey declares a state of siege in 11 provinces, Ankara included, due to violent demonstrations."], ["1971-04-28T00:00:00", "The first number of Il Manifesto is issued in Italy."], ["1971-04-29T00:00:00", "Bolivia nationalizes the American-owned Matilde zinc mine."], ["1971-04-30T00:00:00", "The Milwaukee Bucks win the NBA World Championship, sweeping the Baltimore Bullets in 4 straight games."], ["1971-05-01T00:00:00", "Amtrak begins inter-city rail passenger service in the United States."], ["1971-05-01T00:00:00", "The Ceylonese government promises amnesty for those guerillas who surrender before April 5."], ["1971-05-02T00:00:00", "In Ceylon, left-wing guerillas launch a series of assaults against public buildings."], ["1971-05-03T00:00:00", "Arsenal F.C. wins the English Division 1 football league championship at the home of their bitter rivals, Tottenham Hotspur, with Ray Kennedy scoring the winner. (Arsenal FC will go on to win the league and cup 'double' 6 days later by defeating Liverpool in the FA Cup final)."], ["1971-05-03T00:00:00", "The Harris Poll claims that 60% of Americans are against the Vietnam War."], ["1971-05-03T00:00:00", "East German leader Walter Ulbricht resigns as Communist Party leader but retains the position of head of state."], ["1971-05-03T00:00:00", "1971 May Day Protests: Anti-war militants attempt to disrupt government business in Washington, D.C.; police and military units arrest as many as 12,000, most of whom are later released."], ["1971-05-05T00:00:00", "The US dollar floods the European currency markets and threatens especially the Deutsche Mark; the central banks of Austria, Belgium, Netherlands and Switzerland stop the currency trading."], ["1971-05-06T00:00:00", "The Ceylon government begins a major offensive against the People's Liberation Front."], ["1971-05-09T00:00:00", "Arsenal FC beats Liverpool F.C. 2-1 to win the English FA Cup, thus completing the league and cup 'double'."], ["1971-05-09T00:00:00", "Mariner 8 fails to launch."], ["1971-05-12T00:00:00", "An earthquake in Turkey destroys most of the city of Burdur."], ["1971-05-15T00:00:00", "Efraim Elrom, Israeli ambassador to Turkey, is kidnapped; he is found killed in Istanbul May 25."], ["1971-05-16T00:00:00", "A coup attempt is exposed and foiled in Egypt."], ["1971-05-18T00:00:00", "The U.S. Congress formally votes to end funding for the American Supersonic Transport program."], ["1971-05-18T00:00:00", "The Montréal Canadiens win the Stanley Cup against the Chicago Blackhawks. The Canadiens became only the second team in NHL history to win the Cup in game 7 on the road. This also marked the last NHL game that the late Jean Béliveau played."], ["1971-05-19T00:00:00", "Mars probe program: Mars 2 is launched by the Soviet Union."], ["1971-05-22T00:00:00", "An earthquake lasting 20 seconds destroys most of Bingöl, Turkey - more than 1,000 are killed, 10,000 made homeless."], ["1971-05-23T00:00:00", "An air crash at Rijeka Airport, Yugoslavia kills 78 people, mostly British tourists."], ["1971-05-26T00:00:00", "Austria and the People's Republic of China establish diplomatic relations."], ["1971-05-26T00:00:00", "Qantas agrees to pay $500,000 to bomb hoaxer-extortionist Mr. Brown (Peter Macari), who is later arrested."], ["1971-05-27T00:00:00", "Six armed passengers hijack a Romanian passenger plane and force it to fly to Vienna."], ["1971-05-27T00:00:00", "Christie's auctions a diamond known as Deepdene; it is later found to be artificially colored."], ["1971-05-28T00:00:00", "Portugal resigns from UNESCO."], ["1971-05-30T00:00:00", "Mariner program: Mariner 9 is launched toward Mars."], ["1971-05-31T00:00:00", "The birth of Bangladesh is declared by the government in exile, in territory formerly part of Pakistan."], ["1971-06-01T00:00:00", "Vietnam War: Vietnam Veterans for a Just Peace, claiming to represent the majority of U.S. veterans who served in Southeast Asia, speak against war protests."], ["1971-06-06T00:00:00", "Soyuz program: Soyuz 11 (Vladislav Volkov, Georgi Dobrovolski, Viktor Patsayev) is launched."], ["1971-06-06T00:00:00", "A midair collision between Hughes Airwest Flight 706 Douglas DC-9 jetliner and a U.S. Marine Corps McDonnell Douglas F-4 Phantom jet fighter near Duarte, California, claims 50 lives."], ["1971-06-10T00:00:00", "The U.S. ends its trade embargo of China."], ["1971-06-10T00:00:00", "Corpus Thursday: A student rally on the streets of Mexico City is roughly dispersed."], ["1971-06-11T00:00:00", "Neville Bonner becomes the first Indigenous Australian to sit in the Australian Parliament."], ["1971-06-13T00:00:00", "Vietnam War: The New York Times begins to publish the Pentagon Papers. [1]."], ["1971-06-13T00:00:00", "Gijs van Lennep (The Netherlands) and co-driver Helmut Marko (Austria) win the 24 Hours of Le Mans in the Martini Racing Porsche 917K."], ["1971-06-14T00:00:00", "Norway begins oil production in the North Sea."], ["1971-06-17T00:00:00", "Representatives of Japan and the United States sign the Okinawa Reversion Agreement, whereby the U.S. will return control of Okinawa."], ["1971-06-17T00:00:00", "President Richard Nixon declares the U.S. War on Drugs."], ["1971-06-18T00:00:00", "Southwest Airlines, a low cost carrier, begins its first flights between Dallas, Houston, and San Antonio."], ["1971-06-20T00:00:00", "Britain announces that Soviet space scientist Anatoli Fedoseyev has been granted asylum."], ["1971-06-21T00:00:00", "Britain begins new negotiations for EEC membership in Luxembourg."], ["1971-06-25T00:00:00", "Madagascar accuses the U.S. of being connected to the plot to oust the current government; the U.S. recalls its ambassador."], ["1971-06-27T00:00:00", "Concert promoter Bill Graham closes the legendary Fillmore East, which first opened on 2nd Avenue (between 5th and 6th Streets) in New York City on March 8, 1968."], ["1971-06-28T00:00:00", "Assassin Jerome A. Johnson shoots Joe Colombo in the head in a middle of an Italian-American rally, putting him in a coma."], ["1971-06-30T00:00:00", "After a successful mission aboard Salyut 1, the world's first manned space station, the crew of the Soyuz 11 spacecraft are killed when their air supply leaks out through a faulty valve."], ["1971-06-30T00:00:00", "New York Times Co. v. United States: The U.S. Supreme Court rules that the Pentagon Papers may be published, rejecting government injunctions as unconstitutional prior restraint."], ["1971-07-03T00:00:00", "Jim Morrison, lead singer of The Doors is found dead in his bathtub in Paris, France."], ["1971-07-04T00:00:00", "Michael S. Hart posts the first e-book, a copy of the United States Declaration of Independence, on the University of Illinois at Urbana-Champaign's mainframe computer, the origin of Project Gutenberg."], ["1971-07-05T00:00:00", "Right to vote: The 26th Amendment to the United States Constitution, formally certified by President Richard Nixon, lowers the voting age from 21 to 18."], ["1971-07-06T00:00:00", "Hastings Banda is proclaimed President for Life of Malawi."], ["1971-07-09T00:00:00", "The United Kingdom increases its troops in Northern Ireland to 11,000."], ["1971-07-10T00:00:00", "Gloria Steinem makes her Address to the Women of America."], ["1971-07-11T00:00:00", "Copper mines in Chile are nationalized."], ["1971-07-13T00:00:00", "Ólafur Jóhannesson forms a government in Iceland."], ["1971-07-13T00:00:00", "Jordanian army troops launch an offensive against Palestinian guerillas in Jordan."], ["1971-07-13T00:00:00", "The Yugoslavian government begins allowing foreign companies to take their profits from the country."], ["1971-07-13T00:00:00", "Paced by a prodigious home run by Reggie Jackson, which hits a transformer on the roof of Tiger Stadium, the American League defeats the National League 6-4 in the Major League Baseball All-Star Game in Detroit."], ["1971-07-14T00:00:00", "Libya severs its diplomatic ties with Morocco."], ["1971-07-15T00:00:00", "American President Richard Nixon announces his 1972 visit to China."], ["1971-07-17T00:00:00", "Italy and Austria sign a treaty that ends the schism about South Tyrol."], ["1971-07-18T00:00:00", "The Trucial States are formed in the Persian Gulf."], ["1971-07-19T00:00:00", "The South Tower of the World Trade Center is topped out at 1,362 feet (415 m), making it the second tallest building in the world."], ["1971-07-26T00:00:00", "Apollo 15 (carrying astronauts David Scott, Alfred Worden, and James Irwin) is launched."], ["1971-07-28T00:00:00", "Abdel Khaliq Mahjub, Sudanese communist leader, is hanged."], ["1971-07-29T00:00:00", "The United Kingdom opts out of the Space Race, with the cancellation of its Black Arrow launch vehicle."], ["1971-07-30T00:00:00", "In Japan, an All Nippon Airways Boeing 727 collides with a Japanese fighter jet; 162 people are killed."], ["1971-07-31T00:00:00", "Apollo 15 astronauts David Scott and James Irwin become the first to ride in a lunar rover, a day after landing on the Moon."], ["1971-08-01T00:00:00", "In New York City, 40,000 attend The Concert for Bangladesh."], ["1971-08-02T00:00:00", "J. C. Penney debuts its trademark Helvetica wordmark which has been used ever since."], ["1971-08-05T00:00:00", "The South Pacific Forum (SPF) is established."], ["1971-08-06T00:00:00", "A lunar eclipse lasting 1 hour, 40 minutes, and 4 seconds is observed."], ["1971-08-07T00:00:00", "Apollo 15 returns to Earth."], ["1971-08-09T00:00:00", "India signs a 20-year treaty of friendship and cooperation with the Soviet Union."], ["1971-08-09T00:00:00", "Internment in Northern Ireland: British security forces arrest hundreds of nationalists and detain them without trial in Long Kesh prison; 20 people die in the riots that follow."], ["1971-08-11T00:00:00", "Construction begins on the Louisiana Superdome in New Orleans."], ["1971-08-12T00:00:00", "Three thousand people from Belfast and Derry flee to the Republic of Ireland because of the violence."], ["1971-08-12T00:00:00", "Syria severs diplomatic relations with Jordan because of border clashes."], ["1971-08-14T00:00:00", "British troops are stationed on the Ireland border to stop arms smuggling."], ["1971-08-14T00:00:00", "Bahrain declares independence as the State of Bahrain (Kingdom of Bahrain as of February 2002)."], ["1971-08-15T00:00:00", "Jackie Stewart becomes Formula One World Drivers' Champion in the Tyrrell 003-Cosworth."], ["1971-08-15T00:00:00", "The number of British troops in Northern Ireland is raised to 12,500."], ["1971-08-15T00:00:00", "President Richard Nixon announces that the United States will no longer convert dollars to gold at a fixed value, effectively ending the Bretton Woods system. He also imposes a 90-day freeze on wages, prices and rents."], ["1971-08-18T00:00:00", "Vietnam War: Australia and New Zealand decide to withdraw their troops from Vietnam."], ["1971-08-18T00:00:00", "British troops are engaged in a firefight with the IRA in Derry, Northern Ireland."], ["1971-08-20T00:00:00", "International Telecommunications Satellite Organization (Intelsat) (effective 12 February 1973)."], ["1971-08-20T00:00:00", "The USS Manatee (AO-58) spills 1,000 US gallons (3,800 L) of fuel oil on President Nixon's Western White House beach in San Clemente, California."], ["1971-08-21T00:00:00", "A bomb made of two hand grenades by communist rebels explodes in the Liberal Party campaign party in Plaza Miranda in Quiapo, Manila the Philippines, injuring several anti-Marcos political candidates."], ["1971-08-25T00:00:00", "Border clashes occur between Tanzania and Uganda."], ["1971-08-25T00:00:00", "Bangladesh and eastern Bengal are flooded; thousands flee the area."], ["1971-08-26T00:00:00", "A civilian government takes power in Greece."], ["1971-08-30T00:00:00", "The Progressive Conservatives under Peter Lougheed defeat the Social Credit government under Harry E. Strom in a general election, ending 36 years of uninterrupted power for Social Credit in Alberta."], ["1971-09-03T00:00:00", "Qatar gains independence from the United Kingdom. Unlike most nearby emirates, Qatar declines to become part of either the United Arab Emirates or Saudi Arabia."], ["1971-09-03T00:00:00", "Manlio Brosio resigns as NATO Secretary General."], ["1971-09-04T00:00:00", "A Boeing 727 (Alaska Airlines Flight 1866) crashes into the side of a mountain near Juneau, Alaska, killing all 111 people on board."], ["1971-09-08T00:00:00", "In Washington, D.C., the John F. Kennedy Center for the Performing Arts is inaugurated, with the opening feature being the premiere of Leonard Bernstein's Mass."], ["1971-09-09T00:00:00", "September 13 - Attica Prison riots: - A revolt breaks out at the maximum-security prison in Attica, New York. In the end, state police and the United States National Guard storm the facility; 42 are killed, 10 of them hostages."], ["1971-09-19T00:00:00", "The electric tram system closes in the city of Ballarat, Victoria, Australia."], ["1971-09-21T00:00:00", "Pakistan declares a state of emergency."], ["1971-09-24T00:00:00", "Britain expels 90 KGB and GRU officials; 15 are not allowed to return."], ["1971-09-28T00:00:00", "Cardinal József Mindszenty, who has taken refuge in the U.S. Embassy in Budapest since 1956, is allowed to leave Hungary."], ["1971-09-29T00:00:00", "A cyclone in the Bay of Bengal, in the Indian state of Odisha, kills 10,000."], ["1971-10-01T00:00:00", "Walt Disney World opens in Orlando, Florida."], ["1971-10-14T00:00:00", "Greenpeace is founded in Vancouver, Canada."], ["1971-10-18T00:00:00", "In New York City, the Knapp Commission begins public hearings on police corruption."], ["1971-10-21T00:00:00", "U.S. President Richard Nixon nominates Lewis Franklin Powell, Jr. and William H. Rehnquist to the U.S. Supreme Court."], ["1971-10-21T00:00:00", "The Clarkston explosion in Scotland kills 22 people."], ["1971-10-25T00:00:00", "The United Nations General Assembly admits the People's Republic of China and expels the Republic of China (or Taiwan)."], ["1971-10-27T00:00:00", "The Democratic Republic of the Congo is renamed Zaire."], ["1971-10-28T00:00:00", "The British House of Commons votes 356-244 in favour of joining the European Economic Community."], ["1971-10-28T00:00:00", "The United Kingdom becomes the 6th nation to launch a satellite into orbit, the Prospero X-3, using a Black Arrow carrier rocket."], ["1971-10-28T00:00:00", "The Egyptian Opera House (Khedivial Opera House) burns down in Cairo."], ["1971-10-29T00:00:00", "Vietnam War - Vietnamization: The total number of American troops still in Vietnam drops to a record low of 196,700 (the lowest since January 1966)."], ["1971-10-30T00:00:00", "Rev. Ian Paisley's Democratic Unionist Party is founded in Northern Ireland."], ["1971-10-31T00:00:00", "A bomb explodes at the top of the Post Office Tower in London."], ["1971-11-03T00:00:00", "The UNIX Programmer's Manual is published."], ["1971-11-06T00:00:00", "Operation Grommet: The U.S. tests a thermonuclear warhead at Amchitka Island in Alaska, code-named Project Cannikin. At around 5 megatons, it is the largest ever U.S. underground detonation."], ["1971-11-08T00:00:00", "Led Zeppelin releases their Fourth Studio album \"Led Zeppelin IV\", which goes on to sell 23,000,000 copies."], ["1971-11-09T00:00:00", "A Royal Air Force C-130 crashes into the Ligurian Sea near Leghorn, Italy, killing all 51 people on board."], ["1971-11-10T00:00:00", "In Cambodia, Khmer Rouge forces attack Phnom Penh and its airport, killing 44, wounding at least 30 and damaging 9 airplanes."], ["1971-11-12T00:00:00", "Vietnam War - Vietnamization: U.S. President Richard M. Nixon sets February 1, 1972, as the deadline for the removal of another 45,000 American troops from Vietnam."], ["1971-11-13T00:00:00", "Mariner program: Mariner 9 becomes the first spacecraft to enter Mars orbit successfully."], ["1971-11-14T00:00:00", "Pope Shenouda III of Alexandria is enthroned."], ["1971-11-15T00:00:00", "Intel releases the world's first microprocessor, the Intel 4004."], ["1971-11-15T00:00:00", "International Organization and System of Space Communications (Intersputnik) (effective 12 July 1972)."], ["1971-11-20T00:00:00", "A bridge still in construction, called Elevado Engenheiro Freyssinet, falls over the Paulo de Frontin Avenue, in Rio de Janeiro, Brazil; 48 people are killed and several injured. Reconstructed, the bridge is currently a part of the Linha Vermelha elevate."], ["1971-11-23T00:00:00", "The People's Republic of China takes the Republic of China's seat on the United Nations Security Council (see China and the United Nations)."], ["1971-11-24T00:00:00", "During a severe storm over Washington State, a man calling himself D. B. Cooper parachutes from the Northwest Orient Airlines plane he'd just hijacked, with US$200,000 in ransom money, and is never seen again (as of March 2008, this case remains the only unsolved skyjacking in history)."], ["1971-11-24T00:00:00", "A Brussels court sentences pretender Alexis Brimeyer to 18 months in jail for falsely using a noble title; Brimeyer has already fled to Greece."], ["1971-11-28T00:00:00", "The 59th Grey Cup Game sees the Calgary Stampeders beat the Toronto Argonauts 14-11."], ["1971-12-01T00:00:00", "Cambodian Civil War: Khmer Rouge rebels intensify assaults on Cambodian government positions, forcing their retreat from Kompong Thmar and nearby Ba Ray, 10 kilometers northeast of Phnom Penh."], ["1971-12-02T00:00:00", "Six Persian Gulf sheikdoms found the United Arab Emirates."], ["1971-12-03T00:00:00", "The Indo-Pakistani War of 1971 begins as Pakistan launches preemptive attacks on 9 Indian airbases. The next day India launches a massive invasion of East Pakistan."], ["1971-12-04T00:00:00", "The Montreux Casino burns down during a Frank Zappa concert (the event is memorialized in the Deep Purple song \"Smoke on the Water\"). The casino is rebuilt in 1975."], ["1971-12-04T00:00:00", "The McGurk's Bar bombing by the UVF in Belfast kills 15."], ["1971-12-08T00:00:00", "U.S. President Richard Nixon orders the 7th Fleet to move towards the Bay of Bengal in the Indian Ocean."], ["1971-12-10T00:00:00", "The John Sinclair Freedom Rally in support of the imprisoned activist features a performance by John Lennon at Crisler Arena, Ann Arbor, Michigan."], ["1971-12-11T00:00:00", "Nihat Erim forms the new government of Turkey (34th government, Nihat Erim had served two times as prime minister)."], ["1971-12-16T00:00:00", "Victory Day of Bangladesh: The Pakistan Army in East Pakistan (now Bangladesh) surrenders to the freedom fighters of Bangladesh, ending the Bangladesh Liberation War."], ["1971-12-18T00:00:00", "The U.S. dollar is devalued for the second time in history."], ["1971-12-18T00:00:00", "The world's largest hydroelectric plant in Krasnoyarsk, Soviet Union, begins operations."], ["1971-12-19T00:00:00", "The Clube Atlético Mineiro wins the Brazil Football Championship."], ["1971-12-19T00:00:00", "Intelsat IV (F3) is launched; it enters commercial service over the Atlantic Ocean February 18, 1972."], ["1971-12-24T00:00:00", "Giovanni Leone is elected President of the Italian Republic."], ["1971-12-24T00:00:00", "Juliane Koepcke survives a fall of 10,000 feet following disintegration of LANSA Flight 508."], ["1971-12-25T00:00:00", "In the longest game in NFL history, the Miami Dolphins beat the Kansas City Chiefs."], ["1971-12-25T00:00:00", "A fire at a 22-story hotel in Seoul, South Korea kills 158 people."], ["1971-12-29T00:00:00", "The United Kingdom gives up its military bases in Malta."]]