[["1968-01-05T00:00:00", "Prague Spring: Alexander Dubček is chosen as the leader of the Communist Party in Czechoslovakia."], ["1968-01-08T00:00:00", "British Prime Minister Harold Wilson endorses the I'm Backing Britain campaign for working an additional half hour each day without pay."], ["1968-01-14T00:00:00", "The Green Bay Packers defeat the Oakland Raiders by the score of 33-14 in Super Bowl II at the Miami Orange Bowl."], ["1968-01-15T00:00:00", "An earthquake in Sicily kills 380 and injures around 1,000."], ["1968-01-17T00:00:00", "Lyndon B. Johnson calls for the non-conversion of the U.S. dollar."], ["1968-01-21T00:00:00", "Vietnam War - Battle of Khe Sanh: One of the most publicized and controversial battles of the war begins, ending on April 8."], ["1968-01-21T00:00:00", "A U.S. B-52 Stratofortress crashes in Greenland, discharging 4 nuclear bombs."], ["1968-01-22T00:00:00", "Rowan & Martin's Laugh-In debuts on NBC."], ["1968-01-23T00:00:00", "North Korea seizes the USS Pueblo, claiming the ship violated its territorial waters while spying."], ["1968-01-25T00:00:00", "The Israeli submarine INS Dakar sinks in the Mediterranean Sea, killing 69."], ["1968-01-27T00:00:00", "The French submarine Minerve sinks in the Mediterranean Sea, killing 52."], ["1968-01-30T00:00:00", "Vietnam War: The Tet Offensive begins, as Viet Cong forces launch a series of surprise attacks across South Vietnam."], ["1968-01-31T00:00:00", "Việt Cộng soldiers attack the US Embassy, Saigon."], ["1968-01-31T00:00:00", "Nauru president Hammer DeRoburt declares independence from Australia."], ["1968-02-01T00:00:00", "Vietnam War: A Viet Cong officer named Nguyễn Văn Lém is executed by Nguyễn Ngọc Loan, a South Vietnamese National Police Chief. The event is photographed by Eddie Adams. The photo makes headlines around the world, eventually winning the 1969 Pulitzer Prize, and sways U.S. public opinion against the war."], ["1968-02-01T00:00:00", "The Pennsylvania Railroad and the New York Central Railroad merge to form Penn Central, the largest ever corporate merger up to this date."], ["1968-02-08T00:00:00", "American civil rights movement: A civil rights protest staged at a white-only bowling alley in Orangeburg, South Carolina is broken up by highway patrolmen; 3 college students are killed."], ["1968-02-11T00:00:00", "Border clashes take place between Israel and Jordan."], ["1968-02-11T00:00:00", "Madison Square Garden in New York City opens at its current location."], ["1968-02-12T00:00:00", "Vietnam War: Phong Nhị and Phong Nhất massacre."], ["1968-02-13T00:00:00", "Civil rights disturbances occur at the University of Wisconsin-Madison and the University of North Carolina at Chapel Hill."], ["1968-02-17T00:00:00", "Administrative reforms in Romania divide the country into 39 counties."], ["1968-02-19T00:00:00", "The Florida Education Association (FEA) initiates a mass resignation of teachers to protest state funding of education. This is, in effect, the first statewide teachers' strike in the United States."], ["1968-02-19T00:00:00", "NET televises the very first episode of Mister Rogers' Neighborhood."], ["1968-02-24T00:00:00", "Vietnam War: The Tet Offensive is halted; South Vietnam recaptures Huế."], ["1968-02-25T00:00:00", "Vietnam War: Hà My massacre."], ["1968-02-27T00:00:00", "Ex-Teenagers singer Frankie Lymon is found dead from a heroin overdose in Harlem."], ["1968-03-07T00:00:00", "Vietnam War: The First Battle of Saigon ends."], ["1968-03-08T00:00:00", "The first student protests spark the 1968 Polish political crisis."], ["1968-03-11T00:00:00", "U.S. President Lyndon B. Johnson mandates that all computers purchased by the federal government support the ASCII character encoding."], ["1968-03-12T00:00:00", "Mauritius achieves independence from British rule."], ["1968-03-12T00:00:00", "U.S. President Lyndon B. Johnson barely edges out antiwar candidate Eugene McCarthy in the New Hampshire Democratic primary, a vote which highlights the deep divisions in the country, and the party, over Vietnam."], ["1968-03-13T00:00:00", "The first Rotaract club is chartered in North Charlotte, North Carolina."], ["1968-03-14T00:00:00", "Nerve gas leaks from the U.S. Army Dugway Proving Ground near Skull Valley, Utah."], ["1968-03-15T00:00:00", "British Foreign Secretary George Brown resigns."], ["1968-03-16T00:00:00", "Vietnam War - My Lai Massacre: American troops kill scores of civilians. The story will first become public in November 1969 and will help undermine public support for the U.S. efforts in Vietnam."], ["1968-03-16T00:00:00", "U.S. Senator Robert F. Kennedy enters the race for the Democratic Party presidential nomination."], ["1968-03-17T00:00:00", "A demonstration in London's Grosvenor Square against U.S. involvement in the Vietnam War leads to violence; 91 people are injured, 200 demonstrators arrested."], ["1968-03-18T00:00:00", "Gold standard: The United States Congress repeals the requirement for a gold reserve to back U.S. currency."], ["1968-03-21T00:00:00", "Vietnam War: In ongoing campus unrest, Howard University students protesting the Vietnam War, the ROTC program on campus and the draft, confront Gen. Lewis Hershey, then head of the U.S. Selective Service System, and as he attempts to deliver an address, shout him down with cries of \"America is the Black man's battleground!\""], ["1968-03-22T00:00:00", "Daniel Cohn-Bendit (\"Danny the Red\") and 7 other students occupy the administrative offices of the University of Nanterre, setting in motion a chain of events that lead France to the brink of revolution in May."], ["1968-03-24T00:00:00", "Aer Lingus Flight 712 crashes en route from Cork to London near Tuskar Rock, Wexford, killing 61 passengers and crew."], ["1968-03-26T00:00:00", "Joan Baez marries activist David Harris in New York."], ["1968-03-28T00:00:00", "Brazilian high school student Edson Luís de Lima Souto is shot by the police in a protest for cheaper meals at a restaurant for low-income students. The aftermath of his death is one of the first major events against the military dictatorship."], ["1968-03-31T00:00:00", "U.S. President Lyndon B. Johnson announces he will not seek re-election."], ["1968-04-02T00:00:00", "Bombs explode at midnight in two department stores in Frankfurt-am-Main; Andreas Baader and Gudrun Ensslin are later arrested and sentenced for arson."], ["1968-04-02T00:00:00", "The film 2001: A Space Odyssey premieres in Washington, D.C."], ["1968-04-03T00:00:00", "The American movie Planet of the Apes is released in theaters."], ["1968-04-04T00:00:00", "Martin Luther King, Jr. is shot dead at the Lorraine Motel in Memphis, Tennessee. Riots erupt in major American cities, lasting for several days afterwards."], ["1968-04-04T00:00:00", "Apollo program: Apollo-Saturn mission 502 (Apollo 6) is launched, as the second and last unmanned test-flight of the Saturn V launch vehicle."], ["1968-04-06T00:00:00", "La, la, la by Massiel (music and lyrics by Manuel de la Calva and Ramón Arcusa) wins the Eurovision Song Contest 1968 for Spain, at the Royal Albert Hall in London."], ["1968-04-06T00:00:00", "A shootout between Black Panthers and Oakland police results in several arrests and deaths, including 16-year-old Panther Bobby Hutton."], ["1968-04-06T00:00:00", "A double explosion in downtown Richmond, Indiana kills 41 and injures 150."], ["1968-04-07T00:00:00", "Racing driver Jim Clark is killed in a Formula 2 race at Hockenheim."], ["1968-04-08T00:00:00", "The Bureau of Narcotics and Dangerous Drugs (under Department of Justice) (BNDD) is created."], ["1968-04-10T00:00:00", "The ferry TEV Wahine strikes a reef at the mouth of Wellington Harbour, New Zealand, with the loss of 53 lives, in Cyclone Giselle, which created the windiest conditions ever recorded in New Zealand."], ["1968-04-11T00:00:00", "Josef Bachmann tries to assassinate Rudi Dutschke, leader of the left-wing movement (APO) in Germany, and tries to commit suicide afterwards, failing in both, although Dutschke dies of his brain injuries 11 years later."], ["1968-04-11T00:00:00", "German left-wing students blockade the Springer Press HQ in Berlin and many are arrested (one of them Ulrike Meinhof)."], ["1968-04-11T00:00:00", "U.S. President Lyndon B. Johnson signs the Civil Rights Act of 1968."], ["1968-04-11T00:00:00", "MGM's classic film The Wizard of Oz makes its NBC debut after being telecast on CBS since 1956. It will remain on NBC for the next 8 years."], ["1968-04-20T00:00:00", "English politician Enoch Powell makes his controversial Rivers of Blood speech."], ["1968-04-23T00:00:00", "President Mobutu releases captured mercenaries in the Congo."], ["1968-04-23T00:00:00", "Surgeons at the Hôpital de la Pitié, Paris, perform Europe's first heart transplant, on Clovis Roblain."], ["1968-04-23T00:00:00", "The United Methodist Church is created by the union of the former Methodist and Evangelical United Brethren churches."], ["1968-04-26T00:00:00", "The nuclear weapon \"Boxcar\" is tested at the Nevada Test Site in the biggest detonation of Operation Crosstie."], ["1968-04-29T00:00:00", "The musical Hair officially opens on Broadway."], ["1968-05-02T00:00:00", "The Israel Broadcasting Authority commences television broadcasts."], ["1968-05-03T00:00:00", "Braniff Flight 352 crashes near Dawson, Texas, killing all 85 persons on board."], ["1968-05-13T00:00:00", "Paris student riots: One million march through the streets of Paris."], ["1968-05-13T00:00:00", "Manchester City wins the 1967-68 Football League First Division by 2 clear points, over club rivals Manchester United."], ["1968-05-14T00:00:00", "The Beatles announce the creation of Apple Records in a New York press conference."], ["1968-05-15T00:00:00", "An outbreak of severe thunderstorms produces tornadoes, causing massive damage and heavy casualties in Charles City, Iowa, Oelwein, Iowa, and Jonesboro, Arkansas."], ["1968-05-16T00:00:00", "Ronan Point, a 23 floor tower block in Canning Town, east London, partially collapses after a gas explosion, killing 5."], ["1968-05-17T00:00:00", "The Catonsville Nine enter the Selective Service offices in Catonsville, Maryland, take dozens of selective service draft records, and burn them with napalm as a protest against the Vietnam War."], ["1968-05-19T00:00:00", "A general election is held in Italy."], ["1968-05-19T00:00:00", "Nigerian forces capture Port Harcourt and form a ring around the Biafrans. This contributes to a humanitarian disaster as the surrounded population already suffers from hunger and starvation."], ["1968-05-22T00:00:00", "The U.S. nuclear-powered submarine Scorpion sinks with 99 men aboard, 400 miles southwest of the Azores."], ["1968-05-29T00:00:00", "Manchester United wins the European Cup Final, becoming the first English team to do so."], ["1968-05-30T00:00:00", "Bobby Unser wins the Indianapolis 500."], ["1968-06-01T00:00:00", "Helen Keller dies at the age of 87 years."], ["1968-06-03T00:00:00", "Radical feminist Valerie Solanas shoots Andy Warhol as he enters his studio, wounding him."], ["1968-06-04T00:00:00", "The Standard & Poor's 500 index closes above 100 for the first time, at 100.38."], ["1968-06-04T00:00:00", "Pierre Elliott Trudeau becomes the 15th Prime Minister of Canada."], ["1968-06-05T00:00:00", "U.S. presidential candidate Robert F. Kennedy is shot at the Ambassador Hotel in Los Angeles by Sirhan Sirhan. Kennedy dies from his injuries the next day."], ["1968-06-08T00:00:00", "James Earl Ray is arrested for the assassination of Martin Luther King, Jr.."], ["1968-06-10T00:00:00", "Italy beats Yugoslavia 2-0 in a replay to win the 1968 European Championship. The original final on June 8 ended 1-1."], ["1968-06-12T00:00:00", "The film Rosemary's Baby premieres in the U.S."], ["1968-06-17T00:00:00", "The Malayan Communist Party launches a second insurgency and the state of emergency is again imposed in Malaysia."], ["1968-06-20T00:00:00", "Austin Currie, Member of Parliament at Stormont in Northern Ireland, along with others, squats a house in Caledon to protest discrimination in housing allocations."], ["1968-06-23T00:00:00", "A football stampede in Buenos Aires leaves 74 dead and 150 injured."], ["1968-06-24T00:00:00", "Giorgio Rosa declares the independence of his Republic of Rose Island, an artificial island off Rimini, Italy. Italian troops demolish it not long after."], ["1968-06-26T00:00:00", "The Bonin Islands are returned to Japan after 23 years of occupation by the United States Navy."], ["1968-06-30T00:00:00", "The Lockheed C-5 Galaxy heavy military transport aircraft first flies in the U.S. This model will still be in service 40 years later."], ["1968-07-01T00:00:00", "The Central Intelligence Agency's Phoenix Program is officially established."], ["1968-07-01T00:00:00", "The Nuclear Non-Proliferation Treaty opens for signature."], ["1968-07-04T00:00:00", "Yachtsman Alec Rose, 59, receives a hero's welcome as he sails into Portsmouth, England after his 354-day round-the-world trip."], ["1968-07-15T00:00:00", "- The soap opera One Life to Live premieres on ABC."], ["1968-07-17T00:00:00", "Saddam Hussein becomes Vice Chairman of the Revolutionary Council in Iraq after a coup d'état."], ["1968-07-18T00:00:00", "The semiconductor company Intel is founded."], ["1968-07-20T00:00:00", "The first International Special Olympics Summer Games are held at Soldier Field in Chicago, Ill, with about 1,000 athletes with intellectual disabilities."], ["1968-07-25T00:00:00", "Pope Paul VI publishes the encyclical entitled Humanae vitae, condemning birth control."], ["1968-07-26T00:00:00", "Vietnam War: South Vietnamese opposition leader Trương Đình Dzu is sentenced to 5 years hard labor, for advocating the formation of a coalition government as a way to move toward an end to the war."], ["1968-07-29T00:00:00", "Arenal Volcano erupts in Costa Rica for the first time in centuries."], ["1968-07-30T00:00:00", "Thames Television starts transmission in London."], ["1968-08-11T00:00:00", "The last steam passenger train service runs in Britain. A selection of British Railways steam locomotives make the 120-mile journey from Liverpool to Carlisle and return to Liverpool - the journey is known as the Fifteen Guinea Special."], ["1968-08-18T00:00:00", "Two charter buses are pushed into the Hida River on National Highway Route 41 in Japan, in an accident caused by heavy rain; 104 are killed."], ["1968-08-21T00:00:00", "The Medal of Honor is posthumously awarded to James Anderson, Jr.—he is the first black U.S. Marine to be awarded the Medal of Honor."], ["1968-08-24T00:00:00", "France explodes its first hydrogen bomb."], ["1968-08-29T00:00:00", "John Gordon Mein, US Ambassador to Guatemala, is assassinated on the streets of Guatemala City. First US Ambassador assassinated in the line of duty."], ["1968-08-29T00:00:00", "Crown Prince Harald of Norway marries Sonja Haraldsen, the commoner he has dated for 9 years, in Oslo."], ["1968-09-06T00:00:00", "Swaziland becomes independent."], ["1968-09-06T00:00:00", "150 women (members of New York Radical Women) arrive in Atlantic City, New Jersey to protest against the Miss America Pageant, as exploitative of women. Led by activist and author Robin Morgan, it is one of the first large demonstrations of Second Wave Feminism as Women's Liberation begins to gather much media attention."], ["1968-09-11T00:00:00", "The International Association of Classification Societies (IACS) is founded."], ["1968-09-11T00:00:00", "French General René Cogny and 94 others die in an Air France Caravelle jetliner crash near Nice in the Mediterranean."], ["1968-09-13T00:00:00", "Albania officially retreats from the Warsaw Pact upon the Soviet Union-led Warsaw Pact invasion of Czechoslovakia, having already ceased to participate actively in Pact activity since 1962."], ["1968-09-13T00:00:00", "US Army Maj. Gen. Keith L. Ware, WWII Medal of Honor recipient, is killed when his helicopter is shot down in Vietnam. He is posthumously awarded the Distinguished Service Cross."], ["1968-09-13T00:00:00", "Agreement for merger between the General Electric Company and English Electric, the largest industrial merger in the UK up to this date."], ["1968-09-14T00:00:00", "Detroit Tiger Denny McLain becomes the first baseball pitcher to win 30 games in a season since 1934. He remains the last to accomplish the feat."], ["1968-09-17T00:00:00", "The D'Oliveira affair: The Marylebone Cricket Club tour of South Africa is cancelled when the South Africans refuse to accept the presence of Basil D'Oliveira, a Cape Coloured, in the side."], ["1968-09-20T00:00:00", "Hawaii 5-O debuts on CBS, and eventually becomes the longest-running crime show in television history, until Law & Order overtakes it in 2003."], ["1968-09-21T00:00:00", "The Soviet's Zond 5 unmanned lunar flyby mission returns to earth, with its first of a kind biological payload intact."], ["1968-09-23T00:00:00", "Vietnam War: The Tet Offensive comes to an end in South Vietnam."], ["1968-09-24T00:00:00", "60 Minutes debuts on CBS and is still on the air as of 2015."], ["1968-09-27T00:00:00", "Marcelo Caetano becomes prime minister of Portugal."], ["1968-09-29T00:00:00", "A referendum in Greece gives more power to the military junta."], ["1968-09-30T00:00:00", "At Paine Field, near Everett, Washington in the United States, Boeing officially rolls out its new 747 for the media and the public."], ["1968-10-02T00:00:00", "Tlatelolco massacre: A student demonstration ends in bloodbath at La Plaza de las Tres Culturas in Tlatelolco, Mexico City, Mexico, 10 days before the inauguration of the 1968 Summer Olympics."], ["1968-10-03T00:00:00", "In Peru, Juan Velasco Alvarado takes power in a revolution."], ["1968-10-05T00:00:00", "Police baton civil rights demonstrators in Derry, Northern Ireland, marking the beginning of The Troubles."], ["1968-10-08T00:00:00", "Vietnam War - Operation Sealords: United States and South Vietnamese forces launch a new operation in the Mekong Delta."], ["1968-10-11T00:00:00", "Apollo program: NASA launches Apollo 7, the first manned Apollo mission (Wally Schirra, Donn Eisele, Walter Cunningham). Mission goals include the first live television broadcast from orbit and testing the lunar module docking maneuver."], ["1968-10-11T00:00:00", "In Panama, a military coup d'état, led by Col. Boris Martinez and Col. Omar Torrijos, overthrows the democratically elected (but highly controversial) government of President Arnulfo Arias. Within a year, Torrijos ousts Martinez and takes charge as de facto Head of Government in Panama."], ["1968-10-12T00:00:00", "Equatorial Guinea receives its independence from Spain."], ["1968-10-14T00:00:00", "Vietnam War: The United States Department of Defense announces that the United States Army and United States Marines will send about 24,000 troops back to Vietnam for involuntary second tours."], ["1968-10-15T00:00:00", "Led Zeppelin makes their first live performance, at Surrey University in England"], ["1968-10-16T00:00:00", "In Mexico City, African-American athletes Tommie Smith and John Carlos raise their arms in a black power salute after winning, respectively, the gold and bronze medals in the Olympic men's 200 metres."], ["1968-10-16T00:00:00", "Kingston, Jamaica is rocked by the Rodney Riots, provoked by the banning of Walter Rodney from the country."], ["1968-10-20T00:00:00", "Former U.S. First Lady Jacqueline Kennedy marries Greek shipping tycoon Aristotle Onassis on the Greek island of Skorpios."], ["1968-10-22T00:00:00", "The Gun Control Act of 1968 is enacted."], ["1968-10-31T00:00:00", "Vietnam War: Citing progress in the Paris peace talks, U.S. President Lyndon B. Johnson announces to the nation that he has ordered a complete cessation of \"all air, naval, and artillery bombardment of North Vietnam\" effective November 1."], ["1968-11-05T00:00:00", "U.S. presidential election, 1968: Republican challenger Richard Nixon defeats the Democratic candidate, Vice President Hubert Humphrey, and American Independent Party candidate George C. Wallace."], ["1968-11-05T00:00:00", "Luis A. Ferré, of the newly formed New Progressive Party is elected Governor of Puerto Rico, by beating incumbent governor Roberto Sánchez Vilella of the People's Party, Luis Negrón López of the Popular Democratic Party and Antonio J. Gonzalez of the Puerto Rican Independence Party, he also becomes the first \"statehooder\" governor of the Island."], ["1968-11-11T00:00:00", "Vietnam War: Operation Commando Hunt is initiated to interdict men and supplies on the Ho Chi Minh trail, through Laos into South Vietnam. By the end of the operation, 3 million tons of bombs are dropped on Laos, slowing but not seriously disrupting trail operations."], ["1968-11-11T00:00:00", "A second republic is declared in the Maldives."], ["1968-11-14T00:00:00", "Yale University announces it is going to admit women."], ["1968-11-17T00:00:00", "The Heidi Game: NBC cuts off the final 1:05 of an Oakland Raiders-New York Jets football game to broadcast the pre-scheduled Heidi. Fans are unable to see Oakland (which had been trailing 32-29) score 2 late touchdowns to win 43-32; as a result, thousands of outraged football fans flood the NBC switchboards to protest."], ["1968-11-19T00:00:00", "In Mali, President Modibo Keïta's regime is overthrown in a bloodless military coup led by Moussa Traoré."], ["1968-11-20T00:00:00", "The Farmington Mine disaster in Farmington, West Virginia, kills seventy-eight men."], ["1968-11-22T00:00:00", "The Beatles release their self-titled album popularly known as the White Album."], ["1968-11-22T00:00:00", "\"Plato's Stepchildren\", 12th episode of Star Trek 3rd season is aired, featuring the first-ever interracial kiss on U.S. national television between Lieutenant Uhura and Captain James T. Kirk."], ["1968-11-24T00:00:00", "4 men hijack Pan Am Flight 281 from JFK International Airport, New York to Havana, Cuba."], ["1968-11-26T00:00:00", "Vietnam War: United States Air Force First Lieutenant and Bell UH-1F helicopter pilot James P. Fleming rescues an Army Special Forces unit pinned down by Viet Cong fire, earning a Medal of Honor for his bravery."], ["1968-12-03T00:00:00", "The '68 Comeback Special marks the concert return of Elvis Presley."], ["1968-12-06T00:00:00", "The Rolling Stones release Beggars Banquet, which contains the classic song \"Sympathy for the Devil.\""], ["1968-12-09T00:00:00", "Douglas Engelbart publicly demonstrates his pioneering hypertext system, NLS, in San Francisco, together with the computer mouse, at what becomes retrospectively known as \"The Mother of All Demos\"."], ["1968-12-10T00:00:00", "Japan's biggest heist, the never-solved \"300 million yen robbery\", occurs in Tokyo."], ["1968-12-11T00:00:00", "The film - The Rolling Stones Rock and Roll Circus is also filmed on this date, but not released until 1996."], ["1968-12-13T00:00:00", "Brazilian president Artur da Costa e Silva decrees the AI-5 (or the Fifth Institutional Act), which lasts until 1978 and marks the beginning of the hard times of Brazilian military dictatorship."], ["1968-12-17T00:00:00", "11-year-old Mary Bell is found guilty of murdering two small boys and sentenced to life in Detention, but is later released from prison in 1980 and granted anonymity."], ["1968-12-20T00:00:00", "The Zodiac Killer is believed to have shot Betty Lou Jensen and David Faraday on Lake Herman Road, Benicia, San Francisco Bay, California."], ["1968-12-22T00:00:00", "David Eisenhower, grandson of former U.S. President Dwight D. Eisenhower, marries Julie Nixon, the daughter of U.S. President-elect Richard Nixon."], ["1968-12-22T00:00:00", "Mao Zedong advocates that educated youth in urban China be re-educated in the country. It marks the start of the \"Up to the mountains and down to the villages\" movement."], ["1968-12-24T00:00:00", "Apollo program: U.S. spacecraft Apollo 8 enters orbit around the Moon. Astronauts Frank Borman, Jim Lovell and William A. Anders become the first humans to see the far side of the Moon and planet Earth as a whole. The crew also reads from Genesis."], ["1968-12-26T00:00:00", "Led Zeppelin make their American debut in Denver, CO."], ["1968-12-28T00:00:00", "Israeli forces launch an attack on Beirut airport, destroying more than a dozen aircraft."]]