[["1977-01-01T00:00:00", "The Australian state of Queensland abolishes the inheritance tax."], ["1977-01-03T00:00:00", "Apple Computer is incorporated."], ["1977-01-06T00:00:00", "Record company EMI sacks the controversial United Kingdom punk rock group the Sex Pistols."], ["1977-01-08T00:00:00", "Three bombs explode in Moscow within 37 minutes, killing seven. The bombings are attributed to an Armenian separatist group."], ["1977-01-10T00:00:00", "Mount Nyiragongo erupts in eastern Zaire (now the Democratic Republic of the Congo)."], ["1977-01-10T00:00:00", "Ocean Park opens in Hong Kong."], ["1977-01-15T00:00:00", "Kälvesta air disaster: A Swedish airliner crashes into a residential area of Stockholm, killing all 22 on board."], ["1977-01-17T00:00:00", "Gary Gilmore is executed by firing squad in Utah (the first execution after the reintroduction of the death penalty in the U.S.)."], ["1977-01-17T00:00:00", "49 marines from the USS Trenton and USS Guam (LPH-9) perished in the waters of the Barcelona harbour [1]."], ["1977-01-18T00:00:00", "Scientists identify a previously unknown bacterium as the cause of the mysterious Legionnaires' disease."], ["1977-01-18T00:00:00", "Australia's worst railway disaster at Granville, near Sydney, leaves 83 people dead."], ["1977-01-18T00:00:00", "SFR Yugoslavia Prime minister Džemal Bijedić, his wife and 6 others are killed in a plane crash in Bosnia and Herzegovina."], ["1977-01-19T00:00:00", "U.S. President Gerald Ford pardons Iva Toguri D'Aquino (aka \"Tokyo Rose\")."], ["1977-01-19T00:00:00", "Snow falls in Miami (despite its ordinarily tropical climate) for the only time in its history. Snowfall has occurred farther south in the United States only on the high mountains of the state of Hawaii."], ["1977-01-20T00:00:00", "Jimmy Carter succeeds Gerald Ford as the 39th President of the United States."], ["1977-01-21T00:00:00", "U.S. President Jimmy Carter pardons Vietnam War draft evaders."], ["1977-01-23T00:00:00", "Roots begins its phenomenally successful run on ABC."], ["1977-01-24T00:00:00", "The Massacre of Atocha occurs during the Spanish transition to democracy."], ["1977-01-26T00:00:00", "Katimavik is founded as a volunteer service organization for Canadian youths."], ["1977-01-28T00:00:00", "The Great Lakes Blizzard of 1977 hits Buffalo, New York, and the Niagara Region of Southern Ontario."], ["1977-01-31T00:00:00", "The Centre Georges Pompidou is officially opened by French President Valéry Giscard d'Estaing."], ["1977-02-02T00:00:00", "The Congress party of India, led by Indira Gandhi, splits with Jagjivan Ram and other senior leaders, forming Congress for Democracy. This party later merges with the Janata Party."], ["1977-02-04T00:00:00", "Fleetwood Mac's Grammy-winning album Rumours is released."], ["1977-02-07T00:00:00", "The Soviet Union launches Soyuz 24 (Viktor Gorbatko, Yury Glazkov) to dock with the Salyut 5 space station."], ["1977-02-07T00:00:00", "London's International Times proclaims for the first time the famous quote; “punk is dead.”"], ["1977-02-15T00:00:00", "Space Shuttle program: First test taxi flight of Space Shuttle Enterprise."], ["1977-02-18T00:00:00", "Prog 1 of 2000 AD is launched (issue dated 26 February 1977)."], ["1977-02-23T00:00:00", "Óscar Romero becomes Archbishop of San Salvador."], ["1977-02-28T00:00:00", "Queen Elizabeth II opens the Parliament of New Zealand."], ["1977-03-04T00:00:00", "The 1977 Bucharest Earthquake kills 1,500."], ["1977-03-05T00:00:00", "Formula One driver Tom Pryce dies after colliding with a track marshal at the South African Grand Prix in Kyalami."], ["1977-03-08T00:00:00", "The Australian parliament is opened by Elizabeth II, Queen of Australia."], ["1977-03-09T00:00:00", "Hanafi Siege: Approximately a dozen armed Hanafi Movement members take over 3 buildings in Washington, D.C., killing 1 person and taking more than 130 hostages (the hostage situation ends 2 days later)."], ["1977-03-10T00:00:00", "The rings of Uranus are discovered."], ["1977-03-12T00:00:00", "The Centenary Test between Australia and England begins at the Melbourne Cricket Ground."], ["1977-03-15T00:00:00", "Tenor Luciano Pavarotti and the PBS opera series Live from the Met both make their American television debuts. Pavarotti stars in a complete production of Puccini's La Boheme."], ["1977-03-19T00:00:00", "Results of elections to the Indian Parliament are declared. Indira Gandhi's Congress Party is routed by the opposition parties later to form the Janata Party."], ["1977-03-26T00:00:00", "Focus on the Family is founded by Dr. James Dobson."], ["1977-03-27T00:00:00", "Tenerife disaster: A collision between KLM and Pan Am Boeing 747s at Tenerife, Canary Islands, kills 583 people. This becomes the deadliest accident in aviation history."], ["1977-03-28T00:00:00", "Marquette University wins the men's NCAA basketball tournament with a win over the University of North Carolina 67-59."], ["1977-04-01T00:00:00", "The small market town of Hay-on-Wye declares independence from the UK, as a publicity stunt."], ["1977-04-02T00:00:00", "Horse racing: Red Rum wins a record third Grand National at Aintree Racecourse."], ["1977-04-04T00:00:00", "Grundy, Virginia experiences a major flood that causes around $15 million in damages to 228 residential and commercial structures (to date the town is still recovering)."], ["1977-04-04T00:00:00", "Southern Airways Flight 242 crashes on a highway in New Hope, Georgia, killing 72 people."], ["1977-04-07T00:00:00", "German Federal Prosecutor Siegfried Buback and his driver are shot by 2 Red Army Faction members while waiting at a red light near his home in Karlsruhe. The \"Ulrike Meinhof Commando\" later claims responsibility."], ["1977-04-07T00:00:00", "The Toronto Blue Jays play their first game of baseball against the Chicago White Sox."], ["1977-04-07T00:00:00", "The Seattle Mariners play their first-ever game of baseball against the California Angels."], ["1977-04-08T00:00:00", "The punk band The Clash's debut album The Clash is released in the UK on CBS Records."], ["1977-04-11T00:00:00", "London Transport's Silver Jubilee buses are launched."], ["1977-04-21T00:00:00", "Residents of Dover, Massachusetts report sightings of an eerie monster."], ["1977-04-22T00:00:00", "Optical fiber is first used to carry live telephone traffic."], ["1977-04-27T00:00:00", "The Guatemala City air disaster kills 28 people."], ["1977-04-28T00:00:00", "A federal court in Stuttgart sentences Red Army Faction members Andreas Baader, Gudrun Ensslin, and Jan-Carl Raspe to life imprisonment."], ["1977-04-30T00:00:00", "The Cold War between Cambodia and Vietnam evolves into the Cambodian-Vietnamese War. - Led Zeppelin sets a new world record attendance for an indoor solo attraction at the Pontiac Silverdome when 76,229 persons attend a concert here on the group's 1977 North American Tour."], ["1977-05-01T00:00:00", "The Taksim Square massacre in Istanbul results in 34 deaths, hundreds of injuries."], ["1977-05-03T00:00:00", "The light aircraft carrier HMS Invincible is launched at Barrow-in-Furness by Elizabeth II."], ["1977-05-08T00:00:00", "Suzanne Lacy's extended performance piece about rape, Three Weeks in May begins in Los Angeles and continues until May 24."], ["1977-05-12T00:00:00", "Portugal and Israel establish diplomatic relations."], ["1977-05-14T00:00:00", "The 1977 IAS Cargo Boeing 707 airplane crash in Lusaka, Zambia kills all 6 on board."], ["1977-05-14T00:00:00", "In Milan, Italy, during a far-left demonstration, a hooded person shoots at the police, killing a policeman, Antonio Custra. The scene is photographed and the picture of the hooded man shooting in the middle of the street appears in many magazines around the world."], ["1977-05-17T00:00:00", "The Likud Party, led by Menachem Begin, wins the national elections in Israel."], ["1977-05-17T00:00:00", "Elizabeth II commences her 1977 Silver Jubilee tour in Glasgow, Scotland."], ["1977-05-23T00:00:00", "Scientists report using bacteria in a lab to make insulin via gene splicing."], ["1977-05-23T00:00:00", "Moluccan terrorists take over a school in Bovensmilde, northern Netherlands (105 hostages), and a passenger train on the Bovensmilde-Assen route nearby (90 hostages) at the same time. On June 11, Dutch Royal Marines storm the train, and 6 terrorists and 2 hostages are killed."], ["1977-05-25T00:00:00", "George Lucas' Star Wars opens in cinemas and later becomes the historic highest grossing film for that time. It also makes sci-fi films very popular."], ["1977-05-26T00:00:00", "George Willig climbs the South Tower of the World Trade Center."], ["1977-05-27T00:00:00", "Elizabeth II opens the new Air Terminal Building at the Edinburgh Airport."], ["1977-05-27T00:00:00", "The 1977 Aeroflot Ilyushin 62 airplane crash in Cuba kills 69 people."], ["1977-05-27T00:00:00", "Space Mountain opens at Disneyland and to this day remains as one of the parks most popular attractions."], ["1977-05-27T00:00:00", "A demonstration and coup attempt in Angola takes place. Afterward thousands were killed by the government and Cuban forces."], ["1977-05-28T00:00:00", "The Beverly Hills Supper Club in Southgate, Kentucky, is engulfed in fire; 165 are killed inside."], ["1977-05-29T00:00:00", "Indianapolis 500: A. J. Foyt becomes the first driver to win the race 4 times."], ["1977-06-05T00:00:00", "A bloodless coup installs France-Albert René as President of the Seychelles."], ["1977-06-05T00:00:00", "The Portland Trail Blazers defeat the Philadelphia 76ers 109-107 to win the National Basketball Association finals four games to two. Bill Walton is selected as the MVP of the series."], ["1977-06-06T00:00:00", "9 - Jubilee celebrations are held in the United Kingdom to celebrate 25 years of Elizabeth II's reign."], ["1977-06-07T00:00:00", "After campaigning by Anita Bryant and her anti-gay \"Save Our Children\" crusade, Miami-Dade County, Florida voters overwhelmingly vote to repeal the county's \"gay rights\" ordinance."], ["1977-06-10T00:00:00", "The first Apple II series computers go on sale."], ["1977-06-10T00:00:00", "James Earl Ray escapes from the Brushy Mountain State Prison in Petros, Tennessee; he is recaptured on June 13."], ["1977-06-12T00:00:00", "The Supremes perform their final concert together at Drury Lane in London, England and then disband permanently."], ["1977-06-15T00:00:00", "Spain has its first democratic elections, after 41 years under the Franco regime."], ["1977-06-16T00:00:00", "The Oracle Corporation is incorporated in Redwood Shores, California as Software Development Laboratories (SDL) by Larry Ellison, Bob Miner, and Ed Oates."], ["1977-06-20T00:00:00", "The U.S. Supreme Court rules that the states are not required to spend Medicaid funds on elective abortions."], ["1977-06-20T00:00:00", "Anglia Television broadcasts the fake documentary Alternative 3, which enters into the conspiracy theory canon."], ["1977-06-21T00:00:00", "Bülent Ecevit, of CHP forms the new government of Turkey (40th government since the founding of the Turkish republic, but fails to receive the vote of confidence)."], ["1977-06-25T00:00:00", "The 1977 Rugby League World Cup culminates in Australia's 13 - 12 victory over Great Britain at the Sydney Cricket Ground before about 24,450 spectators."], ["1977-06-25T00:00:00", "American Roy Sullivan is struck by lightning for the seventh time."], ["1977-06-26T00:00:00", "Elvis Presley holds his last concert at Market Square Arena in Indianapolis."], ["1977-06-26T00:00:00", "Some 200,000 protesters march through the streets of San Francisco, protesting Anita Bryant's anti-gay remarks and the murder of Robert Hillsborough."], ["1977-06-26T00:00:00", "16-year-old shop assistant Jayne Macdonald is murdered by the Yorkshire Ripper in Leeds, England."], ["1977-06-27T00:00:00", "Djibouti receives its independence from France."], ["1977-06-30T00:00:00", "The Southeast Asia Treaty Organization is permanently disbanded."], ["1977-06-30T00:00:00", "The Women Marines are disbanded, and the women are integrated into regular Marine Corps."], ["1977-06-30T00:00:00", "U.S. President Jimmy Carter announces the cancellation of the B-1 Bomber program (it is later revived by the Reagan Administration)."], ["1977-07-01T00:00:00", "CKO (a now-defunct Canadian all news radio network since 1989) begins broadcasting."], ["1977-07-01T00:00:00", "The EAC is dissolved."], ["1977-07-01T00:00:00", "Wimbledon - Virginia Wade wins women's singles title in centenary year of the tournament - It was Wade's first and only Wimbledon title, third and final Grand Slam title overall. Wade remains the last British woman to win the singles title at Wimbledon."], ["1977-07-05T00:00:00", "General Muhammad Zia-ul-Haq overthrows Zulfikar Ali Bhutto, the first elected Prime Minister of Pakistan."], ["1977-07-13T00:00:00", "Somalia declares war on Ethiopia, starting the Ethio-Somali War."], ["1977-07-13T00:00:00", "The New York City blackout of 1977 lasts for 25 hours, resulting in looting and other disorder."], ["1977-07-15T00:00:00", "Anti-drug campaigner Donald Mackay disappears near Griffith, New South Wales (presumed murdered)."], ["1977-07-21T00:00:00", "Süleyman Demirel, of AP forms the new government of Turkey (41st government a three-party coalition, so-called second national front (Turkish: Milliyetçi cephe))."], ["1977-07-22T00:00:00", "The purged Chinese Communist leader Deng Xiaoping is restored to power 9 months after the \"Gang of Four\" was expelled from power in a coup d'état."], ["1977-07-24T00:00:00", "Led Zeppelin presents its last American concert in Oakland, California, at the Oakland-Alameda County Coliseum. A brawl erupts between Led Zeppelin's crew and the staff of the promoter Bill Graham, resulting in criminal assault charges for several members of the Led Zeppelin group including the drummer John Bonham."], ["1977-07-27T00:00:00", "The Soviet Politburo orders Boris Yeltsin to demolish the Ipatiev House, where Tsar Nicholas II of Russia and his family were shot in 1918. Yeltsin eventually calls this a barbarian act."], ["1977-07-28T00:00:00", "The first oil through the Trans-Alaska Pipeline System reaches Valdez, Alaska."], ["1977-07-30T00:00:00", "Left-wing German terrorists Susanne Albrecht, Brigitte Mohnhaupt and a third person assassinate Jürgen Ponto, chairman of the Dresdner Bank in Oberursel, West Germany."], ["1977-08-03T00:00:00", "United States Senate hearings on Project MKUltra are held."], ["1977-08-03T00:00:00", "The Tandy Corporation TRS-80 Model I computer is announced at a press conference."], ["1977-08-04T00:00:00", "U.S. President Jimmy Carter signs legislation creating the United States Department of Energy."], ["1977-08-07T00:00:00", "Mount Usu volcano in Japan erupts."], ["1977-08-09T00:00:00", "The military-controlled government of Uruguay announces that it will return the nation to civilian rule through general elections in 1981 for a President and Congress."], ["1977-08-10T00:00:00", "David Berkowitz is captured in Yonkers, New York, after over a year of murders in New York City as the Son of Sam."], ["1977-08-12T00:00:00", "The NASA Space Shuttle, named Enterprise, makes its first test free-flight from the back of a Boeing 747 Shuttle Carrier Aircraft."], ["1977-08-15T00:00:00", "The Big Ear, a radio telescope operated by Ohio State University as part of the SETI project, receives a radio signal from deep space; the event is named the Wow! signal for a notation made by a volunteer on the project."], ["1977-08-15T00:00:00", "Herbert Kappler escapes from the Caelian Hill military hospital in Rome."], ["1977-08-16T00:00:00", "Elvis Presley, the \"king of rock and roll\", dies in his home in Graceland at age 42. 75,000 fans line the streets of Memphis for his funeral."], ["1977-08-16T00:00:00", "Supertanker Pierre Guillaumat is launched at Saint-Nazaire; she is the all-time world's largest ship (by deadweight tonnage and length overall) at launch."], ["1977-08-17T00:00:00", "The Soviet icebreaker Arktika becomes the first surface ship to reach the North Pole."], ["1977-08-19T00:00:00", "Groucho Marx, comedic legend, star of stage and screen, dies of pneumonia at Cedars-Sinai Medical Center in Los Angeles, at the age of 86 (born 1890)."], ["1977-08-20T00:00:00", "Voyager program: The United States launches the Voyager 2 spacecraft."], ["1977-09-03T00:00:00", "The Commodore PET computer is first sold."], ["1977-09-04T00:00:00", "The Golden Dragon massacre takes place in San Francisco."], ["1977-09-05T00:00:00", "Voyager program: Voyager 1 is launched after a brief delay."], ["1977-09-05T00:00:00", "German Autumn: Employers Association President Hanns Martin Schleyer is kidnapped in Cologne, West Germany. The kidnappers kill 3 escorting police officers and his chauffeur. They demand the release of Red Army Faction prisoners."], ["1977-09-07T00:00:00", "Treaties between Panama and the United States on the status of the Panama Canal are signed. The U.S. agrees to transfer control of the canal to Panama at the end of the 20th century."], ["1977-09-08T00:00:00", "Interpol issues a resolution against the piracy of video tapes and other material, which is still cited in warnings on opening pre-credits of videocassettes and DVDs."], ["1977-09-10T00:00:00", "Hamida Djandoubi's is the last guillotine execution in France."], ["1977-09-11T00:00:00", "Atari, Inc. releases its Video Computer System in North America."], ["1977-09-12T00:00:00", "South African activist Steve Biko dies after suffering a massive head injury in police custody in Pretoria."], ["1977-09-16T00:00:00", "Glam rock pioneer Marc Bolan dies in a car crash in Barnes, London."], ["1977-09-18T00:00:00", "Courageous (U.S.), skippered by Ted Turner, sweeps the Australian challenger Australia in the 24th America's Cup yacht race."], ["1977-09-19T00:00:00", "Under pressure from the Carter Administration, President of Nicaragua Anastasio Somoza Debayle lifts the state of siege in Nicaragua."], ["1977-09-19T00:00:00", "North Korean agents abduct Yutaka Kume from Noto Peninsula starting the North Korean abductions of Japanese citizens."], ["1977-09-20T00:00:00", "The Petrozavodsk phenomenon is observed in the Soviet Union and some northern European countries."], ["1977-09-21T00:00:00", "A nuclear non-proliferation pact is signed by 15 countries, including the United States and the Soviet Union."], ["1977-09-28T00:00:00", "The Porsche 928 debuts at the Geneva Motor Show."], ["1977-09-29T00:00:00", "The modern Food Stamp Program begins when the Food Stamp Act of 1977 is enacted."], ["1977-10-01T00:00:00", "Energy Research and Development Administration part of Department of Energy."], ["1977-10-01T00:00:00", "Pelé plays his final professional football game as a member of the New York Cosmos."], ["1977-10-13T00:00:00", "German Autumn: Four Palestinians hijack a Lufthansa Airlines flight to Somalia and demand the release of 11 Red Army Faction members (see Lufthansa Flight 181)."], ["1977-10-14T00:00:00", "The Atari 2600 game system is released."], ["1977-10-14T00:00:00", "Anita Bryant is famously pied by four gay rights activists during a press conference in Des Moines, Iowa. This event resulted in her political fallout from anti-gay activism."], ["1977-10-17T00:00:00", "18 - German Autumn: GSG 9 troopers storm a hijacked Lufthansa passenger plane in Mogadishu, Somalia; 3 of the 4 hijackers die."], ["1977-10-18T00:00:00", "German Autumn: Red Army Faction members Andreas Baader, Jan-Carl Raspe and Gudrun Ensslin commit suicide in Stammheim prison; Irmgard Möller fails (their supporters still claim they were murdered). They are buried on October 27."], ["1977-10-18T00:00:00", "Elizabeth II, Queen of Canada, opens the third session of the 30th Canadian Parliament."], ["1977-10-18T00:00:00", "Reggie Jackson blasts 3 home runs to lead the New York Yankees to a World Series victory over the Los Angeles Dodgers."], ["1977-10-19T00:00:00", "German Autumn: Kidnapped industrialist Hanns Martin Schleyer is found murdered in Mulhouse, France."], ["1977-10-20T00:00:00", "Three members of the rock band Lynyrd Skynyrd die in a charter plane crash outside Gillsburg, Mississippi, 3 days after the release of their fifth studio album Street Survivors."], ["1977-10-21T00:00:00", "The European Patent Institute is founded."], ["1977-10-25T00:00:00", "Seychelles recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1977-10-26T00:00:00", "The last natural smallpox case is discovered in Merca district, Somalia. The WHO and the CDC consider this date the anniversary of the eradication of smallpox, the most spectacular success of vaccination and, by extension, of modern science."], ["1977-10-27T00:00:00", "British punk band Sex Pistols release \"Nevermind the Bollocks: Here's The Sex Pistols\", which was instantly banned."], ["1977-10-28T00:00:00", "Hong Kong police forces attack the ICAC headquarters."], ["1977-10-28T00:00:00", "Never Mind the Bollocks, Here's the Sex Pistols is released in the United Kingdom."], ["1977-11-01T00:00:00", "2060 Chiron, first of the outer Solar System asteroids known as Centaurs, is discovered by Charlie Kowal."], ["1977-11-02T00:00:00", "The worst storm in Athens' modern history causes havoc across the Greek capital and kills 38 people."], ["1977-11-06T00:00:00", "The Kelly Barnes Dam, located above Toccoa Falls Bible College near Toccoa, Georgia fails, killing 39."], ["1977-11-08T00:00:00", "Greek archaeologist Manolis Andronikos discovers the tomb of Philip II of Macedon at Vergina."], ["1977-11-08T00:00:00", "San Francisco elects City Supervisor Harvey Milk, the first openly gay elected official of any large city in the U.S."], ["1977-11-09T00:00:00", "Gen. Hugo Banzer, president of the military government of Bolivia, announces that the constitutional democracy will be restored in 1978 instead of 1980 as previously provided."], ["1977-11-10T00:00:00", "The Bee Gees release the soundtrack to Saturday Night Fever, which will go on to become the then best selling album of all time."], ["1977-11-19T00:00:00", "Egyptian President Anwar Sadat becomes the first Arab leader to make an official visit to Israel, when he meets with Israeli Prime Minister Menachem Begin, seeking a permanent peace settlement."], ["1977-11-19T00:00:00", "TAP Portugal Flight 425 crashes at Madeira Airport, Funchal, Portugal, killing 131 and leaving 33 survivors."], ["1977-11-22T00:00:00", "British Airways inaugurates regular London to New York City supersonic Concorde service."], ["1977-11-22T00:00:00", "The TCP/IP test succeeds, connecting 3 ARPANET nodes (of 111), in what eventually becomes the Internet protocol."], ["1977-11-26T00:00:00", "The Hannington transmitter of the Independent Broadcasting Authority is perpetrated by people claiming to be aliens. They warn humanity to live in peace. Considered a prank, they were never caught."], ["1977-11-27T00:00:00", "The Rankin/Bass made-for-TV animated film The Hobbit premieres on NBC in the United States."], ["1977-11-30T00:00:00", "The International Fund for Agricultural Development (IFAD) is founded as a specialized agency of the United Nations."], ["1977-12-01T00:00:00", "Lockheed's top-secret stealth aircraft project, designated Have Blue and precursor to the U.S. Lockheed F-117 Nighthawk, makes its first flight."], ["1977-12-01T00:00:00", "The first children's cable channel The Pinwheel Network (later known as Nickelodeon), is launched."], ["1977-12-04T00:00:00", "Jean-Bédel Bokassa, president of the Central African Republic, crowns himself Emperor."], ["1977-12-04T00:00:00", "Malaysian Airline System Flight 653 is hijacked and crashes in Tanjung Kupang, Johor, Malaysia, killing all 100 passengers and crew on board."], ["1977-12-11T00:00:00", "after losing 26 games, the Tampa Bay Buccaneers of the US National Football League record their very first win; against the New Orleans Saints."], ["1977-12-13T00:00:00", "a chartered Douglas DC-3 aircraft carrying the University of Evansville basketball team to Nashville, Tennessee, crashes in rain and dense fog about 90 seconds after takeoff from Evansville Regional Airport; 29 people die in the crash, including 14 members of the team and head coach Bob Watson."], ["1977-12-16T00:00:00", "Mikhail Baryshnikov's 1976 production of Tchaikovsky's beloved ballet The Nutcracker comes to CBS a year after premiering onstage at the Kennedy Center. This adaptation will become the most popular television production of the work."], ["1977-12-16T00:00:00", "The movie Saturday Night Fever is released in theaters and becoming the biggest dancing movie of all time and launches the career of its star John Travolta and the Bee Gees who performed many songs on its soundtrack to superstardom."], ["1977-12-18T00:00:00", "SA de Transport Aérien Flight 730, an international charter service from Zurich to Funchal Airport (Madeira), hits the sea during a landing attempt. Many of the 36 who die drown, trapped inside the sinking aircraft. Twenty-one people survive with the help of rescuers and by swimming to the shore."], ["1977-12-20T00:00:00", "Djibouti and Vietnam join the United Nations."], ["1977-12-25T00:00:00", "Comedian Charlie Chaplin, silent film actor dies in his sleep at his home at the Manoir de Ban in Vevey, Switzerland at the age of 88."]]