[["1900-01-02T00:00:00", "U.S. Secretary of State John Hay announces the Open Door Policy to promote American trade with China."], ["1900-01-05T00:00:00", "The Irish Nationalist leader John Redmond calls for a revolt against British rule."], ["1900-01-05T00:00:00", "Dr. Henry A. Rowland of Johns Hopkins University announces a theory about the cause of the Earth's magnetism."], ["1900-01-06T00:00:00", "Second Boer War: Boers attack the town of Ladysmith, South Africa, killing over 1,000 people."], ["1900-01-09T00:00:00", "S.S. Lazio, an Italian professional sports club, is founded in Rome."], ["1900-01-14T00:00:00", "Puccini's opera Tosca premieres in Rome, Italy."], ["1900-01-14T00:00:00", "The U.S. Senate accepts the British-German treaty of 1899, in which the United Kingdom renounced its claims to the American Samoa portion of the Samoan Islands."], ["1900-01-24T00:00:00", "The Second Boer War: At the Battle of Spion Kop, Boer troops defeat the British Army."], ["1900-01-27T00:00:00", "Boxer Rebellion: Foreign diplomats in Peking, Qing dynasty China, demand that the Boxer rebels be disciplined."], ["1900-01-31T00:00:00", "Datu Muhammad Salleh, leader of the Mat Salleh Rebellion in North Borneo, is shot dead in Tambunan."], ["1900-02-05T00:00:00", "The United Kingdom and the United States sign a treaty for the building of a Central American shipping canal across Central America in Nicaragua."], ["1900-02-06T00:00:00", "The international arbitration court at The Hague is created when the Netherlands' Senate ratifies an 1899 peace conference decree."], ["1900-02-08T00:00:00", "Second Boer War: British troops are defeated by the Boers at Ladysmith."], ["1900-02-14T00:00:00", "Second Boer War - Battle of Paardeberg: 20,000 British troops invade the Orange Free State."], ["1900-02-15T00:00:00", "Second Boer War: The Siege of Kimberley is lifted."], ["1900-02-17T00:00:00", "Second Boer War: Battle of Paardeberg: British troops defeat the Boers."], ["1900-02-27T00:00:00", "FC Bayern, Germany's most successful football club, is founded in Munich."], ["1900-02-27T00:00:00", "Second Boer War: British military leaders accept the unconditional notice of surrender from Boer General Piet Cronjé."], ["1900-03-05T00:00:00", "Two U.S. Navy cruisers are sent to Central America to protect American interests in a dispute between Nicaragua and Costa Rica."], ["1900-03-06T00:00:00", "A coal mine explosion in West Virginia, U.S.A. kills 50 miners."], ["1900-03-14T00:00:00", "Botanist Hugo de Vries rediscovers Mendel's Laws of Heredity."], ["1900-03-15T00:00:00", "The Gold Standard Act is ratified, placing the United States currency on the gold standard."], ["1900-03-16T00:00:00", "The British archaeologist Sir Arthur Evans purchases the land on Crete on which the ruins of the palace of Knossos stand. He begins to unearth some of the palace three days later."], ["1900-03-27T00:00:00", "The arrival of a Russian naval fleet in Korea causes concern to the Imperial Japanese government."], ["1900-04-14T00:00:00", "The Paris World Exhibition opens."], ["1900-04-22T00:00:00", "Battle of Kousséri: French forces secure their domination of Chad. Warlord Rabih az-Zubayr is defeated and killed."], ["1900-05-01T00:00:00", "An explosion of blasting powder in a coal mine in Scofield, Utah kills 200."], ["1900-05-14T00:00:00", "The second Modern Olympic Games opens in Paris (as part of the Paris World Exhibition)."], ["1900-05-17T00:00:00", "Second Boer War: The British Army relieves the Siege of Mafeking."], ["1900-05-17T00:00:00", "Boxer Rebellion: Boxers destroy three villages near Peking and kill sixty Chinese Christians."], ["1900-05-17T00:00:00", "L. Frank Baum's The Wonderful Wizard of Oz is published in Chicago, the first of Baum's Oz books chronicling the fictional Land of Oz for children."], ["1900-05-18T00:00:00", "The United Kingdom proclaims a protectorate over Tonga."], ["1900-05-21T00:00:00", "Russia invades Manchuria."], ["1900-05-24T00:00:00", "Second Boer War: The British annex the Orange Free State as the Orange River Colony."], ["1900-05-28T00:00:00", "Boxer Rebellion: The Boxers attack Belgians in the Fengtai railway station."], ["1900-05-29T00:00:00", "N'Djamena, the capital city of Chad, is founded as Fort-Lamy by French commander Émile Gentil."], ["1900-05-31T00:00:00", "Boxer Rebellion: Peacekeepers from various European countries arrive in China where they join with Japanese forces."], ["1900-06-01T00:00:00", "American temperance agitator Carrie Nation begins her crusade to demolish saloons."], ["1900-06-05T00:00:00", "Second Boer War: British soldiers take Pretoria."], ["1900-06-14T00:00:00", "The Reichstag approves a second law that allows the expansion of the Imperial German Navy"], ["1900-06-17T00:00:00", "Boxer Rebellion: Battle of Dagu Forts: Naval forces of the Eight-Nation Alliance capture the Taku Forts on the Hai River estuary in China."], ["1900-06-20T00:00:00", "Boxer Rebellion: Boxers gather about 20,000 people near Peking and kill hundreds of European citizens, including the German ambassador."], ["1900-06-25T00:00:00", "The Taoist monk Wang Yuanlu discovers the Dunhuang manuscripts in the Mogao Caves of Dunhuang, China, where they have been sealed since the early 11th century."], ["1900-06-30T00:00:00", "Hoboken Docks fire: A wharf fire at the docks in Hoboken, New Jersey, owned by the North German Lloyd Steamship line spreads to German passenger ships Saale, Main, and Bremen. The fire engulfs the adjacent piers and nearby ships, killing 326 people."], ["1900-07-02T00:00:00", "The first zeppelin flight is carried out over Lake Constance near Friedrichshafen, Germany."], ["1900-07-12T00:00:00", "German cruise liner SS Deutschland breaks the record for the Blue Riband for the first time with an average speed of 22.4 knots (41.5 km/h)."], ["1900-07-29T00:00:00", "King Umberto I of Italy is assassinated by the Italian-born anarchist Gaetano Bresci."], ["1900-08-04T00:00:00", "Elizabeth Bowes-Lyon, later Queen Elizabeth The Queen Mother, was born in London"], ["1900-08-14T00:00:00", "Boxer Rebellion: An international contingent of troops, under British command, invades Peking and frees the Europeans taken hostage."], ["1900-09-08T00:00:00", "The 1900 Galveston hurricane kills about 8,000 people."], ["1900-09-13T00:00:00", "Philippine-American War: Filipino resistance fighters defeat a large American column in the Battle of Pulang Lupa."], ["1900-09-17T00:00:00", "Philippine-American War: Filipinos under Juan Cailles defeat the Americans under Colonel Benjamin F. Cheatham at Mabitac."], ["1900-11-29T00:00:00", "Herbert Kitchener succeeds Frederick Roberts as commander-in-chief of the British forces in South Africa and implements a scorched earth strategy."], ["1900-12-14T00:00:00", "Max Planck announces his discovery of the law of black body emission, marking the birth of quantum physics."], ["1900-12-27T00:00:00", "Emily Hobhouse arrives in Cape Town."]]