[["1919-01-01T00:00:00", "The Czechoslovak Legions occupy much of the self-proclaimed \"free city\" of Pressburg, enforcing its incorporation into the new republic of Czechoslovakia."], ["1919-01-01T00:00:00", "HMY Iolaire sinks off the coast of Scotland; 206 die."], ["1919-01-01T00:00:00", "Edsel Ford succeeds his father as head of the Ford Motor Company."], ["1919-01-03T00:00:00", "The Faisal-Weizmann Agreement is signed by Emir Faisal (representing the Arab Kingdom of Hejaz) and Zionist leader Chaim Weizmann for Arab-Jewish cooperation in the development of a Jewish homeland in Palestine and an Arab nation in a large part of the Middle East."], ["1919-01-05T00:00:00", "Spartacist uprising: Socialist demonstrations in Berlin, Germany turn into an attempted communist revolution."], ["1919-01-05T00:00:00", "In Germany, the German Workers' Party (Deutsche Arbeiterpartei, DAP), predecessor of the Nazi Party, is formed by merger of Anton Drexler's Committee of Independent Workmen with journalist Karl Harrer's Political Worker's Circle."], ["1919-01-07T00:00:00", "The beginning of the Tragic Week in Argentina, an anarchist uprising in Buenos Aires, which is suppressed by official forces."], ["1919-01-07T00:00:00", "Estonian War of Independence: Estonian forces start a general counter-offensive against the Red Army."], ["1919-01-08T00:00:00", "The funeral of Theodore Roosevelt, 26th President of the United States, is held at Christ Church Oyster Bay, Long Island; Roosevelt had died in his sleep at the age of 60, two days earlier."], ["1919-01-09T00:00:00", "Friedrich Ebert orders the Freikorps into action in Berlin."], ["1919-01-11T00:00:00", "Romania annexes Transylvania."], ["1919-01-11T00:00:00", "Georgians genocide in Alagir."], ["1919-01-13T00:00:00", "Worker's councils in Berlin end the general strike; the Spartacist uprising is over."], ["1919-01-14T00:00:00", "Estonian War of Independence: Estonian forces liberate Tartu from the Red Army."], ["1919-01-15T00:00:00", "Rosa Luxemburg and Karl Liebknecht are murdered following the Spartacist uprising."], ["1919-01-15T00:00:00", "Great Molasses Flood: A wave of molasses released from an exploding storage tank sweeps through Boston, Massachusetts, killing 21 and injuring 150."], ["1919-01-16T00:00:00", "The Eighteenth Amendment to the United States Constitution, authorizing Prohibition, is ratified."], ["1919-01-16T00:00:00", "Pianist Ignacy Jan Paderewski becomes the second Prime Minister of Poland."], ["1919-01-18T00:00:00", "World War I: The Paris Peace Conference opens at the Palace of Versailles, France."], ["1919-01-18T00:00:00", "Estonian War of Independence: Estonian forces liberate Narva, expelling the Red Army from Northern Estonia."], ["1919-01-18T00:00:00", "Bentley Motors Limited is founded in England."], ["1919-01-19T00:00:00", "The Monarchy of the North is established in Northern Portugal."], ["1919-01-21T00:00:00", "Dáil Éireann meets for the first time in the Mansion House, Dublin. It comprises Sinn Féin members elected in the 1918 general election who, in accordance with their manifesto, have not taken their seats in the Parliament of the United Kingdom but chosen to declare an independent Irish Republic. In the first shots of the Anglo-Irish War, two Royal Irish Constabulary (RIC) men are killed in an ambush at Soloheadbeg in Tipperary."], ["1919-01-21T00:00:00", "Gojong, the first emperor of the Korean Empire, dies."], ["1919-01-23T00:00:00", "The Khotin Uprising breaks out in Khotyn, Ukraine."], ["1919-01-25T00:00:00", "The League of Nations is founded in Paris."], ["1919-01-31T00:00:00", "Battle of George Square: The British Army is called in to deal with riots and protests against high rents in Glasgow, Scotland."], ["1919-02-01T00:00:00", "Estonian War of Independence: Estonian forces liberate Valga and Võru, expelling the Red Army from the entire territory of Estonia."], ["1919-02-03T00:00:00", "Soviet troops occupy Ukraine."], ["1919-02-06T00:00:00", "The Seattle General Strike begins in the United States, affecting over 65,000 workers."], ["1919-02-11T00:00:00", "Friedrich Ebert is elected first President of Germany (Reichspräsident) by the Weimar National Assembly."], ["1919-02-11T00:00:00", "The Seattle General Strike ends when Federal troops are summoned by the State of Washington's Attorney General."], ["1919-02-12T00:00:00", "Ethnic Germans and Hungarian inhabitants of Pressburg start a protest against its incorporation into Czechoslovakia but the Czechoslovak Legions open fire on the unarmed demonstrators."], ["1919-02-14T00:00:00", "The Polish-Soviet War begins with the Battle of Bereza Kartuska."], ["1919-02-25T00:00:00", "Oregon places a one cent per US gallon (0.26¢/liter) tax on gasoline, becoming the first U.S. state to levy a gasoline tax."], ["1919-02-26T00:00:00", "Grand Canyon National Park: An act of the United States Congress establishes most of the Grand Canyon as a United States National Park."], ["1919-02-28T00:00:00", "Amānullāh Khān becomes King of Afghanistan."], ["1919-02-28T00:00:00", "An independence mission to the U.S., funded by the Philippine legislature, sets out from Manila to present its case to Secretary of War Newton D. Baker."], ["1919-03-01T00:00:00", "The March 1st Movement against Japanese colonial rule in Korea is formed."], ["1919-03-02T00:00:00", "Founding Congress of the Comintern opens in Moscow."], ["1919-03-03T00:00:00", "The Supreme Court of the United States upholds the conviction of Charles Schenck."], ["1919-03-04T00:00:00", "The Communist International (Comintern) is founded."], ["1919-03-05T00:00:00", "A. Mitchell Palmer becomes United States Attorney General through recess appointment."], ["1919-03-08T00:00:00", "The Rowlatt Act is passed by the Imperial Legislative Council in London, indefinitely extending the emergency provisions of the Defence of India Act 1915."], ["1919-03-09T00:00:00", "The Egyptian Revolution of 1919 breaks out."], ["1919-03-21T00:00:00", "The Hungarian Soviet Republic is established by Béla Kun."], ["1919-03-23T00:00:00", "In Milan, Italy, Benito Mussolini founds his Fascist political movement."], ["1919-03-27T00:00:00", "The name Bratislava is officially adopted for the city of Pressburg."], ["1919-03-31T00:00:00", "A general strike begins in the Ruhr."], ["1919-04-10T00:00:00", "Mexican Revolution leader Emiliano Zapata is ambushed and shot dead in Morelos."], ["1919-04-12T00:00:00", "French serial killer Henri Désiré Landru is arrested."], ["1919-04-13T00:00:00", "Amritsar Massacre: British and Gurkha troops massacre 379 Sikhs at Jallianwala Bagh in Amritsar in the Punjab Province (British India)."], ["1919-04-13T00:00:00", "Eugene V. Debs enters prison at the Atlanta Federal Penitentiary in Atlanta, Georgia for speaking out against the draft during World War I."], ["1919-04-15T00:00:00", "Save the Children Fund is created in the UK to raise money for the relief of German and Austrian children."], ["1919-04-20T00:00:00", "The French Army blows up the bridge over the Dniester at Bender, Moldova, to protect the city from the Bolsheviks."], ["1919-04-23T00:00:00", "The Estonian Constituent Assembly convenes its first session."], ["1919-04-25T00:00:00", "The Bauhaus architectural and design movement is founded in Weimar, Germany."], ["1919-04-25T00:00:00", "Anzac Day is observed for the first time in Australia."], ["1919-04-25T00:00:00", "Pancho Villa takes Parral, Chihuahua, in Mexico, and executes the mayor and his two sons by hanging."], ["1919-04-30T00:00:00", "Several bombs are intercepted in the first wave of the 1919 United States anarchist bombings."], ["1919-05-01T00:00:00", "A large left-wing demonstration in France leads to a violent confrontation with the police."], ["1919-05-01T00:00:00", "Riots break out in Cleveland, Ohio; 2 people are killed, 40 injured, and 116 arrested."], ["1919-05-02T00:00:00", "Weimar Republic troops and the Freikorps occupy Munich and crush the Bavarian Soviet Republic."], ["1919-05-03T00:00:00", "Amānullāh Khān attacks British government in India."], ["1919-05-04T00:00:00", "The May Fourth Movement opposes foreign colonizers in China erupts."], ["1919-05-04T00:00:00", "The League of Red Cross Societies is founded in Paris."], ["1919-05-06T00:00:00", "Beginning of the Third Anglo-Afghan War."], ["1919-05-08T00:00:00", "Edward George Honey proposes the idea of a moment of silence to commemorate the Armistice of World War I."], ["1919-05-09T00:00:00", "In Belgium, a new electoral law introduces universal manhood suffrage and gives the franchise to certain classes of women."], ["1919-05-14T00:00:00", "The University College of Wales, Aberystwyth, establishes probably the world's first Chair in International Politics, endowed by David Davies and his sisters in honour of Woodrow Wilson, with Alfred Eckhard Zimmern as first professor."], ["1919-05-15T00:00:00", "The Hellenic Army lands at Smyrna on ships of the British Royal Navy."], ["1919-05-15T00:00:00", "Law providing for full women's suffrage in the Netherlands is introduced."], ["1919-05-15T00:00:00", "Winnipeg General Strike: Workers in Winnipeg launch a strike for better wages and working conditions."], ["1919-05-17T00:00:00", "The Committee of One Thousand forms to oppose the Winnipeg General Strike."], ["1919-05-19T00:00:00", "Mustafa Kemal Atatürk lands at Samsun on the Anatolian Black Sea coast, marking the start of the Turkish War of Independence. The anniversary of this event is also an official day of Turkish Youth."], ["1919-05-19T00:00:00", "Volcano Kelud erupts in Java, killing about 5,000."], ["1919-05-23T00:00:00", "The University of California opens its second campus in Los Angeles. Initially called Southern Branch of the University of California (SBUC), it is eventually renamed the University of California, Los Angeles (UCLA)."], ["1919-05-25T00:00:00", "Estonian War of Independence: Estonian forces capture Pskov from the Red Army and soon hand it over to the White forces."], ["1919-05-27T00:00:00", "Fyodor Raskolnikov is exchanged for fourteen British prisoners of war."], ["1919-05-27T00:00:00", "Siege of Spin Boldak (Third Anglo-Afghan War): last time the British Army uses an escalade."], ["1919-05-29T00:00:00", "Einstein's theory of general relativity is tested by Arthur Eddington's observation of the \"bending of light\" during a total solar eclipse in Príncipe, and by Andrew Crommelin in Sobral, Ceará, Brazil (confirmed November 19)."], ["1919-05-29T00:00:00", "The Republic of Prekmurje formally declares independence from Hungary."], ["1919-05-30T00:00:00", "By agreement with the United Kingdom, later confirmed by the League of Nations, Belgium is given the mandate over part of German East Africa (Ruanda-Urundi)."], ["1919-06-02T00:00:00", "Eight mail bombs are sent to prominent figures as part of the 1919 United States anarchist bombings."], ["1919-06-04T00:00:00", "Women's rights: The United States Congress approves the 19th Amendment to the United States Constitution, which would guarantee suffrage to women, and sends it to the U.S. states for ratification."], ["1919-06-05T00:00:00", "Estonian and Latvian Wars of Independence: The advancing pro-German Baltische Landeswehr initiates war against Estonia in Northern Latvia."], ["1919-06-06T00:00:00", "The Hungarian Red Army attacks the Republic of Prekmurje."], ["1919-06-07T00:00:00", "Sette Giugno on Malta: British troops fire on a mob protesting against the colonial government, killing four."], ["1919-06-15T00:00:00", "Pancho Villa attacks Ciudad Juárez, Mexico. When the bullets begin to fly to the American side of the border, two units of the United States 7th Cavalry Regiment cross the border to repulse Villa's forces away from American territory."], ["1919-06-17T00:00:00", "English Police Sergeant Thomas Green killed during the Epsom Riot by Canadian troops"], ["1919-06-18T00:00:00", "The biggest football club in Central America, Liga Deportiva Alajuelense, is founded in Costa Rica."], ["1919-06-21T00:00:00", "Winnipeg General Strike: Royal Northwest Mounted Police fire a volley of bullets into a crowd of unemployed war veterans, killing two."], ["1919-06-21T00:00:00", "Scuttling of the German fleet in Scapa Flow: Admiral Ludwig von Reuter scuttles the German fleet interned in Scapa Flow, Scotland; nine German sailors are killed."], ["1919-06-23T00:00:00", "Estonian and Latvian Wars of Independence: The Estonian army defeats the pro-German Baltische Landeswehr in the Battle of Cēsis in northern Latvia, forcing the Landeswehr to retreat towards Riga."], ["1919-06-26T00:00:00", "British Foreign Office official St John Philby and T. E. Lawrence arrive in Cairo for discussions about Arab unrest in Egypt having been flown by Canadian pilot Harry Yates in a Handley Page bomber which set off from England on June 21."], ["1919-06-28T00:00:00", "The Treaty of Versailles is signed, formally ending World War I. John Maynard Keynes, who had been present at the conference and was unhappy with the terms of the treaty, brings out his own analysis later in the year, entitled The Economic Consequences of the Peace."], ["1919-06-28T00:00:00", "International Labor Organization (ILO) is established as an agency of the League of Nations."], ["1919-07-02T00:00:00", "The Syrian National Congress in Damascus: Arab nationalists announce independence."], ["1919-07-03T00:00:00", "Estonian and Latvian Wars of Independence: The pro-German Baltische Landeswehr signs a peace treaty with Estonia and Latvia. The pro-German Prime Minister of Latvia Andrievs Niedra resigns and Latvian forces take over Riga on July 8."], ["1919-07-07T00:00:00", "The United States Army sends a convoy across the continental U.S., starting in Washington, D.C., to assess the possibility of crossing North America by road. This crossing takes many months to complete, because the building of the U.S. Highway System has not commenced."], ["1919-07-11T00:00:00", "The eight-hour day and free Sunday become law for workers in the Netherlands."], ["1919-07-19T00:00:00", "The Foreign Ministry of the Azerbaijan Democratic Republic is established by decree of the chancellory for foreign affairs."], ["1919-07-21T00:00:00", "Wingfoot Air Express crash: The dirigible Wingfoot Air Express catches fire over downtown Chicago. Two passengers, one aircrewman and ten people on the ground are killed. However, two people parachute to the ground safely."], ["1919-07-27T00:00:00", "The Chicago Race Riot of 1919 begins when a white man throws stones at a group of four black teens on a raft."], ["1919-07-31T00:00:00", "British police strike in London and Liverpool for recognition of the National Union of Police and Prison Officers; over 2,000 strikers are dismissed."], ["1919-08-01T00:00:00", "Béla Kun's Hungarian Soviet Republic collapses."], ["1919-08-03T00:00:00", "Romanian army liberates Timișoara from the Hungarian occupation."], ["1919-08-04T00:00:00", "Romanian army occupies Budapest."], ["1919-08-08T00:00:00", "Treaty of Rawalpindi ends the Third Anglo-Afghan War."], ["1919-08-11T00:00:00", "In Germany, the Weimar Constitution is proclaimed to be in effect (ratified)."], ["1919-08-18T00:00:00", "The Bolshevik fleet at Kronstadt, near Petrograd, Russia, on the Baltic Sea, is mostly destroyed by German warplanes and torpedo boats in a combined operation."], ["1919-08-19T00:00:00", "Afghanistan gains independence from the United Kingdom."], ["1919-08-21T00:00:00", "Friedrich Ebert becomes first president in Germany."], ["1919-08-29T00:00:00", "Russian Civil War: The Red Army captures Pskov from White forces."], ["1919-08-31T00:00:00", "The American Communist Party is established."], ["1919-09-03T00:00:00", "Jan Smuts becomes the second Prime Minister of South Africa."], ["1919-09-06T00:00:00", "The U.S. Army expedition across America, which started July 7, ends in San Francisco."], ["1919-09-10T00:00:00", "The Treaty of Saint-Germain is signed, ending World War I with Empire of Austria-Hungary."], ["1919-09-17T00:00:00", "German South-West Africa is placed under South African administration."], ["1919-09-21T00:00:00", "The Steel strike of 1919 begins across the United States."], ["1919-09-27T00:00:00", "The last British Army troops leave Archangel and leave fighting to the Russians."], ["1919-10-02T00:00:00", "President of the United States Woodrow Wilson suffers a serious stroke, rendering him an invalid for the remainder of his life (died 1924)."], ["1919-10-09T00:00:00", "In Major League Baseball, the Cincinnati Reds win the World Series, five games to three, over the Chicago White Sox, whose players are later found to have lost intentionally."], ["1919-10-10T00:00:00", "Estonia adopts a radical land reform, nationalizing 97% of agrarian lands, mostly still belonging to Baltic Germans."], ["1919-10-13T00:00:00", "The Convention relating to the Regulation of Aerial Navigation is signed."], ["1919-10-16T00:00:00", "In Germany, Adolf Hitler gives his first speech for the German Workers' Party (DAP)."], ["1919-10-16T00:00:00", "The historic Condado Vanderbilt Hotel is inaugurated in San Juan, Puerto Rico."], ["1919-10-28T00:00:00", "Prohibition in the United States is authorized: The United States Congress passes the Volstead Act over President Woodrow Wilson's veto. Prohibition goes into effect on January 17, 1920, under the provisions of the 18th Amendment to the United States Constitution."], ["1919-11-01T00:00:00", "The Coal Strike of 1919 begins in the United States by the United Mine Workers under John L. Lewis. Final agreement comes on December 10."], ["1919-11-07T00:00:00", "The first Palmer Raid is conducted on the second anniversary of the Russian Revolution. Over 10,000 suspected communists and anarchists are arrested in twenty-three different U.S. cities."], ["1919-11-09T00:00:00", "Felix the Cat appears in Feline Follies, marking the first cartoon character to become popular."], ["1919-11-10T00:00:00", "Supreme Court of the United States upholds conviction of Jacob Abrams for inciting resistance to the war effort against Soviet Russia."], ["1919-11-11T00:00:00", "Russian Civil War: The Northwestern Army of General Nikolai Yudenich retreats to Estonia and is disarmed."], ["1919-11-11T00:00:00", "The Centralia Massacre in Centralia, Washington (United States), originating at an Armistice Day parade, results in the deaths of four members of the American Legion, and the lynching of a local leader of the Industrial Workers of the World (IWW)."], ["1919-11-11T00:00:00", "First Remembrance Day observed in the British Empire with a two minute silence at 11:00 hrs, following an original suggestion by Australian-born soldier and journalist Edward George Honey (\"Warren Foster\")."], ["1919-11-16T00:00:00", "After Entente pressure, Romanian forces withdraw from Budapest and allow Admiral Horthy to march in."], ["1919-11-19T00:00:00", "The Treaty of Versailles fails a critical ratification vote in the United States Senate. It will never be ratified by the U.S."], ["1919-11-27T00:00:00", "The Treaty of Neuilly-sur-Seine is signed between the Allies and Bulgaria."], ["1919-11-30T00:00:00", "Health officials declare the global \"Spanish\" flu pandemic has ceased."], ["1919-12-01T00:00:00", "American-born Nancy Astor, Viscountess Astor, becomes the first woman to take her seat in the House of Commons of the United Kingdom, having become the second to be elected on November 28."], ["1919-12-01T00:00:00", "XWA (now CINW), in Montreal, becomes the first public radio station in North America to go on the air."], ["1919-12-05T00:00:00", "The Turkish Ministry of War releases Greeks, Armenians and Jews from military service."], ["1919-12-19T00:00:00", "The fictional character Ham Gravy makes his début in Thimble Theatre Comics."], ["1919-12-21T00:00:00", "The United States deports 249 people, including Emma Goldman, to Russia on the USAT Buford."], ["1919-12-25T00:00:00", "Cliftonhill Stadium in Coatbridge, Scotland, opens as the home of Albion Rovers F.C.. They lose the opening match 2-0 to St. Mirren."]]