[["2006-01-01T00:00:00", "Russia cuts the shipment of natural gas to Ukraine over a price dispute."], ["2006-01-04T00:00:00", "Ariel Sharon, Prime Minister of Israel, suffers a severe stroke and cerebral hemorrhage."], ["2006-01-05T00:00:00", "A hotel in Mecca, Saudi Arabia, collapses, killing 76 pilgrims visiting to perform Hajj."], ["2006-01-12T00:00:00", "A stampede during the Stoning of the Devil ritual on the last day at the Hajj in Mina, Saudi Arabia, kills 362 pilgrims."], ["2006-01-15T00:00:00", "NASA's Stardust mission successfully ends, the first to return dust from a comet."], ["2006-01-16T00:00:00", "Ellen Johnson Sirleaf assumes office as President of Liberia, the first female elected head of state in Africa."], ["2006-01-19T00:00:00", "NASA launches the first space mission to Pluto as a rocket hurls the New Horizons spacecraft on a 9-year journey."], ["2006-01-25T00:00:00", "Pope Benedict XVI issues his first encycylical, Deus caritas est."], ["2006-01-27T00:00:00", "Celebrations are held in Salzburg and around the world, for the 250th anniversary of the birth of Wolfgang Amadeus Mozart."], ["2006-02-03T00:00:00", "Egyptian passenger ferry, MS al-Salam Boccaccio 98 carrying more than 1,400 people, sinks in the Red Sea off the Saudi coast, with only 388 rescued."], ["2006-02-04T00:00:00", "The Wowowee stampede at the PhilSports Arena in Pasig City, Philippines, kills 74 people and leaves 600 injured."], ["2006-02-10T00:00:00", "February 26 - The 2006 Winter Olympics are held in Turin, Italy."], ["2006-02-17T00:00:00", "A massive mudslide occurs in Southern Leyte, Philippines; the official death toll is set at 1,126."], ["2006-02-19T00:00:00", "Pasta de Conchos mine disaster: Sixty-five miners die after becoming trapped underground, following an explosion in Nueva Rosita, Mexico."], ["2006-03-04T00:00:00", "The final contact attempt with Pioneer 10 receives no response."], ["2006-03-09T00:00:00", "NASA's Cassini-Huygens spacecraft discovers geysers of a liquid substance shooting from Saturn's moon Enceladus, signaling a possible presence of water."], ["2006-03-10T00:00:00", "NASA's Mars Reconnaissance Orbiter enters orbit around Mars."], ["2006-03-16T00:00:00", "The United Nations General Assembly votes overwhelmingly to establish the United Nations Human Rights Council."], ["2006-03-21T00:00:00", "Jack Dorsey, Noah Glass, Biz Stone, and Evan Williams found the popular social-networking service Twitter. They officially launch the site later in the year."], ["2006-03-28T00:00:00", "A scramjet jet engine, HyShot III, designed to fly at 7 times the speed of sound, is successfully tested at Woomera, South Australia."], ["2006-04-05T00:00:00", "A swan with Avian Flu is discovered in Cellardyke in Fife, Scotland (the first case in the United Kingdom)."], ["2006-04-10T00:00:00", "A fire at the Brand India Fair, Victoria Park, Meerut, Uttar Pradesh, India, kills at least 100."], ["2006-04-11T00:00:00", "The European Space Agency's Venus Express spaceprobe enters Venus' orbit."], ["2006-04-11T00:00:00", "Nuclear program of Iran: President Mahmoud Ahmadinejad confirms that Iran has successfully produced a few grams of low-grade enriched uranium."], ["2006-04-20T00:00:00", "Iran announces a deal with Russia, involving a joint uranium enrichment firm on Russian soil; 9 days later Iran announces that it will not move all activity to Russia, thus leading to a de facto termination of the deal."], ["2006-05-19T00:00:00", "Over The Hedge, the first DreamWorks Animation film to be by Paramount Pictures premieres in theatres."], ["2006-05-24T00:00:00", "East Timor's Foreign Minister José Ramos-Horta officially requests military assistance from the governments of Australia, New Zealand, Malaysia, and Portugal."], ["2006-05-27T00:00:00", "A 6.3 magnitude earthquake strikes central Java in Indonesia, killing more than 6,000, injuring at least 36,000 and leaving some 1.5 million people homeless."], ["2006-05-29T00:00:00", "Sidoarjo mud flow: The world's biggest mud volcano is created by the blowout of a natural gas well being drilled in the subdistrict of Porong, Sidoarjo in East Java, Indonesia. This results in displacement of more than 11,000 persons from 8 villages, as well as damage to road and power infrastructures. Several (Twenty-five) factories are also abandoned."], ["2006-06-03T00:00:00", "Montenegro declares independence after a May 21 referendum. The state union of Serbia and Montenegro is dissolved on June 5, leaving Serbia as the successor state."], ["2006-06-09T00:00:00", "July 9 - The 2006 FIFA World Cup begins in Germany."], ["2006-06-18T00:00:00", "The first Kazakh space satellite KazSat-1 is launched."], ["2006-06-18T00:00:00", "Former Beatle Paul McCartney turns 64 after writing \"When I'm Sixty-Four\" at age 16."], ["2006-06-28T00:00:00", "Operation Summer Rains: Israel launches an offensive against militants in Gaza."], ["2006-06-28T00:00:00", "The United States Armed Forces withdraws its forces in Iceland, thereby disbanding the Iceland Defense Force."], ["2006-07-01T00:00:00", "The Qinghai-Tibet Railway launches a trial operation, making Tibet the last province-level entity of China to have a conventional railway."], ["2006-07-06T00:00:00", "The Nathu La pass between India and China, sealed during the Sino-Indian War, re-opens for trade after 44 years."], ["2006-07-09T00:00:00", "Italy wins its fourth FIFA World Cup title."], ["2006-07-09T00:00:00", "S7 Airlines Flight 778 crashes into a concrete barrier shortly after landing, killing at least 122 people and leaving many injured."], ["2006-07-10T00:00:00", "Pakistan International Airlines Flight 688 crashes in Multan, Pakistan, shortly after takeoff."], ["2006-07-11T00:00:00", "A series of coordinated bomb attacks strikes several commuter trains in Mumbai, India, during the evening rush hour."], ["2006-07-12T00:00:00", "2006 Lebanon War: Israeli troops invade Lebanon in response to Hezbollah kidnapping 2 Israeli soldiers and killing 3. Hezbollah declares open war against Israel 2 days later."], ["2006-07-15T00:00:00", "Twitter is launched."], ["2006-07-18T00:00:00", "The SS Nomadic, the last floating link to Titanic, returns home to a large reception in Belfast, Northern Ireland."], ["2006-08-11T00:00:00", "A resolution to end the 2006 Lebanon War is unanimously accepted by the United Nations Security Council."], ["2006-08-22T00:00:00", "Pulkovo Aviation Enterprise Flight 612 crashes near the Russian border in Ukraine, killing 171 people, including 45 children."], ["2006-08-22T00:00:00", "The ICM awards Grigori Perelman the Fields Medal for proving the Poincaré conjecture, one of 7 Millennium Prize Problems; Perelman refuses the medal."], ["2006-08-24T00:00:00", "The International Astronomical Union defines 'planet' at its 26th General Assembly, demoting Pluto to the status of 'dwarf planet' more than 70 years after its discovery."], ["2006-09-13T00:00:00", "Dawson College shooting in Montreal: One killed, nineteen injured."], ["2006-09-19T00:00:00", "Prime Minister Thaksin Shinawatra of Thailand declares a state of emergency in Bangkok as members of the Royal Thai Army stage a coup d'état. The army announces the removal of Prime Minister Thaksin Shinawatra from power."], ["2006-09-29T00:00:00", "Gol Transportes Aéreos Flight 1907 (Boeing 737-800) collides with a business jet over the Amazon rainforest, killing all 155 on board."], ["2006-10-02T00:00:00", "Aleksandër Moisiu University opens in Durrës, Albania."], ["2006-10-09T00:00:00", "North Korea claims to have conducted its first-ever nuclear test."], ["2006-10-13T00:00:00", "South Korean Ban Ki-moon is elected as the new Secretary-General of the United Nations."], ["2006-10-17T00:00:00", "The population of the United States exceeds 300 million."], ["2006-10-29T00:00:00", "ADC Airlines Flight 53 crashes shortly after takeoff in Nigeria, killing 96 people."], ["2006-11-02T00:00:00", "No. 5, 1948 by Jackson Pollock becomes the most expensive painting after it is sold privately for $140 million."], ["2006-11-05T00:00:00", "Former President of Iraq Saddam Hussein is sentenced to death by hanging by the Iraqi Special Tribunal."], ["2006-11-08T00:00:00", "Mercury transits the sun. It is visible from the Americas, Eastern China, Japan, Australia, and Polynesia."], ["2006-11-12T00:00:00", "The former Soviet republic of South Ossetia holds a referendum on independence from Georgia."], ["2006-11-15T00:00:00", "Al Jazeera launches its English-language news channel, Al Jazeera English."], ["2006-11-23T00:00:00", "A series of car bombs and mortar attacks in Sadr City, Baghdad, kill at least 215 people and injure 257 other people."], ["2006-11-30T00:00:00", "Typhoon Durian triggers a massive mudslide and kills at least 720 people in Albay province on the island of Luzon in the Philippines."], ["2006-12-05T00:00:00", "The military seizes power in Fiji, in a coup d'état led by Commodore Josaia Vorenathalie qe \"Frank\" Bainimarama."], ["2006-12-11T00:00:00", "Felipe Calderón sends the Mexican military to combat the drug cartels and put down the violence in the state of Michoacán, initiating the Mexican Drug War."], ["2006-12-12T00:00:00", "Swift raids: Homeland Security police detain workers at 6 meatpacking plants in the midwestern U.S."], ["2006-12-13T00:00:00", "The Chinese River Dolphin or Baiji becomes extinct."], ["2006-12-24T00:00:00", "Ethiopia admits its troops have intervened in Somalia."], ["2006-12-26T00:00:00", "An oil pipeline explodes in Nigeria's commercial capital, Lagos, killing at least 200 people."], ["2006-12-30T00:00:00", "Basque nationalist group ETA detonates a van bomb at Madrid-Barajas Airport in Madrid, Spain, ending a nine-month ceasefire."]]