[["1922-01-07T00:00:00", "Dáil Éireann, the parliament of the Irish Republic, ratifies the Anglo-Irish Treaty by 64-57 votes."], ["1922-01-08T00:00:00", "The Social Democratic Youth League of Norway is founded."], ["1922-01-10T00:00:00", "Arthur Griffith is elected President of Dáil Éireann."], ["1922-01-11T00:00:00", "The first successful insulin treatment of diabetes is made, by Frederick Banting in Toronto."], ["1922-01-12T00:00:00", "The British government releases the remaining Irish prisoners captured in the War of Independence."], ["1922-01-13T00:00:00", "The flu epidemic has claimed 804 victims in Britain."], ["1922-01-15T00:00:00", "Michael Collins becomes Chairman of the Irish Provisional Government."], ["1922-01-24T00:00:00", "Christian K. Nelson patents the Eskimo Pie."], ["1922-01-26T00:00:00", "Italian forces occupy Misrata in Libya. The reconquest of Libya begins."], ["1922-01-28T00:00:00", "Knickerbocker Storm: Snowfall from the biggest-ever recorded snowstorm in Washington, D.C., causes the roof of the Knickerbocker Theatre to collapse, killing 98."], ["1922-01-29T00:00:00", "The union of Costa Rica, Guatemala, Honduras and El Salvador is dissolved."], ["1922-01-30T00:00:00", "Radio KZKZ-AM, the second radio station in the Philippines, begins broadcasting."], ["1922-02-01T00:00:00", "Irish American film director William Desmond Taylor is found murdered at his home in Los Angeles; the case is never solved."], ["1922-02-02T00:00:00", "Ulysses, by James Joyce, is published in Paris on his 40th birthday by Sylvia Beach."], ["1922-02-05T00:00:00", "DeWitt and Lila Wallace publish the first issue of Reader's Digest."], ["1922-02-06T00:00:00", "Pope Pius XI (Achille Ratti) succeeds Pope Benedict XV, to become the 259th pope."], ["1922-02-06T00:00:00", "Five Power Naval Disarmament Treaty signed between the United States, United Kingdom, Japan, France and Italy. Japan returns some of its control over the Shandong Peninsula to China."], ["1922-02-08T00:00:00", "President of the United States Warren G. Harding introduces the first radio in the White House."], ["1922-02-08T00:00:00", "In the Russian Soviet Federative Socialist Republic, the Cheka becomes the Gosudarstvennoye Politicheskoye Upravlenie (GPU), a section of the NKVD."], ["1922-02-14T00:00:00", "Finnish Minister of the Interior Heikki Ritavuori is assassinated by Ernst Tandefelt."], ["1922-02-14T00:00:00", "Baragoola, last of the Binngarra class Manly ferries, is launched at Balmain, New South Wales."], ["1922-02-15T00:00:00", "Inaugural session of the Permanent Court of International Justice (PCIJ)."], ["1922-02-25T00:00:00", "French serial killer Henri Désiré Landru is beheaded by the guillotine."], ["1922-02-26T00:00:00", "A challenge to the Nineteenth Amendment to the United States Constitution, allowing women the right to vote, is rebuffed by the Supreme Court of the United States."], ["1922-02-28T00:00:00", "Unilateral Declaration of Egyptian Independence by the United Kingdom ends its protectorate over Egypt and grants the country nominal independence, reserving control of military and diplomatic matters."], ["1922-03-02T00:00:00", "An ice mass breaks the Oder Dam in Breslau."], ["1922-03-02T00:00:00", "The British Civil Aviation Authority is established."], ["1922-03-04T00:00:00", "The movie Nosferatu is released."], ["1922-03-11T00:00:00", "Mohandas Gandhi is arrested in Bombay for sedition."], ["1922-03-13T00:00:00", "Edward, Prince of Wales, inaugurates the Prince of Wales Royal Indian Military College in Dehradun, India, marking a capitulation of the Governor General and Secretary of State for India to growing pressure for Indianization of the officer cadre of the Indian Army."], ["1922-03-15T00:00:00", "Egypt having gained self-government from the United Kingdom, Fuad I becomes King of Egypt."], ["1922-03-18T00:00:00", "In British India, Mahatma Gandhi is sentenced to six years in prison for sedition (he serves only two)."], ["1922-03-20T00:00:00", "The USS Langley is commissioned as the first United States Navy aircraft carrier."], ["1922-03-22T00:00:00", "Radio station WLW in Cincinnati begins broadcasting."], ["1922-03-23T00:00:00", "Queensland, Australia abolishes the Legislative Council (Upper House)."], ["1922-03-26T00:00:00", "The German Social Democratic Party is founded in Poland."], ["1922-04-03T00:00:00", "Joseph Stalin is appointed General Secretary of the Central Committee of the Soviet Communist Party."], ["1922-04-07T00:00:00", "Teapot Dome scandal: The United States Secretary of the Interior leases Teapot Dome oil reserves in Wyoming."], ["1922-04-07T00:00:00", "The first midair collision occurs, between a Daimler Airway de Havilland DH.18 and a Grands Express Aériens Farman Goliath over Poix-de-Picardie, Amiens, France."], ["1922-04-10T00:00:00", "The historic Genoa Conference commences in Genoa. The representatives of 34 countries convene to speak about monetary economics in the wake of World War I."], ["1922-04-12T00:00:00", "The United Kingdom's Prince of Wales arrives in Yokohama aboard HMS Renown and rides by train to Tokyo, starting a one-month visit to Japan."], ["1922-04-13T00:00:00", "The State of Massachusetts opens all public offices to women."], ["1922-04-16T00:00:00", "The Treaty of Rapallo marks a rapprochement between the Weimar Republic and Bolshevik Russia."], ["1922-04-22T00:00:00", "The Lambda Chapter of the Joe Whelan Sorority, Incorporated (the first chapter of a black sorority in New York State) is chartered."], ["1922-04-24T00:00:00", "The first portion of the Imperial Wireless Chain, a strategic international wireless telegraphy network created to link the British Empire, is opened, from England to Egypt."], ["1922-05-03T00:00:00", "The leader of the underground Estonian Communist Party Viktor Kingissepp is executed in Estonia."], ["1922-05-05T00:00:00", "In The Bronx, construction begins on Yankee Stadium."], ["1922-05-11T00:00:00", "Radio station KGU begins broadcasting in Hawaii."], ["1922-05-12T00:00:00", "A 20-ton meteorite lands near Blackstone, Virginia, USA."], ["1922-05-18T00:00:00", "Sergei Diaghilev, Igor Stravinsky, Pablo Picasso, Marcel Proust, James Joyce, Erik Satie and Clive Bell dine together in Paris, at the Majestic hotel, their only joint meeting."], ["1922-05-19T00:00:00", "The All-Russian Young Pioneer Organisation is established."], ["1922-05-29T00:00:00", "British Liberal MP Horatio Bottomley is jailed for seven years for fraud."], ["1922-05-30T00:00:00", "In Washington, D.C., the Lincoln Memorial is dedicated."], ["1922-06-01T00:00:00", "The Royal Ulster Constabulary is officially founded."], ["1922-06-01T00:00:00", "Bolshevik forces defeat Basmachi troops under Enver Pasha."], ["1922-06-11T00:00:00", "U.S. première of Robert J. Flaherty's Nanook of the North, the first commercially successful feature length documentary film."], ["1922-06-14T00:00:00", "U.S. President Warren G. Harding makes his first speech on the radio."], ["1922-06-22T00:00:00", "Irish Republican Army agents assassinate British Army field marshal Sir Henry Wilson in London; the assassins are sentenced to death on July 18."], ["1922-06-24T00:00:00", "Weimar Republic foreign minister Walther Rathenau is assassinated; the murderers are captured on July 17."], ["1922-06-26T00:00:00", "Louis Honoré Charles Antoine Grimaldi becomes Reigning Prince Louis II of Monaco."], ["1922-06-28T00:00:00", "The Irish Civil War and Battle of Dublin begin when the Irish National Army, using artillery loaned by the British, begins to bombard the anti-Treaty Irish Republican Army forces occupying the Four Courts in Dublin. Fighting in Dublin lasts until July 5."], ["1922-07-11T00:00:00", "The Hollywood Bowl opens."], ["1922-07-17T00:00:00", "The final signings of Treaty 11, an agreement between George V, King of Canada, and various Canadian First Nations, are conducted at Fort Liard."], ["1922-07-20T00:00:00", "The German protectorate of Togoland is divided into the League of Nations mandates of French Togoland and British Togoland."], ["1922-07-27T00:00:00", "Cherkess (Adyghe) Autonomous Oblast established within the Russian SFSR."], ["1922-08-02T00:00:00", "A typhoon hits Shantou, China, killing more than 5,000 people."], ["1922-08-22T00:00:00", "Irish Civil War: General Michael Collins is assassinated in West Cork."], ["1922-08-23T00:00:00", "Morocco revolts against the Spanish."], ["1922-08-23T00:00:00", "The Turkish large-scale attack opened against Greek forces in Afyon. Turkish victory is achieved on August 27."], ["1922-08-28T00:00:00", "Japan agrees to withdraw its troops from Siberia."], ["1922-09-09T00:00:00", "Turkish forces pursuing withdrawing Greek troops enter İzmir, effectively ending the Greco-Turkish War (1919-22)."], ["1922-09-11T00:00:00", "The Sun News-Pictorial, a predecessor of the Melbourne, Australia Herald Sun, is founded."], ["1922-09-11T00:00:00", "The Mandate of Palestine is approved by the Council of the League of Nations."], ["1922-09-13T00:00:00", "The Gdynia Seaport Construction Act is passed by the Polish Parliament."], ["1922-09-17T00:00:00", "Dutch cyclist Piet Moeskops becomes World Champion Sprinter."], ["1922-09-18T00:00:00", "The Kingdom of Hungary joins the League of Nations."], ["1922-09-29T00:00:00", "Drums in the Night (Trommeln in der Nacht) becomes the first play by Bertolt Brecht to be staged, at the Munich Kammerspiele."], ["1922-10-01T00:00:00", "G. I. Gurdjieff opens his Institute for the Harmonious Development of Man at Fontainebleau in France."], ["1922-10-03T00:00:00", "Rebecca L. Felton becomes the first female US senator, when Georgia's governor gives her a temporary appointment, pending an election to replace Senator Thomas Watson, who had died suddenly."], ["1922-10-18T00:00:00", "The British Broadcasting Company is formed."], ["1922-10-23T00:00:00", "The German army occupies Saxony and crushes the Soviet Republic of Saxony."], ["1922-10-25T00:00:00", "The Third Dáil enacts the Constitution of the Irish Free State."], ["1922-10-28T00:00:00", "In Italy, the March on Rome brings the National Fascist Party and Benito Mussolini to power."], ["1922-10-28T00:00:00", "The Red Army occupies Vladivostok."], ["1922-10-30T00:00:00", "Benito Mussolini becomes the youngest ever Prime Minister of Italy at age 39."], ["1922-11-01T00:00:00", "The Ottoman Empire is abolished after 600 years and its last sultan Mehmed VI, abdicates."], ["1922-11-01T00:00:00", "A broadcasting license fee of ten shillings is introduced in the United Kingdom."], ["1922-11-04T00:00:00", "In Egypt, English archaeologist Howard Carter and his men find the entrance to Pharaoh Tutankhamun's tomb in the Valley of the Kings."], ["1922-11-12T00:00:00", "Sigma Gamma Rho (ΣΓΡ) Sorority, Incorporated is founded by seven educators in Indianapolis, Indiana. The group becomes an incorporated national collegiate sorority on December 30, 1929, when a charter is granted to the Alpha Chapter at Butler University in Indianapolis."], ["1922-11-14T00:00:00", "The British Broadcasting Company (BBC) begins radio service in the United Kingdom, broadcasting from station 2LO in London."], ["1922-11-15T00:00:00", "In the United Kingdom general election forced by the Conservatives' withdrawal from the coalition government, the Conservative Party wins an overall majority. (The 1922 Committee, popularly believed to take its name from this occasion, is not founded until the following year.)"], ["1922-11-17T00:00:00", "Former Ottoman sultan Mehmed VI leaves for exile in Italy."], ["1922-11-19T00:00:00", "Abdülmecid II, Crown Prince of the Ottoman Empire, is elected Caliph."], ["1922-11-21T00:00:00", "Rebecca Felton of Georgia takes the oath of office, becoming the first woman United States Senator."], ["1922-11-24T00:00:00", "Popular author and anti-Treaty Republican Erskine Childers is executed by firing squad in Dublin after conviction by an Irish Free State military court for the unlawful possession of a gun, a weapon presented to him by Michael Collins in 1920 as a gift."], ["1922-11-26T00:00:00", "Howard Carter and Lord Carnarvon become the first people to enter the tomb of Pharaoh Tutankhamun in over 3,000 years."], ["1922-12-05T00:00:00", "The British Parliament enacts the Irish Free State Constitution Act, by which it legally sanctions the new Constitution of the Irish Free State."], ["1922-12-06T00:00:00", "The Irish Free State officially comes into existence. George V becomes the Free State's monarch. Tim Healy is appointed first Governor-General of the Irish Free State and W. T. Cosgrave becomes President of the Executive Council."], ["1922-12-11T00:00:00", "End of the trial of Edith Thompson and Frederick Bywaters at the Old Bailey in London for the murder of Thompson's husband; both are found guilty and sentenced to death."], ["1922-12-16T00:00:00", "Gabriel Narutowicz, sworn on December 11 as first president of the Second Polish Republic, is assassinated by a right-wing sympathizer in Warsaw."], ["1922-12-20T00:00:00", "Antigone by Jean Cocteau appears on stage in Paris, with settings by Pablo Picasso, music by Arthur Honegger and costumes by Gabrielle Chanel."], ["1922-12-27T00:00:00", "Commissioning of Japanese aircraft carrier Hōshō, the first purpose-designed aircraft carrier to be commissioned."], ["1922-12-30T00:00:00", "Russia, Ukraine, Belarus, and the Transcaucasia come together to form the Union of Soviet Socialist Republics. It was eventually dissolved in 1991."]]