[["2001-03-23T00:00:00", "The deorbit of Russian space station Mir is carried out near Nadi, Fiji, with Mir falling into the Pacific Ocean."], ["2001-03-23T00:00:00", "The World Wrestling Federation (WWF/now WWE) purchases rival organization World Championship Wrestling (WCW) for an estimated US$7 million."], ["2001-03-24T00:00:00", "The first release of Mac OS X is released as the successor to Mac OS 9 and the Mac OS X Public Beta, which would not cease to function until May 14."], ["2001-04-01T00:00:00", "Hainan Island incident: A Chinese fighter jet bumps into a U.S. EP-3E surveillance aircraft, which is forced to make an emergency landing in Hainan, China. The U.S. crew is detained for 10 days and the F-8 Chinese pilot, Wang Wei, goes missing and is presumed dead."], ["2001-04-01T00:00:00", "Former Federal Republic of Yugoslavia President Slobodan Milošević surrenders to police special forces, to be tried on charges of war crimes."], ["2001-04-01T00:00:00", "In the Netherlands, the Act on the Opening up of Marriage goes into effect. The Act allows same-sex couples to marry legally for the first time in the world since the reign of Nero."], ["2001-05-24T00:00:00", "Sherpa Temba Tsheri, 16, becomes the youngest person to summit Mount Everest."], ["2001-05-24T00:00:00", "The Versailles wedding hall disaster kills 23 in Jerusalem, Israel."], ["2001-06-01T00:00:00", "Crown Prince Dipendra of Nepal kills his father, the king, his mother and other members of the royal family with an assault rifle and then shoots himself in the Nepalese royal massacre. Dipendra dies June 4, as King of Nepal. His uncle Gyanendra accedes to the throne."], ["2001-06-01T00:00:00", "A Hamas suicide bomber kills 21, mostly teenagers, in the Dolphinarium disco in Tel Aviv, Israel."], ["2001-07-16T00:00:00", "The People's Republic of China and the Russian Federation sign the Treaty of Good-Neighborliness and Friendly Cooperation."], ["2001-07-16T00:00:00", "The FBI arrests Dmitry Sklyarov at a convention in Las Vegas, for violating a provision of the DMCA."], ["2001-09-09T00:00:00", "A suicide bomber kills Ahmad Shah Massoud, military commander of the Afghan Northern Alliance."], ["2001-09-09T00:00:00", "68 people die of methanol poisoning in Pärnu County, Estonia."], ["2001-10-23T00:00:00", "The Provisional Irish Republican Army of Northern Ireland commences disarmament after peace talks."], ["2001-10-23T00:00:00", "The iPod is first introduced by Apple."], ["2001-11-04T00:00:00", "Hurricane Michelle hits Cuba, destroying crops and thousands of homes."], ["2001-11-04T00:00:00", "The Police Service of Northern Ireland is established, replacing the controversial Royal Ulster Constabulary."], ["2001-11-10T00:00:00", "The People's Republic of China is admitted to the World Trade Organization after 15 years of negotiations."], ["2001-11-10T00:00:00", "Heavy rains and mudslides in Algeria kill more than 900."], ["2001-11-10T00:00:00", "John Howard, the Prime Minister of Australia, is elected to a third term."], ["2001-12-02T00:00:00", "Enron files for Chapter 11 bankruptcy protection 5 days after Dynegy cancels a US$8.4 billion buyout bid (to that point, the largest bankruptcy in U.S. history)."], ["2001-12-02T00:00:00", "During economic crisis in Argentina government effectively froze all bank accounts for twelve months which led to riots."], ["2001-12-11T00:00:00", "The United States government indicts Zacarias Moussaoui for involvement in the September 11, 2001 attacks."], ["2001-12-11T00:00:00", "Law enforcement raid members of DrinkOrDie in Operation Buccaneer."], ["2001-12-13T00:00:00", "The Parliament of India is attacked; 12 are killed. This brings India and Pakistan to the brink of war."], ["2001-12-13T00:00:00", "U.S. President George W. Bush announces the US withdrawal from the 1972 Anti-Ballistic Missile Treaty."], ["2001-12-27T00:00:00", "The People's Republic of China is granted permanent normal trade status with the United States."], ["2001-12-27T00:00:00", "Typhoon Vamei forms within 1.5 degrees of the equator. No other tropical cyclone in recorded history has come as close to the equator."], ["2001-01-12T00:00:00", "William Redington Hewlett, American businessman (b. 1913)"], ["2001-01-12T00:00:00", "Adhemar da Silva, Brazilian athlete (b. 1927)"], ["2001-02-18T00:00:00", "Balthus, French painter (b. 1908)"], ["2001-02-18T00:00:00", "Dale Earnhardt, American auto racing driver (b. 1951)"], ["2001-02-19T00:00:00", "Stanley Kramer, American film director (b. 1913)"], ["2001-02-19T00:00:00", "Charles Trenet, French singer (b. 1913)"], ["2001-03-15T00:00:00", "Gaetano Cozzi, Italian historian (b. 1922)"], ["2001-03-15T00:00:00", "Ann Sothern, American actress (b. 1909)"], ["2001-06-21T00:00:00", "John Lee Hooker, American musician (b. 1917)"], ["2001-06-21T00:00:00", "Carroll O'Connor, American actor (b. 1924)"], ["2001-06-27T00:00:00", "Tove Jansson, Finnish author (b. 1914)"], ["2001-06-27T00:00:00", "Jack Lemmon, American actor and director (b. 1925)"], ["2001-06-28T00:00:00", "Joan Sims, English actress (b. 1930)"], ["2001-06-28T00:00:00", "Mortimer J. Adler, American philosopher (b. 1902)"], ["2001-08-06T00:00:00", "Larry Adler, American musician (b. 1914)"], ["2001-08-06T00:00:00", "Jorge Amado, Brazilian writer (b. 1912)"], ["2001-08-25T00:00:00", "Ken Tyrrell, British auto racing driver (b. 1924)"], ["2001-08-25T00:00:00", "Aaliyah, R&B singer and actress (b. 1979)"], ["2001-11-24T00:00:00", "Melanie Thornton, American singer (La Bouche) (b. 1967)"], ["2001-11-24T00:00:00", "Rachel Gurney, British actress (b. 1920)"]]