[["2004-01-03T00:00:00", "Flash Airlines Flight 604 crashes into the Red Sea off the coast of Egypt, killing all 148 aboard."], ["2004-01-04T00:00:00", "NASA's MER-A (Spirit) lands on Mars at 04:35 UTC."], ["2004-01-22T00:00:00", "Chea Vichea, Cambodian labor leader, is shot dead by unidentified gunman in Phnom Penh."], ["2004-01-24T00:00:00", "NASA's MER-B (Opportunity) lands on Mars at 05:05 UTC."], ["2004-01-26T00:00:00", "A whale explodes in Tainan City, Taiwan, while being transported through the town to a university for a necropsy."], ["2004-02-01T00:00:00", "A hajj stampede in Mina, Saudi Arabia, kills 251 pilgrims."], ["2004-02-04T00:00:00", "Facebook launches."], ["2004-02-07T00:00:00", "Several leaders of Abnaa el-Balad are arrested in Israel."], ["2004-02-13T00:00:00", "Scientists in South Korea announce the cloning of 30 human embryos."], ["2004-02-24T00:00:00", "A 6.5 Richter scale earthquake in Northern Morocco hits in the Rif mountains near the city of Al Hoceima, killing 613."], ["2004-02-26T00:00:00", "The United States lifts a 1981 travel ban upon Libya."], ["2004-02-26T00:00:00", "Macedonian President Boris Trajkovski is killed in a plane crash near Mostar, Bosnia and Herzegovina."], ["2004-02-27T00:00:00", "2004 SuperFerry 14 bombing: The Abu Sayyaf guerrilla group is blamed for the deadliest terrorist attack at sea in world history, which kills 116 in the Philippines."], ["2004-02-27T00:00:00", "The John Jay Report into Catholic sex abuse cases in the United States has its initial release."], ["2004-02-28T00:00:00", "Over 1 million Taiwanese participating in the 228 Hand-in-Hand Rally form a 500-kilometre (310 mi) long human chain to commemorate the 228 Incident in 1947."], ["2004-02-29T00:00:00", "2004 Haitian coup d'état: Jean-Bertrand Aristide resigns as president of Haiti. The chief justice of the Haitian Supreme Court, Boniface Alexandre, is sworn in as interim president."], ["2004-03-02T00:00:00", "NASA announces that the Mars rover MER-B (Opportunity) has confirmed that its landing area was once drenched in water."], ["2004-03-10T00:00:00", "Five British men are released from detention at Camp Delta, Guantanamo Bay. After they land at RAF Brize Norton, 4 of them are immediately arrested for questioning."], ["2004-03-11T00:00:00", "Terrorists execute simultaneous attacks, with bombs in 4 rush-hour trains in Madrid, killing 191 people."], ["2004-03-17T00:00:00", "A pogrom-like organized violence breaks out over 2 days in Kosovo; 19 people are killed, 8,000 Serbian homes burned, schools and businesses vandalized, and over 300 Orthodox monasteries and churches burned and destroyed."], ["2004-03-25T00:00:00", "British prime minister Tony Blair visits Libyan leader Colonel Muammar Gaddafi, in return for the dismantling of Libya's weapons of mass destruction programme in December 2003 (the first time a major Western leader had visited the nation in several decades)."], ["2004-03-28T00:00:00", "The first ever reported South Atlantic hurricane makes landfall in southern Brazil in the state of Santa Catarina - the hurricane is dubbed Cyclone Catarina."], ["2004-03-29T00:00:00", "The Republic of Ireland bans smoking in all enclosed work places, including restaurants, pubs and bars."], ["2004-03-29T00:00:00", "The largest expansion of NATO to date takes place, allowing Bulgaria, Estonia, Latvia, Lithuania, Romania, Slovakia and Slovenia into the organization."], ["2004-04-08T00:00:00", "Darfur conflict: The Humanitarian Ceasefire Agreement is signed by the Sudanese government and 2 rebel groups."], ["2004-04-17T00:00:00", "Israeli helicopters fire missiles at a convoy of vehicles in the Gaza Strip, killing the Gaza leader of Hamas, Abdel Aziz al-Rantisi."], ["2004-04-20T00:00:00", "In Iraq, 12 mortars are fired on Abu Ghraib Prison by insurgents; 22 detainees are killed and 92 wounded."], ["2004-04-22T00:00:00", "Ryongchon disaster: Two trains carrying explosives and fuel collide in Ryongchon, North Korea, killing 161 people, injuring 1,300 and destroying thousands of homes."], ["2004-04-24T00:00:00", "Referendums on the Annan Plan for Cyprus, which proposes to re-unite the island, take place in both the Greek-controlled and the Turkish-controlled parts. Although the Turkish Cypriots vote in favour, the Greek Cypriots reject the proposal."], ["2004-05-01T00:00:00", "The largest expansion to date of the European Union takes place, extending the Union by 10 member-states: Poland, Lithuania, Latvia, Estonia, the Czech Republic, Slovakia, Slovenia, Hungary, Malta and Cyprus."], ["2004-05-09T00:00:00", "Chechen president Akhmad Kadyrov is killed by a landmine placed under a VIP stage during a World War II memorial parade in Grozny."], ["2004-05-12T00:00:00", "An American civilian contractor in Iraq, Nick Berg, is shown being decapitated by a group allegedly linked to al-Qaeda on a web-distributed video."], ["2004-05-14T00:00:00", "Frederik, Crown Prince of Denmark, marries Australian Mary Donaldson in Copenhagen."], ["2004-05-17T00:00:00", "Massachusetts legalizes same-sex marriage, in compliance with a ruling from the state's Supreme Judicial Court (Goodridge v. Department of Public Health)."], ["2004-05-19T00:00:00", "Jeremy Sivits pleads guilty in a court-martial in connection with alleged abuse of Iraqi prisoners at Abu Ghraib prison in Baghdad."], ["2004-05-24T00:00:00", "North Korea bans mobile phones (see Communications in North Korea)."], ["2004-05-26T00:00:00", "Terry Nichols is convicted by an Oklahoma state court on murder charges stemming from the 1995 Oklahoma City bombing."], ["2004-06-08T00:00:00", "The first transit of Venus since 1882 occurs; the next one will occur in 2012."], ["2004-06-11T00:00:00", "Terry Nichols is spared the death penalty by an Oklahoma state court on murder charges stemming from the 1995 Oklahoma City bombing."], ["2004-06-12T00:00:00", "A 1.3 kg chondrite type meteorite strikes a house in Ellerslie, New Zealand, causing serious damage but no injuries."], ["2004-06-21T00:00:00", "In Mojave, California, SpaceShipOne becomes the first privately funded spaceplane to achieve spaceflight."], ["2004-06-28T00:00:00", "The U.S.-led coalition occupying Iraq transfers sovereignty to an Iraqi Interim Government."], ["2004-06-30T00:00:00", "Preliminary hearings begin in Iraq in the trial of former president Saddam Hussein, for war crimes and crimes against humanity."], ["2004-07-01T00:00:00", "The Cassini-Huygens spacecraft arrives at Saturn."], ["2004-07-01T00:00:00", "Vatican City gains full membership rights in the United Nations except voting."], ["2004-07-04T00:00:00", "Groundbreaking for the Freedom Tower begins at Ground Zero in New York City."], ["2004-07-04T00:00:00", "The Greek national football team wins the 2004 UEFA European Championship in Portugal."], ["2004-08-01T00:00:00", "A supermarket fire in Asunción, Paraguay, kills about 400 and leaves over 100 missing."], ["2004-08-01T00:00:00", "A bomb attack occurs in front of Prague's Casino Royal."], ["2004-08-03T00:00:00", "The Statue of Liberty reopens after security improvements."], ["2004-08-03T00:00:00", "NASA's MESSENGER is launched (it is captured into Mercury's orbit on March 18, 2011)."], ["2004-08-09T00:00:00", "At the Mihama Nuclear Power Plant, a pipe leaking hot water and steam kills 5 and injures 6 others, in the 2nd worst nuclear disaster in Japan."], ["2004-08-22T00:00:00", "Armed robbers steal Edvard Munch's The Scream, Madonna, and other paintings from the Munch Museum in Oslo, Norway."], ["2004-08-24T00:00:00", "Two airliners in Russia, carrying a total of 89 passengers, crash within minutes of each other after flying out of Domodedovo International Airport, leaving no survivors. Authorities suspect suicide attacks by rebels from Chechnya to be the cause of the crashes."], ["2004-08-26T00:00:00", "During the Republican National Convention over 1800 individuals were arrested by the authorities in New York City, USA. However 90% of those charges were eventually dropped."], ["2004-09-01T00:00:00", "Chechen terrorists take 1,128 people hostage, mostly children, in a school in the Beslan school hostage crisis. The hostage-takers demand the release of Chechen rebels imprisoned in neighbouring Ingushetia and the independence of Chechnya from Russia."], ["2004-09-02T00:00:00", "The United Nations Security Council adopts Resolution 1559, calling for the removal of all foreign troops from Lebanon. This measure is largely aimed at Syrian troops."], ["2004-09-03T00:00:00", "Russian forces end the siege at a school in Beslan, Northern Ossetia; 334 people are killed and at least 700 people injured."], ["2004-09-09T00:00:00", "A bomb blast outside the Australian embassy in Jakarta, Indonesia, kills 11 and injures up to 100 people."], ["2004-09-17T00:00:00", "The 2004 Summer Paralympics commence in Athens, Greece."], ["2004-09-17T00:00:00", "Mexico and Japan finish 2-year-long negotiations and sign a Free Trade Agreement in Mexico City."], ["2004-09-21T00:00:00", "Construction of the Burj Khalifa begins."], ["2004-09-29T00:00:00", "In Mojave, California, the first Ansari X Prize flight takes place of SpaceShipOne, which is competing with a number of spacecraft (including Canada's Da Vinci Project, claimed to be its closest rival) and goes on to win the prize on October 4."], ["2004-10-08T00:00:00", "Suicide bombers detonate 2 bombs at the Red Sea resort of Taba, Egypt, killing 34 people, mainly Israeli tourists and Egyptian workers."], ["2004-10-14T00:00:00", "Prince Norodom Sihamoni is chosen as the new king of Cambodia."], ["2004-10-19T00:00:00", "A team of explorers reaches the bottom of Krubera Cave, world's deepest cave. The depth reached is 2,080 meters (6,824 feet), setting a world record (National Geographic)."], ["2004-10-20T00:00:00", "The Ubuntu operating system is first released."], ["2004-10-20T00:00:00", "Corporate Airlines Flight 5966 crashes in Missouri, killing 13 people and injuring 2."], ["2004-10-21T00:00:00", "The Ministry of Defence approves the deployment of the Black Watch regiment of the British Army to Baghdad, Iraq, after a request for assistance by the U.S. government."], ["2004-10-23T00:00:00", "A magnitude 6.7 earthquake and aftershocks of similar scale occur in the Tokamachi area. A huge landslide occurs on the outskirts of Nagaoka. According to Japanese officials, 68 people are killed, 4,085 are injured, and 103,000 are rendered homeless."], ["2004-10-24T00:00:00", "Brazil successfully launches its first rocket into space."], ["2004-10-26T00:00:00", "The Cassini probe passes within 1,200 km of Titan."], ["2004-10-27T00:00:00", "Details of the discovery of a new, recent species of fossil hominid, Homo floresiensis, from the island of Flores, Indonesia, are published."], ["2004-10-29T00:00:00", "European heads of state sign in Rome the Treaty and Final Act, establishing the first European Constitution."], ["2004-11-02T00:00:00", "United States presidential election, 2004: Republican incumbent President George W. Bush is declared the winner over his Democratic challenger, U.S. Senator John F. Kerry, in a close election."], ["2004-11-06T00:00:00", "In Côte d'Ivoire, National Army bombings kill 9 people, including French U.N. soldiers. French U.N. forces retaliate by destroying the National Army's air force."], ["2004-11-07T00:00:00", "U.S. forces launch a major assault on the Iraqi town of Fallujah, in an effort to rid the area of insurgents before the Iraqi elections in January."], ["2004-11-13T00:00:00", "After six days of intense battles, the Iraqi town of Fallujah is fully occupied by U.S. forces."], ["2004-11-16T00:00:00", "The European Space Agency probe SMART-1 passes from Earth orbit into the orbit of the Moon."], ["2004-11-16T00:00:00", "NASA's hypersonic Scramjet breaks a record by reaching a velocity of about 7,000 mph in an unmanned experimental flight. It obtains a speed of Mach 9.6, almost 10 times the speed of sound."], ["2004-11-16T00:00:00", "Half Life 2 was released."], ["2004-11-22T00:00:00", "The Orange Revolution begins when the government of the Ukraine is accused of electoral fraud against presidential candidate Viktor Yushchenko."], ["2004-11-28T00:00:00", "A male Poʻouli dies of avian malaria at the Maui Bird Conservation Center in Olinda before it can breed, making the species in all probability extinct."], ["2004-12-06T00:00:00", "Terrorists attack the U.S. Consulate in Jeddah, Saudi Arabia, killing several people."], ["2004-12-08T00:00:00", "Dimebag Darrell, former guitarist for the heavy metal band Pantera, is murdered on stage by a deranged fan while performing with his new band Damageplan."], ["2004-12-10T00:00:00", "New Zealand bans smoking in all public places, including bars."], ["2004-12-14T00:00:00", "The world's tallest bridge, the Millau bridge over the River Tarn in the Massif Central mountains, France, is opened by President Jacques Chirac."], ["2004-12-15T00:00:00", "Albanian terrorists take a bus and its passengers hostage in Athens, Greece, and demand 1 million euro in ransom money."], ["2004-12-16T00:00:00", "The House of Lords rules that the British Government breaches human rights legislation, by detaining without trial foreign nationals suspected of being terrorists."], ["2004-12-21T00:00:00", "Iraqi insurgents attack a U.S. military base in the city of Mosul, killing 22 people."], ["2004-12-26T00:00:00", "One of the worst natural disasters in recorded history hits Southeast Asia, when the strongest earthquake in 40 years, measuring 9.3 on the Richter scale, hits the entire Indian Ocean region, which generates an enormous tsunami that crashes into the coastal areas of a number of nations including Thailand, India, Sri Lanka, the Maldives, Malaysia, Myanmar, Bangladesh, and Indonesia. The official death toll in the affected countries stands at 186,983 while more than 40,000 people are still missing."], ["2004-12-27T00:00:00", "Astrophysicists from the Max Planck Institute for Extraterrestrial Physics in Garching near Munich measure the strongest burst from a magnetar. At 21:30:26 UT the earth is hit by a huge wave front of gamma and X-rays. It is the strongest flux of high-energetic gamma radiation measured so far."], ["2004-12-30T00:00:00", "A fire in a Buenos Aires night club (República Cromagnon) kills 194 people during a rock concert."], ["2004-12-31T00:00:00", "Taipei 101, at the time tallest skyscraper in the world, standing at a height of 1,670 feet (509 metres), officially opens."], ["2004-12-31T00:00:00", "Simón Trinidad, high-profile FARC leader, is extradited to the United States, following the second extradition of a high drug dealer in a month and in 2004."]]