[["2002-01-01T00:00:00", "The Open Skies mutual surveillance treaty, initially signed in 1992, officially enters into force."], ["2002-01-01T00:00:00", "Euro notes and coins are introduced in France, Spain, Germany, Italy, Portugal, Greece, Finland, Luxembourg, Belgium, Austria, Ireland and the Netherlands."], ["2002-01-16T00:00:00", "The UN Security Council unanimously establishes an arms embargo and freezes the assets of Osama bin Laden, al-Qaeda, and the Taliban."], ["2002-01-17T00:00:00", "The eruption of Mount Nyiragongo in the Democratic Republic of the Congo displaces an estimated 400,000 people."], ["2002-01-18T00:00:00", "The Sierra Leone government - with British assistance, Guinean air support and US logistical support - defeats the Revolutionary United Front, bringing the Sierra Leone Civil War to a conclusion."], ["2002-01-23T00:00:00", "Wall Street Journal reporter Daniel Pearl is kidnapped in Pakistan, accused of being a CIA agent by his captors."], ["2002-01-27T00:00:00", "Lagos armoury explosion: Several explosions at a military dump in Lagos, Nigeria kill more than 1,000."], ["2002-01-31T00:00:00", "A large section of the Antarctic Larsen Ice Shelf begins disintegrating, consuming about 3,250 km (2,020 mi) over 35 days."], ["2002-02-01T00:00:00", "Kidnapped Wall Street Journal reporter Daniel Pearl is murdered in Karachi, Pakistan."], ["2002-02-06T00:00:00", "Golden Jubilee of Elizabeth II of the United Kingdom upon the 50th anniversary of King George VI's death in 1952."], ["2002-02-09T00:00:00", "Queen Elizabeth II's sister, Princess Margaret, Countess of Snowdon, dies in her sleep aged 71 after suffering a major stroke."], ["2002-02-12T00:00:00", "The trial of Slobodan Milošević, the former President of Yugoslavia, begins at the International Criminal Tribunal for the former Yugoslavia in The Hague."], ["2002-02-15T00:00:00", "The funeral of Princess Margaret, Countess of Snowdon, takes place at St George's Chapel, Windsor Castle on the 50th anniversary of her father's funeral; coincidentally, this is also the final public appearance of her mother."], ["2002-02-19T00:00:00", "NASA's 2001 Mars Odyssey space probe begins to map the surface of Mars using its thermal emission imaging system."], ["2002-02-20T00:00:00", "Al Ayyat railway accident at Reqa Al-Gharbiya in Egypt: a fire on a train running from Cairo to Luxor kills at least 383 and injures over 65."], ["2002-02-22T00:00:00", "Robert William Pickton, the most prolific serial killer in Canadian history, is arrested and charged with the first 2 (of 27) counts of first-degree murder."], ["2002-02-22T00:00:00", "A Spanish-facilitated ceasefire begins in Sri Lanka."], ["2002-02-22T00:00:00", "Angolan Civil War: Anti-communist UNITA guerilla leader Jonas Savimbi is killed in a clash against government troops led by socialist Angolan President José Eduardo dos Santos in Moxico Province, Angola. The incident gradually ends the fighting that had lasted since 1975. The civil war ends on April 4."], ["2002-02-27T00:00:00", "Godhra train burning: 59 Hindu pilgrims die aboard the Sabarmati Express train burned by Muslim extremists at Godhra in the Indian state of Gujarat, starting the 2002 Gujarat riots."], ["2002-02-28T00:00:00", "The ex-currencies of all euro-using nations cease to be legal tender in the European Union."], ["2002-02-28T00:00:00", "2002 Gujarat riots: 97 people are burnt alive or killed in the Naroda Patiya massacre, and 69 in the Gulbarg Society massacre in Ahmedabad."], ["2002-03-01T00:00:00", "U.S. invasion of Afghanistan: In eastern Afghanistan, Operation Anaconda begins."], ["2002-03-01T00:00:00", "Continuing violence in Ahmedabad, India kills 28; police shoot and kill 5 rioters."], ["2002-03-01T00:00:00", "The Envisat environmental satellite successfully reaches an orbit 800 km above the Earth using an Ariane 5 on its 11th launch, carrying the heaviest payload to date at 8,500 kg."], ["2002-03-01T00:00:00", "STS-109: Space Shuttle Columbia flies the Hubble Space Telescope service mission, the penultimate flight before its ill-fated STS-107 mission."], ["2002-03-14T00:00:00", "The Economic Community of West African States (ECOWAS) Parliament is established."], ["2002-03-17T00:00:00", "In Islamabad, Pakistan, the International Protestant Church attack occurs."], ["2002-03-19T00:00:00", "US war in Afghanistan: Operation Anaconda ends after killing 500 Taliban and Al-Qaeda fighters, with 11 allied troop fatalities."], ["2002-03-21T00:00:00", "In Pakistan, Ahmed Omar Saeed Sheikh and 3 others are charged with the kidnapping and killing of Wall Street Journal reporter Daniel Pearl."], ["2002-03-27T00:00:00", "A Palestinian suicide bomber kills 30 Israeli civilians and injures 140 others at the Park Hotel in Netanya, triggering Operation Defensive Shield, a large-scale counter-terrorist Israeli military incursion into the West Bank, 2 days later."], ["2002-03-30T00:00:00", "Queen Elizabeth The Queen Mother dies aged 101 at Royal Lodge, Windsor."], ["2002-04-02T00:00:00", "Israeli forces besiege the Church of the Nativity in Bethlehem, when militants take shelter there."], ["2002-04-09T00:00:00", "The Funeral of Queen Elizabeth The Queen Mother takes place in Westminster Abbey, London."], ["2002-04-11T00:00:00", "April 14 - A military coup d'état against the leftist Venezuelan President Hugo Chávez fails."], ["2002-04-15T00:00:00", "An Air China Boeing 767-200 crashes into a hillside during heavy rain and fog near Busan, South Korea, killing 128."], ["2002-04-17T00:00:00", "Four Canadian infantrymen are killed in Afghanistan by friendly fire from 2 US F-16s."], ["2002-04-18T00:00:00", "The discovery of a new insect order, Mantophasmatodea, is announced."], ["2002-04-25T00:00:00", "Soyuz TM-34: South African Mark Shuttleworth blasts off from the Baikonur Cosmodrome; he had paid £15 million for the trip."], ["2002-05-06T00:00:00", "In the Netherlands, politician and Prime Ministerial candidate Pim Fortuyn is assassinated in Hilversum."], ["2002-05-09T00:00:00", "A 38-day stand-off in the Church of the Nativity in Bethlehem ends, when the Palestinians inside agree to have 13 suspected militants among them deported to several different countries."], ["2002-05-09T00:00:00", "In Kaspiysk, Russia, a remote-control bomb explodes during a holiday parade, killing 43 and injuring at least 130."], ["2002-05-10T00:00:00", "FBI agent Robert Hanssen is sentenced to life imprisonment without the possibility of parole for selling American secrets to the Soviet Union for $1.4 million in cash and diamonds."], ["2002-05-20T00:00:00", "East Timor regains its independence after 26 years of occupation by Indonesia since 1975."], ["2002-05-21T00:00:00", "The US State Department releases a report naming 7 state sponsors of terrorism: Iran, Iraq, Cuba, Libya, North Korea, Sudan, and Syria."], ["2002-05-24T00:00:00", "In Moscow, United States President George W. Bush and Russian President Vladimir Putin sign the Strategic Offensive Reductions Treaty to replace the Anti-Ballistic Missile Treaty of 1972 and the START II Treaty of 1993."], ["2002-05-25T00:00:00", "China Airlines Flight 611 disintegrates near the Penghu Islands at Taiwan Strait, killing all 225 people on board."], ["2002-05-26T00:00:00", "The Mars Odyssey finds signs of large water ice deposits on the planet Mars."], ["2002-05-26T00:00:00", "A barge collides with the Interstate 40 bridge across the Arkansas River in eastern Oklahoma, killing 14."], ["2002-05-31T00:00:00", "June 30 - The 2002 FIFA World Cup begins in South Korea and Japan."], ["2002-06-04T00:00:00", "The planetoid Quaoar is discovered orbiting the Sun in the Kuiper belt."], ["2002-06-06T00:00:00", "Eastern Mediterranean event: An object with an estimated diameter of 10 meters collides with Earth, over the Mediterranean, and detonates in mid-air."], ["2002-06-10T00:00:00", "An annular solar eclipse occurs."], ["2002-06-10T00:00:00", "The first direct electronic communication experiment between the nervous systems of 2 humans, is carried out by Kevin Warwick in the United Kingdom."], ["2002-06-11T00:00:00", "Antonio Meucci is recognized as the first inventor of the telephone by the United States Congress."], ["2002-06-13T00:00:00", "The United States Senate withdraws from the Anti-Ballistic Missile Treaty of 1972. The Russian State Duma withdraws from START II Treaty of 1993 in response."], ["2002-06-14T00:00:00", "In Karachi, Pakistan, a car bomb in front of the U.S. Consulate kills 12 Pakistanis and injures 50."], ["2002-06-15T00:00:00", "Near Earth Asteroid 2002 MN misses the planet by 75,000 miles (121,000 km), about 1/3 the distance to the moon."], ["2002-06-18T00:00:00", "British Telephone Company O2 is created after a BT Cellnet rebrand."], ["2002-06-24T00:00:00", "The Igandu train disaster in Dodoma Region, Tanzania, kills 281 people in the worst rail accident in African history."], ["2002-06-30T00:00:00", "Brazil wins their 5th FIFA World Cup by defeating Germany 2-0 in the 2002 FIFA World Cup Final."], ["2002-07-01T00:00:00", "The International Criminal Court is established."], ["2002-07-01T00:00:00", "Überlingen mid-air collision: A Russian passenger jet and a cargo plane collide over the town of Überlingen, Germany; 71 are killed."], ["2002-07-09T00:00:00", "The Organization of African Unity is disbanded and replaced by the African Union."], ["2002-07-15T00:00:00", "In Washington, D.C., \"American Taliban\" John Walker Lindh pleads guilty to aiding the enemy and possession of explosives during the commission of a felony; Lindh agrees to serve 10 years in prison for each charge."], ["2002-07-19T00:00:00", "Hail kills 25 and injures hundreds in the Chinese province of Henan."], ["2002-07-21T00:00:00", "Telecommunications giant WorldCom files for Chapter 11 bankruptcy protection (the largest such filing in United States history)."], ["2002-07-27T00:00:00", "A Sukhoi Su-27 fighter crashes at an air show in Ukraine, killing 77 and injuring more than 100, making it the worst air show disaster in history (see Sknyliv airshow disaster)."], ["2002-09-02T00:00:00", "The United Nations World Summit on Sustainable Development, successor of the Conference on the Human Environment, World Commission on Environment and Development, and the Conference on Environment and Development, opens."], ["2002-09-05T00:00:00", "A car bomb kills at least 30 people in Afghanistan, and an apparent assassination attempt on Afghan President Hamid Karzai fails the same day."], ["2002-09-10T00:00:00", "Switzerland joins the United Nations as the 191st member state after rejecting a place in 1986."], ["2002-09-11T00:00:00", "The World Summit on Sustainable Development comes to a close."], ["2002-09-19T00:00:00", "Civil war starts in Côte d'Ivoire."], ["2002-09-20T00:00:00", "The Kolka-Karmadon rock ice slide occurs."], ["2002-09-25T00:00:00", "The Vitim event, a possible bolide impact, occurs in Siberia, Russia."], ["2002-09-26T00:00:00", "The Senegalese passenger ferry Joola capsizes in a storm off the coast of Gambia; 1,863 are killed."], ["2002-09-27T00:00:00", "The Democratic Republic of Timor-Leste is admitted to the United Nations as the 192nd member state."], ["2002-10-02T00:00:00", "The Beltway sniper attacks begin with 5 shootings in Montgomery County, Maryland."], ["2002-10-11T00:00:00", "Myyrmanni bombing: A lone bomber explodes a home-made bomb in the Myyrmanni shopping mall north of Helsinki, Finland; the casualties include himself."], ["2002-10-12T00:00:00", "Terrorists detonate bombs in 2 nightclubs in Kuta, Bali, killing 202 and injuring over 300."], ["2002-10-22T00:00:00", "25 - Chechen rebels take control of the theatre Nord-Ost in Moscow and hold the audience hostage."], ["2002-11-07T00:00:00", "Iran bans the advertising of United States products."], ["2002-11-07T00:00:00", "A sovereignty referendum in Gibraltar is held since the Gibraltar sovereignty referendum in 1967. The people again reject Spanish sovereignty."], ["2002-11-08T00:00:00", "Iraq disarmament crisis: The United Nations Security Council unanimously approves UN Security Council Resolution 1441, forcing Saddam Hussein to disarm or face \"serious consequences\"."], ["2002-11-13T00:00:00", "Iraq disarmament crisis: Iraq agrees to the terms of UN Security Council Resolution 1441."], ["2002-11-13T00:00:00", "The oil tanker Prestige sinks off the Galician coast, causing an oil spill."], ["2002-11-14T00:00:00", "Argentina defaults on a US $805 million World Bank loan payment."], ["2002-11-18T00:00:00", "Iraq disarmament crisis: United Nations weapons inspectors led by Hans Blix arrive in Iraq."], ["2002-11-21T00:00:00", "At the NATO Summit in Prague, Bulgaria, Estonia, Latvia, Lithuania, Romania, Slovakia, and Slovenia are invited to join the organization in 2004."], ["2002-11-22T00:00:00", "In Nigeria, more than 100 are killed at an attack aimed at the Miss World contestants."], ["2002-11-25T00:00:00", "U.S. President George W. Bush signs the Homeland Security Act into law, establishing the Department of Homeland Security, in the largest U.S. government reorganization since the creation of the Department of Defense in 1947."], ["2002-12-07T00:00:00", "As required by the recently passed U.N. resolution, Iraq files a 12,000 page weapons declaration with the U.N. Security Council."], ["2002-12-10T00:00:00", "The High Court of Australia hands down its judgement in the Internet defamation dispute in the case of Dow Jones & Co Inc v Gutnick."], ["2002-12-27T00:00:00", "A suicide truck-bomb attack destroys the headquarters of Chechnya's Moscow-backed government, killing 72."], ["2002-12-30T00:00:00", "An eruption on the volcanic island Stromboli off the coast of Sicily causes a flank failure and tsunami. The island is later evacuated."]]