[["1918-01-04T00:00:00", "Finland officially recognized by the Russian SFSR."], ["1918-01-08T00:00:00", "Woodrow Wilson delivers his Fourteen Points speech."], ["1918-01-09T00:00:00", "U.S troops engage Yaqui Indian warriors in the Battle of Bear Valley in Arizona, a minor skirmish and one of the last battles of the American Indian Wars between the United States and American Indians."], ["1918-01-12T00:00:00", "Finland enacts a \"Mosaic Confessors\" law, granting Finnish Jews civil rights."], ["1918-01-15T00:00:00", "The keel of HMS Hermes is laid in Britain, the first purpose-designed aircraft carrier to be laid down."], ["1918-01-18T00:00:00", "Russian Constituent Assembly meets."], ["1918-01-18T00:00:00", "The Historic Concert for the Benefit of Widows and Orphans of Austrian and Hungarian Soldiers at the Konzerthaus, Vienna."], ["1918-01-19T00:00:00", "Russian Constituent Assembly proclaims Russian Democratic Federative Republic, but is dissolved by Bolshevik government on same day."], ["1918-01-25T00:00:00", "The Ukrainian People's Republic declares independence from Bolshevik Russia."], ["1918-01-27T00:00:00", "The Finnish Civil War begins."], ["1918-02-01T00:00:00", "The Cattaro Mutiny sees Austrian sailors in the Gulf of Cattaro (Kotor), led by two Czech Socialists, mutiny."], ["1918-02-05T00:00:00", "The SS Tuscania is torpedoed off the Irish coast; it is the first ship carrying American troops to Europe to be torpedoed and sunk."], ["1918-02-06T00:00:00", "Women's suffrage in the United Kingdom: Representation of the People Act gives most women over 30 the vote."], ["1918-02-14T00:00:00", "Russia switches from the Julian calendar to the Gregorian calendar; the date skips from February 1 to February 14."], ["1918-02-16T00:00:00", "The Council of Lithuania adopts the Act of Independence of Lithuania, declaring Lithuania's independence from the Russian Soviet Federative Socialist Republic."], ["1918-02-19T00:00:00", "WWI: Capture of Jericho by the Egyptian Expeditionary Force begins the British occupation of the Jordan Valley."], ["1918-02-21T00:00:00", "The last captive Carolina parakeet (the last breed of parrot native to the eastern United States) dies at the Cincinnati Zoo."], ["1918-02-24T00:00:00", "Estonia declares its independence from Russia after seven centuries of foreign rule. German forces capture Tallinn on the next day."], ["1918-02-24T00:00:00", "Armenia, Azerbaijan, and Georgia declare their independence from Russia as the Transcaucasian Democratic Federative Republic."], ["1918-03-01T00:00:00", "WWI: German submarine U-19 sinks HMS Calgarian off Rathlin Island, Northern Ireland."], ["1918-03-03T00:00:00", "WWI: Germany, Austria-Hungary and Bolshevist Russia sign the Treaty of Brest-Litovsk, ending Russia's involvement in the war."], ["1918-03-06T00:00:00", "The Finnish Army Corps of Aviation is founded, forerunner of the Finnish Air Force to be established on 4 May 1928. The blue swastika is adopted as its symbol as a tribute to the Swedish explorer and aviator Eric von Rosen, who donated the first plane. Von Rosen had painted the Viking symbol on the plane as his personal lucky insignia."], ["1918-03-06T00:00:00", "The first pilotless drone, the Hewitt-Sperry Automatic Airplane developed by Elmer Sperry and Peter Cooper Hewitt, is test-flown in Long Island, New York, but development is scrapped in 1925 after its guidance system proves unreliable."], ["1918-03-07T00:00:00", "WWI: Finland forms an alliance with Germany."], ["1918-03-08T00:00:00", "WWI: Battle of Tell 'Asur launched by units of the British Army's Egyptian Expeditionary Force against Ottoman defences from the Mediterranean Sea, across the Judaean Mountains to the edge of the Jordan Valley ends on March 12 with the move of much of the front line north into Ottoman territory."], ["1918-03-12T00:00:00", "Moscow becomes the capital of Soviet Russia."], ["1918-03-19T00:00:00", "The United States Congress establishes time zones and approves daylight saving time (DST goes into effect on March 31)."], ["1918-03-21T00:00:00", "WWI: First Transjordan attack on Amman by units of the Egyptian Expeditionary Force begins with the passage of the Jordan River."], ["1918-03-23T00:00:00", "WWI: The giant German cannon, the 'Paris Gun' (Kaiser Wilhelm Geschütz), begins to shell Paris from 114 km (71 mi) away."], ["1918-03-23T00:00:00", "In London at the Wood Green Empire, Chung Ling Soo (William E. Robinson, U.S.-born magician) dies during his trick where he is supposed to \"catch\" two separate bullets - but one of them perforates his lung. He dies the following morning in a hospital."], ["1918-03-25T00:00:00", "The Belarusian People's Republic declares independence."], ["1918-03-25T00:00:00", "Dr. Karl Muck, music director of the Boston Symphony Orchestra, is arrested under the Alien Enemies Act and imprisoned for the duration of WWI."], ["1918-03-25T00:00:00", "French composer Claude Debussy dies of colorectal cancer in Paris."], ["1918-03-26T00:00:00", "Dr. Marie Stopes publishes her influential book Married Love in the U.K."], ["1918-03-27T00:00:00", "WWI: First Battle of Amman launched by units of the Egyptian Expeditionary Force during the First Transjordan attack on Amman, ends with their withdrawal on 31 March back to the Jordan Valley."], ["1918-03-30T00:00:00", "March Days: Bolshevik and Armenian Revolutionary Federation forces suppress a Muslim revolt in Baku, Azerbaijan, resulting in up to 30,000 deaths."], ["1918-04-01T00:00:00", "The Royal Flying Corps and the Royal Naval Air Service in Britain are merged to form the Royal Air Force."], ["1918-04-05T00:00:00", "Sālote succeeds as Queen of Tonga; she will remain on the throne until her death in 1965."], ["1918-04-09T00:00:00", "Union of Bessarabia with Romania: Bessarabia votes to become part of the Kingdom of Romania."], ["1918-04-21T00:00:00", "WWI: Manfred von Richthofen, \"The Red Baron\", the war's most successful fighter pilot, dies in combat at Morlancourt Ridge near the Somme River."], ["1918-04-23T00:00:00", "WWI: - Conscription Crisis of 1918 in Ireland: a general strike is held here against conscription."], ["1918-04-23T00:00:00", "WWI: - Zeebrugge Raid, an attempt by the British Royal Navy to seal off the German U-boat base here."], ["1918-04-30T00:00:00", "WWI: Second Transjordan attack on Shunet Nimrin and Es Salt launched by units of the Egyptian Expeditionary Force ends on 4 May with their withdrawal back to the Jordan Valley."], ["1918-05-01T00:00:00", "German troops enter Don Host Oblast; they take Rostov on May 8."], ["1918-05-02T00:00:00", "General Motors acquires the Chevrolet Motor Company of Delaware."], ["1918-05-07T00:00:00", "British capture of Kirkuk."], ["1918-05-11T00:00:00", "The Mountainous Republic of the Northern Caucasus is officially established."], ["1918-05-14T00:00:00", "The Three Minute Pause, initiated by the daily firing of the Noon Gun on Signal Hill, is instituted by Cape Town Mayor Sir Harry Hands. It would inspire the introduction of the two minutes silence in November 1919."], ["1918-05-15T00:00:00", "End of the Finnish Civil War."], ["1918-05-15T00:00:00", "The United States Post Office Department begins the world's third regular airmail service, between New York City, Philadelphia and Washington, D.C.."], ["1918-05-16T00:00:00", "The Sedition Act of 1918 is approved by the U.S. Congress."], ["1918-05-20T00:00:00", "The small town of Codell, Kansas, is hit for the third year in a row on the same date by a tornado."], ["1918-05-21T00:00:00", "United States Army Aviation Section separated from Signal Corps and divided into the Division of Military Aeronautics and the Bureau of Aircraft Production."], ["1918-05-26T00:00:00", "The Transcaucasian Democratic Federative Republic is abolished. Georgia declares its independence as the Democratic Republic of Georgia."], ["1918-05-27T00:00:00", "The Third Battle of the Aisne commences."], ["1918-05-28T00:00:00", "Armenia and Azerbaijan declare their independence as the Democratic Republic of Armenia and the Azerbaijan Democratic Republic respectively."], ["1918-06-01T00:00:00", "WWI: The Battle of Belleau Wood begins."], ["1918-06-08T00:00:00", "V603 Aquilae, the brightest nova observed since Kepler's of 1604, is discovered."], ["1918-06-10T00:00:00", "WWI: The Austro-Hungarian dreadnought battleship SMS Szent István is sunk by two Italian MAS motor torpedo boats off the Dalmatian coast."], ["1918-06-12T00:00:00", "Grand Duke Michael of Russia is murdered, thereby becoming the first of the Romanovs to be murdered by the Bolsheviks."], ["1918-06-12T00:00:00", "WWI: First airplane bombing raid by an American unit in France."], ["1918-06-22T00:00:00", "Suspects in the Chicago Restaurant Poisonings are arrested, and more than 100 waiters are taken into custody, for poisoning restaurant customers with a lethal powder called Mickey Finn."], ["1918-07-03T00:00:00", "The Siberian Expedition is launched to extract the Czechoslovak Legion from the Russian Civil War."], ["1918-07-04T00:00:00", "Mehmed VI (1918-1922) succeeds Mehmed V (Resad) (1909-1918) as Ottoman Sultan."], ["1918-07-09T00:00:00", "Great Train Wreck of 1918: in Nashville, Tennessee, an inbound local train collides with an outbound express, killing 101."], ["1918-07-12T00:00:00", "The Imperial Japanese Navy battle ship Kawachi blows up at Shunan, western Honshu, Japan, killing at least 621."], ["1918-07-13T00:00:00", "The National Czechoslovak Committee is established."], ["1918-07-14T00:00:00", "Release in the United States of the film The Glorious Adventure featuring Mammy Lou who becomes one of the oldest people ever to star in a film, at a claimed age of 114."], ["1918-07-15T00:00:00", "WWI: Second Battle of the Marne: The battle begins near the River Marne with a German attack."], ["1918-07-18T00:00:00", "Shooting of the Romanov family: By order of the Bolshevik Party and carried out by the Cheka, former emperor Nicholas II, his wife Alexandra Feodorovna, their children, Olga, Tatiana, Maria, Anastasia, and Alexei, and retainers are executed at the Ipatiev House in Ekaterinburg, Russia."], ["1918-07-18T00:00:00", "WWI: RMS Carpathia is torpedoed and sunk off the east coast of Ireland by Imperial German Navy submarine U-55; 218 of the 223 on board are rescued."], ["1918-08-02T00:00:00", "North Russia Intervention: British anti-Bolshevik forces occupy Arkhangelsk."], ["1918-08-08T00:00:00", "WWI: Battle of Amiens: Canadian and Australian troops begin a string of almost continuous victories, the 'Hundred Days Offensive', with an 8-mile push through the German front lines, takiing 12,000 prisoners. German General Erich Ludendorff later calls this the \"black day of the German Army\"."], ["1918-08-10T00:00:00", "Russian Revolution: The British commander in Archangel is told to help the White Russians."], ["1918-08-16T00:00:00", "Battle of Lake Baikal is fought by the Czechoslovak legion against the Red Army."], ["1918-08-21T00:00:00", "WWI: The Second Battle of the Somme begins."], ["1918-08-27T00:00:00", "Battle of Ambos Nogales: U.S. Army forces skirmish against Mexican Carrancistas and their German advisors at Nogales, Arizona, in the only battle of WWI fought on United States soil."], ["1918-08-30T00:00:00", "20,000 London policemen strike for increased pay and union recognition."], ["1918-08-30T00:00:00", "Russian Revolution: Vladimir Lenin is shot by Fanny Kaplan, but survives. Moisei Uritsky, the Petrograd head of the Cheka, is assassinated the same day."], ["1918-09-05T00:00:00", "The Kazan Operation begins. The event continues for 5 days and solidifies the Red Army's power in Russia over the White Army."], ["1918-09-14T00:00:00", "Start of the Balkan front offensive by the Serbian army."], ["1918-09-19T00:00:00", "WWI: - The British Army's Egyptian Expeditionary Force launches the Battle of Megiddo, incorporating the Battle of Sharon, and the Battle of Nablus, an attack in the Judaean Mountains. This day are fought the Battle of Tulkarm, and the Battle of Arara, which breaks the Ottoman front line stretching from the Mediterranean coast to the Judaean Mountains; while the Battle of Tabsor extends into September 20."], ["1918-09-19T00:00:00", "WWI: - Third Transjordan attack in the Jordan Valley begins."], ["1918-09-20T00:00:00", "WWI: The British Army's Desert Mounted Corps launches the - Battle of Nazareth by 5th Cavalry Division (British Indian Army);"], ["1918-09-20T00:00:00", "WWI: The British Army's Desert Mounted Corps launches the - Capture of Afulah and Beisan by the 4th Cavalry Division (British Indian Army);"], ["1918-09-20T00:00:00", "WWI: The British Army's Desert Mounted Corps launches the - Capture of Jenin by the Australian Mounted Division, almost encircling the Yildirim Army Group still in the Judaean Mountains."], ["1918-09-25T00:00:00", "WWI: - Battle of Megiddo ends with the Battle of Haifa, Battle of Samakh, and Capture of Tiberias."], ["1918-09-25T00:00:00", "WWI: - Third Transjordan attack ends with ANZAC Mounted Division victory at the Second Battle of Amman with the subsequent capture at Ziza of the Ottoman II Corps. The division capturing more than 10,000 Ottoman and German prisoners."], ["1918-09-26T00:00:00", "WWI: The Capture of Damascus begins with the Charge at Irbid by the 4th Cavalry Division."], ["1918-09-27T00:00:00", "WWI: Battle of Jisr Benat Yakub launched by the Australian Mounted Division continues the advance towards Damascus."], ["1918-09-29T00:00:00", "WWI: - Allied forces break through the Hindenburg Line."], ["1918-09-29T00:00:00", "WWI: - Bulgaria requests an armistice."], ["1918-09-30T00:00:00", "WWI: - Charge at Kaukab by units of the Australian Mounted Division."], ["1918-09-30T00:00:00", "WWI: - Charge at Kiswe by 4th Cavalry Division continuing Desert Mounted Corps' advance to Damascus."], ["1918-10-01T00:00:00", "WWI: Desert Mounted Corps Capture of Damascus."], ["1918-10-02T00:00:00", "WWI: Charge at Khan Ayash north of Damascus by 3rd Light Horse Brigade."], ["1918-10-03T00:00:00", "Kaiser Wilhelm II of Germany appoints Max von Baden Chancellor of Germany."], ["1918-10-03T00:00:00", "King Ferdinand I of Bulgaria abdicates in the wake of the Bulgarian military collapse in WWI. He is succeeded by his son, Boris III."], ["1918-10-03T00:00:00", "WWI: Pursuit to Haritan by Desert Mounted Corps begins."], ["1918-10-04T00:00:00", "Wilhelm II of Germany forms a new more liberal government to sue for peace."], ["1918-10-04T00:00:00", "The T. A. Gillespie Company Shell Loading Plant explosion in New Jersey kills 100+ and destroys enough ammunition to supply the Western Front for 6 months."], ["1918-10-08T00:00:00", "WWI: In the Forest of Argonne in France, U.S. Corporal Alvin C. York almost single-handedly kills 25 German soldiers and captures 132."], ["1918-10-09T00:00:00", "Landgrave Prince Frederick Charles of Hesse is elected King of Finland."], ["1918-10-11T00:00:00", "Puerto Rico earthquake: The city of Mayagüez and adjacent towns are nearly destroyed by a 7.5 earthquake and a tsunami."], ["1918-10-12T00:00:00", "Cloquet Fire: The city of Cloquet, Minnesota, and nearby areas are destroyed in a fire, killing 453."], ["1918-10-18T00:00:00", "The Washington Declaration proclaims the independent Czechoslovak Republic."], ["1918-10-25T00:00:00", "WWI: Aleppo captured by Prince Feisal's Sheifial Forces."], ["1918-10-25T00:00:00", "The steamer Princess Sophia sinks on Vanderbilt Reef near Juneau, Alaska; 353 people die in the greatest maritime disaster in the Pacific Northwest."], ["1918-10-26T00:00:00", "WWI: Units of Desert Mounted Corps Charge at Haritan last conflict with Ottoman forces in WWI."], ["1918-10-28T00:00:00", "Czechoslovakia declares its independence from Austria-Hungary."], ["1918-10-28T00:00:00", "A new Polish government is declared in Western Galicia (Eastern Europe)."], ["1918-10-29T00:00:00", "Wilhelmshaven mutiny of the German High Seas Fleet."], ["1918-10-30T00:00:00", "The Martin Declaration is published, including Slovakia in the formation of the Czecho-Slovak state."], ["1918-10-30T00:00:00", "The Armistice of Mudros ends conflicts between the Ottoman Empire and the Allies of World War I."], ["1918-10-30T00:00:00", "The Mutawakkilite Kingdom of Yemen is granted independence from the Ottoman Empire by the Armistice of Mudros."], ["1918-10-31T00:00:00", "The Hungarian government terminates the personal union with Austria, officially dissolving the Austro-Hungarian Empire."], ["1918-11-01T00:00:00", "Polish-Ukrainian War inaugurated by proclamation of the West Ukrainian People's Republic in Galicia with a capital at Lwów."], ["1918-11-01T00:00:00", "Malbone Street Wreck: The worst rapid transit accident in world history occurs under the intersection of Malbone Street and Flatbush Avenue, in Brooklyn, New York City, with at least 93 dead."], ["1918-11-03T00:00:00", "WWI: Austria-Hungary enters an armistice with the Allies in Padua."], ["1918-11-03T00:00:00", "Poland declares its independence from Russia."], ["1918-11-03T00:00:00", "German Revolution: Sailors in the German fleet at Kiel mutiny and throughout northern Germany soldiers and workers begin to establish revolutionary councils on the Russian soviet model."], ["1918-11-04T00:00:00", "WWI: Austria-Hungary surrenders to Italy."], ["1918-11-06T00:00:00", "A new Polish government is proclaimed in Lublin."], ["1918-11-07T00:00:00", "King Ludwig of Bavaria flees his country."], ["1918-11-08T00:00:00", "The German army withdraws its support of the Kaiser."], ["1918-11-09T00:00:00", "Kaiser Wilhelm II of Germany abdicates and chooses to live in exile in the Netherlands."], ["1918-11-09T00:00:00", "Proclamation of German Republic by Philipp Scheidemann in Berlin on the Reichstag balcony."], ["1918-11-09T00:00:00", "Provisional National Council Minister-President Kurt Eisner declares Bavaria to be a republic."], ["1918-11-09T00:00:00", "British battleship HMS Britannia is sunk by a German submarine off Trafalgar with the loss of around fifty lives, the last major naval engagement of WWI."], ["1918-11-11T00:00:00", "End of WWI and Armistice with Germany (Compiègne): Germany signs an armistice agreement with the Allies between 5:12 AM and 5:20 AM in Marshal Foch's railroad car in Compiègne Forest in France. It becomes official on the 11th hour of the 11th day of the 11th month."], ["1918-11-11T00:00:00", "Poland regains independence after 123 years of partitions. Józef Piłsudski is appointed Commander-in-Chief."], ["1918-11-11T00:00:00", "Emperor Charles I of Austria gives up his absolute power but does not abdicate."], ["1918-11-12T00:00:00", "Austria becomes a republic."], ["1918-11-13T00:00:00", "Allied Occupation of Constantinople."], ["1918-11-13T00:00:00", "Frederick II, Grand Duke of Baden, relinquishes all governing duties."], ["1918-11-14T00:00:00", "The provisional government of Baden proclaims the Freie Volksrepublik Baden (\"Free Peoples' Republic of Baden\")."], ["1918-11-14T00:00:00", "Czechoslovakia becomes a republic."], ["1918-11-14T00:00:00", "Józef Piłsudski is appointed head of state of Poland."], ["1918-11-16T00:00:00", "The Hungarian Democratic Republic is declared, marking Hungary's independence from Austria."], ["1918-11-18T00:00:00", "Latvia declares its independence from Russia."], ["1918-11-20T00:00:00", "U-boats start to rendezvous off Harwich to begin the surrender of the High Seas Fleet to the British Royal Navy; in the following week the German warships are escorted to internment in Scapa Flow."], ["1918-11-21T00:00:00", "Start of 3-day Lwów pogrom: Polish troops, volunteers and freed criminals massacre at least 320 Ukrainian Christians and Jews in Lwów in Galicia."], ["1918-11-22T00:00:00", "The Spartacist League founds the German Communist Party."], ["1918-11-22T00:00:00", "The Belgian royal family returns to Brussels after the war, King Albert I having commanded the Allied Army group in the autumn Courtrai offensive which liberated his country."], ["1918-11-22T00:00:00", "Frederick II, Grand Duke of Baden, abdicates; the Grand Duchy of Baden gives way to the Republic of Baden."], ["1918-11-23T00:00:00", "British military government of Palestine begins."], ["1918-11-26T00:00:00", "The Podgorica Assembly votes for a \"union of the people\", declaring its union with the Kingdom of Serbia."], ["1918-11-28T00:00:00", "Estonian War of Independence: The Red Army invades Estonia, starting the war. The Commune of the Working People of Estonia is established as a Soviet puppet state in Narva on the next day."], ["1918-11-29T00:00:00", "Serbia annexes Montenegro."], ["1918-11-30T00:00:00", "Ernest Ansermet conducts the first concert by the Orchestre de la Suisse Romande."], ["1918-12-01T00:00:00", "Iceland regains independence, but remains in personal union with the King of Denmark, who also becomes the King of Iceland until 1944."], ["1918-12-01T00:00:00", "New voting laws in Sweden makes votes no longer dependent on taxable assets, each adult having one vote."], ["1918-12-01T00:00:00", "The Union of Alba Iulia is proclaimed: Following the March 27 incorporation of Bessarabia and Bucovina, Transylvania unites with the Kingdom of Romania."], ["1918-12-01T00:00:00", "The Kingdom of Serbs, Croats and Slovenes (which later becomes the Kingdom of Yugoslavia) is proclaimed."], ["1918-12-04T00:00:00", "President Woodrow Wilson departs by ship to the Paris Peace Conference, becoming the first United States President to travel to any foreign country while holding office."], ["1918-12-05T00:00:00", "Estonian War of Independence: The British light cruiser HMS Cassandra strikes a mine and sinks near Saaremaa in the Baltic Sea, killing eleven sailors."], ["1918-12-14T00:00:00", "Prince Frederick Charles of Hesse renounces the Finnish throne."], ["1918-12-16T00:00:00", "Vincas Mickevičius-Kapsukas declares formation of the Lithuanian Soviet Socialist Republic, a puppet state created by the Russian SFSR to justify the Lithuanian-Soviet War."], ["1918-12-17T00:00:00", "Darwin Rebellion in Australia: Disaffected workers march on Government House, Darwin demanding the resignation of the Administrator of the Northern Territory, John A. Gilruth."], ["1918-12-20T00:00:00", "Tomáš Garrigue Masaryk returns to the Czechoslovak Republic."], ["1918-12-21T00:00:00", "Estonian War of Independence: The Red Army captures Tartu in Estonia."], ["1918-12-27T00:00:00", "Great Poland Uprising: The Poles in Greater Poland (or Grand Duchy of Poznań) rise up against the Germans."], ["1918-12-28T00:00:00", "Sinn Féin have a landslide victory in Irish seats in the United Kingdom general election, following the counting of votes, winning 73 of the 105 seats in Ireland. In accordance with their manifesto, Sinn Féin members will not take their seats in the Palace of Westminster but will form the First Dáil in Dublin. Countess Constance Markievicz, while detained in Holloway Prison (London), becomes the first woman elected to (but does not take her seat in) the British House of Commons."], ["1918-12-31T00:00:00", "A British-brokered ceasefire ends the two weeks of fighting in the Georgian-Armenian War."]]