[["1984-01-01T00:00:00", "Brunei becomes a fully independent state."], ["1984-01-01T00:00:00", "Bell System in the United States is broken up."], ["1984-01-03T00:00:00", "President of the United States Ronald Reagan meets with Navy Lieutenant Robert Goodman and the Reverend Jesse Jackson at the White House, following Lieutenant Goodman's release from Syrian captivity."], ["1984-01-05T00:00:00", "President Ronald Reagan nominates Elizabeth Dole as U.S. Secretary of Transportation."], ["1984-01-07T00:00:00", "Brunei becomes the sixth member of the Association of Southeast Asian Nations (ASEAN)."], ["1984-01-10T00:00:00", "The United States and the Vatican (Holy See) restore full diplomatic relations."], ["1984-01-10T00:00:00", "The Victoria Agreement is signed."], ["1984-01-18T00:00:00", "The Mitsui Miike coal mine explosion at Ōmuta, Fukuoka, Japan, kills 83."], ["1984-01-22T00:00:00", "The release of the iconic 1984 (advertisement)"], ["1984-01-24T00:00:00", "Apple Computer places the Macintosh personal computer on sale in the United States."], ["1984-02-01T00:00:00", "Medicare comes into effect in Australia."], ["1984-02-03T00:00:00", "Dr. John Buster and the research team at Harbor-UCLA Medical Center announce history's first embryo transfer from one woman to another, resulting in a live birth."], ["1984-02-03T00:00:00", "STS-41-B: Space Shuttle Challenger is launched on the 10th Space Shuttle mission."], ["1984-02-07T00:00:00", "Astronauts Bruce McCandless II and Robert L. Stewart make the first untethered space walk."], ["1984-02-13T00:00:00", "Konstantin Chernenko succeeds the late Yuri Andropov as General Secretary of the Communist Party of the Soviet Union."], ["1984-02-26T00:00:00", "The United States Marine Corps pulls out of Beirut, Lebanon."], ["1984-02-29T00:00:00", "Canadian prime minister, Pierre Trudeau, announces his retirement."], ["1984-03-05T00:00:00", "Iran accuses Iraq of using chemical weapons; the United Nations condemns their use on March 30."], ["1984-03-06T00:00:00", "A year-long strike action begins in the British coal industry (see UK miners' strike (1984-85))."], ["1984-03-14T00:00:00", "Sinn Féin's Gerry Adams and three others are seriously injured in a gun attack by the Ulster Volunteer Force."], ["1984-03-16T00:00:00", "The United States Central Intelligence Agency station chief in Beirut, William Francis Buckley, is kidnapped by the Islamic Jihad Organization and later dies in captivity."], ["1984-03-22T00:00:00", "Teachers at the McMartin Preschool in Manhattan Beach, California are charged with Satanic ritual abuse of the school children; the charges are later dropped as completely unfounded."], ["1984-03-23T00:00:00", "General Rahimuddin Khan becomes the first man in Pakistan's history to rule over two of its provinces, after becoming interim Governor of Sindh."], ["1984-03-25T00:00:00", "Pope John Paul II consecrates the world to the Immaculate Heart of Mary, in Fátima, Portugal."], ["1984-03-25T00:00:00", "The Institute of the Incarnate Word (IVE) is founded under Fr. Carlos Miguel Buela."], ["1984-04-01T00:00:00", "Marvin Gaye is shot to death by his father, one day before his 45th birthday."], ["1984-04-02T00:00:00", "Indian Squadron Leader Rakesh Sharma is launched into space, aboard the Soyuz T-11."], ["1984-04-04T00:00:00", "U.S. President Ronald Reagan calls for an international ban on chemical weapons."], ["1984-04-09T00:00:00", "The 56th Academy Awards, hosted by Johnny Carson, are held at the Dorothy Chandler Pavilion. Terms of Endearment wins Best Picture and 4 other Academy Awards."], ["1984-04-12T00:00:00", "Palestinian gunmen take Israeli bus number 300 hostage. Israeli special forces storm the bus, freeing the hostages (one hostage, two hijackers killed)."], ["1984-04-13T00:00:00", "India launches Operation Meghdoot, bringing most of the disputed Siachen Glacier region of Kashmir under Indian control and triggering the Siachen conflict with Pakistan."], ["1984-04-15T00:00:00", "English comedian Tommy Cooper suffers a massive heart attack and dies while live on TV."], ["1984-04-15T00:00:00", "The first World Youth Day gathering is held in Rome, Italy."], ["1984-04-16T00:00:00", "More than one million people, led by Tancredo Neves, occupy the streets of São Paulo to demand direct presidential elections during the Brazilian military government of João Figueiredo. It is the largest protest during the Diretas Já civil unrest, as well as the largest public demonstration in the history of Brazil. The elections are granted in 1989."], ["1984-04-17T00:00:00", "WPC Yvonne Fletcher is shot and killed by a secluded gunman, leading to a police siege of the Libyan Embassy in London."], ["1984-04-19T00:00:00", "\"Advance Australia Fair\" is proclaimed as Australia's national anthem, and green and gold as the national colours."], ["1984-04-23T00:00:00", "United States researchers announce their discovery of the AIDS virus."], ["1984-04-25T00:00:00", "The term of Sultan Ahmad Shah as the seventh Yang di-Pertuan Agong of Malaysia ends."], ["1984-04-26T00:00:00", "Sultan Iskandar of Johor, becomes the eighth Yang di-Pertuan Agong of Malaysia."], ["1984-05-02T00:00:00", "The International Garden Festival opens in Liverpool."], ["1984-05-05T00:00:00", "The Herreys win the Eurovision Song Contest 1984 for Sweden, with the song \"Diggi-Loo, Diggi-Ley\"."], ["1984-05-08T00:00:00", "The Soviet Union announces that it will boycott the 1984 Summer Olympics in Los Angeles."], ["1984-05-08T00:00:00", "Denis Lortie kills three government employees in the National Assembly of Quebec building."], ["1984-05-08T00:00:00", "The Chicago White Sox defeat the Milwaukee Brewers 7-6 in the longest game in Major League Baseball history: 25 innings totalling eight hours, six minutes."], ["1984-05-11T00:00:00", "A transit of Earth from Mars takes place."], ["1984-05-12T00:00:00", "The Louisiana World Exposition, also known as the 1984 World's Fair, and also the New Orleans World's Fair, and, to the locals, simply as \"The Fair\" or \"Expo 84\", opens."], ["1984-05-14T00:00:00", "The one dollar coin is introduced in Australia."], ["1984-05-17T00:00:00", "Michael Silka kills nine people near Manley Hot Springs, Alaska."], ["1984-05-23T00:00:00", "A methane gas explosion at Abbeystead water treatment works in Lancashire, England, kills 16 people."], ["1984-05-27T00:00:00", "An overnight flash flood rages through neighborhoods in Tulsa, Oklahoma. Nearly 15 inches of rain falls in some areas over a four-hour period; 14 people are killed."], ["1984-05-31T00:00:00", "Six inmates, including James and Linwood Briley, escape from a death row facility at Mecklenburg Correctional Center, the only occasion this has ever happened in the United States."], ["1984-06-01T00:00:00", "William M. Gibbons is released as receiver and trustee of the Chicago, Rock Island & Pacific railroad, after all of its debts and creditors are paid off by order of a federal bankruptcy court."], ["1984-06-03T00:00:00", "Ronald Reagan visits his ancestral home in Ballyporeen, the Republic of Ireland."], ["1984-06-05T00:00:00", "The Indian government begins Operation Blue Star, the planned attack on the Golden Temple in Amritsar."], ["1984-06-08T00:00:00", "A deadly F5 tornado nearly destroys the town of Barneveld, Wisconsin, killing nine people, injuring nearly 200, and causing over $25,000,000 in damage."], ["1984-06-12T00:00:00", "In one of the greatest NBA Finals ever, The Boston Celtics beat the Los Angeles Lakers in 7 games to captured their 15th NBA Championship."], ["1984-06-16T00:00:00", "The world-renowned, critically acclaimed Canadian entertainment company, Cirque du Soleil is founded."], ["1984-06-18T00:00:00", "Colorado radio host Alan Berg is shot dead outside his home in Denver by members of The Order."], ["1984-06-20T00:00:00", "The biggest exam shake-up in the British education system in over 10 years is announced, with O-level and CSE exams to be replaced by a new exam, the GCSE."], ["1984-06-22T00:00:00", "The official name of the Turkish city of Urfa is changed into Şanlıurfa."], ["1984-06-22T00:00:00", "Virgin Atlantic Airways makes its inaugural flight."], ["1984-06-27T00:00:00", "France beats Spain 2-0 to win Euro 84."], ["1984-06-28T00:00:00", "Richard Ramírez (the \"Night Stalker\") murders his first confirmed victim."], ["1984-06-30T00:00:00", "John Turner becomes Canada's 17th prime minister."], ["1984-06-30T00:00:00", "Elton John plays the famous Night and Day Concert at Wembley Stadium."], ["1984-07-01T00:00:00", "Liechtenstein becomes the last country in Europe to grant women the right to vote."], ["1984-07-13T00:00:00", "Terry Wallis, a 19-year old living in the Ozark Mountains of Arkansas, falls into a deep coma after a severe automobile accident (he will eventually awaken 19 years later on June 13, 2003)."], ["1984-07-14T00:00:00", "New Zealand Prime Minister Rob Muldoon calls a snap election and is heavily defeated by opposition Labour leader David Lange."], ["1984-07-18T00:00:00", "Beverly Burns becomes the first woman Boeing 747 captain in the world."], ["1984-07-18T00:00:00", "In San Ysidro, San Diego, 41-year-old James Oliver Huberty sprays a McDonald's restaurant with gunfire, killing 21 people before being shot and killed himself."], ["1984-07-23T00:00:00", "Vanessa L. Williams becomes the first Miss America to resign when she surrenders her crown, after nude photos of her appear in Penthouse magazine."], ["1984-07-25T00:00:00", "Salyut 7: cosmonaut Svetlana Savitskaya becomes the first woman to perform a space walk."], ["1984-08-01T00:00:00", "Australian banks are deregulated."], ["1984-08-04T00:00:00", "The African republic Upper Volta changes its name to Burkina Faso."], ["1984-08-04T00:00:00", "Soviet submarine K-278 Komsomolets reaches a record submergence depth of 1,020 meters."], ["1984-08-11T00:00:00", "United States President Ronald Reagan, during a voice check for a radio broadcast remarks, \"My fellow Americans, I'm pleased to tell you today that I've signed legislation that will outlaw Russia forever. We begin bombing in five minutes\"."], ["1984-08-11T00:00:00", "Barefoot South African runner Zola Budd, controversially granted British citizenship earlier in the year, collides with Mary Decker of the U.S. in the Olympic 3000 meters final, neither finishing as medallists."], ["1984-08-16T00:00:00", "John DeLorean is acquitted of all eight charges of possessing and distributing cocaine."], ["1984-08-17T00:00:00", "Peru recognizes the Sahrawi Arab Democratic Republic."], ["1984-08-21T00:00:00", "Half a million people in Manila demonstrate against the regime of Ferdinand Marcos."], ["1984-08-30T00:00:00", "STS-41-D: the Space Shuttle Discovery takes off on its maiden voyage."], ["1984-09-02T00:00:00", "Seven people are shot and killed and 12 wounded in the Milperra massacre, a shootout between the rival motorcycle gangs Bandidos and Comancheros in Sydney, Australia."], ["1984-09-04T00:00:00", "The Progressive Conservative Party of Canada, led by Brian Mulroney, wins 211 seats in the Canadian House of Commons, forming the largest majority government in Canadian history."], ["1984-09-04T00:00:00", "The Sandinista Front wins the Nicaraguan general elections."], ["1984-09-05T00:00:00", "STS-41-D: the Space Shuttle Discovery lands after its maiden voyage at Edwards Air Force Base in California."], ["1984-09-05T00:00:00", "Western Australia becomes the last Australian state to abolish capital punishment."], ["1984-09-14T00:00:00", "P. W. Botha is inaugurated as the first executive State President of South Africa."], ["1984-09-16T00:00:00", "Edgar Reitz's film series Heimat begins release in Germany."], ["1984-09-17T00:00:00", "Brian Mulroney is sworn in as Prime Minister of Canada."], ["1984-09-18T00:00:00", "Joe Kittinger becomes the first person to cross the Atlantic, solo, in a hot air balloon."], ["1984-09-20T00:00:00", "Hezbollah car-bombs the U.S. Embassy annex in Beirut, killing 24 people."], ["1984-09-23T00:00:00", "The television drama Threads, a documentary of nuclear war, broadcasts on BBC Two."], ["1984-09-26T00:00:00", "The United Kingdom and the People's Republic of China sign the initial agreement to return Hong Kong to China in 1997."], ["1984-10-04T00:00:00", "Tim Macartney-Snape and Greg Mortimer become the first Australians to summit Mount Everest."], ["1984-10-05T00:00:00", "STS-41-G: Marc Garneau becomes the first Canadian in space, aboard the Space Shuttle Challenger."], ["1984-10-11T00:00:00", "Aboard the Space Shuttle Challenger, astronaut Kathryn D. Sullivan becomes the first American woman to perform a space walk."], ["1984-10-12T00:00:00", "The Provisional Irish Republican Army (PIRA) attempts to assassinate Prime Minister Margaret Thatcher and the British Cabinet in the Brighton hotel bombing."], ["1984-10-19T00:00:00", "Polish secret police kidnap Jerzy Popiełuszko, a Catholic priest who supports the Solidarity movement. His dead body is found in a reservoir 11 days later on October 30."], ["1984-10-23T00:00:00", "The world learns from moving BBC News television reports presented by Michael Buerk of the famine in Ethiopia, where thousands of people have already died of starvation due to a famine, and as many as 10,000,000 more lives are at risk."], ["1984-10-25T00:00:00", "The European Economic Community makes £1.8 million available to help combat the famine in Ethiopia."], ["1984-10-31T00:00:00", "Assassination of Indira Gandhi: Prime Minister of India Indira Gandhi is assassinated by her two Sikh security guards in New Delhi. Anti-Sikh riots break out, leaving 10,000 to 20,000 Sikhs dead in Delhi and surrounding areas with majority populations of Hindus. Rajiv Gandhi becomes Prime Minister of India."], ["1984-11-06T00:00:00", "United States presidential election, 1984: Ronald Reagan defeats Walter F. Mondale with 59% of the popular vote, the highest since Richard Nixon's 61% popular vote victory in 1972. Reagan carries 49 states in the electoral college; Mondale wins only his home state of Minnesota by a mere 3,761 vote margin and the District of Columbia."], ["1984-11-09T00:00:00", "Cesar Chavez delivers his speech, \"What The Future Holds For Farm Workers And Hispanics\", at the Commonwealth Club in San Francisco."], ["1984-11-11T00:00:00", "The Louisiana World Exposition, also known as The 1984 World's Fair, and also the New Orleans World's Fair, and, to the locals, simply as \"The Fair\" or \"Expo 84\", closes."], ["1984-11-14T00:00:00", "Zamboanga City mayor Cesar Climaco, a prominent critic of the government of Philippine President Ferdinand Marcos, is assassinated in his home city."], ["1984-11-19T00:00:00", "A series of explosions at the Pemex Petroleum Storage Facility at San Juan Ixhuatepec, in Mexico City, ignites a major fire and kills about 500 people."], ["1984-11-25T00:00:00", "An East Rail train derails between Sheung Shui and Fanling stations, Hong Kong."], ["1984-11-25T00:00:00", "Band Aid (assembled by Bob Geldof) records the charity single \"Do They Know It's Christmas?\" in London to raise money to combat the famine in Ethiopia. It is released on December 3."], ["1984-11-25T00:00:00", "Uruguayan presidential election, 1984: Julio María Sanguinetti is democratically elected President of Uruguay after 12 years of military dictatorship."], ["1984-11-28T00:00:00", "Over 250 years after their deaths, William Penn and his wife Hannah Callowhill Penn are made Honorary Citizens of the United States."], ["1984-11-30T00:00:00", "The Tamil Tigers begin the purge of the Sinhalese people from North and East Sri Lanka; 127 are killed."], ["1984-12-01T00:00:00", "Controlled Impact Demonstration: NASA and the FAA crashes a remote controlled Boeing 720."], ["1984-12-02T00:00:00", "Bob Hawke's government is re-elected in Australia with a reduced majority."], ["1984-12-03T00:00:00", "Bhopal disaster: A methyl isocyanate leak from a Union Carbide pesticide plant in Bhopal, Madhya Pradesh, India, kills more than 8,000 people outright and injures over half a million (with more later dying from their injuries the death toll reaches 23,000+) in the worst industrial disaster in history."], ["1984-12-03T00:00:00", "British Telecom is privatised."], ["1984-12-04T00:00:00", "Sri Lankan Civil War: Sri Lankan Army soldiers kill 107-150 civilians in Mannar."], ["1984-12-04T00:00:00", "Hezbollah militants hijack a Kuwait Airlines plane and kill 4 passengers."], ["1984-12-08T00:00:00", "White supremacist and Order leader Robert Jay Mathews is killed in a gun battle and fire during an FBI siege on Whidbey Island."], ["1984-12-10T00:00:00", "Cisco Systems is founded."], ["1984-12-14T00:00:00", "Nigeria recognizes the Sahrawi Arab Democratic Republic."], ["1984-12-19T00:00:00", "The People's Republic of China and United Kingdom sign the Sino-British Joint Declaration on the future of Hong Kong."], ["1984-12-22T00:00:00", "Four African-American youths (Barry Allen, Troy Canty, James Ramseur, and Darrell Cabey) board an express train in the Bronx borough of New York City. They attempt to rob Bernhard Goetz, who shoots them. The event starts a national debate about urban crime in the United States."], ["1984-12-22T00:00:00", "In Malta, Prime Minister Dom Mintoff resigns."], ["1984-12-28T00:00:00", "A Soviet cruise missile plunges into Inarinjärvi lake in Finnish Lapland. Finnish authorities announce the fact in public on January 3, 1985."]]