[["2005-01-04T00:00:00", "Gunmen assassinate the Governor of Baghdad, Ali al-Haidari."], ["2005-01-05T00:00:00", "Eris, the largest known dwarf planet in the Solar System, is identified by a team led by Michael E. Brown using images originally taken on October 21, 2003, at the Palomar Observatory."], ["2005-01-09T00:00:00", "The same storm, which pounded the U.S. earlier in the month, hits England, Scandinavia and the Baltic states, leaving 13 dead with widespread flooding and power cuts."], ["2005-01-09T00:00:00", "Mahmoud Abbas is elected to succeed Yasser Arafat as President of the Palestinian National Authority."], ["2005-01-12T00:00:00", "Deep Impact is launched from Cape Canaveral by a Delta II rocket."], ["2005-01-14T00:00:00", "The Huygens probe lands on Titan, the largest moon of Saturn."], ["2005-01-25T00:00:00", "The Mandher Devi temple stampede during a religious pilgrimage in India kills at least 250."], ["2005-01-30T00:00:00", "The first free Parliamentary elections in Iraq since 1958 take place."], ["2005-02-09T00:00:00", "An ETA car bomb injures at least 40 people at a conference centre in Madrid."], ["2005-02-10T00:00:00", "North Korea announces that it possesses nuclear weapons as a protection against the hostility it feels from the United States."], ["2005-02-10T00:00:00", "Saudi Arabia holds its first ever municipal elections, in which only male citizens are allowed to vote."], ["2005-02-14T00:00:00", "Former Prime Minister of Lebanon Rafic Hariri is killed in Beirut after an assassination attempt by suicide bombing; it also kills at least 16 other people and injures 120 others."], ["2005-02-14T00:00:00", "YouTube, the most popular video sharing website, is founded."], ["2005-02-14T00:00:00", "59 people are killed and 200 injured after a fire breaks out in a mosque in Tehran, Iran."], ["2005-02-16T00:00:00", "The Kyoto Protocol goes into effect, without the support of the United States and Australia."], ["2005-02-19T00:00:00", "Suicide bombers kill more than 30 people in Iraq as Shia Muslims mark Ashura, their holiest day."], ["2005-02-22T00:00:00", "More than 500 people are killed and over 1,000 injured, after entire villages are flattened in an earthquake (6.4 on the Richter scale) in the Zarand region of Kerman province in southern Iran."], ["2005-02-26T00:00:00", "Egyptian President Hosni Mubarak asks Parliament to amend the constitution to allow multi-candidate presidential elections before September 2005."], ["2005-03-01T00:00:00", "Tabaré Vázquez is sworn in as the first President of Uruguay belonging to a leftist party."], ["2005-03-03T00:00:00", "Millionaire Steve Fossett breaks a world record by completing the fastest non-stop, non-refueled, solo flight around the world in the Virgin Atlantic GlobalFlyer."], ["2005-03-03T00:00:00", "Four Royal Canadian Mounted Police officers are gunned down in Mayerthorpe, Alberta, Canada. It is deadliest day in Canadian law enforcement in over 120 years."], ["2005-03-04T00:00:00", "The car of released Italian hostage Giuliana Sgrena is fired on by U.S. soldiers in Iraq, causing the death of 1 passenger and injuring 2 more."], ["2005-03-08T00:00:00", "The Pakistan Army opens fire on insurgents in Balochistan, in the first armed uprising since General Rahimuddin Khan's stabilization of the province in 1978."], ["2005-03-14T00:00:00", "The People's Republic of China ratifies an anti-secession law, aimed at preventing Taiwan from declaring independence."], ["2005-03-14T00:00:00", "800,000 people gather for an opposition rally in Beirut, a month after the death of former Prime Minister Rafic Hariri. It is the largest rally in Lebanon's history."], ["2005-03-19T00:00:00", "A time bomb explodes in a Muslim shrine in Quetta, southwestern Pakistan, killing at least 29 people and wounding 40."], ["2005-03-23T00:00:00", "An explosion takes place at one of BP's largest oil refineries in Texas City, killing 15 and injuring more than 170."], ["2005-03-24T00:00:00", "The Tulip Revolution in Kyrgyzstan reaches its climax with the overthrow of president Askar Akayev."], ["2005-03-26T00:00:00", "The Taiwanese government calls on 1 million Taiwanese to demonstrate in Taipei, in opposition to the Anti-Secession Law of the People's Republic of China. Between 200,000 and 300,000 attend the walk."], ["2005-04-02T00:00:00", "Pope John Paul II dies; over 4 million people travel to the Vatican to mourn him."], ["2005-04-08T00:00:00", "A referendum is held in Curaçao on independence vs. integration with the Netherlands."], ["2005-04-09T00:00:00", "Tens of thousands of demonstrators, many of them supporters of Shia cleric Muqtada al-Sadr, march through Baghdad denouncing the U.S. occupation of Iraq, 2 years after the fall of Saddam Hussein, and rally in the square where his statue was toppled in 2003."], ["2005-04-09T00:00:00", "Wedding of Charles, Prince of Wales, and Camilla Parker Bowles: The Prince of Wales marries Camilla Parker Bowles in a civil ceremony at Windsor's Guildhall. Camilla acquires her title The Duchess of Cornwall."], ["2005-04-17T00:00:00", "Twelve holidaymakers are killed in southern Switzerland when a bus carrying 27 people plunges 656 feet (200 m) into a ravine."], ["2005-04-18T00:00:00", "Five people die in ethnic clashes in Iran's south-west Khuzestan Province."], ["2005-04-19T00:00:00", "Pope Benedict XVI succeeds Pope John Paul II, becoming the 265th pope."], ["2005-04-20T00:00:00", "An earthquake (5.8 on the Richter scale) hits Fukuoka and Kasuga, Fukuoka Prefecture, Japan, injuring 56."], ["2005-04-23T00:00:00", "YouTube is launched: the first video is uploaded at 20:27 (8:27 pm)."], ["2005-04-25T00:00:00", "Amagasaki rail crash: A passenger train derails in Amagasaki, Hyōgo Prefecture, Japan, killing 107 people and injuring another 562."], ["2005-04-26T00:00:00", "Facing international pressure, Syria withdraws the last of its 14,000 troop military garrison in Lebanon, ending its 29-year military domination of that country."], ["2005-04-27T00:00:00", "The Superjumbo jet aircraft Airbus A380 makes its first flight from Toulouse."], ["2005-05-04T00:00:00", "In one of the largest insurgent attacks in Iraq, at least 60 people are killed and dozens wounded in a suicide bombing at a Kurdish police recruitment center in Erbil, northern Iraq."], ["2005-05-13T00:00:00", "Andijan massacre: Uzbek Interior Ministry and National Security Service troops kill up to 700 during protests in eastern Uzbekistan over the trials of 23 accused Islamic extremists. President Islam Karimov defends the act."], ["2005-05-15T00:00:00", "A passenger ferry capsizes and sinks in strong winds in the Bura Gauranga River in Bangladesh, leaving 200 people missing."], ["2005-05-17T00:00:00", "Kuwaiti women are re-granted the right to vote."], ["2005-05-21T00:00:00", "Kingda Ka opens at Six Flags Great Adventure amusement park in Jackson, New Jersey as the world's tallest and (at the time) fastest roller coaster."], ["2005-05-31T00:00:00", "Watergate scandal: Deep Throat's identity is revealed by Vanity Fair to be former FBI Associate Director Mark Felt after retiring on 22 June 1973."], ["2005-06-21T00:00:00", "A Volna booster rocket carrying the first light sail spacecraft (a joint Russian-United States project) fails 83 seconds after its launch, destroying the spacecraft."], ["2005-06-28T00:00:00", "Three U.S. Navy SEALs, 16 American Special Operations Forces soldiers, and an unknown number of Taliban insurgents are killed during Operation Red Wings, a failed counter-insurgent mission in Kunar Province, Afghanistan."], ["2005-06-30T00:00:00", "The Spanish Parliament votes by a margin of 187 votes to 147 to legalize same-sex marriage in Spain, becoming the fourth country to do so."], ["2005-07-02T00:00:00", "Live 8, a set of 10 simultaneous concerts, takes place throughout the world, raising interest in the Make Poverty History campaign."], ["2005-07-04T00:00:00", "NASA's \"Copper bullet\" from the Deep Impact spacecraft hits Comet Tempel 1, creating a crater for scientific studies."], ["2005-07-04T00:00:00", "Violent anti-G8 demonstrations occur in Gleneagles, Scotland."], ["2005-07-06T00:00:00", "The European Parliament rejects the Proposed directive on the patentability of computer-implemented inventions in its second reading in the codecision procedure."], ["2005-07-06T00:00:00", "The International Olympic Committee awards the 2012 Summer Olympics to London."], ["2005-07-07T00:00:00", "Four terror attacks (3 on the London Underground and 1 on a bus) rock the transport network in London, killing 52 (not including the 4 bombers) and injuring over 700."], ["2005-07-12T00:00:00", "Terrorists kill 5 people and wound 90 in a crowded mall in Netanya, Israel. Islamic Jihad claims responsibility for the attack."], ["2005-07-23T00:00:00", "A series of blasts hits a resort town in Egypt."], ["2005-07-26T00:00:00", "Mumbai, India receives 99.5 cm of rain (39.17 inches) within 24 hours, bringing the city to a halt for over 2 days."], ["2005-07-28T00:00:00", "The Provisional IRA issues a statement formally ordering an end to the armed campaign it has pursued since 1969, and ordering all its units to dump their arms."], ["2005-08-02T00:00:00", "Air France Flight 358 overruns Runway 24L at Toronto Pearson International Airport."], ["2005-08-06T00:00:00", "Tuninter Flight 1153 is ditched due to engine failure; 16 are killed."], ["2005-08-13T00:00:00", "The Mars Reconnaissance Orbiter is launched."], ["2005-08-14T00:00:00", "Helios Airways Flight 522 crashes near the town of Grammatiko in Greece, killing 121 people. Observations from fighter jet aircraft indicate a decompression problem."], ["2005-08-16T00:00:00", "West Caribbean Airways Flight 708 crashes into a mountain in Venezuela, killing 152 passengers."], ["2005-08-18T00:00:00", "Peace Mission 2005, the first joint China-Russia military exercise, begins its 8-day training on the Shandong Peninsula."], ["2005-08-22T00:00:00", "A 4.1 kilograms (9.0 lb) meteorite crashes into the Dotito area of Zambezi Escarpment in Zimbabwe, leaving a 150 millimeters (5.9 in) crater."], ["2005-08-23T00:00:00", "Israel's unilateral disengagement from 25 Jewish settlements in the Gaza Strip and West Bank ends."], ["2005-08-29T00:00:00", "Hurricane Katrina makes landfall along the U.S. Gulf Coast, causing severe damage. At least 1,836 die in the aftermath."], ["2005-08-31T00:00:00", "The 2005 Al-Aaimmah bridge stampede in Baghdad kills several hundred civilians."], ["2005-09-02T00:00:00", "Protesters and Israeli forces clash in Bil'in."], ["2005-09-11T00:00:00", "Japan general election, 2005: Prime Minister Junichiro Koizumi and the Liberal Democratic Party are returned to power."], ["2005-09-12T00:00:00", "Hong Kong Disneyland Resort in Penny's Bay, Lantau Island, Hong Kong opens."], ["2005-09-18T00:00:00", "Afghan parliamentary election: Former Northern Alliance warlords and their followers claim victory."], ["2005-09-19T00:00:00", "North Korea agrees to stop building nuclear weapons in exchange for aid and cooperation."], ["2005-09-26T00:00:00", "U.S. Army Reservist Lynndie England is convicted by a military jury on 6 of 7 counts, in connection with the Abu Ghraib prisoner abuse scandal."], ["2005-09-30T00:00:00", "Controversial drawings of Muhammad are printed in the Danish newspaper Jyllands-Posten."], ["2005-10-01T00:00:00", "The 2005 Bali bombings kill 26 people and injure more than 100."], ["2005-10-01T00:00:00", "The world's largest bank, Mitsubishi UFJ Financial Group, is formed by the merger of 2 Japanese banking conglomerates."], ["2005-10-01T00:00:00", "An Australian photojournalist in Afghanistan, Stephen Dupont, films U.S. soldiers burning 2 dead Taliban militias' bodies."], ["2005-10-08T00:00:00", "The 2005 Kashmir earthquake kills about 80,000 people."], ["2005-10-12T00:00:00", "The second manned Chinese spacecraft, Shenzhou 6, is launched, carrying Fei Junlong and Nie Haisheng for 5 days in orbit."], ["2005-10-15T00:00:00", "The referendum on the new proposed Iraqi constitution is held."], ["2005-10-15T00:00:00", "The Qinghai-Tibet Railway is completed."], ["2005-10-19T00:00:00", "The Trial of Saddam Hussein begins."], ["2005-10-27T00:00:00", "The 2005 French riots begin after 2 young immigrants die in Clichy-sous-Bois, while hiding from the police."], ["2005-10-29T00:00:00", "At least 61 people are killed and many others wounded in 3 powerful blasts in the Indian capital, Delhi (see 2005 Delhi bombings)."], ["2005-11-02T00:00:00", "The Spanish Congress of Deputies approves the admission to formality of the new Catalan Statute of Autonomy with the support of all the groups except the People's Party (PP), which the same day files an objection of unconstitutionality."], ["2005-11-03T00:00:00", "Chicken Little, the first computer animated film made by Walt Disney Pictures premiers in theaters."], ["2005-11-04T00:00:00", "The U.S. and Uruguay governments sign a Bilateral investment treaty."], ["2005-11-09T00:00:00", "2005 Amman bombings: At least 50 people are killed and more than 120 injured in a series of coordinated suicide bombings in Amman, Jordan."], ["2005-11-13T00:00:00", "Andrew Stimpson, a 25-year-old British man, is reported as the first person proven to have been 'cured' of HIV."], ["2005-11-22T00:00:00", "Angela Merkel assumes office as the first female Chancellor of Germany."], ["2005-11-30T00:00:00", "Surgeons in France carry out the first human face transplant."], ["2005-12-06T00:00:00", "An Iranian C-130 Hercules airplane crashes into a ten-storey building in a civilian area of Tehran, the capital of Iran, killing all 94 people aboard and 34 residents of the building (128 total)."], ["2005-12-07T00:00:00", "The European Union TLD .eu is launched, and replaces .eu.int. Initially this will be only for business purposes. From 7 April 2006 onwards, EU citizens can also register .eu domains."], ["2005-12-11T00:00:00", "The 2005 Cronulla riots occur in Sydney, Australia, involving up to 5,000 youths."], ["2005-12-12T00:00:00", "Scientists announce that they have created mice with small amounts of human brain cells in an effort to make realistic models of neurological disorders."], ["2005-12-14T00:00:00", "Shakidor Dam fails in Pakistan due to heavy rain."], ["2005-12-16T00:00:00", "The 43rd Mersenne prime is found."], ["2005-12-18T00:00:00", "The Chadian Civil War (2005-10) begins."], ["2005-12-20T00:00:00", "Aleksandër Moisiu University is founded in Durrës, Albania."], ["2005-12-23T00:00:00", "Chad declares war on Sudan, following a December 18 attack on Adre, which left about 100 people dead."], ["2005-12-31T00:00:00", "Another second is added, 23:59:60, called a leap second, to end the year 2005. The last time this occurred was on June 30, 1998."]]