[["1990-01-01T00:00:00", "Poland becomes the first country in Eastern Europe to begin abolishing its state socialist economy. Poland also withdraws from the Warsaw Pact."], ["1990-01-01T00:00:00", "Glasgow begins its year as European Capital of Culture."], ["1990-01-01T00:00:00", "Rowan Atkinson's Mr. Bean debuts in a Thames Television special."], ["1990-01-03T00:00:00", "United States invasion of Panama: General Manuel Noriega, the deposed \"strongman of Panama\", surrenders to American forces."], ["1990-01-04T00:00:00", "Two trains collide in Sangi, Pakistan, killing between 200 and 300 people and injuring an estimated 700 others."], ["1990-01-07T00:00:00", "The Leaning Tower of Pisa is closed to the public because of safety concerns."], ["1990-01-09T00:00:00", "Ugandan Lt. Gen. Bazilio Olara-Okello, who led a coup against Dr. Apolo Milton Obote's government, dies in Ormduruman Hospital in Khartoum, Sudan."], ["1990-01-11T00:00:00", "Cold War: In Lithuania, 300,000 demonstrate for independence."], ["1990-01-15T00:00:00", "The National Assembly of Bulgaria votes to end one party rule by the Bulgarian Communist Party."], ["1990-01-15T00:00:00", "Thousands storm the Stasi headquarters in East Berlin in an attempt to view their government records."], ["1990-01-15T00:00:00", "Martin Luther King Day Crash - Telephone service in Atlanta, St. Louis, and Detroit, including 9-1-1 service, goes down for nine hours, due to an AT&T software bug."], ["1990-01-17T00:00:00", "Smith & Wesson introduce the .40 S&W cartridge."], ["1990-01-20T00:00:00", "Cold War: Soviet troops occupy Baku, Azerbaijan, under the state of emergency decree issued by Soviet premier Mikhail Gorbachev, and kill over 130 and wound over 700 protesters for national independence."], ["1990-01-20T00:00:00", "Clashes break out between Indian troops and Muslim separatists in Kashmir."], ["1990-01-20T00:00:00", "The government of Haiti declares a state of siege, under which it suspends civil liberties, imposes censorship, and arrests political opponents. The state of siege is lifted on January 29."], ["1990-01-22T00:00:00", "The League of Communists of Yugoslavia votes to give up its monopoly on power."], ["1990-01-22T00:00:00", "Robert Tappan Morris is convicted of releasing the Morris worm."], ["1990-01-25T00:00:00", "Avianca Flight 52 crashes into Cove Neck, Long Island, New York after a miscommunication between the flight crew and JFK Airport officials, killing 73 people on board."], ["1990-01-25T00:00:00", "Prime Minister of Pakistan Benazir Bhutto gives birth to a girl, becoming the first modern head of government to bear a child while in office."], ["1990-01-25T00:00:00", "Pope John Paul II begins an eight-day tour of Cape Verde, Guinea-Bissau, Mali, Burkina Faso, and Chad."], ["1990-01-27T00:00:00", "The city of Tiraspol in the Moldavian SSR briefly declares independence."], ["1990-01-28T00:00:00", "Four months after their exit from power, the Polish United Workers' Party votes to dissolve itself and reorganize itself as the Social Democracy of the Republic of Poland."], ["1990-01-29T00:00:00", "The trial of Joseph Hazelwood, former skipper of the Exxon Valdez, begins in Anchorage, Alaska. He is accused of negligence that resulted in America's second worst oil spill to date."], ["1990-01-29T00:00:00", "In Holmdel, New Jersey, scientists at Bell Labs announce they have created a digital optical processor that could lead to the development of superfast computers that use pulses of light rather than electric currents to make calculations."], ["1990-01-31T00:00:00", "Globalization - The first McDonald's in Moscow, Russia opens 8 months after construction began on 3 May 1989. 8 months later the first McDonald's in Mainland China is opened in Shenzhen."], ["1990-01-31T00:00:00", "Liberal Muslim Rashad Khalifa is murdered in Tucson, Arizona; his killer is theorized to be a member of an early al-Qaeda sleeper cell."], ["1990-01-31T00:00:00", "President of the United States George H. W. Bush gives his first State of the Union address and proposes that the U.S. and the Soviet Union make deep cuts to their military forces in Europe."], ["1990-02-02T00:00:00", "Apartheid in South Africa: F. W. de Klerk announces the unbanning of the African National Congress and promises to release Nelson Mandela."], ["1990-02-07T00:00:00", "The Communist Party of the Soviet Union votes to end its monopoly of power, clearing the way for multiparty elections."], ["1990-02-07T00:00:00", "In the Tajik Soviet Socialist Republic, rioting breaks out against the settlement of Armenian refugees there."], ["1990-02-10T00:00:00", "President of South Africa F. W. de Klerk announces that Nelson Mandela will be released the next day."], ["1990-02-10T00:00:00", "Las Cruces Bowling Alley massacre: 2 people walked into the 10 Pin Alley in Las Cruces, New Mexico, (known then as the Las Cruces Bowl) and shot seven people, four of whom were killed. The case is currently unsolved."], ["1990-02-11T00:00:00", "Nelson Mandela is released from Victor Verster Prison, near Cape Town, South Africa, after 27 years behind bars."], ["1990-02-12T00:00:00", "Representatives of NATO and the Warsaw Pact meet in Ottawa for an \"Open Skies\" conference. The conference results in agreements about superpower troop levels in Europe and on German reunification."], ["1990-02-13T00:00:00", "German reunification: An agreement is reached for a two-stage plan to reunite Germany."], ["1990-02-13T00:00:00", "Drexel Burnham Lambert files for bankruptcy protection, Chapter 11."], ["1990-02-14T00:00:00", "The Pale Blue Dot photograph of Earth is sent back from the Voyager 1 probe after completing its primary mission, from around 3.5 billion miles away."], ["1990-02-15T00:00:00", "The United Kingdom and Argentina restore diplomatic relations after 8 years. The UK had severed ties in response to Argentina's invasion of the Falkland Islands, a British Dependent Territory, in 1982."], ["1990-02-15T00:00:00", "In Cartagena, Colombia, a summit is held between President of the United States George H. W. Bush, President of Bolivia Jaime Paz Zamora, President of Colombia Virgilio Barco Vargas, and President of Peru Alan García. The leaders pledge additional cooperation in fighting international drug trafficking."], ["1990-02-26T00:00:00", "The Sandinistas are defeated in the Nicaraguan elections, with Violeta Chamorro elected as the new president of Nicaragua, replacing Daniel Ortega."], ["1990-02-26T00:00:00", "The USSR agrees to withdraw all 73,500 troops from Czechoslovakia by July, 1991."], ["1990-02-27T00:00:00", "Exxon Valdez oil spill: Exxon and its shipping company are indicted on 5 criminal counts."], ["1990-02-28T00:00:00", "President of Nicaragua Daniel Ortega announces a cease-fire with the U.S.-backed contras."], ["1990-03-01T00:00:00", "A fire at the Sheraton Hotel in Cairo, Egypt, kills 16 people."], ["1990-03-01T00:00:00", "Steve Jackson Games is raided by the U.S. Secret Service, prompting the later formation of the Electronic Frontier Foundation."], ["1990-03-01T00:00:00", "The Royal New Zealand Navy discontinues its daily rum ration."], ["1990-03-01T00:00:00", "Luis Alberto Lacalle, a grandson of the late politician and diplomat Luis Alberto de Herrera, is sworn in as President of Uruguay."], ["1990-03-03T00:00:00", "The International Trans-Antarctic Scientific Expedition, a group of six explorers from six nations, completes the first dog sled crossing of Antarctica."], ["1990-03-06T00:00:00", "An SR-71 sets a U.S. transcontinental speed record of 1 hour 8 minutes 17 seconds, on what is publicized as its last official flight."], ["1990-03-09T00:00:00", "Police seal off Brixton in South London after another night of protests against the poll tax."], ["1990-03-09T00:00:00", "Newfoundland Premier Clyde Wells confirms he will rescind Newfoundland's approval of the Meech Lake Accord."], ["1990-03-10T00:00:00", "Eighteen months after seizing power in a coup, Prosper Avril is ousted in Haiti."], ["1990-03-11T00:00:00", "Cold War: Lithuania declares independence from the Soviet Union with the Act of the Re-Establishment of the State of Lithuania."], ["1990-03-12T00:00:00", "Cold War: Soviet soldiers begin leaving Hungary under terms of an agreement to withdraw all Soviet troops by June 1."], ["1990-03-12T00:00:00", "Patricio Aylwin is sworn in as the first democratically elected Chilean president since 1970."], ["1990-03-13T00:00:00", "The Supreme Soviet of the Soviet Union approves changes to the Constitution of the Soviet Union to create a strong U.S.-style presidency. Mikhail Gorbachev is elected to a five-year term as the first-ever President of the Soviet Union on March 15."], ["1990-03-15T00:00:00", "Iraq hangs British journalist Farzad Bazoft for spying. Daphne Parish, a British nurse, is sentenced to 15 years' imprisonment as an accomplice."], ["1990-03-15T00:00:00", "Mikhail Gorbachev is elected as the first executive president of the Soviet Union."], ["1990-03-15T00:00:00", "Cold War: The Soviet Union announces that Lithuania's declaration of independence is invalid."], ["1990-03-15T00:00:00", "Fernando Collor de Mello takes office as President of Brazil, Brazil's first democratically elected president since Jânio Quadros in 1961. The next day, he announces a currency freeze and freezes large bank accounts for 18 months."], ["1990-03-18T00:00:00", "Twelve paintings, collectively worth $100 to $300 million, are stolen from the Isabella Stewart Gardner Museum in Boston, Massachusetts by 2 thieves posing as police officers. This is the largest art theft in US history, and the paintings (as of 2011) have not been recovered."], ["1990-03-18T00:00:00", "Cold War: East Germany holds its first free elections."], ["1990-03-20T00:00:00", "Ferdinand Marcos's widow, Imelda Marcos, goes on trial for bribery, embezzlement, and racketeering."], ["1990-03-21T00:00:00", "After 75 years of South African rule since World War I, Namibia becomes independent."], ["1990-03-24T00:00:00", "In the Australian federal election, the Australian Labor Party, led by Prime Minister of Australia Bob Hawke, clings to power with a reduced majority."], ["1990-03-25T00:00:00", "In New York City, a fire due to arson at an illegal social club called \"Happy Land\" kills 87."], ["1990-03-25T00:00:00", "Archbishop of Canterbury Robert Runcie announces his intention to retire at the end of the year."], ["1990-03-25T00:00:00", "In the Hungarian parliamentary election, Hungary's first multiparty election since 1948, the Hungarian Democratic Forum wins the most seats."], ["1990-03-26T00:00:00", "The 62nd Academy Awards, hosted by Billy Crystal, are held at the Dorothy Chandler Pavilion in Los Angeles, California, with Driving Miss Daisy winning Best Picture."], ["1990-03-27T00:00:00", "The United States begins broadcasting TV Martí to Cuba."], ["1990-03-28T00:00:00", "U.S. President George H. W. Bush posthumously awards Jesse Owens the Congressional Gold Medal."], ["1990-03-30T00:00:00", "After its first free elections on March 18, the Estonian SSR declares the Soviet rule to have been illegal since 1940 and declares a transition period for full independence."], ["1990-03-31T00:00:00", "\"The Second Battle of Trafalgar\": A massive anti-poll tax demonstration in Trafalgar Square, London, turns into a riot; 471 people are injured, and 341 are arrested."], ["1990-04-01T00:00:00", "The Community Charge (poll tax) takes effect in England and Wales amid widespread protests"], ["1990-04-01T00:00:00", "Strangeways Prison riot: The longest prison riot in Britain's history begins at Strangeways Prison in Manchester, and continues for 3 weeks and 3 days, until April 25."], ["1990-04-01T00:00:00", "The Ultimate Warrior defeats Hulk Hogan to win the WWF Championship in a Title for Title, winner takes all match at WrestleMania VI in front of nearly 68,000 people at the SkyDome in Toronto, Ontario."], ["1990-04-01T00:00:00", "The 1990 United States Census begins. There are 248,709,873 residents in the U.S."], ["1990-04-06T00:00:00", "Robert Mapplethorpe's \"The Perfect Moment\" show of nude and homoerotic photographs opens at the Cincinnati Contemporary Arts Center, in spite of accusations of indecency by Citizens for Community Values."], ["1990-04-07T00:00:00", "Iran-Contra affair: John Poindexter is found guilty of 5 charges for his part in the scandal; the convictions are later reversed on appeal."], ["1990-04-07T00:00:00", "Scandinavian Star, a Bahamas-registered ferry, catches fire en route from Norway to Denmark, leaving 158 dead."], ["1990-04-08T00:00:00", "In Nepal, Birendra of Nepal lifts a ban on political parties following violent protests."], ["1990-04-08T00:00:00", "In the Greek legislative election, the conservative New Democracy wins the most seats in the Hellenic Parliament; its leader, Konstantinos Mitsotakis, becomes Prime Minister of Greece on April 11."], ["1990-04-08T00:00:00", "In the Socialist Federal Republic of Yugoslavia, the Socialist Republic of Slovenia holds Yugoslavia's first multiparty election since 1938. After the election, a center-right coalition led by Lojze Peterle forms Yugoslavia's first non-Communist government since 1945."], ["1990-04-09T00:00:00", "Comet Austin, the brightest comet visible from Earth since 1975, makes its closest approach to the sun."], ["1990-04-12T00:00:00", "Lothar de Maizière becomes prime minister of East Germany, heading a conservative coalition that favors German reunification."], ["1990-04-13T00:00:00", "Cold War: The Soviet Union apologizes for the Katyn massacre."], ["1990-04-15T00:00:00", "Food poisoning kills 450 guests at an engagement party in Uttar Pradesh."]]