[["1960-01-22T00:00:00", "In France, President Charles de Gaulle fires Jacques Massu, the commander-in-chief of the French troops in Algeria."], ["1960-01-22T00:00:00", "Jacques Piccard and Don Walsh descend into the Mariana Trench in the bathyscaphe Trieste, reaching the depth of 10,911 meters (35,797 feet) and become the first human beings to reach the lowest spot on Earth."], ["1960-02-09T00:00:00", "Joanne Woodward receives the first star on the Hollywood Walk of Fame."], ["1960-02-09T00:00:00", "Adolph Coors III, the chairman of the board of the Coors Brewing Company, is kidnapped, and his captors demand a ransom of $500,000. Coors is later found murdered, and Joseph Corbett, Jr. is indicted for the crime."], ["1960-02-11T00:00:00", "The N-class blimp ZPG-3W of the U.S. Navy is destroyed during a storm over Massachusetts."], ["1960-02-11T00:00:00", "Twelve Indian soldiers die in clashes with Red Chinese troops along their small common border."], ["1960-03-02T00:00:00", "Lucille Ball files for divorce from husband Desi Arnaz after 19 years of marriage. The divorce ends the I Love Lucy franchise."], ["1960-03-03T00:00:00", "Elvis Presley returns home from Germany, after being away on military duty for 2 years."], ["1960-03-05T00:00:00", "Elvis Presley receives his honorable discharge from the U.S. Army."], ["1960-03-05T00:00:00", "Alberto Korda takes his iconic photograph of Che Guevara, Guerrillero Heroico, in Havana."], ["1960-03-06T00:00:00", "Vietnam War: The United States announces that 3,500 American soldiers will be sent to Vietnam."], ["1960-03-06T00:00:00", "The Canton of Geneva in Switzerland gives women the right to vote."], ["1960-04-01T00:00:00", "Tuanku Abdul Rahman ibni Almarhum Tuanku Muhammad, 1st Yang di-Pertuan Agong of Malaysia, dies in office. He is replaced by Hisamuddin Alam Shah ibni Almarhum Sultan Alaeddin Sulaiman Shah, Sultan of Selangor."], ["1960-04-01T00:00:00", "The United States launches the first weather satellite, TIROS-1."], ["1960-04-01T00:00:00", "The 1960 United States Census begins. There are 179,323,175 U.S. residents on this day. All people from Latin America are listed as white, including blacks from the Dominican Republic, European whites from Argentina and Mexicans who resemble Native Americans."], ["1960-04-04T00:00:00", "At the 32nd Academy Awards ceremony, Ben-Hur wins a record number of Oscars, including Best Picture."], ["1960-04-04T00:00:00", "Elvis Presley's song \"Are You Lonesome Tonight?\" is recorded for the first time."], ["1960-04-13T00:00:00", "United States launches navigation satellite Transit I-b."], ["1960-04-13T00:00:00", "The proposed mass-production of the Blue Streak missile is cancelled."], ["1960-05-01T00:00:00", "Several Soviet surface-to-air missiles shoot down an American Lockheed U-2 spy plane. Its pilot, Francis Gary Powers of the Central Intelligence Agency, is captured."], ["1960-05-01T00:00:00", "In India, May 2 is declared as 'Maharashtra Divas', i.e., Maharashtra Day (also celebrated as 'Kaamgaar Divas', i.e., Workers Day)."], ["1960-05-03T00:00:00", "The European Free Trade Association (EFTA) is established."], ["1960-05-03T00:00:00", "The Fantasticks, the world's longest-running musical, opens at New York City's Sullivan Street Playhouse, where it will play for 42 years."], ["1960-05-04T00:00:00", "West German refugee minister Theodor Oberländer is fired because of his past with Nazi Germany."], ["1960-05-04T00:00:00", "A. J. Liebling promulgates Liebling's Law in The New Yorker magazine: \"Freedom of the press is guaranteed only to those who own one.\""], ["1960-05-16T00:00:00", "Soviet premier Nikita Khrushchev demands an apology from President Dwight D. Eisenhower for the U-2 reconnaissance plane flights over the Soviet Union, thus aborting the summit meeting scheduled for Paris in 1960."], ["1960-05-16T00:00:00", "Theodore Maiman operates the first laser."], ["1960-05-18T00:00:00", "Real Madrid beats Eintracht Frankfurt 7-3 at Hampden Park, Glasgow and wins the 1959-60 European Cup (football)."], ["1960-06-15T00:00:00", "Violent demonstrations at Tokyo University result in 182 arrests, 589 injuries."], ["1960-06-15T00:00:00", "The BC Ferries company, later to become the second-largest ferry operator in the world, commences service between Tsawwassen and Swartz Bay, British Columbia, Canada."], ["1960-06-26T00:00:00", "The State of Somaliland (the former British Somaliland protectorate) receives its independence from the United Kingdom. Five days later, it unites as scheduled with the Trust Territory of Somalia (the former Italian Somaliland) to form the Somali Republic."], ["1960-06-26T00:00:00", "The Malagasy Republic, now Madagascar, becomes independent from France."], ["1960-06-30T00:00:00", "The Belgian Congo receives its independence from Belgium as the Republic of the Congo (Léopoldville). A civil war follows closely on the heels of this."], ["1960-06-30T00:00:00", "Public demonstrations by democratic and left forces, against Italian government support of the post-fascist Italian Social Movement, are heavily suppressed by police."], ["1960-07-01T00:00:00", "Ghana becomes a republic and Kwame Nkrumah becomes its first President."], ["1960-07-01T00:00:00", "Cold War: A Soviet Air Force MiG-19 fighter plane flying north of Murmansk, Russia, over the Barents Sea shoots down a six-man RB-47 Stratojet reconnaissance plane of the U.S. Air Force. Four of the U.S. Air Force officers are killed, and the two survivors are held prisoner in the Soviet Union."], ["1960-07-01T00:00:00", "The Trust Territory of Somalia (the former Italian Somaliland) gains its independence from Italy. Concurrently, it unites as scheduled with the five-day-old State of Somaliland (the former British Somaliland) to form the Somali Republic."], ["1960-07-11T00:00:00", "Congo Crisis: Moise Tshombe declares the Congolese province of Katanga independent. He requests and receives help from Belgium."], ["1960-07-11T00:00:00", "Harper Lee publishes her novel To Kill a Mockingbird, which later wins the Pulitzer Prize for the best American novel of 1960."], ["1960-08-06T00:00:00", "Cuban Revolution: In response to a United States embargo against Cuba, Fidel Castro nationalizes all American and foreign-owned property in Cuba."], ["1960-08-06T00:00:00", "In the Republic of the Congo (Léopoldville), now the Democratic Republic of the Congo, Albert Kalonji declares the independence of the \"Autonomous State of South Kasai\"."], ["1960-08-07T00:00:00", "The world's first standard gauge passenger preserved railway, The Bluebell Railway, opens to the public."], ["1960-08-16T00:00:00", "Joseph Kittinger parachutes from a balloon over New Mexico at an aititude of about 102,800 feet (31,333 meters). Kittinger sets world records for: high-altitude jump; free-fall by falling 16.0 miles (25.7 kilometers) before opening his parachute; and the fastest speed attained by a human being without mechanical or chemical assistance, about 982 k.p.h (614 m.p.h.). (Kittinger survives more or less uninjured, and he is still alive in Florida as of 2013. Felix Baumgartner breaks his record in 2012.)"], ["1960-08-16T00:00:00", "The Mediterranean island of Cyprus receives its independence from the United Kingdom."], ["1960-08-17T00:00:00", "The newly named Beatles begin a 48-night residency at the Indra club in Hamburg, West Germany."], ["1960-08-17T00:00:00", "Gabon becomes independent from France."], ["1960-08-17T00:00:00", "The trial of the American U-2 pilot Francis Gary Powers begins in Moscow."], ["1960-08-19T00:00:00", "Cold War: In Moscow, American U-2 pilot Francis Gary Powers is sentenced to 10 years in prison for espionage."], ["1960-08-19T00:00:00", "Sputnik program: The Soviet Union launches the satellite Sputnik 5, with the dogs Belka and Strelka (the Russian for \"Squirrel\" and \"Little Arrow\"), 40 mice, two rats and a variety of plants. This satellite returns to earth the next day and all animals are recovered safely."], ["1960-08-25T00:00:00", "The 1960 Summer Olympic Games begin in Rome."], ["1960-08-25T00:00:00", "The American nuclear submarine USS Seadragon (SSN-584) surfaces through the arctic ice cap at the North Pole, the first submarine ever to do so."], ["1960-09-01T00:00:00", "Sultan Hisamuddin Alam Shah, Sultan of Selangor and 2nd Yang di-Pertuan Agong of Malaysia, dies in office. He is replaced by Tuanku Syed Putra, Raja of Perlis."], ["1960-09-01T00:00:00", "Disgruntled railroad workers effectively halt operations of the Pennsylvania Railroad, marking the first shutdown in the company's history (the event lasts two days)."], ["1960-09-05T00:00:00", "1960 Summer Olympic Games: Muhammad Ali (then Cassius Clay) wins the gold medal in light-heavyweight boxing."], ["1960-09-05T00:00:00", "The Congolese president, Joseph Kasa-Vubu, fires Patrice Lumumba's entire government, and also places Lumumba under house arrest."], ["1960-09-14T00:00:00", "Colonel Joseph Mobutu takes power in Republic of the Congo via a military coup."], ["1960-09-14T00:00:00", "The countries of Iran, Iraq, Kuwait, Saudi Arabia, and Venezuela form OPEC."], ["1960-10-01T00:00:00", "Nigeria becomes independent from United Kingdom, and Nnamdi Azikiwe becomes its first native-born Governor General."], ["1960-10-01T00:00:00", "Cameroon declares independence from United Kingdom."], ["1960-10-12T00:00:00", "Cold War: Soviet premier Nikita Khrushchev pounds his shoe on a table at a meeting of the United Nations General Assembly, his way of protesting the discussion of the Soviet Union's policies toward Eastern Europe."], ["1960-10-12T00:00:00", "Otoya Yamaguchi assassinates Inejiro Asanuma, the chairman of the Japanese Socialist Party."], ["1960-10-13T00:00:00", "The third John F. Kennedy – Richard M. Nixon Presidential Debate takes place."], ["1960-10-13T00:00:00", "The Pittsburgh Pirates defeat the New York Yankees in the seventh game of the World Series on Bill Mazeroski's series-clinching home run."], ["1960-11-14T00:00:00", "Belgium threatens to leave the United Nations over criticism of its policy concerning the Republic of the Congo."], ["1960-11-14T00:00:00", "A collision between two trains in Pardubice, Czechoslovakia, kills 117 people."], ["1960-12-01T00:00:00", "Patrice Lumumba, deposed premier of the Republic of the Congo, is arrested by the troops of Colonel Joseph Mobutu."], ["1960-12-01T00:00:00", "A Soviet satellite containing live animals and plants is launched into orbit. Due to a malfunction it burns up during re-entry."], ["1960-12-02T00:00:00", "The Archbishop of Canterbury, the Most Rev. Geoffrey Francis Fisher, talks with Pope John XXIII for about one hour in Vatican City. This is the first time that any chief of the Anglican Church had ever visited the Pope."], ["1960-12-02T00:00:00", "U.S. President Dwight D. Eisenhower authorizes the use of $1.0 million for the relief and resettlement of Cuban refugees, who had been arriving in Florida at the rate of about 1,000 per week."], ["1960-12-05T00:00:00", "Pierre Lagaillarde, who led the insurrections in 1958 and 1960 in Algeria, fails to appear in court in Paris, France. He had reportedly fled with his four fellow defendants to Spain en route to Algeria."], ["1960-12-05T00:00:00", "Boynton v. Virginia: The Supreme Court of the United States declares that segregation in public transportation is illegal in the United States."], ["1960-12-09T00:00:00", "French President Charles de Gaulle's visit to Algeria is bloodied by European and Muslim rioters in Algeria's largest cities. These riots cause 127 deaths."], ["1960-12-09T00:00:00", "The classic British TV series Coronation Street premieres. Planned as a 13-part drama, it becomes such a success among viewers it continues to be shown five times per week through 2012."], ["1960-12-13T00:00:00", "While Emperor Haile Selassie I of Ethiopia visits Brazil, his Imperial Bodyguard leads a military coup against his rule, proclaiming that the emperor's son, Crown Prince Asfa Wossen, is the new emperor."], ["1960-12-13T00:00:00", "The countries of El Salvador, Guatemala, Honduras, and Nicaragua announce the formation of the Central American Common Market."], ["1960-12-13T00:00:00", "The U.S. Navy's Commander Leroy Heath (pilot) and Lieutenant Larry Monroe (bombardier/navigator) establish a world flight-altitude record of 91,450 feet (27,874 m), with payload, in an A-5 Vigilante bomber carrying 1,000 kg (2,200 lb), and better the previous world record by over four miles (6 km)."], ["1960-12-14T00:00:00", "Antoine Gizenga proclaims in the Democratic Republic of the Congo that he has taken over as the country's premier."], ["1960-12-14T00:00:00", "First tied Test by the West Indian cricket team in Australia in Brisbane."], ["1960-12-15T00:00:00", "King Mahendra of Nepal deposes the democratic government in his country and takes direct control himself."], ["1960-12-15T00:00:00", "King Baudouin of Belgium marries Doña Fabiola de Mora y Aragón."], ["1960-12-16T00:00:00", "Secretary of State Christian Herter announces that the United States will commit five nuclear submarines and eighty Polaris missiles to the defense of the NATO countries by the end of 1963."], ["1960-12-16T00:00:00", "New York mid-air collision: A United Airlines DC-8 collides in mid-air with a TWA Lockheed Constellation over Staten Island in New York City. All 128 passengers and crewmembers on the two airliners, and six people on the ground, are killed."], ["1960-01-04T00:00:00", "Art Paul Schlosser, American comedian,singer and song writer"], ["1960-01-04T00:00:00", "Michael Stipe, American rock singer (R.E.M.)"], ["1960-01-06T00:00:00", "Kari Jalonen, Finnish ice hockey player"], ["1960-01-06T00:00:00", "Howie Long, American football player"], ["1960-01-06T00:00:00", "Miriam O'Callaghan, Irish television current affairs broadcaster"], ["1960-01-10T00:00:00", "Brian Cowen, Taoiseach of Ireland"], ["1960-01-10T00:00:00", "Samira Said, Moroccan singer"], ["1960-01-12T00:00:00", "Oliver Platt, Canadian actor"], ["1960-01-12T00:00:00", "Dominique Wilkins, American basketball player"], ["1960-01-21T00:00:00", "Toxey Haas, American entrepreneur, founder of Haas Outdoors, Inc."], ["1960-01-21T00:00:00", "Mamoru Nagano, Japanese designer"], ["1960-01-24T00:00:00", "Rick Leventhal, American news journalist"], ["1960-01-24T00:00:00", "Mária Bajzek Lukács, Hungarian Slovene writer, adjunct of the University ELTE"], ["1960-01-26T00:00:00", "Charlie Gillingham, American keyboardist"], ["1960-01-29T00:00:00", "Gia Carangi, American model (d. 1986)"], ["1960-01-29T00:00:00", "Sean Kerly, British field hockey player"], ["1960-01-29T00:00:00", "Greg Louganis, American diver"], ["1960-02-03T00:00:00", "Joachim Löw, German football manager"], ["1960-02-03T00:00:00", "Kerry Von Erich, American professional wrestler (d. 1993)"], ["1960-02-07T00:00:00", "Yasunori Matsumoto, Japanese voice actor"], ["1960-02-07T00:00:00", "Robert Smigel, American actor, comedian, and puppeteer"], ["1960-02-07T00:00:00", "James Spader, American actor"], ["1960-02-08T00:00:00", "Benigno Aquino III, 15th President of the Philippines"], ["1960-02-09T00:00:00", "Frederik Ndoci, Albanian singer, songwriter, poet, writer, actor and international Recording artist"], ["1960-02-13T00:00:00", "Pierluigi Collina, Italian football (soccer) referee"], ["1960-02-13T00:00:00", "Gary Patterson, American football coach"], ["1960-02-20T00:00:00", "Wendee Lee, American voice actress"], ["1960-02-21T00:00:00", "Henry G. Brinton, American writer and minister"], ["1960-02-21T00:00:00", "Laurent Petitguillaume, French radio and television host"], ["1960-02-28T00:00:00", "Tōru Ōkawa, Japanese voice actor"], ["1960-02-28T00:00:00", "Dorothy Stratten, Canadian model and actress (d. 1980)"], ["1960-03-04T00:00:00", "Mikko Kuustonen, Finnish singer and songwriter"], ["1960-03-04T00:00:00", "John Mugabi, Ugandan boxer and World Junior Middleweight champion"], ["1960-03-07T00:00:00", "Joe Carter, American baseball player"], ["1960-03-07T00:00:00", "Ivan Lendl, Czech tennis player"], ["1960-03-08T00:00:00", "Finn Carter, American actress"], ["1960-03-08T00:00:00", "Jeffrey Eugenides, American author"], ["1960-03-13T00:00:00", "Adam Clayton, Irish rock bassist (U2)"], ["1960-03-13T00:00:00", "Joe Ranft, American animator (d. 2005)"], ["1960-03-20T00:00:00", "Roxanne Kernohan, Canadian actress (d. 1993)"], ["1960-03-20T00:00:00", "Norm Magnusson, American artist"], ["1960-03-24T00:00:00", "Annabella Sciorra, Italian-American actress"], ["1960-03-24T00:00:00", "Jan Berglin, Swedish cartoonist"], ["1960-03-24T00:00:00", "Nena, German singer"], ["1960-03-27T00:00:00", "Hans Pflügler, German footballer"], ["1960-03-27T00:00:00", "Renato Russo, Brazilian singer (Legião Urbana) (d. 1996)"], ["1960-04-16T00:00:00", "Wahab Akbar, Filipino politician (d. 2007)"], ["1960-04-16T00:00:00", "Rafael Benítez, Spanish football manager"], ["1960-04-16T00:00:00", "Pierre Littbarski, German footballer and coach"], ["1960-04-18T00:00:00", "Neo Rauch, German painter"], ["1960-04-18T00:00:00", "J. Christopher Stevens, American diplomat, U.S. Ambassador to Libya (d. 2012)"], ["1960-04-23T00:00:00", "Valerie Bertinelli, American actress"], ["1960-04-23T00:00:00", "Steve Clark, English guitarist (Def Leppard) (d. 1991)"], ["1960-04-23T00:00:00", "David Gedge, English musician (The Wedding Present and Cinerama)"], ["1960-04-23T00:00:00", "Léo Jaime, Brazilian writer, actor and musician (João Penca e Seus Miquinhos Amestrados)"], ["1960-04-23T00:00:00", "Claude Julien, Canadian ice hockey coach"], ["1960-04-28T00:00:00", "Steven Blum, American voice actor"], ["1960-04-28T00:00:00", "John Cerutti, American baseball player and announcer (d. 2004)"], ["1960-04-28T00:00:00", "Ian Rankin, Scottish crime novelist"], ["1960-05-04T00:00:00", "Andrew Denton, Australian television presenter and comedian"], ["1960-05-04T00:00:00", "Werner Faymann, Chancellor of Austria"], ["1960-05-14T00:00:00", "Ronan Tynan, Irish tenor"], ["1960-05-14T00:00:00", "\"Dr. Death\" Steve Williams, American professional wrestler (d. 2009)"], ["1960-05-17T00:00:00", "John Payne, British voice actor"], ["1960-05-18T00:00:00", "Jari Kurri, Finnish hockey player"], ["1960-05-18T00:00:00", "Yannick Noah, French tennis player"], ["1960-05-20T00:00:00", "John Billingsley, American actor"], ["1960-05-20T00:00:00", "Tony Goldwyn, American actor, voice actor, and film director"], ["1960-05-24T00:00:00", "Guy Fletcher, British keyboardist (Dire Straits)"], ["1960-05-24T00:00:00", "Kristin Scott Thomas, English actress"], ["1960-05-29T00:00:00", "Thomas Baumer, Swiss economist, interculturalist and personality assessor"], ["1960-05-29T00:00:00", "Neil Crone, Canadian actor"], ["1960-07-03T00:00:00", "Vince Clarke, British musician and composer (Depeche Mode, Erasure)"], ["1960-07-03T00:00:00", "Perrine Pelen, French alpine skier"], ["1960-07-14T00:00:00", "Kyle Gass, American music singer-song-writer-guitarist/actor"], ["1960-07-14T00:00:00", "Jane Lynch, American actress"], ["1960-07-17T00:00:00", "Robin Shou, Hong Kong actor"], ["1960-07-17T00:00:00", "Jan Wouters, Dutch football player and manager"], ["1960-07-19T00:00:00", "Atom Egoyan, Armenian-Canadian film maker"], ["1960-07-19T00:00:00", "Terrie Hall, American anti-smoking and tobacco advocate"], ["1960-07-21T00:00:00", "Ezequiel Viñao, Argentine-born composer"], ["1960-07-21T00:00:00", "Fritz Walter, German footballer"], ["1960-08-04T00:00:00", "Dean Malenko, American professional wrestler"], ["1960-08-04T00:00:00", "José Luis Rodríguez Zapatero, Prime Minister of Spain"], ["1960-08-10T00:00:00", "Antonio Banderas, Spanish actor"], ["1960-08-10T00:00:00", "Kenny Perry, American golfer"], ["1960-08-13T00:00:00", "Koji Kondo, Japanese composer"], ["1960-08-13T00:00:00", "Phil Taylor, English darts player"], ["1960-08-16T00:00:00", "Timothy Hutton, American actor"], ["1960-08-16T00:00:00", "Martha Moxley, American murder victim (d. 1975)"], ["1960-08-26T00:00:00", "Branford Marsalis, African-American musician"], ["1960-08-26T00:00:00", "Ola Ray, American actress and model"], ["1960-09-04T00:00:00", "Damon Wayans, African-American actor and comedian"], ["1960-09-05T00:00:00", "Karita Mattila, Finnish soprano"], ["1960-09-09T00:00:00", "Mario Batali, American chef and host"], ["1960-09-09T00:00:00", "Hugh Grant, English actor and activist"], ["1960-09-14T00:00:00", "Melissa Leo, American actress"], ["1960-09-14T00:00:00", "Callum Keith Rennie, Canadian actor"], ["1960-09-16T00:00:00", "John Franco, American baseball player"], ["1960-09-16T00:00:00", "Yianna Katsoulos, French singer"], ["1960-10-04T00:00:00", "Ana Patricia Botín, Spanish banker"], ["1960-10-04T00:00:00", "Billy Hatcher, American baseball player"], ["1960-10-18T00:00:00", "Alex Ferrer, Cuban-American television personality, lawyer, and retired judge who presided as the arbiter on Judge Alex"], ["1960-10-18T00:00:00", "Jean-Claude Van Damme, Belgian actor"], ["1960-10-24T00:00:00", "Jaime Garzón, Colombian journalist and comedian (d. 1999)"], ["1960-10-24T00:00:00", "BD Wong, American actor"], ["1960-11-03T00:00:00", "Francis Beckwith, American philosopher"], ["1960-11-03T00:00:00", "Karch Kiraly, American volleyball player"], ["1960-11-19T00:00:00", "Hiroshi Naka, Japanese voice actor"], ["1960-11-25T00:00:00", "Amy Grant, American Christian and pop musician"], ["1960-11-25T00:00:00", "John F. Kennedy Jr., American lawyer, journalist and son of 35th President John F. Kennedy (d. 1999)"], ["1960-11-25T00:00:00", "Kasey Smith, American keyboardist (Danger Danger)"], ["1960-11-27T00:00:00", "Tim Pawlenty, American politician"], ["1960-11-27T00:00:00", "Yulia Tymoshenko, Prime Minister of Ukraine"], ["1960-11-30T00:00:00", "Rich Fields, American television personality"], ["1960-11-30T00:00:00", "Gary Lineker, English footballer and sports presenter"], ["1960-12-03T00:00:00", "Daryl Hannah, American actress"], ["1960-12-03T00:00:00", "Julianne Moore, American actress"], ["1960-12-10T00:00:00", "Kenneth Branagh, Northern Irish actor and director"], ["1960-12-10T00:00:00", "Michael Schoeffling, American actor and model"], ["1960-12-17T00:00:00", "Tarako, Japanese voice actress"], ["1960-12-19T00:00:00", "Mike Lookinland, former American actor"], ["1960-12-24T00:00:00", "Charles Ng - Chinese-American serial killer"], ["1960-12-24T00:00:00", "Carol Vorderman, British television presenter"], ["1960-12-27T00:00:00", "Maryam d'Abo, British actress"], ["1960-12-27T00:00:00", "Fred Hammond, African-American gospel musician"], ["1960-12-28T00:00:00", "Ray Bourque, Canadian ice hockey player"], ["1960-12-28T00:00:00", "John Fitzgerald, Australian tennis player"], ["1960-12-31T00:00:00", "Steve Bruce, English footballer"], ["1960-12-31T00:00:00", "John Allen Muhammad, African-American spree killer (d. 2009)"], ["1960-01-04T00:00:00", "Albert Camus, French writer, Nobel Prize winner (b. 1913)"], ["1960-01-04T00:00:00", "Dudley Nichols, American screenwriter (b. 1895)"], ["1960-01-24T00:00:00", "Matt Moore, Irish-American actor (b. 1888)"], ["1960-01-24T00:00:00", "Edwin Fischer, Swiss pianist and conductor (b. 1886)"], ["1960-01-24T00:00:00", "John Miljan, American actor (b. 1892)"], ["1960-01-25T00:00:00", "Diana Barrymore, American stage & film actress (b. 1921)"], ["1960-01-25T00:00:00", "Beno Gutenberg, German-American seismologist (b. 1889)"], ["1960-02-20T00:00:00", "Leonard Woolley, English archaeologist (b. 1880)"], ["1960-02-20T00:00:00", "Adone Zoli, Italian politician, former Prime Minister (b. 1887)"], ["1960-02-29T00:00:00", "Jacques Becker, French director (b. 1906)"], ["1960-02-29T00:00:00", "Edwina Mountbatten, Countess Mountbatten of Burma (b. 1901), last Vicereine of India"], ["1960-02-29T00:00:00", "Melvin Purvis, American lawman (b. 1903)"], ["1960-02-29T00:00:00", "Walter Yust, American encyclopedia editor (b. 1894)"], ["1960-04-05T00:00:00", "Cuthbert Burnup, English sportsman (b. 1875)"], ["1960-04-05T00:00:00", "Peter Llewelyn Davies, namesake for Peter Pan (b. 1897)"], ["1960-04-05T00:00:00", "Alma Kruger, American actress (b. 1868)"], ["1960-04-24T00:00:00", "Max von Laue, German physicist, Nobel Prize laureate (b. 1879)"], ["1960-04-24T00:00:00", "George Relph, English actor (b. 1888)"], ["1960-04-25T00:00:00", "Hope Emerson, American actress (b. 1897)"], ["1960-04-25T00:00:00", "Amānullāh Khān, former Afghan Emir and King (b. 1892)"], ["1960-05-27T00:00:00", "Edward Brophy, American actor (b. 1895)"], ["1960-05-27T00:00:00", "James Montgomery Flagg, American artist and illustrator (b. 1877)"], ["1960-05-27T00:00:00", "George Zucco, English actor (b. 1886)"], ["1960-06-04T00:00:00", "Józef Haller de Hallenburg, Polish general (b. 1873)"], ["1960-06-04T00:00:00", "Lucien Littlefield, American actor (b. 1895)"], ["1960-06-20T00:00:00", "William E. Fairbairn, English soldier, police officer, and hand-to-hand combat expert (b. 1885)"], ["1960-06-20T00:00:00", "John B. Kelly Sr., American Olympic rower, father of Grace Kelly (b. 1889)"], ["1960-07-15T00:00:00", "Anton Giulio Bragaglia, Italian cinematographer (b. 1890)"], ["1960-07-15T00:00:00", "Set Persson, Swedish politician (b. 1897)"], ["1960-07-15T00:00:00", "Lawrence Tibbett, American opera singer and actor (b. 1896)"], ["1960-07-16T00:00:00", "Albert Kesselring, German field marshal (b. 1885)"], ["1960-07-16T00:00:00", "John P. Marquand, American novelist (b. 1893)"], ["1960-08-14T00:00:00", "Fred Clarke, American baseball player (Pittsburgh Pirates) and a member of the MLB Hall of Fame (b. 1872)"], ["1960-08-22T00:00:00", "Eduard Pütsep, Estonian wrestler (b. 1898)"], ["1960-08-22T00:00:00", "Johannes Sikkar, Estonian politician (b. 1897)"], ["1960-08-23T00:00:00", "Jersey Flegg, English-Australian rugby league player and chairman (b. 1878)"], ["1960-08-23T00:00:00", "Oscar Hammerstein II, American librettist (b. 1895)"], ["1960-09-08T00:00:00", "Feroze Gandhi, Indian politician (b. 1912)"], ["1960-09-08T00:00:00", "Oscar Pettiford, American jazz musician (b. 1922)"], ["1960-10-15T00:00:00", "Henny Porten, German actress (b. 1890)"], ["1960-10-15T00:00:00", "Clara Kimball Young, American actress (b. 1890)"], ["1960-10-24T00:00:00", "Yevgeny Ostashev, was the test pilot of rocket and space complexes, head of the 1st control polygon NIIP-5 (Baikonur), Lenin prize winner, Candidate of Technical Sciences, engineer-Lieutenant Colonel.(b. 1924)"], ["1960-11-03T00:00:00", "Bobby Wallace, American baseball player (St. Louis Browns) and a member of the MLB Hall of Fame (b. 1873)"], ["1960-11-05T00:00:00", "Ward Bond, American actor (b. 1903)"], ["1960-11-05T00:00:00", "August Gailit, Estonian writer (b. 1891)"], ["1960-11-05T00:00:00", "Johnny Horton, American country singer (b. 1925)"], ["1960-11-05T00:00:00", "Mack Sennett, Canadian film producer and director (b. 1880)"], ["1960-11-28T00:00:00", "Richard Wright, American novelist (b. 1908)"], ["1960-11-28T00:00:00", "Dirk Jan de Geer, Prime Minister of the Netherlands (b. 1870)"], ["1960-12-26T00:00:00", "Giuseppe Bellanca, Italian-American aircraft designer and company founder (b. 1886)"], ["1960-12-26T00:00:00", "Watsuji Tetsuro, Japanese philosopher (b. 1889)"]]