[["1992-01-01T00:00:00", "The Atari 2600 is finally discontinued 15 years after its introduction in September 1977"], ["1992-01-01T00:00:00", "Boutros Boutros-Ghali of Egypt replaces Javier Pérez de Cuéllar of Peru as United Nations Secretary-General."], ["1992-01-01T00:00:00", "George H. W. Bush becomes the first U.S. President to address the Australian Parliament."], ["1992-01-02T00:00:00", "President of Russia Boris Yeltsin ends price controls, resulting in prices of some goods and services becoming 3 to 5 times more expensive. This in effect ends the command economy in Russia."], ["1992-01-06T00:00:00", "The Nagorno-Karabakh Republic is proclaimed by the Armenians of Nagorno-Karabakh."], ["1992-01-07T00:00:00", "The Yugoslav Air Force downs a helicopter, killing 5 military observers from the European Community."], ["1992-01-08T00:00:00", "George H. W. Bush is televised falling violently ill at a state dinner in Japan, vomiting into the lap of Prime Minister Kiichi Miyazawa and fainting."], ["1992-01-09T00:00:00", "Bosnian Serbs declare their own republic within Bosnia and Herzegovina, in protest of the decision by Bosniaks and Bosnian Croats to seek EC recognition."], ["1992-01-11T00:00:00", "Singer Paul Simon is the first major artist to tour South Africa after the end of the cultural boycott."], ["1992-01-11T00:00:00", "Shanda Sharer is tortured and burned to death in Madison, Indiana by 4 teenage girls."], ["1992-01-12T00:00:00", "The second round of Algeria's general elections is cancelled when the first round is favorable to the Islamic Salvation Front."], ["1992-01-13T00:00:00", "Japan apologizes for forcing Korean women into sexual slavery during World War II."], ["1992-01-15T00:00:00", "The Socialist Federal Republic of Yugoslavia begins to break up. Slovenia and Croatia gain independence and international recognition in some Western countries."], ["1992-01-16T00:00:00", "El Salvador officials and rebel leaders sign a pact in Mexico City ending a 12-year civil war that claimed at least 75,000 lives."], ["1992-01-18T00:00:00", "In Nairobi, Kenya, more than 100,000 attend protests demanding an end to one-party rule by the Kenya African National Union."], ["1992-01-19T00:00:00", "The Bulgarian presidential election is won by Zhelyu Zhelev, leader of the Union of Democratic Forces."], ["1992-01-20T00:00:00", "Cuba executes Eduardo Diaz Betancourt, who was found guilty of sabotage and terrorism."], ["1992-01-21T00:00:00", "Faced with decreased military spending, United Technologies Corporation announces it will eliminate 13,900 jobs by 1993."], ["1992-01-22T00:00:00", "Rebel forces occupy Zaire's national radio station in Kinshasa and broadcast a demand for the government's resignation."], ["1992-01-22T00:00:00", "STS-42: Dr. Roberta Bondar becomes the first Canadian woman in space, aboard Space Shuttle Discovery."], ["1992-01-24T00:00:00", "In El Salvador, an army colonel and a lieutenant of the Atlacatl Battalion are each sentenced to 30 years in prison for the 1989 murder of six Jesuit priests and their housekeepers."], ["1992-01-24T00:00:00", "China and Israel establish diplomatic relations."], ["1992-01-26T00:00:00", "Boris Yeltsin announces that Russia will stop targeting cities of the United States and her allies with nuclear weapons. In return George H. W. Bush announces that the United States and her allies will stop targeting Russia and the remaining communist states with nuclear weapons."], ["1992-01-26T00:00:00", "In Mauritania, security forces open fire on opponents of President of Mauritania Maaouya Ould Sid'Ahmed Taya, killing at least 5 people."], ["1992-01-27T00:00:00", "Macy's files for bankruptcy."], ["1992-01-27T00:00:00", "Nagorno-Karabakh War: in the disputed territory of Nagorno-Karabakh, fighting between Armenians and Azeris leaves at least 60 people dead."], ["1992-01-30T00:00:00", "North Korea signs an accord with the International Atomic Energy Agency allowing for international inspections of North Korea's nuclear power plants."], ["1992-01-31T00:00:00", "The heads of state of the 5 permanent members of the United Nations Security Council, and of most of the temporary members, meet in New York City to discuss the new world order in the post-Cold War world."], ["1992-02-01T00:00:00", "President of the United States George H. W. Bush meets with President of Russia Boris Yeltsin at Camp David, where they formally declare that the Cold War is over."], ["1992-02-01T00:00:00", "The United States Coast Guard begins deporting the first of some 14,000 refugees from Haiti."], ["1992-02-04T00:00:00", "In Venezuela, Hugo Chávez leads an unsuccessful coup attempt against President of Venezuela Carlos Andrés Pérez."], ["1992-02-06T00:00:00", "The United States Senate approves a measure calling for the faster phase-out of chlorofluorocarbons under the revised Montreal Protocol; the phase-out is later completed in 2000."], ["1992-02-07T00:00:00", "The Maastricht Treaty is signed, founding the European Union."], ["1992-02-08T00:00:00", "The opening ceremony for the 1992 Winter Olympics is held in Albertville, France."], ["1992-02-09T00:00:00", "Algerian Civil War: The government of Algeria declares a state of emergency and begins a crackdown on the Islamic Salvation Front."], ["1992-02-10T00:00:00", "Boxer Mike Tyson, the former undisputed heavyweight champion of the world, is found guilty of raping 18-year-old Desiree Washington, Miss Black Rhode Island, by a jury in Indianapolis. On March 26, he is sentenced to 6 years in prison."], ["1992-02-11T00:00:00", "An F-16 jet crashes into a residential district of Hengelo, the Netherlands; no casualties are reported."], ["1992-02-14T00:00:00", "Ukraine and 4 other nations in the Commonwealth of Independent States reject Russia's proposal to maintain unified armed forces. Ukraine, Moldova, and Azerbaijan announce they will go ahead with plans to create their own armed forces."], ["1992-02-16T00:00:00", "In Lebanon, Israeli helicopter gunships assassinate Abbas al-Musawi, the leader of Hezbollah, and his son, in retaliation for a February 14 raid that killed 3 Israeli soldiers."], ["1992-02-17T00:00:00", "A court in Milwaukee, Wisconsin sentences serial killer Jeffrey Dahmer to life in prison."], ["1992-02-18T00:00:00", "Iraq disarmament crisis: The Executive Chairman of UNSCOM details Iraq's refusal to abide by UN Security Council disarmament resolutions."], ["1992-02-18T00:00:00", "The New Hampshire primary is won by Paul Tsongas on the Democratic side; for the Republicans, Pat Buchanan has a surprisingly strong showing (37%) against incumbent president George H. W. Bush."], ["1992-02-21T00:00:00", "The United Nations Security Council approves Resolution 743 to send a UNPROFOR peacekeeping force to Yugoslavia."], ["1992-02-23T00:00:00", "The closing ceremony of the 1992 Winter Olympics is held in Albertville."], ["1992-02-25T00:00:00", "February 26 - 613 Azerbaijani civilians are massacred in Khojaly."], ["1992-02-26T00:00:00", "The Supreme Court of Ireland rules that a 14-year-old rape victim may travel to England to have an abortion."], ["1992-02-27T00:00:00", "In Albuquerque, New Mexico, 79 year-old Stella Liebeck is burned by a cup of coffee at a McDonald's located near the city."], ["1992-03-01T00:00:00", "The first victims of the Bosnian War are a Serb groom's father and an Orthodox priest in a Sarajevo shooting. The Bosnian independence referendum was held from February 29-March 1, in which the majority of the Bosniak and Bosnian Croat communities, boycotted by the Bosnian Serbs, voted for the Yugoslav republic's independence."], ["1992-03-03T00:00:00", "Turkey's worst coal mine disaster leaves 263 dead near Zonguldak."], ["1992-03-04T00:00:00", "The Supreme Court of Algeria bans the Islamic Salvation Front, which is poised to win control of the Parliament of Algeria in runoff elections."], ["1992-03-09T00:00:00", "The People's Republic of China ratifies the Nuclear Non-Proliferation Treaty."], ["1992-03-10T00:00:00", "Following Super Tuesday voting, Bill Clinton is declared the likely winner of the Democratic Party presidential primaries."], ["1992-03-11T00:00:00", "Manuel de Dios Unanue, former editor of El Diario La Prensa, is slain in a restaurant in Queens, New York after having received death threats from the Colombian drug cartels."], ["1992-03-12T00:00:00", "Mauritius becomes a republic while remaining a member of the Commonwealth of Nations."], ["1992-03-13T00:00:00", "In eastern Turkey, an earthquake registering a surface wave magnitude of 6.8, kills over 500."], ["1992-03-16T00:00:00", "President Boris Yeltsin announces the creation of a separate Russian army, leading to questions about the viability of the Commonwealth of Independent States."], ["1992-03-18T00:00:00", "White South Africans vote in favour of political reforms which will end the apartheid regime and create a power-sharing multi-racial government."], ["1992-03-19T00:00:00", "Paul Tsongas withdraws from the Democratic Party presidential primaries, virtually assuring a victory for Bill Clinton."], ["1992-03-19T00:00:00", "Dow Corning announces that it will stop manufacturing silicone breast implants."], ["1992-03-22T00:00:00", "In French regional elections, the conservative Rally for the Republic and the centre-right Union for French Democracy win in a landslide, capturing 20 of 22 metropolitan regional presidencies."], ["1992-03-22T00:00:00", "STS-45: Space Shuttle Atlantis takes off from Cape Canaveral carrying instruments designed to study global warming."], ["1992-03-24T00:00:00", "The Open Skies Treaty is signed in Helsinki, Finland to establish a program of unarmed survelliance flights over the 34 member states. It went into effect on January 1, 2002."], ["1992-03-25T00:00:00", "The International Atomic Energy Agency orders Iraq to destroy an industrial complex at Al Atheer that is being used to manufacture nuclear weapons."], ["1992-03-25T00:00:00", "Pakistan beats England to win the Cricket World Cup for the very first time."], ["1992-03-29T00:00:00", "In France, police arrest 3 men believed to be planning a Basque separatist terrorist attack at the 1992 Summer Olympics."], ["1992-03-31T00:00:00", "The Maintenance of Religious Harmony Act of Singapore comes into force."], ["1992-04-05T00:00:00", "The Assembly of Bosnia and Herzegovina (without the presence of Serb political delegates) proclaims independence from the Socialist Federal Republic of Yugoslavia."], ["1992-04-05T00:00:00", "Bosnian War: Serb troops, following a mass rebellion of Serbs in Bosnia and Herzegovina against the Bosnian declaration of independence from Yugoslavia, besiege the city of Sarajevo."], ["1992-04-05T00:00:00", "Approximately 500,000 people march on Washington, D. C. in support of abortion rights in advance of oral arguments in the case of Planned Parenthood v. Casey."], ["1992-04-05T00:00:00", "President of Peru Alberto Fujimori issues Decree Law 25418, dissolving the Congress of the Republic of Peru, imposing censorship and having opposition politicians arrested, setting off the 1992 Peruvian constitutional crisis."], ["1992-04-06T00:00:00", "Barney & Friends makes its debut on PBS."], ["1992-04-06T00:00:00", "Microsoft releases Windows 3.1."], ["1992-04-07T00:00:00", "The United States recognizes the independence of Croatia, Bosnia and Herzegovina, and Slovenia. The European Community also recognizes Bosnia and Herzegovina."], ["1992-04-09T00:00:00", "A Miami jury convicts former Panamanian ruler Manuel Noriega of assisting Colombia's cocaine cartel."], ["1992-04-09T00:00:00", "The United Kingdom general election is narrowly won by the Conservative Party led by Prime Minister of the United Kingdom John Major."], ["1992-04-10T00:00:00", "A Provisional Irish Republican Army bomb explodes in the Baltic Exchange in the City of London; 3 are killed, 91 injured."], ["1992-04-12T00:00:00", "The Euro Disney Resort officially opens with its theme park Euro Disneyland. The resort and its park's name are later changed to Disneyland Paris."], ["1992-04-13T00:00:00", "Roermond, the Netherlands, is rocked by an earthquake along the Peel Fault."], ["1992-04-15T00:00:00", "The National Assembly of Vietnam adopts the 1992 Constitution of the Socialist Republic of Vietnam."], ["1992-04-16T00:00:00", "President of Afghanistan Mohammad Najibullah is ousted and detained by Muslim rebels moving towards Kabul, setting the stage for the civil war in Afghanistan (1992-96)."], ["1992-04-20T00:00:00", "Seville, Spain's 6-month Universal Exhibition, called Seville Expo '92, opens."], ["1992-04-20T00:00:00", "The Freddie Mercury Tribute Concert, held at Wembley Stadium, is televised live to over 1 billion people and raises millions of dollars for AIDS research."], ["1992-04-21T00:00:00", "The death of Grand Duke Vladimir Kirillovich of Russia results in a succession dispute between Nicholas Romanov, Prince of Russia and Vladimir's daughter Maria for the leadership of the Imperial Family of Russia."], ["1992-04-22T00:00:00", "Fuel that leaked into a sewer explodes in Guadalajara, Mexico; 215 are killed, 1,500 injured."], ["1992-04-27T00:00:00", "Betty Boothroyd becomes the first woman elected Speaker of the British House of Commons."], ["1992-04-28T00:00:00", "The two remaining constituent republics of the former Socialist Federal Republic of Yugoslavia - Serbia and Montenegro - form a new state, named the Federal Republic of Yugoslavia (after 2003, Serbia and Montenegro), bringing to an end the official union of Serbs, Croats, Slovenes, Montenegrins, Bosnian Muslims and Macedonians that existed from 1918 (with the exception of the period during World War II)."], ["1992-04-29T00:00:00", "Los Angeles riots: The acquittal of 4 police officers in the Rodney King beating criminal trial triggers massive rioting in Los Angeles. The riots will last for 6 days resulting in 53 deaths and over a $1 billion in damages before order is restored."], ["1992-05-05T00:00:00", "Russian leaders in Crimea declare their separation from Ukraine as a new republic. They withdraw the secession on May 10."], ["1992-05-07T00:00:00", "STS-49: Space Shuttle Endeavour makes its maiden flight, as a replacement for Space Shuttle Challenger."], ["1992-05-07T00:00:00", "The Michigan Legislature approves the Twenty-seventh Amendment to the United States Constitution. With that approval, the amendment had been adopted by 38 states and is thereby approved."], ["1992-05-07T00:00:00", "The Sydney River McDonald's murders in Nova Scotia, Canada got international attention as three employees where killed and a fourth was left permanently disabled during a botched robbery. It was the first fast food restaurant murders in Canada."], ["1992-05-09T00:00:00", "The United Nations Framework Convention on Climate Change is adopted in New York."], ["1992-05-10T00:00:00", "Sweden wins the Ice Hockey World Championships in Prague."], ["1992-05-12T00:00:00", "The United States recalls United States Ambassador to Yugoslavia Warren Zimmermann, to protest military aggression against Bosnia and Hercegovina."], ["1992-05-13T00:00:00", "Falun Gong is introduced by Li Hongzhi in China."], ["1992-05-15T00:00:00", "The Commonwealth of Independent States Collective Security Treaty (CST) is signed (effective 20 April 1994)."], ["1992-05-15T00:00:00", "The Genoa Expo '92 World's Fair opens in Genoa, Italy."], ["1992-05-16T00:00:00", "STS-49: Space Shuttle Endeavour lands safely after a successful maiden voyage."], ["1992-05-18T00:00:00", "The Twenty-seventh Amendment to the United States Constitution is enacted."], ["1992-05-22T00:00:00", "The Tonight Show Starring Johnny Carson airs its final show on NBC."]]