[["1980-01-01T00:00:00", "Changes to the Swedish Act of Succession make Princess Victoria of Sweden first in line to the throne (\"heir apparent\") and therefore Crown Princess, ahead of her younger brother."], ["1980-01-04T00:00:00", "U.S. President Jimmy Carter proclaims a grain embargo against the USSR with the support of the European Commission."], ["1980-01-06T00:00:00", "Global Positioning System time epoch begins at 00:00 UTC."], ["1980-01-06T00:00:00", "The president of Sicily, Piersanti Mattarella, is killed by the Mafia."], ["1980-01-09T00:00:00", "In Saudi Arabia, 63 Islamist insurgents are beheaded for their part in the siege of the Great Mosque in Mecca in November, 1979."], ["1980-01-11T00:00:00", "Nigel Short, 14, becomes the youngest chess player to be awarded the degree of International Master."], ["1980-01-20T00:00:00", "Cuba recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-01-21T00:00:00", "The London Gold Fixing hits its highest price ever (adjusted for inflation), at US$850 a troy ounce."], ["1980-01-21T00:00:00", "MS Athina B is beached at Brighton, becoming a temporary tourist attraction."], ["1980-01-21T00:00:00", "At least 200 people are killed when the Corralejas Bullring collapses at Sincelejo, Colombia."], ["1980-01-22T00:00:00", "Andrei Sakharov, Soviet scientist and human rights activist, is arrested in Moscow."], ["1980-01-24T00:00:00", "The Chicago, Rock Island and Pacific Railroad is ordered liquidated due to bankruptcy, and debt owed to creditors."], ["1980-01-26T00:00:00", "Israel and Egypt establish diplomatic relations."], ["1980-01-27T00:00:00", "Canadian Caper: Six United States diplomats, posing as Canadians, manage to escape from Tehran, Iran as they board a flight to Zürich, Switzerland."], ["1980-01-31T00:00:00", "The Spanish Embassy in Guatemala is invaded and set on fire, killing 36 people. It is called \"Spain's own Tehran\", similar to the 1979-80 Iran American hostage crisis."], ["1980-02-02T00:00:00", "Abscam: FBI personnel target members of the Congress of the United States in a sting operation."], ["1980-02-04T00:00:00", "Ayatollah Ruhollah Khomeini names Abolhassan Banisadr as president of Iran."], ["1980-02-13T00:00:00", "The 1980 Winter Olympics open in Lake Placid, New York."], ["1980-02-15T00:00:00", "In Vanuatu, followers of John Frum's cargo cult on the island of Tanna declare secession as the nation of Tafea."], ["1980-02-16T00:00:00", "A total solar eclipse is seen in North Africa and West Asia."], ["1980-02-22T00:00:00", "The United States Olympic Hockey Team defeats the Soviet Union in the semifinals of the Winter Olympics, in the Miracle on Ice."], ["1980-02-23T00:00:00", "Ayatollah Ruhollah Khomeini states that Iran's parliament will decide the fate of the American embassy hostages."], ["1980-02-25T00:00:00", "A coup in Suriname ousts the government of Henck Arron; leaders Dési Bouterse and Roy Horb replace it with a National Military Council."], ["1980-02-27T00:00:00", "M-19 guerrillas begin the Dominican embassy siege in Colombia, holding 60 people hostage, including 14 ambassadors."], ["1980-02-27T00:00:00", "Iran recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-03-01T00:00:00", "The Commonwealth Trade Union Council is established."], ["1980-03-01T00:00:00", "The Voyager 1 probe confirms the existence of Janus, a moon of Saturn."], ["1980-03-03T00:00:00", "- Pierre Trudeau returns to office as Prime Minister of Canada."], ["1980-03-03T00:00:00", "- The Audi Quattro, a four-wheel drive sporting coupe, is launched in West Germany."], ["1980-03-04T00:00:00", "Robert Mugabe is elected Prime Minister of Zimbabwe."], ["1980-03-08T00:00:00", "The Soviet Union's first rock music festival starts."], ["1980-03-14T00:00:00", "LOT Polish Airlines Flight 007 crashes during an emergency landing near Warsaw, Poland, killing a 14-man American boxing team and 73 others."], ["1980-03-18T00:00:00", "Fifty people are killed at the Plesetsk Cosmodrome in Russia, when a Vostok-2M rocket explodes on its launch pad during a fueling operation."], ["1980-03-20T00:00:00", "The Mi Amigo, the ship that housed pirate radio station Radio Caroline, sinks (Radio Caroline returns aboard a new ship in 1983)."], ["1980-03-21T00:00:00", "U.S. President Jimmy Carter announces that the United States will boycott the 1980 Summer Olympics in Moscow."], ["1980-03-21T00:00:00", "Mafioso Angelo Bruno is murdered in Philadelphia."], ["1980-03-22T00:00:00", "The Georgia Guidestones are erected in Elbert County, Georgia."], ["1980-03-24T00:00:00", "The Australia Olympic Committee announces it will send an Olympic delegation to Moscow, despite objections by Prime Minister Malcolm Fraser."], ["1980-03-24T00:00:00", "Archbishop Óscar Romero is killed by gunmen while celebrating Mass in San Salvador."], ["1980-03-26T00:00:00", "A mine lift cage at the Vaal Reefs gold mine in South Africa falls 1.2 miles (1.9 kilometers), killing 23."], ["1980-03-27T00:00:00", "The Norwegian oil platform Alexander L. Kielland collapses in the North Sea, killing 123 of its crew of 212."], ["1980-03-27T00:00:00", "The Silver Thursday market crash occurs."], ["1980-03-27T00:00:00", "Sierra Leone recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-03-28T00:00:00", "Talpiot Tomb is found in Jerusalem."], ["1980-03-31T00:00:00", "Chicago, Rock Island and Pacific Railroad operates its final train."], ["1980-04-01T00:00:00", "The Southern African Development Coordination Conference (SADCC) is formed in Lusaka, Zambia."], ["1980-04-01T00:00:00", "The Mariel boatlift from Cuba begins."], ["1980-04-01T00:00:00", "New York City's Transport Works Union Local 100 goes on strike, which continues for 11 days."], ["1980-04-01T00:00:00", "The 1980 United States Census begins. There are 226,545,805 United States residents on this day."], ["1980-04-02T00:00:00", "The St Pauls riot breaks out in Bristol."], ["1980-04-07T00:00:00", "The United States severs diplomatic relations with Iran and imposes economic sanctions, following the taking of American hostages on November 4, 1979."], ["1980-04-10T00:00:00", "In Lisbon, Portugal, the governments of Spain and the United Kingdom agree to reopen the border between Gibraltar and Spain in 1985, closed since 1969."], ["1980-04-12T00:00:00", "Samuel Kanyon Doe takes over Liberia in a coup d'état, ending over 130 years of democratic presidential succession in that country."], ["1980-04-12T00:00:00", "Terry Fox begins his Marathon of Hope from St. Johns, Newfoundland, Canada."], ["1980-04-14T00:00:00", "Iron Maiden's debut self-titled album Iron Maiden is released."], ["1980-04-15T00:00:00", "Libya and Syria recognize the Sahrawi Arab Democratic Republic (SADR)."], ["1980-04-18T00:00:00", "Zimbabwe gains de jure independence from the United Kingdom; Robert Mugabe becomes Prime Minister."], ["1980-04-21T00:00:00", "Rosie Ruiz wins the Boston Marathon, but is later exposed as a fraud and stripped of her award."], ["1980-04-24T00:00:00", "Pennsylvania Lottery Scandal: the Pennsylvania Lottery is rigged by 6 men including the host of the live TV drawing, Nick Perry."], ["1980-04-25T00:00:00", "Dan-Air Flight 1008 crashes in Tenerife, killing all 146 occupants and marking the worst air disaster involving a British-registered aircraft in terms of loss of life."], ["1980-04-26T00:00:00", "Louise and Charmian Faulkner disappear from outside their flat in St Kilda, Victoria, Australia."], ["1980-04-27T00:00:00", "The Dominican embassy siege ends with all hostages released and the guerrillas flying to Cuba."], ["1980-04-28T00:00:00", "Swaziland recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-04-30T00:00:00", "Iranian Embassy siege: Six Iranian-born terrorists take over the Iranian embassy in London, UK. SAS retakes the Embassy on May 5; 1 terrorist survives."], ["1980-04-30T00:00:00", "Queen Juliana of the Netherlands abdicates, and her daughter Beatrix accedes to the throne."], ["1980-05-02T00:00:00", "Referendum on system of government held in Nepal."], ["1980-05-04T00:00:00", "Yugoslav President Josip Broz Tito dies. The funeral ceremony later becomes a large diplomatic meeting and media event, with more than 140 state delegations in Belgrade from all over the world (only the funeral of Pope John Paul II in April 2005 will have more news coverage and a higher number of delegations)."], ["1980-05-07T00:00:00", "Paul Geidel, convicted of second-degree murder in 1911, is released from prison in Beacon, New York, after 68 years and 245 days (the longest-ever time served by an inmate)."], ["1980-05-09T00:00:00", "In Florida, the Liberian freighter Summit Venture hits the Sunshine Skyway Bridge over Tampa Bay. A 1,400-foot section of the bridge collapses and 35 people (most in a bus) are killed."], ["1980-05-09T00:00:00", "The Norco shootout takes place in California."], ["1980-05-09T00:00:00", "James Alexander George Smith \"Jags\" McCartney the Turks and Caicos Islands’ first Chief Minister, is killed in a plane crash over New Jersey."], ["1980-05-11T00:00:00", "Mobster Henry Hill is arrested for drug possession."], ["1980-05-14T00:00:00", "Botswana recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-05-17T00:00:00", "A Tampa, Florida court acquits 4 white police officers of killing Arthur McDuffie, a black insurance executive, provoking 3 days of race riots in Miami."], ["1980-05-17T00:00:00", "Internal conflict in Peru: On the eve of presidential elections, Maoist guerrilla group Shining Path attacks a polling location in the town of Chuschi, Ayacucho."], ["1980-05-18T00:00:00", "The 1980 eruption of Mount St. Helens kills 57 and causes US$3 billion in damage."], ["1980-05-18T00:00:00", "Ian Curtis, singer/songwriter of acclaimed post-punk band Joy Division, is found hanged."], ["1980-05-20T00:00:00", "1980 Quebec referendum: Voters in Quebec reject by a vote of 60% a proposal to seek independence from Canada."], ["1980-05-21T00:00:00", "Star Wars Episode V: The Empire Strikes Back is released."], ["1980-05-22T00:00:00", "Pac-Man (the best-selling arcade game of all time) is released in Japan."], ["1980-05-24T00:00:00", "The International Court of Justice calls for the release of U.S. Embassy hostages in Tehran."], ["1980-05-24T00:00:00", "The New York Islanders win their first Stanley Cup, from a goal by Bobby Nystrom in overtime of game six of the Stanley Cup playoffs's final round."], ["1980-05-25T00:00:00", "Indianapolis 500: Johnny Rutherford wins for a third time in car owner Jim Hall's revolutionary ground effect Chaparral car; the victory is Hall's second as an owner."], ["1980-05-26T00:00:00", "John Frum supporters in Vanuatu storm government offices on the island of Tanna. Vanuatu government troops land the next day and drive them away."], ["1980-05-26T00:00:00", "In South Korea, military government forces and pro-democracy protesters clash; 2,000 protesters die."], ["1980-05-26T00:00:00", "Vernon Jordan is shot and critically injured in an assassination attempt in Fort Wayne, Indiana by Joseph Paul Franklin (the first major news story for CNN)."], ["1980-06-01T00:00:00", "The first 24-hour news channel Cable News Network (CNN) is launched."], ["1980-06-03T00:00:00", "A series of deadly tornadoes strikes Grand Island, Nebraska, causing over $300m in damage, killing 5 people and injuring over 250."], ["1980-06-09T00:00:00", "In Los Angeles, comedian Richard Pryor is badly burned trying to freebase cocaine."], ["1980-06-10T00:00:00", "Apartheid: The African National Congress in South Africa publishes a statement by their imprisoned leader Nelson Mandela."], ["1980-06-10T00:00:00", "A Unabomber bomb injures United Airlines president Percy Wood in Lake Forest, Illinois."], ["1980-06-20T00:00:00", "Augusta AVA becomes the first federally recognized American Viticultural Area."], ["1980-06-23T00:00:00", "Tim Berners-Lee begins work on ENQUIRE, the system that will eventually lead to the creation of the World Wide Web in fall of 1990."], ["1980-06-25T00:00:00", "A Muslim Brotherhood assassination attempt against Syrian president Hafez al-Assad fails. Assad retaliates by sending the army against them."], ["1980-06-26T00:00:00", "Aerolinee Itavia Flight 870 crashes into the sea near Palermo after an explosion occurs in the air; 81 people die. A bomb or a missile is suspected to be the cause of the accident but no culprits are ever found."], ["1980-06-27T00:00:00", "U.S. President Jimmy Carter signs Proclamation 4771, requiring 18- to 25-year-old males to register for a peacetime military draft, in response to the Soviet invasion of Afghanistan."], ["1980-06-29T00:00:00", "Vigdís Finnbogadóttir is elected president of Iceland, making her the first woman democratically elected as head of state."], ["1980-07-04T00:00:00", "Chad and Mali recognize the Sahrawi Arab Democratic Republic (SADR)."], ["1980-07-08T00:00:00", "A wave of strikes begins in Lublin, Poland."], ["1980-07-09T00:00:00", "Pope John Paul II visits Brazil; 7 people are crushed to death in a crowd meeting him."], ["1980-07-09T00:00:00", "Zimbabwe recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-07-15T00:00:00", "A severe and destructive thunderstorm strikes 4 counties in western Wisconsin, including the city of Eau Claire. It causes over $250m in damage, and 1 person is killed."], ["1980-07-16T00:00:00", "Former California Governor and actor Ronald Reagan is nominated for U.S. President, at the 1980 Republican National Convention in Detroit. Influenced by the Religious Right, the convention also drops its long standing support for the Equal Rights Amendment, dismaying moderate Republicans."], ["1980-07-19T00:00:00", "Former Turkish Prime Minister Nihat Erim is killed by 2 gunmen in Istanbul, Turkey."], ["1980-07-25T00:00:00", "The album Back in Black is released by the Australian band AC/DC."], ["1980-07-27T00:00:00", "Mohammad Reza Pahlavi, deposed Shah of Iran, dies in Cairo."], ["1980-07-30T00:00:00", "Vanuatu gains independence."], ["1980-07-30T00:00:00", "Israel's Knesset passes the Jerusalem Law."], ["1980-08-02T00:00:00", "A terrorist bombing at the railway station in Bologna, Italy kills 85 people and wounds more than 200."], ["1980-08-02T00:00:00", "Moskow Olympic Games football final: Czechoslovakia - GDR"], ["1980-08-10T00:00:00", "Hurricane Allen (category 3) pounds southeastern Texas."], ["1980-08-14T00:00:00", "U.S. President Jimmy Carter defeats Senator Edward Kennedy to win renomination, at the 1980 Democratic National Convention in New York City."], ["1980-08-14T00:00:00", "Dorothy Stratten, the 1980 Playboy Playmate of the Year is murdered by estranged husband Paul Leslie Snider, who subsequently commits suicide."], ["1980-08-17T00:00:00", "In Australia, baby Azaria Chamberlain disappears from a campsite at Ayers Rock (Uluru), reportedly taken by a dingo."], ["1980-08-19T00:00:00", "In one of aviation's worst disasters, 301 people are killed when Saudia Flight 163 catches fire in Riyadh, Saudi Arabia."], ["1980-08-31T00:00:00", "Victory of the strike in Gdańsk Shipyard, Poland. The Gdańsk Agreement is signed, opening a way to start the first in the communist bloc free organization (not controlled by regime) \"Solidarność\" i.e. Solidarity."], ["1980-09-01T00:00:00", "Terry Fox is forced to end his Marathon of Hope run outside of Thunder Bay, Ontario, after finding out that the cancer has spread to his lungs."], ["1980-09-02T00:00:00", "Ford Europe launches the Escort MK3, a new front-wheel drive hatchback."], ["1980-09-03T00:00:00", "Zimbabwe breaks diplomatic and consular relations with South Africa, even though it maintains a commercial mission in Johannesburg."], ["1980-09-05T00:00:00", "The St. Gotthard Tunnel opens in Switzerland as the world's longest highway tunnel at 10.14 miles (16.32 km), stretching from Göschenen to Airolo."], ["1980-09-12T00:00:00", "Kenan Evren stages a military coup in Turkey. It stops political gang violence, but begins stronger state violence leading to the execution of many young activists."], ["1980-09-17T00:00:00", "After weeks of strikes at the Lenin Shipyard in Gdańsk, Poland, the nationwide independent trade union Solidarity is established."], ["1980-09-17T00:00:00", "Former Nicaraguan President Anastasio Somoza Debayle is killed in Asunción, Paraguay."], ["1980-09-21T00:00:00", "Bülent Ulusu, ex admiral, forms the new government of Turkey (44th government, composed mostly of technocrats)."], ["1980-09-22T00:00:00", "The command council of Iraq orders its army to \"deliver its fatal blow on Iranian military targets,\" initiating the Iran-Iraq War."], ["1980-09-22T00:00:00", "Youth riots in Tallinn, the capital of the Estonian SSR, are quickly put down. Similar riots are organized on 1 October."], ["1980-09-26T00:00:00", "13 people are killed and 211 injured in the Oktoberfest terror attack."], ["1980-09-26T00:00:00", "The Mariel boatlift officially ends."], ["1980-09-27T00:00:00", "The Richmond Football Club defeats Collingwood by 81 points in the VFL Grand Final (They have yet to win another premiership since)."], ["1980-09-29T00:00:00", "The Washington Post publishes Janet Cooke's story of Jimmy, an 8-year-old heroin addict (later proven to be fabricated)."], ["1980-09-30T00:00:00", "Digital Equipment Corporation, Intel and Xerox introduce the DIX standard for Ethernet, which is the first implementation outside of Xerox, and the first to support 10 Mbit/s speeds."], ["1980-10-01T00:00:00", "Associated Newspapers announces that The Evening News will close and merge with the Evening Standard."], ["1980-10-03T00:00:00", "The Police release their third studio album, Zenyattà Mondatta."], ["1980-10-03T00:00:00", "The main-belt asteroid 2404 Antarctica is discovered by Antonín Mrkos at Kleť, South Bohemian Region, Czechoslovakia."], ["1980-10-05T00:00:00", "British Leyland launches its new Metro, a three-door entry-level hatchback which is designed as the eventual replacement for the Mini. It gives BL a long-awaited modern competitor for the likes of the Ford Fiesta and Vauxhall Chevette."], ["1980-10-10T00:00:00", "El Asnam, Algeria is destroyed by an earthquake, which claims more than 2,600 lives. After the quake, El Asnam is rebuilt and changes its name to the city of Chlef."], ["1980-10-10T00:00:00", "British Prime Minister Margaret Thatcher delivers her famous \"The lady's not for turning\" speech."], ["1980-10-14T00:00:00", "The Staggers Rail Act is enacted, deregulating American railroads."], ["1980-10-15T00:00:00", "James Callaghan announces his resignation as leader of the British Labour Party."], ["1980-10-15T00:00:00", "James Hoskins forces his way into WCPO's television studio in Cincinnati, holding 9 employees hostage for several hours before releasing them and taking his own life."], ["1980-10-18T00:00:00", "The Fraser Government is re-elected for a third consecutive term in Australia with a reduced majority."], ["1980-10-20T00:00:00", "In continuous production since 1962, the last MGB roadster rolls off the assembly line at the Abingdon factory, ending production for the MG marque."], ["1980-10-22T00:00:00", "The Thomson Corporation says that The Times and all associated supplements will close in March 1981 if no buyer can be found."], ["1980-10-25T00:00:00", "Proceedings on the Hague Convention on the Civil Aspects of International Child Abduction conclude at The Hague."], ["1980-10-27T00:00:00", "Six Provisional Irish Republican Army prisoners in Maze prison refuse food and demand status as political prisoners; the hunger strike lasts until December."], ["1980-10-30T00:00:00", "El Salvador and Honduras sign a peace treaty to put the border dispute fought over in 1969's Football War before the International Court of Justice."], ["1980-10-30T00:00:00", "Costa Rica recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-10-31T00:00:00", "The Polish government recognizes Solidarity."], ["1980-10-31T00:00:00", "Reza Pahlavi, eldest son of the Shah of Iran, proclaims himself the rightful successor to the Peacock Throne."], ["1980-11-04T00:00:00", "United States presidential election, 1980: Republican challenger and former Governor Ronald Reagan of California defeats incumbent Democratic President Jimmy Carter, exactly 1 year after the beginning of the Iran hostage crisis."], ["1980-11-10T00:00:00", "November 12 - Voyager program: The NASA space probe Voyager I makes its closest approach to Saturn, when it flies within 77,000 miles of the planet's cloud-tops and sends the first high resolution images of the world back to scientists on Earth."], ["1980-11-20T00:00:00", "The Gang of Four trial begins in China."], ["1980-11-20T00:00:00", "A Texaco oil rig breaks through to a mine under Lake Peigneur."], ["1980-11-21T00:00:00", "A fire at the MGM Grand Hotel and Casino on the Las Vegas Strip kills 85 people."], ["1980-11-21T00:00:00", "A then-record number of viewers (for an entertainment program) tune into the U.S. soap opera Dallas to learn who shot lead character J. R. Ewing. The \"Who shot J.R.?\" event is an international obsession."], ["1980-11-23T00:00:00", "1980 Irpinia earthquake: a magnitude 7 earthquake in southern Italy kills approximately 4,800 people and leaves 300,000 homeless."], ["1980-11-27T00:00:00", "Vanuatu recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1980-12-02T00:00:00", "American missionary Jean Donovan and three Roman Catholic nuns are murdered by a military death squad in El Salvador while volunteering to do charity work during the country's civil war."], ["1980-12-04T00:00:00", "Led Zeppelin issue a press release announcing their break-up due to the death of their drummer John Bonham."], ["1980-12-08T00:00:00", "John Lennon is shot dead outside his apartment in New York City by Mark David Chapman."], ["1980-12-11T00:00:00", "CERCLA is enacted by the U.S. Congress."], ["1980-12-14T00:00:00", "Four people are murdered at Bob's Big Boy on La Cienega Boulevard in Los Angeles and 4 others are injured by two armed robbers, in what is one of the city's most brutal crimes ever."], ["1980-12-15T00:00:00", "The Academia de la Llingua Asturiana (Academy of the Asturian language) is created."], ["1980-12-16T00:00:00", "During a summit on the island of Bali, OPEC decides to raise the price of petroleum by 10%."]]