[["2003-01-01T00:00:00", "Luiz Inácio Lula da Silva is elected President of Brazil. He is the first left-wing president of Brazil since João Goulart in 1961."], ["2003-01-05T00:00:00", "Police in London arrest 7 suspects in connection with the 2002 Wood Green ricin plot."], ["2003-01-08T00:00:00", "US Airways Express Flight 5481 crashes at Charlotte Douglas International Airport in Charlotte, North Carolina, killing all 21 people aboard."], ["2003-01-16T00:00:00", "STS-107: Space Shuttle Columbia is launched on its last flight."], ["2003-01-18T00:00:00", "The Canberra Bushfires in Canberra, Australia, kill 4 people."], ["2003-01-23T00:00:00", "The last signal is received from NASA's Pioneer 10 spacecraft, some 7.5 billion miles from Earth."], ["2003-01-24T00:00:00", "The U.S. Department of Homeland Security established."], ["2003-01-29T00:00:00", "2003 Phnom Penh riots: In Phnom Penh, Cambodia, the Thai embassy is burned and commercial properties of Thai businesses are vandalized."], ["2003-01-30T00:00:00", "Belgium legally recognizes same-sex marriage."], ["2003-02-01T00:00:00", "At the conclusion of the STS-107 mission, the Space Shuttle Columbia disintegrates during reentry over Texas, killing all 7 astronauts on board."], ["2003-02-01T00:00:00", "In Northern Ireland, Protestant Ulster Defence Association Belfast leader John Gregg is killed by a loyalist faction."], ["2003-02-05T00:00:00", "Iraq disarmament crisis: U.S. Secretary of State Colin Powell addresses the UN Security Council on Iraq."], ["2003-02-09T00:00:00", "The War in Darfur begins."], ["2003-02-15T00:00:00", "Global protests against the Iraq war: More than 10 million people protest in over 600 cities worldwide, the largest to take place before a war occurs."], ["2003-02-18T00:00:00", "An arsonist destroys a train in Daegu, South Korea, killing more than 190."], ["2003-02-20T00:00:00", "The Station nightclub fire in West Warwick, Rhode Island, claims the lives of 100 people."], ["2003-02-26T00:00:00", "An American businessman is admitted to the Vietnam France Hospital in Hanoi, Vietnam, with the first identified case of SARS. WHO doctor Carlo Urbani reports the unusual, highly contagious disease to WHO. Both the businessman and doctor later die of the disease."], ["2003-02-27T00:00:00", "Former Bosnian Serb leader Biljana Plavšić is sentenced by the U.N. tribunal in The Hague, Netherlands, to 11 years in prison."], ["2003-03-01T00:00:00", "Khalid Sheikh Mohammed, the mastermind of the September 11 Attacks, is arrested by CIA and ISI officials at a home in Rawalpindi, Pakistan."], ["2003-03-08T00:00:00", "Malta approves joining the European Union in a referendum."], ["2003-03-12T00:00:00", "Serbian Prime Minister Zoran Đinđić is assassinated in Belgrade."], ["2003-03-12T00:00:00", "The WHO issues a global alert on SARS."], ["2003-03-18T00:00:00", "FBI agents raid the corporate headquarters of HealthSouth Corporation in Birmingham, Alabama, on suspicion of massive corporate fraud led by the company's top executives."], ["2003-03-19T00:00:00", "The Iraq War begins with the invasion of Iraq by the U.S. and allied forces."], ["2003-03-23T00:00:00", "Slovenia approves joining the European Union and NATO in a referendum."], ["2003-04-03T00:00:00", "A passenger bus hits a remote-controlled land mine in the Chechen capital, killing at least 8."], ["2003-04-03T00:00:00", "U.S. forces seize control of Saddam International Airport, changing the airport's name to Baghdad International Airport."], ["2003-04-09T00:00:00", "U.S. forces seize control of Baghdad, ending the regime of Saddam Hussein."], ["2003-04-12T00:00:00", "Hungary approves joining the European Union in a referendum."], ["2003-04-14T00:00:00", "The Human Genome Project is completed, with 99% of the human genome sequenced to 99.99% accuracy."], ["2003-04-29T00:00:00", "The United States announces the withdrawal of troops stationed in Saudi Arabia, and the redeployment of some at the Al Udeid Air Base in Qatar."], ["2003-05-04T00:00:00", "May 10 - A major severe weather outbreak spawns more tornadoes than any week in U.S. history; 393 tornadoes are reported in 19 states."], ["2003-05-11T00:00:00", "Benvenuto Cellini's Saliera is stolen from the Kunsthistorisches Museum in Vienna."], ["2003-05-11T00:00:00", "Lithuania approves joining the European Union in a referendum."], ["2003-05-12T00:00:00", "A suicide truck-bomb attack kills at least 60 at a government compound in northern Chechnya."], ["2003-05-12T00:00:00", "In Riyadh, Saudi Arabia, 26 people are killed in the Riyadh compound bombings."], ["2003-05-14T00:00:00", "A suicide bomber blows up explosives strapped to her waist in a crowd of thousands of Muslim pilgrims, killing at least 18 people in Chechnya."], ["2003-05-16T00:00:00", "In Casablanca, Morocco, 33 civilians are killed and more than 100 injured in the Casablanca terrorist attacks."], ["2003-05-17T00:00:00", "Slovakia approves joining the European Union in a referendum."], ["2003-05-19T00:00:00", "The Indonesian military begins an operation in Aceh province."], ["2003-05-21T00:00:00", "An earthquake in the Boumerdès region of northern Algeria kills 2,200."], ["2003-05-23T00:00:00", "Dewey, the first deer cloned by scientists at Texas A&M University, is born."], ["2003-05-28T00:00:00", "Prometea, the first horse cloned by Italian scientists, is born."], ["2003-06-05T00:00:00", "A female suicide bomber detonates a bomb near a bus carrying soldiers and civilians to a military airfield in Mozdok, a major staging point for Russian troops in Chechnya, killing at least 16."], ["2003-06-08T00:00:00", "Poland approves joining the European Union in a referendum."], ["2003-06-14T00:00:00", "The Czech Republic approves joining the European Union in a referendum."], ["2003-06-23T00:00:00", "Grutter v. Bollinger: The Supreme Court of the United States upholds affirmative action in university admissions."], ["2003-06-26T00:00:00", "Lawrence v. Texas: The U.S. Supreme Court declares sodomy laws unconstitutional."], ["2003-07-01T00:00:00", "500,000 Hong Kong people march to protest Hong Kong Basic Law Article 23, which controversially redefines treason."], ["2003-07-05T00:00:00", "SARS is declared to be contained by the World Health Organization."], ["2003-07-05T00:00:00", "A double suicide bombing at a Moscow rock concert kills the attackers and 15 other people."], ["2003-07-06T00:00:00", "The 70-meter Eupatoria Planetary Radar sends a METI message Cosmic Call 2 to 5 stars: Hip 4872, HD 245409, 55 Cancri, HD 10307 and 47 Ursae Majoris, that will arrive at these stars in 2036, 2040, 2044, 2044 and 2049 respectively."], ["2003-07-08T00:00:00", "Sudan Airways Flight 139, with 117 people on board, crashes in Sudan; the only survivor is a 2-year-old child."], ["2003-07-14T00:00:00", "Plame affair: Washington Post columnist Robert Novak publishes the name of Valerie Plame, blowing her cover as a CIA operative."], ["2003-07-18T00:00:00", "The Convention on the Future of Europe finishes its work and proposes the first European Constitution."], ["2003-07-18T00:00:00", "The Second Congo War concludes with 2-5 million deaths since 1998."], ["2003-07-21T00:00:00", "Eleven support towers on Kinzua Bridge collapse after being hit by an F-1 tornado."], ["2003-07-22T00:00:00", "Uday and Qusay Hussein, sons of Saddam Hussein, are killed by the U.S. military in Iraq, after being tipped off by an informant."], ["2003-07-23T00:00:00", "Operation Warrior Sweep is the first major military deployment of the Afghan National Army."], ["2003-07-24T00:00:00", "The Regional Assistance Mission to the Solomon Islands, Operation Helpem Fren, led by Australia, begins."], ["2003-08-01T00:00:00", "A suicide bomber rams a truck filled with explosives into a military hospital near Chechnya, killing 50 people, including Russian troops wounded in Chechnya."], ["2003-08-02T00:00:00", "The United Nations authorizes an international peacekeeping force for Liberia."], ["2003-08-11T00:00:00", "NATO takes over command of the peacekeeping force in Afghanistan, marking its first major operation outside Europe in its 54-year-history."], ["2003-08-14T00:00:00", "A 6.4 Richter scale earthquake occurs near the Greek Ionian island of Lefkada; 24 are injured."], ["2003-08-14T00:00:00", "The Northeast blackout of 2003 cuts power to an estimated 10 million people in Ontario, Canada, and 45 million people in eight U.S. states."], ["2003-08-22T00:00:00", "A rocket explosion kills 21 at the Brazilian rocket complex in Alcântara, Brazil, due to the premature ignition of a solid rocket booster."], ["2003-08-25T00:00:00", "The Spitzer Space Telescope is launched from Cape Canaveral, Florida, during Delta II."], ["2003-08-27T00:00:00", "Perihelic opposition: Mars makes its closest approach to Earth in over 50,000 years."], ["2003-09-03T00:00:00", "The Hubble Space Telescope starts Hubble Ultra-Deep Field."], ["2003-09-04T00:00:00", "Europe's busiest shopping centre, the Bullring in Birmingham, is officially opened by Sir Albert Bore."], ["2003-09-14T00:00:00", "Estonia approves joining the European Union in a referendum."], ["2003-09-15T00:00:00", "The ELN kidnaps 8 foreign tourists in the Ciudad Perdida in Colombia; they demand a human rights investigation and release the last hostages 3 months later."], ["2003-09-20T00:00:00", "Latvia approves joining the European Union in a referendum."], ["2003-09-27T00:00:00", "Smart 1, a European Space Agency satellite, is launched from French Guiana."], ["2003-10-05T00:00:00", "Israeli warplanes strike inside Syrian territory."], ["2003-10-15T00:00:00", "China launches Shenzhou 5, their first manned space mission."], ["2003-10-24T00:00:00", "The Concorde makes its last commercial flight, bringing the era of airliner supersonic travel to a close."], ["2003-10-24T00:00:00", "Apple releases Mac OS X Panther."], ["2003-11-09T00:00:00", "A lunar eclipse is seen in the Americas, Europe, Africa and Central Asia."], ["2003-11-12T00:00:00", "Occupation of Iraq: In Nasiriyah, Iraq, at least 23 people, among them the first Italian casualties of the 2003 Iraq war, are killed in a suicide bomb attack on an Italian police base."], ["2003-11-18T00:00:00", "With its ruling in Goodridge v. Department of Public Health, the Massachusetts Supreme Judicial Court makes the state the first in the United States to legalize same-sex marriage."], ["2003-11-23T00:00:00", "A total solar eclipse is seen over Antarctica."], ["2003-11-23T00:00:00", "President of Georgia Eduard Shevardnadze resigns in the bloodless Rose Revolution."], ["2003-12-01T00:00:00", "The use of hand-held cell phones while driving is outlawed in the United Kingdom."], ["2003-12-05T00:00:00", "A suicide bombing on a commuter train in southern Russia kills 44 people."], ["2003-12-13T00:00:00", "Saddam Hussein, former President of Iraq, is captured in Tikrit by the U.S. 4th Infantry Division."], ["2003-12-20T00:00:00", "Libya admits to building a nuclear bomb."], ["2003-12-22T00:00:00", "Parmalat is first accused of falsifying accounts to the tune of USD $5 billion, later admitted by founder Calisto Tanzi; observers call it \"Europe's Enron\"."], ["2003-12-23T00:00:00", "The World Tourism Organization becomes a specialized agency of the United Nations."], ["2003-12-26T00:00:00", "A massive earthquake devastates southeastern Iran; over 40,000 people are reported killed in the city of Bam."], ["2003-12-31T00:00:00", "British Airways Flight 223, a Boeing 747-400 flying from London Heathrow to Washington Dulles, is escorted into Dulles Airport by F-16 fighter jets, after intelligence reports of terrorists trying to board the jet and use it in a terrorist attack."]]