[["1936-01-04T00:00:00", "England celebrates its first ever win over the All Blacks in rugby union, in particular the two famous tries by \"The Prince\" HH Alexander Obolensky."], ["1936-01-11T00:00:00", "I Wanna Play House marks the first Warner Bros. cartoon with \"target\" titles."], ["1936-01-15T00:00:00", "The first building to be completely covered in glass is completed in Toledo, Ohio, for the Owens-Illinois Glass Company."], ["1936-01-16T00:00:00", "Serial killer Albert Fish is executed in Sing Sing Prison."], ["1936-01-20T00:00:00", "King George V of the United Kingdom dies. His eldest son succeeds to the throne, becoming Edward VIII. The title Prince of Wales is not used for another 22 years."], ["1936-01-31T00:00:00", "The Green Hornet radio show debuts."], ["1936-02-04T00:00:00", "Radium E (bismuth-210) becomes the first radioactive element to be made synthetically."], ["1936-02-06T00:00:00", "The IV Olympic Winter Games open in Garmisch-Partenkirchen, Germany."], ["1936-02-26T00:00:00", "The Imperial Way Faction engineers a failed coup against the Japanese government; some politicians are killed."], ["1936-02-29T00:00:00", "Emperor Hirohito orders the Japanese army to arrest 123 conspirators in Tokyo government offices; 19 of them are executed in July."], ["1936-03-01T00:00:00", "Construction of Hoover Dam is completed."], ["1936-03-07T00:00:00", "In violation of the Treaty of Versailles, Nazi Germany reoccupies the Rhineland."], ["1936-03-09T00:00:00", "Pro-democratic militarist Keisuke Okada steps down as Prime Minister of Japan and is replaced by radical militarist Kōki Hirota."], ["1936-03-17T00:00:00", "March 18 - St. Patrick's Day Flood: Pittsburgh suffers the worst flooding in its history."], ["1936-03-26T00:00:00", "The longest game in the history of the National Hockey League was played. The Montreal Maroons and Detroit Red Wings went scoreless until 16 and a half minutes into the sixth OT when Mud Bruneteau ends it at 2:25 in the morning."], ["1936-04-03T00:00:00", "Richard Hauptmann, convicted of the Lindbergh kidnapping and murder in 1932, is executed by electrocution in New Jersey State Prison."], ["1936-04-05T00:00:00", "A tornado hits Tupelo, Mississippi, killing 216 and injuring over 700 (the 4th deadliest tornado in U.S. history)."], ["1936-04-06T00:00:00", "Two tornadoes strike Gainesville, Georgia. The smaller tornado hits north Gainesville, the stronger tornado the west side of town. 203 die and 1,600 are injured in the 5th deadliest tornado in U.S. history."], ["1936-04-11T00:00:00", "Billy Butlin opens his first Butlins holiday camp, Butlins Skegness, in Skegness (Ingoldmells), Lincolnshire, England. It is officially opened by Amy Johnson of Hull (the first woman to fly solo from England to Australia)."], ["1936-04-19T00:00:00", "The 1936-39 Arab revolt in Palestine against the British government and opposition to Jewish immigration begins."], ["1936-05-02T00:00:00", "Peter and the Wolf, a Russian fairy tale of Sergei Prokofiev's composition, debuts at the Nezlobin Theater in Moscow, Soviet Union."], ["1936-05-05T00:00:00", "Italian forces occupy Addis Ababa."], ["1936-05-07T00:00:00", "Italy annexes Ethiopia."], ["1936-05-09T00:00:00", "Italian East Africa is formed from the Italian territories of Eritrea, Ethiopia, and Italian Somaliland."], ["1936-05-12T00:00:00", "The Santa Fe railroad in the United States inaugurates the all-Pullman Super Chief passenger train between Chicago and Los Angeles."], ["1936-05-25T00:00:00", "The Remington Rand strike of 1936-37 begins, spawning the notorious \"Mohawk Valley formula\", a corporate plan for strikebreaking."], ["1936-05-27T00:00:00", "The first flight by the Irish airline Aer Lingus takes place."], ["1936-05-27T00:00:00", "British luxury liner RMS Queen Mary leaves Southampton on her maiden voyage across the Atlantic."], ["1936-05-28T00:00:00", "Alan Turing submits his paper \"On Computable Numbers\" to the London Mathematical Society for publication, introducing the concept of the \"Turing machine\". Its formal publication is on November 12."], ["1936-06-07T00:00:00", "The general strike in France is ended by the Matignon Agreements."], ["1936-06-07T00:00:00", "The Steel Workers Organizing Committee is founded in the United States."], ["1936-06-10T00:00:00", "Margaret Mitchell's epic historical romance Gone with the Wind is first published in the United States."], ["1936-06-15T00:00:00", "An army ammunition depot explosion kills 60 in Männiku, Estonia."], ["1936-06-19T00:00:00", "Max Schmeling knocks out Joe Louis in the 12th round of their heavyweight boxing match at Yankee Stadium in New York City."], ["1936-06-19T00:00:00", "Per Albin Hansson resigns as Prime Minister of Sweden, over the issue of defence policy. He is replaced by the leader of the Farmer`s League ( Bondeförbundet ) Axel Pehrsson-Bramstorp , whom also becomes Minister of Agriculture."], ["1936-06-26T00:00:00", "Focke-Wulf Fw 61, the first fully controllable helicopter, makes its maiden flight."], ["1936-06-29T00:00:00", "United States Maritime Commission is formed."], ["1936-07-11T00:00:00", "The Triborough Bridge in New York City is opened to traffic - the bridge was renamed Robert F. Kennedy Bridge in 2008."], ["1936-07-13T00:00:00", "14 - Peak of July 1936 heat wave: The U.S. states of Wisconsin, Michigan, and Indiana all set new state records for high temperature. At Mio in northern Michigan, it soars to 113°F (45°C)."], ["1936-07-17T00:00:00", "The Spanish Army of Africa launches a coup d'état against the Second Spanish Republic, beginning the Spanish Civil War."], ["1936-07-20T00:00:00", "Montreux Convention Regarding the Regime of the Straits is signed in Montreux, allowing Turkey to fortify the Dardanelles and the Bosphorus but guaranteeing free passage to ships of all nations in peacetime."], ["1936-08-01T00:00:00", "The 1936 Summer Olympics open in Berlin, Germany, and mark the first live television coverage of a sports event in world history. Note that John Logie Baird had previously broadcast the Derby horse race in Britain in 1931."], ["1936-08-03T00:00:00", "African-American athlete Jesse Owens wins the 100-meter dash at the Berlin Olympics."], ["1936-08-14T00:00:00", "Rainey Bethea was hanged in Owensboro, Kentucky, in the last public execution in the United States"], ["1936-08-14T00:00:00", "1936 Summer Olympics: The United States men's national basketball team wins the first Olympic basketball tournament in the final game over Canada, 19-8."], ["1936-08-19T00:00:00", "The first of the Moscow Trials begins in the Soviet Union."], ["1936-08-26T00:00:00", "Anglo-Egyptian Treaty of 1936 is signed."], ["1936-08-30T00:00:00", "Ernest Nash flees Germany for Rome."], ["1936-08-30T00:00:00", "President Franklin D. Roosevelt attends the dedication of Thomas Jefferson's head at Mount Rushmore."], ["1936-09-05T00:00:00", "Spanish Civil War: Robert Capa's photograph The Falling Soldier is taken."], ["1936-09-07T00:00:00", "The last known thylacine (Tasmanian Tiger), named Benjamin, dies in Hobart Zoo in Tasmania."], ["1936-09-10T00:00:00", "The first World Speedway Championship is held at Wembley Stadium in London, England. It is won by Australian Lionel Van Praag, with Englishman Eric Langton second and Australian Bluey Wilkinson third."], ["1936-09-12T00:00:00", "The Disney animated short Donald and Pluto is released."], ["1936-09-28T00:00:00", "After the election to the Swedish Riksdag`s second chamber, Axel Pehrsson-Bramstorp and his \"Holiday Cabinet\" ( \"Semesterregeringen\" ) resigns. Per Albin Hansson returns as Prime Minister, and stays in office to his death in a heart attack in 1946 ."], ["1936-10-11T00:00:00", "Earl Bascom, rodeo cowboy and artist, designs and builds Mississippi's first permanent rodeo arena at Columbia, Mississippi."], ["1936-10-19T00:00:00", "H.R. Ekins, reporter for the New York World-Telegram, wins a race to travel around the world on commercial airline flights, beating Dorothy Kilgallen of the New York Journal and Leo Kieran of the New York Times. The flight takes 18½ days."], ["1936-10-25T00:00:00", "Rome-Berlin Axis is formed."], ["1936-10-29T00:00:00", "The historic Uptown Theater (Washington, D.C.) opens."], ["1936-11-02T00:00:00", "The BBC launches the world's first regular (then) high-definition television service."], ["1936-11-02T00:00:00", "The Canadian Broadcasting Corporation (CBC) begins radio in Canada."], ["1936-11-03T00:00:00", "U.S. presidential election, 1936: Franklin D. Roosevelt is reelected to a second term in a landslide victory over Kansas Governor Alf Landon. Farmers support Roosevelt."], ["1936-11-09T00:00:00", "American fashion designer Ruth Harkness encounters and captures a nine-week-old panda cub in Sichuan, China; it becomes the first live giant panda to enter the United States."], ["1936-11-12T00:00:00", "In California, the San Francisco-Oakland Bay Bridge opens to traffic."], ["1936-11-20T00:00:00", "A levee failure and continued massive rain at the Mitsubishi Osarizawa mine, Kazuno, northeastern Akita, Japan, results in at least 375 deaths."], ["1936-11-23T00:00:00", "Life magazine begins publication as a weekly news magazine in the United States under the management of Henry Luce."], ["1936-11-25T00:00:00", "The Abraham Lincoln Brigade sails from New York City on its way to the Spanish Civil War."], ["1936-11-26T00:00:00", "The Anti-Comintern Pact is signed by Germany and Japan."], ["1936-11-30T00:00:00", "In London, the Crystal Palace is destroyed in a fire (it had been built for the 1851 Great Exhibition)."], ["1936-12-01T00:00:00", "Hitler mandates that all German boys aged 10 to 18 join the Hitler Youth paramilitary organization."], ["1936-12-03T00:00:00", "Radio station WQXR is officially founded in New York City."], ["1936-12-05T00:00:00", "1936 Soviet Constitution, promulgated by Stalin, is adopted in the Soviet Union. The Transcaucasian Socialist Federative Soviet Republic is dissolved and Armenia, Azerbaijan, and Georgia become full Republics of the Soviet Union."], ["1936-12-10T00:00:00", "Edward VIII abdication crisis: King Edward VIII of the United Kingdom signs an instrument of abdication at Fort Belvedere, Surrey in the presence of his three brothers, The Duke of York, The Duke of Gloucester and The Duke of Kent."], ["1936-12-11T00:00:00", "Edward VIII abdication crisis: - The British Parliament passes His Majesty's Declaration of Abdication Act 1936 on behalf of the U.K., Australia, New Zealand and South Africa. The King performs his last act as sovereign by giving Royal Assent to the Act, and his brother Prince Albert, Duke of York, becomes King, reigning as King George VI."], ["1936-12-11T00:00:00", "Edward VIII abdication crisis: - The abdicated King Edward VIII, now HRH Prince Edward, makes a broadcast to the nation explaining his decision to abdicate. He leaves the country for Austria."], ["1936-12-11T00:00:00", "Edward VIII abdication crisis: - Taking the opportunity to free itself further from ties to the United Kingdom, the Oireachtas of the Irish Free State passes the Constitution (Amendment No. 27) Act 1936, removing most powers from the office of Governor-General of the Irish Free State, and the Executive Authority (External Relations) Act 1936 (signed into law December 12) assenting to the abdication and restricting the power of the monarch in relation to Ireland to international affairs."], ["1936-12-12T00:00:00", "Xi'an Incident: Generalissimo Chiang Kai-shek of the Republic of China is kidnapped by Marshal Zhang Xueliang."], ["1936-12-24T00:00:00", "Release of the film Natalka Poltavka in Ukraine, the first filmed Russian opera."], ["1936-12-29T00:00:00", "The United Auto Workers begins the Flint Sit-Down Strike in Flint, Michigan."]]