[["1925-01-01T00:00:00", "Kristiania, the capital of Norway, reverted to its original name of Oslo."], ["1925-01-03T00:00:00", "Benito Mussolini made a pivotal speech in the Italian Chamber of Deputies. He took personal responsibility for the actions of his Blackshirts, challenged his political opponents to remove him from office and then promised to take charge of restoring order to Italy within forty-eight hours. Historians now trace this speech to the beginning of Mussolini's dictatorship."], ["1925-01-05T00:00:00", "Nellie Tayloe Ross became the first female governor (Wyoming) in the United States. Twelve days later, Ma Ferguson became first female governor of Texas."], ["1925-02-15T00:00:00", "The Alice Comedy Alice Solves the Puzzle was released by Disney Brothers Cartoon Studio, introducing Bootleg Pete (an early prototype for Pegleg Pete) for the first time."], ["1925-02-21T00:00:00", "*This is the cover date of the very first issue of The New Yorker, though not necessarily the publication date, as magazines usually date their covers ahead of time."], ["1925-02-25T00:00:00", "Art Gillham recorded for Columbia Records the first Western Electric masters to be commercially released."], ["1925-02-28T00:00:00", "The 1925 Charlevoix-Kamouraska earthquake struck northeastern North America."], ["1925-03-04T00:00:00", "İsmet İnönü was appointed as the prime minister in Turkey (Turkey's 4th and İnönü's 3rd government)."], ["1925-03-04T00:00:00", "The inauguration of Calvin Coolidge as President of the United States was the first to be broadcast on radio."], ["1925-03-06T00:00:00", "Pionerskaya Pravda, one of the oldest children's newspapers in Europe, was founded in the Soviet Union."], ["1925-03-15T00:00:00", "The Phi Lambda Chi fraternity (original name \"The Aztecs\") was founded on the campus of Arkansas State Teacher's College in Conway, Arkansas (now the University of Central Arkansas)."], ["1925-03-18T00:00:00", "The Tri-State Tornado, the deadliest in U.S. history, rampaged through Missouri, Illinois, and Indiana, killing 695 people and injuring 2,027. It hit the towns of Murphysboro, Illinois; Gorham, Illinois; Ellington, Missouri; and Griffin, Indiana."], ["1925-03-21T00:00:00", "Tennessee Governor Austin Peay signed the Butler Act, prohibiting the teaching of evolution in the state's public schools."], ["1925-03-31T00:00:00", "Radio station WOWO in Fort Wayne, Indiana began broadcasting."], ["1925-04-01T00:00:00", "Frank Heath and his horse Gypsy Queen left Washington, D.C. to begin a two-year journey to visit all 48 states."], ["1925-04-01T00:00:00", "The Patent and Trademark Office was transferred to the Department of Commerce."], ["1925-04-10T00:00:00", "F. Scott Fitzgerald published The Great Gatsby."], ["1925-04-15T00:00:00", "Fritz Haarmann, a serial killer convicted of the murder of 24 boys and young men, was beheaded in Germany."], ["1925-04-16T00:00:00", "The Communist assault on St. Nedelya Church claims roughly 150 lives in Sofia, Bulgaria."], ["1925-04-20T00:00:00", "Iranian forces of Rezā Shāh occupied Ahvaz, and arrested Sheikh Khaz'al."], ["1925-04-28T00:00:00", "Presenting the Stanley Baldwin government's budget, Chancellor of the Exchequer Winston Churchill announced Britain's return to the gold standard."], ["1925-05-01T00:00:00", "The mausoleums in al-Baqi were destroyed by King Ibn Saud (Lanati). In the same year, he also demolishes the tombs of holy persons at Mualla Cemetery in Mecca where Muhammad's first wife Khadijah, his grandfather and other ancestors are buried. This happened despite protests by the international Islamic community."], ["1925-05-05T00:00:00", "Scopes Trial: Dayton, Tennessee, biology teacher John Scopes was arrested for teaching Charles Darwin's Theory of Evolution."], ["1925-05-05T00:00:00", "The General Election Law was passed in Japan."], ["1925-05-08T00:00:00", "Tom Lee rescued 32 people from the M.E. Norman, a sinking steamboat."], ["1925-05-25T00:00:00", "Scopes Trial: John T. Scopes was indicted for teaching Darwin's theory of evolution."], ["1925-05-25T00:00:00", "The National Forensic League was founded."], ["1925-05-29T00:00:00", "British explorer Percy Fawcett sent a last telegram to his wife, before he disappeared in the Amazon."], ["1925-06-01T00:00:00", "Percy and Florence Arrowsmith were married. This couple, who celebrated their 80th wedding anniversary June 1, 2005 (Percy aged 105, and wife Florence 100), are acknowledged by the Guinness Book of Records as record-holders for the longest marriage for a living couple and the greatest aggregate age of a married couple."], ["1925-06-06T00:00:00", "The Chrysler Corporation was founded by Walter Percy Chrysler."], ["1925-06-13T00:00:00", "Charles Francis Jenkins achieved the first synchronized transmission of pictures and sound, using 48 lines, and a mechanical system. A 10-minute film of a miniature windmill in motion was sent across 5 miles from Anacostia to Washington, D.C. The images were viewed by representatives of the National Bureau of Standards, the U.S. Navy, the Commerce Department, and others. Jenkins calls this \"the first public demonstration of radiovision\"."], ["1925-06-14T00:00:00", "The Aristotle University of Thessaloniki in Greece was founded."], ["1925-06-14T00:00:00", "The Turkish football club Göztepe was founded."], ["1925-06-29T00:00:00", "1925 Santa Barbara earthquake: A 6.8 earthquake destroyed downtown Santa Barbara, California."], ["1925-07-09T00:00:00", "In Dublin, Ireland, Oonagh Keogh became the first female member of a stock exchange in the world."], ["1925-07-10T00:00:00", "Scopes Trial: In Dayton, Tennessee, the so-called \"Monkey Trial\" began with John T. Scopes, a young high school science teacher, accused of teaching evolution in violation of a Tennessee state law."], ["1925-07-10T00:00:00", "Meher Baba begins his 44-year silence."], ["1925-07-18T00:00:00", "Adolf Hitler published Volume 1 of his personal manifesto Mein Kampf."], ["1925-07-21T00:00:00", "Scopes Trial: In Dayton, Tennessee, high school biology teacher John T. Scopes was found guilty of teaching evolution in class and fined $100."], ["1925-07-25T00:00:00", "The Telegraph Agency of the Soviet Union (TASS) was established."], ["1925-08-08T00:00:00", "The Ku Klux Klan demonstrated its popularity by holding a parade in Washington DC; as many as 40,000 male and female members of the Klan march down Pennsylvania Avenue. In 1925, an estimated 5,000,000 members belong to the Ku Klux Klan, making it the largest fraternal organization in the United States."], ["1925-08-14T00:00:00", "The original Hetch Hetchy Moccasin Powerhouse was completed and goes on line."], ["1925-08-25T00:00:00", "The French completed their evacuation of the Ruhr region of Germany."], ["1925-09-03T00:00:00", "The U.S. dirigible Shenandoah broke up near Caldwell, Ohio; 14 crewmen are killed."], ["1925-09-27T00:00:00", "Feast of the Cross according to the Old Calendar; A celestial cross appeared over Athens, Greece, while the Greek police pursues a group of Greek Old Calendarists. The phenomenon lasted for half an hour."], ["1925-10-01T00:00:00", "Mount Rushmore National Memorial was dedicated in South Dakota."], ["1925-10-02T00:00:00", "In London - John Logie Baird successfully transmitted the first television pictures with a greyscale image."], ["1925-10-02T00:00:00", "In London - The city's first enclosed double-decker buses were introduced."], ["1925-10-08T00:00:00", "Cubana de Aviación was founded."], ["1925-11-05T00:00:00", "Secret agent Sidney Reilly is executed by the OGPU, the secret police of the Soviet Union."], ["1925-11-14T00:00:00", "The first Surrealist art exhibition opened in Paris."], ["1925-11-24T00:00:00", "The silent film El Húsar de la Muerte was released in Santiago, Chile."], ["1925-11-26T00:00:00", "Prajadhipok (Rama VII) was crowned as King of Siam."], ["1925-11-28T00:00:00", "The weekly country music-variety radio program Grand Ole Opry was first broadcast on WSM radio in Nashville, Tennessee, as the \"WSM Barn Dance\"."], ["1925-12-01T00:00:00", "The Locarno Treaties were signed in London."], ["1925-12-11T00:00:00", "Pope Pius XI's encyclical Quas primas, on the Feast of Christ the King, is promulgated."], ["1925-12-16T00:00:00", "Reza Shah became shah of Persia."], ["1925-12-16T00:00:00", "Alpha Phi Omega, a National service fraternity, was founded at Lafayette College."], ["1925-12-16T00:00:00", "Colombo Radio launched in Ceylon; the station was subsequently known as Radio Ceylon."], ["1925-12-25T00:00:00", "IG Farben was formed by the merger of six chemical companies in Germany."]]