[["1972-01-01T00:00:00", "Kurt Waldheim becomes Secretary-General of the United Nations."], ["1972-01-02T00:00:00", "Pierre Hotel Robbery: Six men rob the safe deposit boxes of The Pierre Hotel in New York City for at least $4 million."], ["1972-01-03T00:00:00", "MGM's 1951 Show Boat is presented on television by NBC for the first time. This marks the first complete network telecast of any version of Show Boat (it had already been filmed as a part-talkie in 1929, and as a full-sound musical in 1936)."], ["1972-01-04T00:00:00", "The first scientific hand-held calculator (HP-35) is introduced (price $395)."], ["1972-01-04T00:00:00", "Rose Heilbron becomes the first woman judge at the Old Bailey in London."], ["1972-01-05T00:00:00", "U.S. President Richard Nixon orders the development of a Space Shuttle program."], ["1972-01-07T00:00:00", "Iberia Airlines Flight 602 crashes into a 462-meter peak on the island of Ibiza; 104 are killed."], ["1972-01-07T00:00:00", "Howard Hughes speaks by telephone to denounce Clifford Irving's supposed biography of him."], ["1972-01-09T00:00:00", "The RMS Queen Elizabeth is destroyed by fire in Hong Kong harbor."], ["1972-01-10T00:00:00", "Sheikh Mujibur Rahman returns to Bangladesh from Pakistan."], ["1972-01-13T00:00:00", "Prime Minister of Ghana Kofi Abrefa Busia is overthrown in a military coup."], ["1972-01-14T00:00:00", "Queen Margrethe II of Denmark succeeds her father, King Frederick IX, on the throne of Denmark."], ["1972-01-19T00:00:00", "The Libertarian enclave Minerva on a platform in the South Pacific, sponsored by the Phoenix Foundation, declares independence. Soon neighboring Tonga annexes the area and dismantles the platform."], ["1972-01-20T00:00:00", "President Zulfikar Ali Bhutto announces that Pakistan will immediately begin a nuclear weapons program."], ["1972-01-20T00:00:00", "Fears are growing about the economy of the United Kingdom, where unemployment is now exceeding 1 million for the first time since World War II."], ["1972-01-21T00:00:00", "A New Delhi bootlegger sells wood alcohol to a wedding party; 100 die."], ["1972-01-21T00:00:00", "Tripura, part of the former independent Twipra Kingdom, becomes a full state of India."], ["1972-01-24T00:00:00", "Japanese soldier Shoichi Yokoi is discovered in Guam; he had spent 28 years in the jungle."], ["1972-01-25T00:00:00", "Shirley Chisholm, the first African American Congresswoman, announces her candidacy for President."], ["1972-01-26T00:00:00", "Yugoslavian air stewardess Vesna Vulović is the only survivor when her plane crashes in Czechoslovakia. She survives after falling 10,160 meters (33,330 feet) in the tail section of the aircraft."], ["1972-01-26T00:00:00", "The Aboriginal Tent Embassy is set up on the lawn of Parliament House in Canberra."], ["1972-01-30T00:00:00", "Bloody Sunday: The British Army kills 14 unarmed nationalist civil rights marchers in Derry, Northern Ireland."], ["1972-01-30T00:00:00", "Pakistan withdraws from the Commonwealth of Nations."], ["1972-01-31T00:00:00", "King Birendra succeeds his father as King of Nepal."], ["1972-02-02T00:00:00", "A bomb explodes at the British Yacht Club in West Berlin, killing Irwin Beelitz, a German boat builder."], ["1972-02-02T00:00:00", "The German militant group 2 June Movement announces its support of the Provisional Irish Republican Army."], ["1972-02-02T00:00:00", "Anti-British riots take place throughout Ireland. The British Embassy in Dublin is burned to the ground, as are several British-owned businesses."], ["1972-02-02T00:00:00", "The last draft lottery is held, a watershed event in the wind-down of military conscription in the United States during the Vietnam era. These draft candidates are never called to duty."], ["1972-02-03T00:00:00", "February 13 - The 1972 Winter Olympics are held in Sapporo, Japan."], ["1972-02-04T00:00:00", "Mariner 9 sends pictures as it orbits Mars."], ["1972-02-05T00:00:00", "U.S. airlines begin mandatory inspection of passengers and baggage."], ["1972-02-05T00:00:00", "Bob Douglas becomes the first African American elected to the Basketball Hall of Fame."], ["1972-02-09T00:00:00", "The British government declares a state of emergency over a miners' strike."], ["1972-02-15T00:00:00", "President of Ecuador José María Velasco Ibarra is deposed for the fourth time."], ["1972-02-15T00:00:00", "Phonorecords are granted U.S. federal copyright protection for the first time."], ["1972-02-17T00:00:00", "Volkswagen Beetle sales exceed those of the Ford Model T when the 15,007,034th Beetle is produced."], ["1972-02-18T00:00:00", "The California Supreme Court voids the state's death penalty, commuting all death sentences to life in prison."], ["1972-02-19T00:00:00", "Asama-Sansō incident: Five United Red Army members break into a lodge below Mount Asama, taking the wife of the lodge keeper hostage."], ["1972-02-21T00:00:00", "The Soviet unmanned spaceship Luna 20 lands on the Moon."], ["1972-02-21T00:00:00", "February 28 - U.S. President Richard M. Nixon makes an unprecedented 8-day visit to the People's Republic of China and meets with Mao Zedong."], ["1972-02-22T00:00:00", "Aldershot Bombing: An Official IRA bomb kills 7 in Aldershot, England."], ["1972-02-22T00:00:00", "Lufthansa Flight 649 is hijacked and taken to Aden. Passengers are released the following day after a ransom of 5 million US dollars is agreed."], ["1972-02-23T00:00:00", "Angela Davis is released from jail. A Caruthers, California farmer, Rodger McAfee, helps her make bail."], ["1972-02-24T00:00:00", "North Vietnamese negotiators walk out of the Paris Peace Talks to protest U.S. air raids."], ["1972-02-26T00:00:00", "A coal sludge spill kills 125 people in Buffalo Creek, West Virginia."], ["1972-02-26T00:00:00", "Luna 20 comes back to Earth with 55 grams (1.94 oz) of lunar soil."], ["1972-02-28T00:00:00", "The Asama-Sanso incident ends in a standoff between 5 members of the Japanese United Red Army and the authorities, in which 2 policemen are killed and 12 injured."], ["1972-03-01T00:00:00", "The Thai province Yasothon is created after being split off from the Ubon Ratchathani Province."], ["1972-03-01T00:00:00", "The Club of Rome publishes its report The Limits to Growth."], ["1972-03-01T00:00:00", "Juan María Bordaberry is sworn in as President of Uruguay amid accusations of election fraud."], ["1972-03-02T00:00:00", "The Pioneer 10 spacecraft is launched from Cape Kennedy, to be the first man-made satellite to leave the solar system."], ["1972-03-02T00:00:00", "Jean-Bédel Bokassa becomes President of the Central African Republic."], ["1972-03-03T00:00:00", "Sculpted figures of Jefferson Davis, Robert E. Lee, and Stonewall Jackson are completed at Stone Mountain in the U.S. state of Georgia."], ["1972-03-04T00:00:00", "Libya and the Soviet Union sign a cooperation treaty."], ["1972-03-04T00:00:00", "The Organisation of the Islamic Conference Charter is signed (effective 28 February 1973)."], ["1972-03-05T00:00:00", "Greek composer Mikis Theodorakis leaves the Greek Communist Party."], ["1972-03-13T00:00:00", "The United Kingdom and the People's Republic of China elevate diplomatic exchanges to the ambassadorial level after 22 years."], ["1972-03-13T00:00:00", "Clifford Irving admits to a New York court that he had fabricated Howard Hughes' \"autobiography\"."], ["1972-03-16T00:00:00", "The first building of the Pruitt-Igoe housing development in St. Louis is destroyed."], ["1972-03-19T00:00:00", "India and Bangladesh sign the Indo-Bangladeshi Treaty of Friendship, Cooperation and Peace."], ["1972-03-22T00:00:00", "The 92nd U.S. Congress votes to send the proposed Equal Rights Amendment to the states for ratification."], ["1972-03-24T00:00:00", "The Godfather is released in cinemas in the United States."], ["1972-03-24T00:00:00", "The British government announces the prorogation of the Parliament of Northern Ireland and the introduction of 'Direct Rule' of Northern Ireland, after the Unionist government refuses to cede security powers."], ["1972-03-25T00:00:00", "\"Après toi\" sung by Vicky Leandros (music by Klaus Munro & Mario Panas, lyric by Klaus Munro & Yves Dessca) wins the Eurovision Song Contest 1972 for Luxembourg."], ["1972-03-26T00:00:00", "An avalanche on Mount Fuji kills 19 climbers."], ["1972-03-26T00:00:00", "The last trolleybus system in the United Kingdom closes in Bradford, West Riding of Yorkshire after over 60 years of operation."], ["1972-03-26T00:00:00", "After 14 years, the last of Leonard Bernstein's Young People's Concerts is telecast by CBS. This last concert is devoted to Gustav Holst's The Planets."], ["1972-03-27T00:00:00", "The First Sudanese Civil War ends."], ["1972-03-30T00:00:00", "Vietnam War: The Easter Offensive begins after North Vietnamese forces cross into the Demilitarized Zone (DMZ) of South Vietnam"], ["1972-03-30T00:00:00", "The Parliament of Northern Ireland is suspended."], ["1972-04-07T00:00:00", "Vietnam War veteran Richard McCoy, Jr. hijacks a United Airlines jet and extorts $500,000; he is later captured."], ["1972-04-10T00:00:00", "The U.S. and the Soviet Union join some 70 nations in signing the Biological Weapons Convention, an agreement to ban biological warfare."], ["1972-04-10T00:00:00", "Tombs containing bamboo slips, among them Sun Tzu's Art of War and Sun Bin's lost military treatise, are accidentally discovered by construction workers in Shandong."], ["1972-04-10T00:00:00", "A 7.0 Richter scale earthquake kills 5,000 people in the Iranian province of Fars."], ["1972-04-10T00:00:00", "The 44th Annual Academy Awards are held at the Dorothy Chandler Pavilion in Los Angeles."], ["1972-04-12T00:00:00", "The X-rated animated movie Fritz the Cat is released."], ["1972-04-13T00:00:00", "The Universal Postal Union decides to recognize the People's Republic of China as the only legitimate Chinese representative, effectively expelling the Republic of China administering Taiwan."], ["1972-04-16T00:00:00", "Apollo 16 (John Young, Ken Mattingly, Charlie Duke) is launched. During the mission, the astronauts achieve a lunar rover speed record of 18 km/h."], ["1972-04-16T00:00:00", "Vietnam War - Nguyen Hue Offensive: Prompted by the North Vietnamese offensive, the United States resumes bombing of Hanoi and Haiphong."], ["1972-04-17T00:00:00", "The first Boston Marathon in which women are officially allowed to compete."], ["1972-04-22T00:00:00", "Sylvia Cook and John Fairfax finish rowing across the Pacific."], ["1972-04-26T00:00:00", "The Lockheed L-1011 TriStar enters service with Eastern Airlines."], ["1972-04-27T00:00:00", "The Burundian Genocide against the Hutu begins; more than 500,000 Hutus die."], ["1972-04-27T00:00:00", "A no-confidence vote against German Chancellor Willy Brandt fails under obscure circumstances."], ["1972-04-29T00:00:00", "The fourth anniversary of the Broadway musical Hair is celebrated with a free concert at a Central Park bandshell, followed by dinner at the Four Seasons. There, 13 Black Panther protesters and the show's co-author, Jim Rado, are arrested for disturbing the peace and for using marijuana."], ["1972-05-02T00:00:00", "Fire in a silver mine in Idaho kills 91."], ["1972-05-05T00:00:00", "An Alitalia DC-8 crashes west of Palermo, Sicily; 115 die."], ["1972-05-07T00:00:00", "General elections are held in Italy."], ["1972-05-08T00:00:00", "U.S. President Richard Nixon orders the mining of Haiphong Harbor in Vietnam."], ["1972-05-10T00:00:00", "Operation Linebacker and Operation Custom Tailor begin with large-scale bombing operations against North Vietnam by tactical fighter aircraft"], ["1972-05-13T00:00:00", "A Fire in a nightclub atop the Sennichi department store in Osaka, Japan, kills 115."], ["1972-05-15T00:00:00", "Okinawa is returned to Japan after 27 years of United States occupation."], ["1972-05-15T00:00:00", "Governor George C. Wallace of Alabama is shot and paralyzed by Arthur Herman Bremer at a Laurel, Maryland, political rally."], ["1972-05-16T00:00:00", "The first financial derivatives exchange, the International Monetary Market (IMM), opens on the Chicago Mercantile Exchange."], ["1972-05-18T00:00:00", "Four troopers of the British Special Air Service and Special Boat Service are parachuted onto the ocean liner Queen Elizabeth 2 1,000 miles (1,600 km) across the Atlantic after a bomb threat and ransom demand which turn out to be bogus."], ["1972-05-19T00:00:00", "Three out of 6 bombs explode in the Axel Springer AG media company offices in Hamburg, Germany, injuring 17; the Red Army Faction claims responsibility."], ["1972-05-21T00:00:00", "In St. Peter's Basilica (Vatican City), Laszlo Toth attacks Michelangelo's Pietà statue with a geologist's hammer, shouting that he is Jesus Christ."], ["1972-05-22T00:00:00", "The Dominion of Ceylon becomes the republic of Sri Lanka under prime minister Sirimavo Bandaranaike, when its new constitution is ratified."], ["1972-05-22T00:00:00", "Ferit Melen forms the new (interim) government of Turkey (35th government)"], ["1972-05-23T00:00:00", "The Tamil United Front (later known as Tamil United Liberation Front), a pro-Tamil organization, is founded in Sri Lanka."], ["1972-05-24T00:00:00", "Scottish Association football club Rangers F.C. win the UEFA Cup Winners' Cup, defeating FC Dynamo Moscow 3-2 in the final at Camp Nou in Barcelona (Spain). A pitch invasion by their supporters leads to the team being banned from defending the trophy the following season."], ["1972-05-24T00:00:00", "A Red Army Faction bomb explodes in the Campbell Barracks of the U.S. Army Supreme European Command in Heidelberg, West Germany; 3 U.S. soldiers (Clyde Bonner, Ronald Woodard and Charles Peck) are killed."], ["1972-05-24T00:00:00", "The Magnavox Odyssey video game system is first demoed, marking the dawn of the video game age; it goes on sale to the public in August."], ["1972-05-26T00:00:00", "Richard Nixon and Leonid Brezhnev sign the SALT I treaty in Moscow, as well as the Anti-Ballistic Missile Treaty and other agreements."], ["1972-05-26T00:00:00", "Wernher von Braun retires from NASA, frustrated by the agency's unwillingness to pursue a manned trans-orbital space program."], ["1972-05-26T00:00:00", "Willandra National Park is established in Australia."], ["1972-05-27T00:00:00", "Mark Donohue wins the Indianapolis 500 in the Penske Racing McLaren-Offenhauser."], ["1972-05-30T00:00:00", "The Angry Brigade goes on trial in the United Kingdom."], ["1972-05-30T00:00:00", "Three Japanese Red Army members kill 24 and injure 100 in Lod Airport, Israel."], ["1972-06-02T00:00:00", "Andreas Baader, Jan-Carl Raspe, Holger Meins and some other members of the Red Army Faction are arrested in Frankfurt am Main after a shootout."], ["1972-06-03T00:00:00", "Sally Priesand becomes the first female U.S. rabbi."], ["1972-06-04T00:00:00", "Angela Davis is found not guilty of murder."], ["1972-06-05T00:00:00", "June 16 - The United Nations Conference on the Human Environment is held in Stockholm, Sweden"], ["1972-06-08T00:00:00", "Seven men and three women hijack a plane from Czechoslovakia to West Germany."], ["1972-06-08T00:00:00", "Vietnam War: Associated Press photographer Nick Ut takes his Pulitzer Prize-winning photograph of a naked nine-year-old Phan Thi Kim Phuc running down a road after being burned by napalm."], ["1972-06-09T00:00:00", "The Black Hills flood kills 238 in South Dakota."], ["1972-06-11T00:00:00", "Henri Pescarolo (France) and co-driver former World Drivers' Champion Graham Hill (Britain) win the 24 Hours of Le Mans in the Equipe Matra MS670."], ["1972-06-14T00:00:00", "June 23 - Hurricane Agnes kills 117 on the U.S. East Coast."], ["1972-06-14T00:00:00", "Japan Airlines Flight 471 crashes outside of New Delhi airport, killing 82 of 87 occupants."], ["1972-06-15T00:00:00", "Ulrike Meinhof and Gerhard Müller of the Red Army Faction are arrested in a teacher's apartment in Langenhagen, West Germany."], ["1972-06-15T00:00:00", "June 18 - The first U.S. Libertarian Party National Convention is held in Denver, Colorado."], ["1972-06-16T00:00:00", "108 die as 2 passenger trains hit the debris of a collapsed railway tunnel near Soissons, France."], ["1972-06-17T00:00:00", "Watergate scandal: Five White House operatives are arrested for burglarizing the offices of the Democratic National Committee."], ["1972-06-17T00:00:00", "The United States returns Okinawa, occupied and governed since the World War II Battle of Okinawa, to Japan."], ["1972-06-17T00:00:00", "Chilean president Salvador Allende forms a new government."], ["1972-06-18T00:00:00", "Staines air disaster: 118 die when a Trident 1 jet airliner crashes 2 minutes after take off from London Heathrow Airport."], ["1972-06-18T00:00:00", "West Germany beats the Soviet Union 3-0 to win Euro 72."], ["1972-06-18T00:00:00", "Hong Kong's worst flooding and landslides in recorded history with 653.2 millimetres (25.72 in) of rainfall in the previous 3 days. 67 people die due to building collapses in Mid-levels districts landslide and building collapses, with a further 83 due to flooding-related fatalities. It is the second worst fatality due to building collapses, and the worst flooding in Hong Kong's recorded history."], ["1972-06-23T00:00:00", "Watergate scandal: U.S. President Richard M. Nixon and White House chief of staff H. R. Haldeman are taped talking about using the C.I.A. to obstruct the F.B.I.'s investigation into the Watergate break-ins."], ["1972-06-26T00:00:00", "Nolan Bushnell and Ted Dabney co-found Atari."], ["1972-06-28T00:00:00", "U.S. President Richard Nixon announces that no new draftees will be sent to Vietnam."], ["1972-06-29T00:00:00", "Furman v. Georgia: The Supreme Court of the United States rules that capital punishment is unconstitutional."], ["1972-06-30T00:00:00", "The International Time Bureau adds the first leap second (23:59:60) to Coordinated Universal Time (UTC) at the end of the month."], ["1972-07-01T00:00:00", "The Canadian ketch Vega, flying the Greenpeace III banner, collides with the French naval minesweeper La Paimpolaise while in international waters, to protest French nuclear weapon tests in the South Pacific."], ["1972-07-01T00:00:00", "The Bureau of Alcohol, Tobacco and Firearms becomes independent from the IRS."], ["1972-07-02T00:00:00", "Following Pakistan's surrender to India in the Indo-Pakistani War of 1971, both nations sign the historic Simla Agreement, agreeing to settle their disputes bilaterally."], ["1972-07-04T00:00:00", "The first Rainbow Gathering is held in Colorado."], ["1972-07-08T00:00:00", "The U.S. sells grain to the Soviet Union for $750 million."], ["1972-07-10T00:00:00", "India's news agency reports that at least 24 people have been killed in separate incidents, in the Chandka Forest in India, by elephants crazed by heat and drought."], ["1972-07-10T00:00:00", "July 14 - The Democratic National Convention meets in Miami Beach. Senator George McGovern, who backs the immediate and complete withdrawal of U.S. troops from South Vietnam, is nominated for President. He names fellow Senator Thomas Eagleton as his running mate."], ["1972-07-15T00:00:00", "The Pruitt-Igoe housing development is demolished in St. Louis, Missouri."], ["1972-07-17T00:00:00", "The McDonnell Douglas F-15 Eagle makes its first flight."], ["1972-07-18T00:00:00", "Anwar Sadat expels 20,000 Soviet advisors from Egypt."], ["1972-07-21T00:00:00", "Bloody Friday: 22 bombs planted by the Provisional IRA explode in Belfast, Northern Ireland; nine people are killed and 130 seriously injured."], ["1972-07-21T00:00:00", "Comedian George Carlin is arrested by Milwaukee police for public obscenity, for reciting his \"Seven Words You Can Never Say On Television\" at Summerfest."], ["1972-07-21T00:00:00", "A collision between two trains near Seville, Spain kills 76 people."], ["1972-07-23T00:00:00", "The United States launches Landsat 1, the first Earth-resources satellite."], ["1972-07-24T00:00:00", "King Jigme Singye Wangchuck succeeds his father Jigme Dorji Wangchuck as king of Bhutan."], ["1972-07-25T00:00:00", "U.S. health officials admit that African-Americans were used as guinea pigs in the Tuskegee Study of Untreated Syphilis in the Negro Male."], ["1972-07-29T00:00:00", "A national dock strike begins in Britain."], ["1972-07-31T00:00:00", "The Troubles, Northern Ireland: - Operation Motorman 4:00 AM: The British Army begins to regain control of the \"no-go areas\" established by Irish republican paramilitaries in Belfast, Derry (\"Free Derry\") and Newry."], ["1972-07-31T00:00:00", "The Troubles, Northern Ireland: - Claudy bombing (\"Bloody Monday\"), 10:00 AM: Three car bombs in Claudy, County Londonderry, kill 9. It becomes public knowledge only in 2010 that a local Catholic priest was an IRA officer believed to be involved in the bombings but his role was covered up by the authorities."], ["1972-08-01T00:00:00", "U.S. Senator Thomas Eagleton, the Democratic vice-presidential nominee, withdraws from the race after revealing he was once treated for mental illness."], ["1972-08-04T00:00:00", "Arthur Bremer is jailed for 63 years for shooting George Wallace."], ["1972-08-04T00:00:00", "Dictator Idi Amin declares that Uganda will expel 50,000 Asians with British passports to Britain within 3 months."], ["1972-08-04T00:00:00", "A huge solar flare (one of the largest ever recorded) knocks out cable lines in U.S. It begins with the appearance of sunspots on August 2; an August 4 flare kicks off high levels of activity until August 10."], ["1972-08-10T00:00:00", "A brilliant, daytime meteor skips off the Earth's atmosphere due to an Apollo asteroid streaking over the western US into Canada."], ["1972-08-14T00:00:00", "An East German Ilyushin airliner crashes near East Berlin; all 156 on board perish."], ["1972-08-16T00:00:00", "As part of a coup attempt, members of the Royal Moroccan Air Force fire upon, but fail to bring down, Hassan II of Morocco's plane while he is traveling back to Rabat."], ["1972-08-21T00:00:00", "The Republican National Convention in Miami Beach, Florida renominates U.S. President Richard Nixon and Vice President Spiro Agnew for a second term."], ["1972-08-22T00:00:00", "Rhodesia is expelled by the IOC for its racist policies."], ["1972-08-22T00:00:00", "John Wojtowicz, 27, and Sal Naturile, 18, hold several Chase Manhattan Bank employees hostage for 17 hours in Gravesend, Brooklyn, N.Y. (an event later dramatized in the film Dog Day Afternoon)."], ["1972-08-22T00:00:00", "In the Almirante Zar Naval Base, Argentina, 16 detainees are executed by firing squad in the Trelew massacre."], ["1972-08-26T00:00:00", "September 11 - The 1972 Summer Olympics are held in Munich, West Germany."], ["1972-09-01T00:00:00", "Bobby Fischer defeats Boris Spassky in a chess match in Reykjavík, Iceland, becoming the first American world chess champion."], ["1972-09-01T00:00:00", "The Second Cod War begins between the United Kingdom and Iceland."], ["1972-09-04T00:00:00", "The first episode of The Price Is Right is aired on CBS by Bob Barker. Gambit and The Joker's Wild also premiere."], ["1972-09-05T00:00:00", "September 6 - Munich massacre: Eleven Israeli athletes at the 1972 Summer Olympics in Munich are murdered after 8 members of the Arab terrorist group Black September invade the Olympic Village; 5 guerillas and 1 policeman are also killed in a failed hostage rescue."], ["1972-09-10T00:00:00", "The Brazilian driver Emerson Fittipaldi wins the Italian Grand Prix at Monza and becomes the youngest Formula One World Champion."], ["1972-09-14T00:00:00", "West Germany and Poland renew diplomatic relations."], ["1972-09-17T00:00:00", "Uganda announces that there are Tanzanian troops in its territory."], ["1972-09-17T00:00:00", "The television series M*A*S*H begins its run on CBS."], ["1972-09-18T00:00:00", "São Paulo Metro is inaugurated in Brazil."], ["1972-09-19T00:00:00", "A parcel bomb sent to the Israeli Embassy in London kills 1 diplomat."], ["1972-09-21T00:00:00", "Philippine president Ferdinand Marcos issues Proclamation No. 1081 placing the entire country under martial law."], ["1972-09-24T00:00:00", "An F-86 fighter aircraft leaving an air show at Sacramento Executive Airport fails to become airborne and crashes into a Farrell's Ice Cream Parlour, killing 12 children and 11 adults."], ["1972-09-25T00:00:00", "Norwegian EC referendum, 1972: Norway rejects membership in the European Economic Community."], ["1972-09-27T00:00:00", "The Joint Communiqué of the Government of Japan and the Government of the People's Republic of China is signed in Beijing."], ["1972-09-28T00:00:00", "The Canadian national men's hockey team defeats the Soviet national ice hockey team in Game 8 of the 1972 Summit Series (French: La Série du Siècle, Russian: Суперсерия СССР — Канада), 6-5, to win the series 4-3-1."], ["1972-09-29T00:00:00", "Sino-Japanese relations: Japan normalizes diplomatic relations with the People's Republic of China after breaking official ties with the Republic of China (Taiwan)."], ["1972-10-01T00:00:00", "The first publication reporting the production of a recombinant DNA molecule marks the birth of modern molecular biology methodology."], ["1972-10-01T00:00:00", "Alex Comfort's bestselling manual The Joy of Sex is published."], ["1972-10-02T00:00:00", "Denmark joins the European Community; the Faroe Islands stay out."], ["1972-10-05T00:00:00", "The United Reformed Church is founded out of the Congregational and Presbyterian Churches."], ["1972-10-06T00:00:00", "A train crash in Saltillo, Mexico kills 208 people."], ["1972-10-08T00:00:00", "A major breakthrough in occurs in the Paris peace talks between Henry Kissinger and Lê Đức Thọ"], ["1972-10-08T00:00:00", "R. Sargent Shriver is chosen to replace Thomas Eagleton as the U.S. vice-presidential nominee of the Democratic Party."], ["1972-10-12T00:00:00", "En route to the Gulf of Tonkin, a racial riot involving more than 200 sailors breaks out aboard the United States Navy aircraft carrier USS Kitty Hawk; nearly 50 sailors are injured."], ["1972-10-13T00:00:00", "Uruguayan Air Force Flight 571: A Fairchild FH-227D passenger aircraft transporting a rugby union team crashes at about 14,000' in the Andes mountain range, near the Argentina/Chile border. Sixteen of the survivors are found alive December 20 but they have had to resort to cannibalism to survive."], ["1972-10-16T00:00:00", "A plane carrying U.S. Congressman Hale Boggs of Louisiana and 3 other men vanishes in Alaska. The wreckage has never been found, despite a massive search at the time."], ["1972-10-16T00:00:00", "Rioting Maze Prison inmates cause a fire that destroys most of the camp."], ["1972-10-17T00:00:00", "Elizabeth II visits Yugoslavia."], ["1972-10-25T00:00:00", "The first female FBI agents are hired."], ["1972-10-25T00:00:00", "Belgian Eddy Merckx sets a new world hour record in cycling in Mexico City."], ["1972-10-26T00:00:00", "Following a visit to South Vietnam, U.S. National Security Advisor Henry Kissinger suggests that \"peace is at hand.\""], ["1972-10-28T00:00:00", "The Airbus A300 flies for the first time."], ["1972-10-29T00:00:00", "Lufthansa Flight 615 is hijacked and threats are made to be blown up if the three surviving perpetrators of the Munich massacre are not released from prison in West Germany. The demands are accepted, leading to fierce condemnation by Israel."], ["1972-10-30T00:00:00", "U.S. President Richard Nixon approves legislation to increase Social Security spending by US$5.3 billion."], ["1972-10-30T00:00:00", "A commuter train collision in Chicago kills 45, injures hundreds."], ["1972-11-05T00:00:00", "A group of Amerindians occupies the Bureau of Indian Affairs."], ["1972-11-07T00:00:00", "U.S. presidential election, 1972: Republican incumbent Richard Nixon defeats Democratic Senator George McGovern in a landslide (the election had the lowest voter turnout since 1948, with only 55 percent of the electorate voting)."], ["1972-11-08T00:00:00", "the oldest and longest continuously operating pay television service in the United States, HBO, is launched."], ["1972-11-11T00:00:00", "Vietnam War - Vietnamization: The United States Army turns over the massive Long Binh military base to South Vietnam."], ["1972-11-14T00:00:00", "The Dow Jones Industrial Average closes above 1,000 (1,003.16) for the first time."], ["1972-11-16T00:00:00", "The United Nations Educational, Scientific and Cultural Organization adopts the Convention Concerning the Protection of the World Cultural and Natural Heritage"], ["1972-11-19T00:00:00", "Seán Mac Stíofáin, a leader of the Provisional Irish Republican Army, is arrested in Dublin after giving an interview to RTÉ."], ["1972-11-22T00:00:00", "Vietnam War: The United States loses its first B-52 Stratofortress of the war."], ["1972-11-28T00:00:00", "The last executions in Paris, France. Roger Bontems and Claude Buffet - the Clairvaux Mutineers - are guillotined at La Santé Prison by chief executioner André Obrecht (already suffering from Parkinson's disease). Bontems had been found innocent of murder by the court, but as Buffet's accomplice is condemned to death anyway. President Georges Pompidou, in private an abolitionist, upholds both death sentences in deference to French public opinion."], ["1972-11-29T00:00:00", "Atari kicks off the first generation of video games with the release of their seminal arcade version of Pong, the first game to achieve commercial success."], ["1972-11-29T00:00:00", "The \"tea house\" Mellow Yellow opens on the Amstel River in Amsterdam, pioneering the legal sale of cannabis in the Netherlands."], ["1972-11-30T00:00:00", "Vietnam War: White House Press Secretary Ron Ziegler tells the press that there will be no more public announcements concerning United States troop withdrawals from Vietnam, due to the fact that troop levels are now down to 27,000."], ["1972-11-30T00:00:00", "Cod War: British Foreign Secretary Sir Alec Douglas-Home says that Royal Navy ships will be stationed to protect British trawlers off Iceland."], ["1972-12-02T00:00:00", "Edward Gough Whitlam becomes the first Labor Party Prime Minister of Australia for 23 years. He is sworn in on 5 December and his first action using executive power is to withdraw all Australian personnel from the Vietnam War."], ["1972-12-07T00:00:00", "Apollo 17 (Gene Cernan, Ronald Evans, Harrison Schmitt), the last manned Moon mission to date, is launched and \"The Blue Marble\" photograph of the Earth is taken."], ["1972-12-07T00:00:00", "The Provisional Irish Republican Army kidnaps Jean McConville in Belfast."], ["1972-12-07T00:00:00", "Imelda Marcos is stabbed and seriously wounded by an assailant; her bodyguards shoot him."], ["1972-12-08T00:00:00", "United Airlines Flight 553 crashes short of the runway, killing 43 of 61 passengers and 2 people on the ground."], ["1972-12-08T00:00:00", "Over $10,000 cash is found in the purse of Watergate conspirator Howard Hunt's wife."], ["1972-12-08T00:00:00", "International Human Rights Day is proclaimed by the United Nations."], ["1972-12-14T00:00:00", "Apollo program: Eugene Cernan is the last person to walk on the moon, after he and Harrison Schmitt complete the third and final Extra-vehicular activity (EVA) of Apollo 17. This is the last manned mission to the moon of the 20th century."], ["1972-12-15T00:00:00", "The Commonwealth of Australia ordains equal pay for women."], ["1972-12-15T00:00:00", "The United Nations Environment Programme is established as a specialized agency of the United Nations."], ["1972-12-16T00:00:00", "The Constitution of Bangladesh comes into effect."], ["1972-12-16T00:00:00", "The Portuguese army kills 400 Africans in Tete, Mozambique."], ["1972-12-19T00:00:00", "Apollo program: Apollo 17 returns to Earth, concluding the program of lunar exploration."], ["1972-12-21T00:00:00", "East Germany and West Germany recognize each other."], ["1972-12-21T00:00:00", "ZANLA troopers attack Altera Farm in north-east Rhodesia."], ["1972-12-22T00:00:00", "Two small earthquakes are felt at about 9:30 and 10:15 local time in Managua, Nicaragua."], ["1972-12-22T00:00:00", "Australia establishes diplomatic relations with China and East Germany."], ["1972-12-22T00:00:00", "A peace delegation that includes singer-activist Joan Baez and human rights attorney Telford Taylor visit Hanoi to deliver Christmas mail to American prisoners of war (they will be caught in the Christmas bombing of North Vietnam)."], ["1972-12-23T00:00:00", "A 6.25 Richter scale earthquake in Nicaragua kills 5,000-12,000 people in the capital, Managua; President Anastasio Somoza Debayle is later accused of pocketing millions of dollars worth of foreign aid intended for relief."], ["1972-12-23T00:00:00", "The Pittsburgh Steelers win their first ever post-season NFL game, defeating the Oakland Raiders 13-7, on a last second play that becomes known as The Immaculate Reception."], ["1972-12-24T00:00:00", "Swedish Prime minister Olof Palme compares the American bombings of North Vietnam to Nazi massacres. The U.S. breaks diplomatic contact with Sweden."], ["1972-12-25T00:00:00", "The Christmas bombing of North Vietnam causes widespread criticism of the U.S. and President Richard Nixon."], ["1972-12-26T00:00:00", "Former United States President Harry S. Truman dies in Kansas City, Missouri."], ["1972-12-28T00:00:00", "The bones of Martin Bormann are identified in Berlin."], ["1972-12-29T00:00:00", "Eastern Air Lines Flight 401 crashes into the Everglades in Florida, killing 101 of 176 on board."], ["1972-12-31T00:00:00", "Roberto Clemente dies in a plane crash off the coast of Puerto Rico while en route to deliver aid to Nicaraguan earthquake victims."], ["1972-12-31T00:00:00", "An extra leap second (23:59:60) is added to end the year."], ["1972-12-31T00:00:00", "The US ban on the pesticide DDT takes effect."]]