[["1937-01-01T00:00:00", "Anastasio Somoza García becomes President of Nicaragua."], ["1937-01-11T00:00:00", "The first issue of Look magazine goes on sale in the United States."], ["1937-01-19T00:00:00", "Spanish Civil War: Second Battle of the Corunna Road (begun 13 December 1936) concludes with both sides withdrawing."], ["1937-01-19T00:00:00", "Howard Hughes establishes a record by flying from Los Angeles to New York City in 7 hours, 28 minutes and 25 seconds."], ["1937-01-20T00:00:00", "Franklin D. Roosevelt is sworn in as President of the United States for a second term by Chief Justice Charles Evans Hughes. This is the first time Inauguration Day in the United States is on this date, on which continues to occur; the change is due to the ratification in 1933 of the Twentieth Amendment to the United States Constitution."], ["1937-01-23T00:00:00", "Moscow Trials: Trial of the Anti-Soviet Trotskyist Center - In the Soviet Union seventeen leading Communists go on trial, accused of participating in a plot led by Leon Trotsky to overthrow Joseph Stalin's regime and assassinate its leaders."], ["1937-01-26T00:00:00", "Michigan celebrates its centennial anniversary as a U.S. state."], ["1937-01-31T00:00:00", "The Soviet Union executes 31 people for alleged Trotskyism."], ["1937-02-05T00:00:00", "U.S President Franklin D. Roosevelt proposes a plan to enlarge the Supreme Court of the United States."], ["1937-02-08T00:00:00", "Spanish Civil War: Falangist troops take Málaga."], ["1937-02-08T00:00:00", "February 27 - Spanish Civil War - Battle of Jarama: Nationalist and government troops fight to a stalemate."], ["1937-02-11T00:00:00", "A sit-down strike ends when General Motors recognizes the United Automobile Workers union."], ["1937-02-16T00:00:00", "Wallace H. Carothers receives a patent for nylon."], ["1937-02-19T00:00:00", "Airliner VH-UHH (Stinson) goes down over Lamington National Park, bound for Sydney, killing five people."], ["1937-02-19T00:00:00", "Yekatit 12: During a public ceremony at the Viceregal Palace (the former Imperial residence) in Addis Ababa, Ethiopia, two Eritrean nationalists attempt to kill viceroy Rodolfo Graziani with a number of grenades. The Italian security guard fire into the crowd of Ethiopian onlookers. Authorities exact further reprisals, which include indiscriminately slaughtering native Ethiopians over the next three days, detaining thousands of Ethiopians at Danan and slaughtering almost 300 monks at Debre Libanos monastery."], ["1937-02-20T00:00:00", "Roberto Ortiz is elected president of Argentina."], ["1937-02-21T00:00:00", "The League of Nations Non-Intervention Committee prohibits foreign nationals from fighting in the Spanish Civil War."], ["1937-03-17T00:00:00", "The Atherton Report (private investigator Edwin Atherton's report detailing vice and police corruption in San Francisco) is released."], ["1937-03-18T00:00:00", "New London School explosion: In the worst school disaster in American history in terms of lives lost, the New London School in New London, Texas, suffers a catastrophic natural gas explosion, killing in excess of 295 students and teachers. Mother Frances Hospital opens in Tyler, Texas, a day ahead of schedule in response to the explosion."], ["1937-03-19T00:00:00", "The encyclical Divini Redemptoris of Pope Pius XI, critical of communism, is published."], ["1937-03-21T00:00:00", "Ponce massacre: A police squad, acting under orders from Governor of Puerto Rico Blanton Winship, opens fire on demonstrators protesting at the arrest of Puerto Rican Nationalist Party leader Pedro Albizu Campos, killing 17 people and injuring over 200."], ["1937-03-21T00:00:00", "The first successful flying car, Waldo Waterman's Aerobile, makes its initial flight."], ["1937-03-26T00:00:00", "In Crystal City, Texas, spinach growers erect a statue of the cartoon character Popeye."], ["1937-03-26T00:00:00", "William H. Hastie becomes the first African American appointed to a federal judgeship in the United States."], ["1937-04-01T00:00:00", "Aden becomes a British crown colony."], ["1937-04-01T00:00:00", "Bombing of Jaén in Spain by the Condor Legion of the Nazi German Luftwaffe."], ["1937-04-09T00:00:00", "The Kamikaze arrives at Croydon Airport in London; it is the first Japanese-built aircraft to fly to Europe."], ["1937-04-12T00:00:00", "Frank Whittle ground-tests the world's first jet engine designed to power an aircraft, at Rugby, England."], ["1937-04-12T00:00:00", "NLRB v. Jones & Laughlin Steel Corp.: The Supreme Court of the United States rules that the National Labor Relations Act is constitutional."], ["1937-04-17T00:00:00", "The animated short Porky's Duck Hunt, directed by Tex Avery for the Looney Tunes series, featuring the debut of Daffy Duck, is released in the United States."], ["1937-04-20T00:00:00", "A fire in an elementary school in Kilingi-Nõmme, Estonia, kills seventeen students and injures fifty."], ["1937-04-26T00:00:00", "Spanish Civil War: Bombing of Guernica in Spain by the Condor Legion of the Nazi German Luftwaffe in support of the Francoists. Three-quarters of the town is destroyed and hundreds killed."], ["1937-05-01T00:00:00", "A general strike occurs in Paris, France."], ["1937-05-06T00:00:00", "Hindenburg disaster: In the United States, the German airship Hindenburg bursts into flame when mooring to a mast in Lakehurst, New Jersey. Of the 36 passengers and 61 crew on board, 13 passengers and 22 crew die, as well as one member of the ground crew."], ["1937-05-07T00:00:00", "Spanish Civil War: The German Condor Legion Fighter Group, equipped with Heinkel He 51 biplanes, arrives in Spain to assist Francisco Franco's forces."], ["1937-05-12T00:00:00", "The coronation of King George VI and Queen Elizabeth takes place at Westminster Abbey, London."], ["1937-05-21T00:00:00", "A Soviet station becomes the first scientific research settlement to operate on the drift ice of the Arctic Ocean."], ["1937-05-21T00:00:00", "As one of the reprisals for the attempted assassination of Italian viceroy Rodolfo Graziani, a detachment of Italian troops massacres the entire community of Debre Libanos, killing 297 monks and 23 laymen."], ["1937-05-27T00:00:00", "In California, the Golden Gate Bridge opens to pedestrian traffic, creating a vital link between San Francisco and Marin County. The next day, President Franklin D. Roosevelt pushes a button in Washington, D.C., signaling the start of vehicle traffic over the Golden Gate Bridge."], ["1937-05-28T00:00:00", "Neville Chamberlain becomes Prime Minister of the United Kingdom."], ["1937-05-28T00:00:00", "In Germany Volkswagen Group is founded, to build a \"people's car\". A new town is set to be created to house the thousands of workers who will be involved in the production of the car."], ["1937-05-30T00:00:00", "Spanish Civil War: Spanish ship Ciudad de Barcelona is torpedoed."], ["1937-05-30T00:00:00", "The Chicago Police Department shoot and kill ten unarmed demonstrators in Chicago in what is known as the Memorial Day massacre."], ["1937-06-03T00:00:00", "Wallis Simpson marries The Duke of Windsor (the former Edward VIII), in France."], ["1937-06-08T00:00:00", "The first total solar eclipse to exceed seven minutes of totality in over 800 years, is visible in the Pacific and Peru."], ["1937-06-08T00:00:00", "Carl Orff's Carmina Burana premieres in Frankfurt, Germany."], ["1937-06-14T00:00:00", "Pennsylvania becomes the first (and only) of the United States to celebrate Flag Day officially as a state holiday."], ["1937-06-21T00:00:00", "The coalition government of Léon Blum resigns in France."], ["1937-06-28T00:00:00", "Civilian Conservation Corps (CCC) established in the United States, superseding the Emergency Conservation Work program."], ["1937-07-01T00:00:00", "The Gestapo arrests pastor Martin Niemöller in Germany."], ["1937-07-01T00:00:00", "In a referendum the people of the Irish Free State accept the new Constitution by 685,105 votes to 527,945."], ["1937-07-01T00:00:00", "First alleged sighting of the White River Monster."], ["1937-07-02T00:00:00", "Amelia Earhart and navigator Fred Noonan disappear after taking off from New Guinea during Earhart's attempt to become the first woman to fly around the world."], ["1937-07-02T00:00:00", "A guard takes his place at the Tomb of the Unknowns in Washington, D.C.; continuous guard has been maintained there ever since."], ["1937-07-04T00:00:00", "The Lost Colony historical drama is first performed at an outdoor theater in the location where it is set, Roanoke Island, North Carolina."], ["1937-07-05T00:00:00", "The canned precooked meat product Spam is introduced by the Hormel company in the United States"], ["1937-07-05T00:00:00", "The highest recorded temperature in Canada, at Yellow Grass, Saskatchewan, is 45 °C (113 °F)."], ["1937-07-07T00:00:00", "Sino-Japanese War: Battle of Lugou Bridge (aka Marco Polo Bridge Incident): Japanese forces invade China (often seen as the beginning of World War II in Asia)."], ["1937-07-07T00:00:00", "Peel Commission proposes partition of the British Mandate of Palestine into separate Arab and Jewish states."], ["1937-07-11T00:00:00", "American popular composer George Gershwin dies in Los Angeles of a brain tumor, age 38."], ["1937-07-20T00:00:00", "The Geibeltbad Pirna is opened in Dresden, Germany."], ["1937-07-21T00:00:00", "Éamon de Valera is elected President of the Executive Council (prime minister) of the Irish Free State by the Dáil (parliament)."], ["1937-07-22T00:00:00", "New Deal: The United States Senate votes down President Franklin D. Roosevelt's proposal to add more justices to the Supreme Court of the United States."], ["1937-07-24T00:00:00", "Alabama drops rape charges against the so-called Scottsboro Boys."], ["1937-07-28T00:00:00", "The Irish Republican Army attempts the assassination by bomb of George VI in Belfast."], ["1937-07-29T00:00:00", "Tungchow Mutiny: units of the East Hopei Army mutiny and kill Japanese troops and civilians in Tōngzhōu."], ["1937-07-31T00:00:00", "NKVD operative order 00447 «Об операции по репрессированию бывших кулаков, уголовников и других антисоветских элементов» (\"The operation for repression of former kulaks, criminals and other anti-Soviet elements\") is approved by the Politburo of the Soviet Union, initially as a 4-month plan for 75,950 people to be executed and an additional 193,000 to be sent to the Gulag."], ["1937-08-02T00:00:00", "The Marihuana Tax Act Pub. 238, 75th Congress, 50 Stat. 551 (Aug. 2, 1937), is a significant bill on the path that will lead to the criminalization of cannabis. It was introduced to U.S. Congress by Commissioner of the Federal Bureau of Narcotics, Harry Anslinger. (The Act is now commonly referred to using the modern spelling as the 1937 Marijuana Tax Act.)"], ["1937-08-05T00:00:00", "The Soviet Union commences one of the largest campaigns of the Great Purge, to \"eliminate anti-Soviet elements.\" Within the following year, at least 724,000 people are killed on order of the troikas, directed by Joseph Stalin. This was an offensive that targeted social classes (such as the kulaks), ethnic or racial backgrounds which were seen as non-Russian, and Stalin's personal opponents from the Communist Party and their sympathizers."], ["1937-08-06T00:00:00", "Spanish Civil War: Falangist artillery bombards Madrid."], ["1937-08-08T00:00:00", "Japan occupies Beijing."], ["1937-08-14T00:00:00", "The Battle of Shanghai."], ["1937-08-26T00:00:00", "Second Sino-Japanese War: Japanese aircraft attack the car carrying the ambassador of Great Britain during a raid on Shanghai."], ["1937-09-02T00:00:00", "The Great Hong Kong Typhoon kills an estimated 11,000 persons."], ["1937-09-05T00:00:00", "Spanish Civil War: The city of Llanes falls to the Falangists."], ["1937-09-07T00:00:00", "CBS broadcasts a two-and-a-half hour memorial concert nationwide on radio in memory of George Gershwin, live from the Hollywood Bowl. Many celebrities appear, including Oscar Levant, Fred Astaire, Otto Klemperer, Lily Pons and members of the original cast of Porgy and Bess. The concert is recorded and released complete years later in what is excellent sound for its time, on CD. The Los Angeles Philharmonic is the featured orchestra."], ["1937-09-10T00:00:00", "Nine nations meet in the Nyon Conference, led by the United Kingdom and France, to address international piracy in the Mediterranean."], ["1937-09-17T00:00:00", "Abraham Lincoln's head is dedicated at Mount Rushmore."], ["1937-09-19T00:00:00", "Swiss professional ice hockey club HC Ambrì-Piotta founded."], ["1937-09-21T00:00:00", "George Allen & Unwin, Ltd. of London publishes the first edition of J. R. R. Tolkien's The Hobbit."], ["1937-09-25T00:00:00", "Second Sino-Japanese War: Battle of Pingxingguan: The Communist Chinese National Revolutionary Army defeats the Japanese."], ["1937-09-27T00:00:00", "The last Bali tiger dies."], ["1937-10-01T00:00:00", "The Marihuana Tax Act becomes law in the United States."], ["1937-10-01T00:00:00", "U.S. Supreme Court associate justice Hugo Black, in a nationwide radio broadcast, refutes allegations of past involvement in the Ku Klux Klan."], ["1937-10-03T00:00:00", "Second Sino-Japanese War: Japanese troops advance toward Nanking."], ["1937-10-05T00:00:00", "Roosevelt gives his famous Quarantine Speech in Chicago."], ["1937-10-09T00:00:00", "Jimmie Angel lands his plane on top of Devil's Mountain; however, the plane gets damaged and he has to trek through the rainforest for help."], ["1937-10-13T00:00:00", "Germany, in a note to Brussels, guarantees the inviolability and integrity of Belgium so long as the latter abstains from military action against Germany."], ["1937-10-15T00:00:00", "Ernest Hemingway's novel To Have and Have Not is first published."], ["1937-10-25T00:00:00", "Celâl Bayar forms the new (ninth) government of Turkey."], ["1937-11-03T00:00:00", "Maurice J. Tobin resoundingly defeats former governor and mayor James Michael Curley in Boston's mayoral election."], ["1937-11-05T00:00:00", "Spanish Civil War - 35,000 Republican supporters are massacred in Piedrafita de Babia, near León."], ["1937-11-05T00:00:00", "World War II: In the Reich Chancellery, Adolf Hitler holds a secret meeting and states his plans for acquiring \"living space\" for the German people (recorded in the Hossbach Memorandum)."], ["1937-11-06T00:00:00", "Italy joins the Anti-Comintern Pact."], ["1937-11-09T00:00:00", "Second Sino-Japanese War: Japanese troops take Shanghai."], ["1937-11-10T00:00:00", "Brazilian president Getúlio Vargas announces the Estado Novo (\"New State\"), thence becoming dictator of Brazil until 1945."], ["1937-11-11T00:00:00", "The Kogushi sulfur mine collapse, in western Gunma, Japan, kills at least 245 people."], ["1937-12-04T00:00:00", "The Dandy comic is first published in Scotland; it will still be running as of 2011."], ["1937-12-11T00:00:00", "Italy withdraws from the League of Nations."], ["1937-12-12T00:00:00", "USS Panay incident: Japanese bombers sink the American gunboat USS Panay."], ["1937-12-12T00:00:00", "Mae West makes a risqué guest appearance on NBC's Chase and Sanborn Hour, which eventually results in her being banned from radio."], ["1937-12-13T00:00:00", "Second Sino-Japanese War: The Battle of Nanking ends with the Japanese occupying the city. In the Nanking Massacre which follows, Japanese soldiers kill over 300,000 Chinese in 3 months."], ["1937-12-16T00:00:00", "The original production of the musical Me and My Girl opens at the West End Victoria Palace Theatre in London. A later revival of this musical would win an award."], ["1937-12-21T00:00:00", "Walt Disney's Snow White and the Seven Dwarfs, the first feature-length traditionally animated film, premieres in selected theaters."], ["1937-12-25T00:00:00", "At the age of 70, legendary conductor Arturo Toscanini conducts the NBC Symphony Orchestra on radio for the first time, beginning his successful 17-year tenure with that orchestra. This first concert consists of music by Vivaldi (at a time when he was still seldom played), Mozart, and Brahms. Millions tune in to listen, including U.S. President Franklin Delano Roosevelt."], ["1937-12-29T00:00:00", "The new Constitution of Ireland (Bunreacht na hÉireann) comes into force. The Irish Free State becomes \"Ireland\", and Éamon de Valera becomes the first Taoiseach (prime minister) of the new state. A Presidential Commission (made up the Chief Justice, the Speaker of Dáil Éireann, and the President of the High Court) assumes the powers of the new presidency, pending the popular election of the first President of Ireland in June 1938. The new constitution prohibits divorce."]]