[["1986-01-01T00:00:00", "Spain and Portugal enter the European Community, which later becomes the European Union."], ["1986-01-01T00:00:00", "Aruba gains increased autonomy from the Netherlands and is separated from the Netherlands Antilles."], ["1986-01-01T00:00:00", "The Province of Flevoland is established in the Netherlands."], ["1986-01-01T00:00:00", "UNIDO becomes a specialised agency of the United Nations."], ["1986-01-01T00:00:00", "In Northern Ireland as part of The Troubles, James McCandless (39) and Michael Williams (24), both Protestant members of the Royal Ulster Constabulary, were killed by a Provisional Irish Republican Army remote controlled bomb hidden in a litter bin and detonated when their foot patrol passed at Thomas Street, Armagh."], ["1986-01-09T00:00:00", "After losing a patent battle with Polaroid, Kodak leaves the instant camera business."], ["1986-01-12T00:00:00", "STS-61-C: Space Shuttle Columbia is launched with the first Hispanic-American astronaut, Dr. Franklin Chang Díaz."], ["1986-01-19T00:00:00", "The first PC virus, Brain, starts to spread."], ["1986-01-20T00:00:00", "The United Kingdom and France announce plans to construct the Channel Tunnel."], ["1986-01-24T00:00:00", "The Voyager 2 space probe makes its first encounter with Uranus."], ["1986-01-25T00:00:00", "Yoweri Museveni's National Resistance Army Rebel group takes over Uganda after leading a successful 5-year guerrilla war in which up to half a million people are believed to have been killed. They will later use January 26 as the official date to avoid a coincidence of dates with Dictator Idi Amin's 1971 coup."], ["1986-01-26T00:00:00", "Chicago Bears win Super Bowl XX against New England Patriots, 46 - 10"], ["1986-01-28T00:00:00", "STS-51-L: Space Shuttle Challenger disintegrates 73 seconds after launch, killing the crew of 7 astronauts, including schoolteacher Christa McAuliffe."], ["1986-01-29T00:00:00", "Yoweri Museveni is sworn in as President of Uganda after leading a successful 5-year guerrilla war."], ["1986-02-03T00:00:00", "Pixar Animation Studios is opened."], ["1986-02-07T00:00:00", "President Jean-Claude Duvalier (\"Baby Doc\") flees Haiti, ending 28 years of family rule."], ["1986-02-09T00:00:00", "Halley's Comet reaches its perihelion, the closest point to the Sun, during its second visit to the solar system in the 20th Century (the first visit was in 1910)."], ["1986-02-11T00:00:00", "Human rights activist Anatoly Shcharansky is released by the Soviet Union and leaves the country."], ["1986-02-15T00:00:00", "The Beechcraft Starship makes its maiden flight."], ["1986-02-16T00:00:00", "The Soviet liner Mikhail Lermontov sinks in the Marlborough Sounds, New Zealand."], ["1986-02-16T00:00:00", "The French Air Force raids the Libyan Ouadi Doum airbase in northern Chad."], ["1986-02-17T00:00:00", "The Single European Act is signed."], ["1986-02-19T00:00:00", "The Soviet Union launches the Mir space station."], ["1986-02-19T00:00:00", "The United States Senate approves a treaty outlawing genocide."], ["1986-02-21T00:00:00", "Nintendo releases the first game in the Zelda series, The Legend of Zelda in Japan on the Famicom."], ["1986-02-25T00:00:00", "The 27th Congress of the CPSU opens in Moscow. The General Secretary Mikhail Gorbachev introduces the keywords of his mandate to the audience: Glasnost and Perestroika."], ["1986-02-25T00:00:00", "People Power Revolution: President Ferdinand Marcos of the Philippines goes into exile in Hawaii after 20 years of rule; Corazon Aquino becomes the first Filipino woman president, first as an interim president. Salvador Laurel becomes her Vice President."], ["1986-02-25T00:00:00", "Egyptian military police, protesting against bad salaries, enter 4 luxury hotels near the pyramids, set fire to them and loot them."], ["1986-02-27T00:00:00", "The United States Senate allows its debates to be televised on a trial basis."], ["1986-02-28T00:00:00", "Swedish Prime Minister Olof Palme is assassinated on his way home from the cinema."], ["1986-03-01T00:00:00", "Olof Palme`s deputy Ingvar Carlsson becomes acting Prime Minister of Sweden. He is elected Prime Minister by the Swedish Riksdag on March 15 ."], ["1986-03-03T00:00:00", "The first paper is published describing the atomic force microscope invented the previous year by Gerd Binnig, Calvin Quate and Christopher Berger."], ["1986-03-04T00:00:00", "The Today national tabloid newspaper is launched in the United Kingdom, pioneering the use of computer photosetting and full-colour offset printing, at a time when British national newspapers still use Linotype machines and letterpress printing."], ["1986-03-08T00:00:00", "The Japanese Suisei probe flies by Halley's Comet, studying its UV hydrogen corona and solar wind."], ["1986-03-09T00:00:00", "United States Navy divers find the largely intact but heavily damaged crew compartment of the Space Shuttle Challenger; the bodies of all seven astronauts are still inside."], ["1986-03-13T00:00:00", "In a Black Sea incident, American cruiser USS Yorktown and the destroyer USS Caron, claiming the right of innocent passage, enter the Soviet territorial waters near the southern Crimean Peninsula."], ["1986-03-14T00:00:00", "Microsoft Corporation holds its initial public offering of stock shares."], ["1986-03-15T00:00:00", "Collapse of the Hotel New World: The six-story Lian Yak Building (1971) in Singapore, housing the Hotel New World, collapses in less than a minute due to structural failure, perhaps caused by a gas explosion, trapping 50 people and killing 33 of them."], ["1986-03-25T00:00:00", "The 58th Academy Awards are held in Los Angeles, with Out of Africa winning Best Picture."], ["1986-03-26T00:00:00", "An article in The New York Times charges that Kurt Waldheim, former United Nations Secretary-General and candidate for president of Austria, may have been involved in Nazi war crimes during World War II."], ["1986-03-27T00:00:00", "Russell Street Bombing: A car bomb explodes at Russell Street Police Headquarters in Russell Street, Melbourne, killing a police constable, the first Australian policewoman to be killed in the line of duty."], ["1986-03-31T00:00:00", "A fire causes extensive damage at Hampton Court Palace in Surrey, England."], ["1986-03-31T00:00:00", "Mexicana Flight 940 crashes near Maravatío, Mexico, killing 167."], ["1986-04-01T00:00:00", "Sector Kanda: Communist Party of Nepal (Mashal) cadres attack a number of police stations in Kathmandu, seeking to incite a popular rebellion."], ["1986-04-02T00:00:00", "A bomb explodes on a Trans World Airlines flight from Rome to Athens, killing 4 people."], ["1986-04-03T00:00:00", "The British Children's TV show The Raggy Dolls is released on ITV in the U.K"], ["1986-04-05T00:00:00", "1986 Berlin discotheque bombing: The West Berlin discothèque, a known hangout for United States soldiers, is bombed, killing 3 and injuring 230; Libya is held responsible."], ["1986-04-13T00:00:00", "Pope John Paul II officially visits the Great Synagogue of Rome, the first time a modern Pope has visited a synagogue."], ["1986-04-14T00:00:00", "Hailstones weighing 1 kg (2.2 lb) fall on the Gopalganj district of Bangladesh, killing 92."], ["1986-04-15T00:00:00", "Operation El Dorado Canyon: At least 15 people die after United States planes bomb targets in the Libyan capital, Tripoli, and the Benghazi region."], ["1986-04-17T00:00:00", "John McCarthy is kidnapped in Beirut (released in August 1991) - 3 others are found dead; Revolutionary Cells claims responsibility in retaliation for the U.S. bombing of Libya."], ["1986-04-17T00:00:00", "The Hindawi affair begins when an Irishwoman is found unknowingly carrying explosives onto an El Al flight from London to Tel Aviv."], ["1986-04-21T00:00:00", "Geraldo Rivera opens Al Capone's secret vault on The Mystery of Al Capone's Vaults, discovering only a bottle of moonshine."], ["1986-04-26T00:00:00", "Chernobyl disaster: A mishandled safety test at the Chernobyl Nuclear Power Plant in Pripyat, Ukrainian SSR, Soviet Union \"killed at least 4056 people and damaged almost $7 billion of property\". Radioactive fallout from the accident is concentrated near Belarus, Ukraine and Russia and at least 350,000 people are forcibly resettled away from these areas. After the accident, \"traces of radioactive deposits unique to Chernobyl were found in nearly every country in the northern hemisphere\"."], ["1986-04-27T00:00:00", "\"Captain Midnight\" interrupts the HBO satellite feed."], ["1986-04-29T00:00:00", "The Diamond Jubilee of Hirohito is held at the Kokugikan in Tokyo."], ["1986-05-02T00:00:00", "Expo 86, the 1986 World Exposition on Transportation and Communication, a World's fair, opens in Vancouver, British Columbia, Canada."], ["1986-05-02T00:00:00", "The physical game show Takeshi's Castle first airs on the Tokyo Broadcasting System."], ["1986-05-03T00:00:00", "Sandra Kim from Belgium wins the Eurovision Song Contest in Bergen, Norway with her song J'aime la vie."], ["1986-05-08T00:00:00", "Óscar Arias is inaugurated into his first term as President of Costa Rica."], ["1986-05-09T00:00:00", "Short Circuit starring Fisher Stevens is released."], ["1986-05-12T00:00:00", "NBC debuts the current well-known peacock as seen in the NBC 60th Anniversary Celebration."], ["1986-05-16T00:00:00", "The Seville Statement on Violence is adopted by an international meeting of scientists, convened by the Spanish National Commission for UNESCO, in Seville, Spain."], ["1986-05-19T00:00:00", "The Firearm Owners Protection Act is enacted."], ["1986-05-23T00:00:00", "Somali President Siad Barre is injured in a car accident in Mogadishu and taken to Saudi Arabia for treatment. Somali opposition groups see this as an opportunity to try and remove Barre setting in stage the Somali Civil War."], ["1986-05-24T00:00:00", "The Montreal Canadiens win their 23rd Stanley Cup In Calgary against the Flames."], ["1986-05-25T00:00:00", "Hands Across America: At least 5,000,000 people form a human chain from New York City to Long Beach, California, to raise money to fight hunger and homelessness."], ["1986-05-25T00:00:00", "The Bangladeshi double decked ferry Shamia capsizes in the Meghna River, southern Barisal, Bangladesh, killing at least 600."], ["1986-05-27T00:00:00", "The game credited as setting the template for role-playing video games, Dragon Quest, is released in Japan."], ["1986-05-31T00:00:00", "The 1986 FIFA World Cup begins in Mexico."], ["1986-06-04T00:00:00", "Jonathan Pollard pleads guilty to espionage for selling top secret United States military intelligence to Israel."], ["1986-06-08T00:00:00", "Former United Nations Secretary-General Kurt Waldheim is elected president of Austria."], ["1986-06-09T00:00:00", "The Rogers Commission releases its report on the Space Shuttle Challenger disaster."], ["1986-06-12T00:00:00", "South Africa declares a nationwide state of emergency."], ["1986-06-19T00:00:00", "American college basketball player Len Bias suffers a fatal cardiac arrhythmia from a cocaine overdose, less than 48 hours after being selected 2nd overall by the Boston Celtics in the 1986 NBA draft."], ["1986-06-22T00:00:00", "In one of the most famous FIFA World Cup matches, Argentinian football player Diego Maradona scores one handball goal (nicknamed the \"Hand of God\") and then dribbles past the entire English football team to score a second goal (nicknamed \"The Goal of the Century\") with Argentina winning 2-1 against England."], ["1986-06-23T00:00:00", "Eric Thomas develops LISTSERV, the first email list management software."], ["1986-06-24T00:00:00", "The Dominican Republic recognizes the Sahrawi Arab Democratic Republic."], ["1986-06-29T00:00:00", "Argentina defeats West Germany 3-2 to win the 1986 FIFA World Cup in Mexico City."], ["1986-07-01T00:00:00", "CSX Transportation is established."], ["1986-07-05T00:00:00", "The Statue of Liberty is reopened to the public after an extensive refurbishment."], ["1986-07-05T00:00:00", "July 20 - The Goodwill Games are held in Moscow."], ["1986-07-07T00:00:00", "Australian drug smugglers Kevin Barlow and Brian Chambers are executed in Malaysia."], ["1986-07-12T00:00:00", "The New Zealand Homosexual Law Reform Act decriminalises consensual sex between men from the age of 16."], ["1986-07-22T00:00:00", "In the Philippines, ABS-CBN Radio launches DZMM at 630 kHz on AM Band."], ["1986-07-23T00:00:00", "In London, Prince Andrew, Duke of York marries Sarah Ferguson at Westminster Abbey."], ["1986-07-27T00:00:00", "Greg LeMond wins the Tour de France."], ["1986-07-28T00:00:00", "Estate agent Suzy Lamplugh vanishes after a meeting in London."], ["1986-08-02T00:00:00", "first film produced by Studio Ghibli, Castle in the Sky directed by Hayao Miyazaki is released in Japan."], ["1986-08-06T00:00:00", "A low-pressure system moving from South Australia and redeveloping off the New South Wales coast dumps a record 328 millimetres (12.9 in) of rain in a day on Sydney."], ["1986-08-06T00:00:00", "In Louisville, Kentucky, William J. Schroeder, the second artificial heart recipient, dies after 620 days."], ["1986-08-06T00:00:00", "Australian Democrats leader Don Chipp retires from federal parliament and is succeeded by Janine Haines, the first woman to lead a political party in Australia."], ["1986-08-19T00:00:00", "Two weeks after it was stolen, the Picasso painting Weeping Woman is found in a locker at the Spencer Street Station in Melbourne, Australia."], ["1986-08-20T00:00:00", "In Edmond, Oklahoma, United States Postal Service employee Patrick Sherrill guns down 14 of his co-workers before committing suicide."], ["1986-08-21T00:00:00", "The Lake Nyos disaster occurs in Cameroon, killing nearly 2,000 people."], ["1986-08-31T00:00:00", "The Soviet passenger liner Admiral Nakhimov collides with the bulk carrier Pyotr Vasev in the Black Sea and sinks almost immediately, killing 398."], ["1986-08-31T00:00:00", "Aeroméxico Flight 498, a Douglas DC-9, collides with a Piper PA-28 over Cerritos, California, killing 67 on both aircraft and 15 on the ground."], ["1986-08-31T00:00:00", "The cargo ship Khian Sea departs from the docks of Philadelphia, carrying 14,000 tons of toxic waste. It wanders the seas for the next 16 months trying to find a place to dump its cargo. The waste is later dumped in Haiti."], ["1986-09-01T00:00:00", "Jordan University of Science and Technology is established in Jordan."], ["1986-09-04T00:00:00", "Eusko Alkartasuna, the Basque Social Democratic Party, is created in Vitoria-Gasteiz."], ["1986-09-05T00:00:00", "Pan Am Flight 73, with 358 people on board, is hijacked at Karachi International Airport by four Abu Nidal terrorists."], ["1986-09-06T00:00:00", "The Big Mac Index is introduced in The Economist newspaper as a semi-humorous international measure of purchasing power parity."], ["1986-09-06T00:00:00", "In Istanbul, two Abu Nidal terrorists kill 22 and wound 6 inside the Neve Shalom Synagogue during Shabbat services."], ["1986-09-07T00:00:00", "Desmond Tutu becomes the first black Anglican Church bishop in South Africa."], ["1986-09-07T00:00:00", "Chilean dictator Augusto Pinochet survives an assassination attempt by the FPMR; 5 of his bodyguards are killed."], ["1986-09-08T00:00:00", "The Oprah Winfrey Show premieres in syndication."], ["1986-09-13T00:00:00", "A magnitude 6.0 earthquake rocks the city of Kalamata in southern Greece, killing 20 people, injuring 80 and completely destroying one-fifth of the city."], ["1986-10-01T00:00:00", "U.S. President Ronald Reagan signs the Goldwater-Nichols Act into law, making official the largest reorganization of the United States Department of Defense since the Air Force was made a separate branch of service in 1947."], ["1986-10-03T00:00:00", "TASCC, a superconducting cyclotron, officially opens at Chalk River Laboratories."], ["1986-10-09T00:00:00", "United States District Court Judge Harry E. Claiborne becomes the fifth federal official to be removed from office through impeachment."], ["1986-10-09T00:00:00", "News Corporation completes its acquisition of the Metromedia group of companies, thereby launching the Fox Broadcasting Company."], ["1986-10-09T00:00:00", "The Phantom of the Opera, the longest running Broadway show in history, opens at Her Majesty's Theatre in London."], ["1986-10-10T00:00:00", "An earthquake measuring 7.5 on the Richter scale strikes San Salvador, El Salvador, killing an estimated 1,500 people."], ["1986-10-11T00:00:00", "Cold War: Ronald Reagan and Soviet leader Mikhail Gorbachev meet in Reykjavík, Iceland, to continue discussions about scaling back their intermediate missile arsenals in Europe (the talks break down in failure)."], ["1986-10-12T00:00:00", "Elizabeth II and The Duke of Edinburgh visit the People's Republic of China."], ["1986-10-16T00:00:00", "The International Olympic Committee chooses Albertville, France to be the host city of the 1992 Winter Olympics and Barcelona, Spain to be the host city of the 1992 Summer Olympics. The IOC also announces that the summer and winter games will separate with the winter games on every even, common year; and the summer games on every even, leap year starting from 1992."], ["1986-10-19T00:00:00", "Mozambican president Samora Machel's plane crashes in South Africa."], ["1986-10-21T00:00:00", "The Marshall Islands become an associated state under the Compact of Free Association."], ["1986-10-22T00:00:00", "In New York City, WNBC Radio's traffic helicopter crashes into the Hudson River, killing traffic reporter Jane Dornacker. The last words heard on-the-air are Dornacker's screams of terror, \"Hit the water! Hit the water! Hit the water!\""], ["1986-10-24T00:00:00", "Lambda Sigma Gamma Sorority Inc. is founded at Sacramento State by Linda V. Fuentes and 26 Founding Mothers."], ["1986-10-26T00:00:00", "Bus deregulation goes into effect in the United Kingdom, except Greater London and Northern Ireland."], ["1986-10-27T00:00:00", "The International World Day of Prayer is held in Assisi, Italy."], ["1986-10-27T00:00:00", "World Series: The New York Mets defeat the Boston Red Sox in 7 games. This is the second world series title in the Mets franchise. It is also remembered for Game 6, when Bill Buckner lets a routine ground ball hit by Mookie Wilson roll through his legs, letting the Mets win and pull even with the Red Sox in the series."], ["1986-10-27T00:00:00", "The Big Bang in the London Stock Exchange abolishes fixed commission charges, paving the way for electronic trading."], ["1986-10-28T00:00:00", "The centennial of the Statue of Liberty's dedication is celebrated in New York Harbor."], ["1986-10-28T00:00:00", "In London, Jeremy Bamber is found guilty of the murder of his adoptive parents, sister and twin nephews, and sentenced to life imprisonment, with a recommendation by the trial judge that he should serve at least 25 years before being considered for parole."], ["1986-10-29T00:00:00", "British Prime Minister Margaret Thatcher officially opens the M25 Motorway, which encircles Greater London, in a ceremony on the carriageway near Potters Bar. It became Europe's second longest orbital road upon completion, and provides the first and only full bypass of London."], ["1986-11-01T00:00:00", "Queensland, Australia: Joh Bjelke-Petersen wins his final election as Premier of Queensland with 38.6% of the vote. He resigns on December 1, 1987 following revelations of his involvement with corruption released in the Fitzgerald Inquiry."], ["1986-11-01T00:00:00", "Sandoz chemical spill: a major environmental disaster near Basel, Switzerland, pollutes the Rhine."], ["1986-11-03T00:00:00", "Iran-Contra affair: The Lebanese magazine Ash-Shiraa reports that the United States has been selling weapons to Iran in secret, in order to secure the release of 7 American hostages held by pro-Iranian groups in Lebanon."], ["1986-11-03T00:00:00", "Commonwealth of the Northern Mariana Islands (CNMI) in Political Union with the United States. The CNMI Government adopted its own constitution in 1977, and the constitutional government took office in January 1978. The Covenant was fully implemented November 3, 1986, pursuant to Presidential Proclamation no. 5564, which conferred United States citizenship on legally qualified CNMI residents."], ["1986-11-04T00:00:00", "Democrats regain control of the United States Senate for the first time in 6 years. In California, Chief Justice Rose Bird and two colleagues are removed by voters from the Supreme Court of California for opposing capital punishment."], ["1986-11-06T00:00:00", "Sumburgh disaster: A British International Helicopters Boeing 234LR Chinook crashes 2.5 miles east of Sumburgh Airport, killing 45 people (the deadliest civilian helicopter crash on record)."], ["1986-11-11T00:00:00", "Sperry Rand and Burroughs merge to form Unisys, becoming the second largest computer company."], ["1986-11-12T00:00:00", "Australian singer John Farnham releases the album Whispering Jack, which becomes the highest selling album in Australia's history."], ["1986-11-18T00:00:00", "Greater Manchester Police announce that they will search for the bodies of 2 missing children (who both vanished more than 20 years ago) after the Moors murderers Ian Brady and Myra Hindley confess to 2 more murders."], ["1986-11-20T00:00:00", "Lee Gye-deok, South Korean singer and activist"], ["1986-11-21T00:00:00", "Iran-Contra Affair: National Security Council member Oliver North and his secretary, Fawn Hall, start shredding documents implicating them in selling weapons to Iran and channeling the proceeds to help fund the Contra rebels in Nicaragua."], ["1986-11-22T00:00:00", "Mike Tyson wins his first world boxing title by defeating Trevor Berbick in Las Vegas."], ["1986-11-25T00:00:00", "Iran-Contra affair: U.S. Attorney General Edwin Meese announces that profits from covert weapons sales to Iran were illegally diverted to the anti-communist Contra rebels in Nicaragua."], ["1986-11-26T00:00:00", "Iran-Contra affair: U.S. President Ronald Reagan announces that on December 1 former Senator John Tower, former Secretary of State Edmund Muskie, and former National Security Adviser Brent Scowcroft will serve as members of the Special Review Board looking into the scandal (they became known as the Tower Commission). Reagan denies involvement in the scandal."], ["1986-12-07T00:00:00", "A 5.7 Richter scale earthquake destroys most of the Bulgarian town of Strajica, killing 2 people."], ["1986-12-14T00:00:00", "Rutan Voyager, an experimental aircraft designed by Burt Rutan and piloted by Dick Rutan and Jeana Yeager, begins its flight around the world."], ["1986-12-19T00:00:00", "Soviet dissident Andrei Sakharov is permitted to return to Moscow after six years of internal exile."], ["1986-12-20T00:00:00", "Three African Americans are assaulted by a group of white teens in the Howard Beach neighborhood of Queens, New York. One of the victims, Michael Griffith, is run over and killed by a motorist while attempting to flee the attackers."], ["1986-12-23T00:00:00", "Voyager completes the first nonstop circumnavigation of the earth by air without refueling in 9 days, 3 minutes and 44 seconds."], ["1986-12-26T00:00:00", "After 35 years on the airwaves and holding the title of longest-running non-news program on network television, NBC airs the final episode of daytime drama Search for Tomorrow."], ["1986-12-31T00:00:00", "A fire at the Dupont Plaza Hotel in San Juan, Puerto Rico, kills 97 and injures 140."]]