[["1932-01-01T00:00:00", "The United States Post Office Department issues a set of 12 stamps commemorating the 200th anniversary of George Washington's birth."], ["1932-01-03T00:00:00", "The British arrest and intern Mohandas Gandhi and Vallabhbhai Patel."], ["1932-01-07T00:00:00", "The Stimson Doctrine is proclaimed, in response to the Japanese invasion of Manchuria."], ["1932-01-08T00:00:00", "In Great Britain the Archbishop of Canterbury forbids Anglican church remarriage of divorced persons."], ["1932-01-09T00:00:00", "Sakuradamon Incident, Korean nationalist Lee Bong-chang fails in his effort to assassinate the Shōwa Emperor of Japan. The Kuomintang's official newspaper runs an editorial expressing regret that the attempt failed, which is used by the Japanese as a pretext to attack Shanghai later month."], ["1932-01-12T00:00:00", "Hattie W. Caraway becomes the first woman elected to the United States Senate."], ["1932-01-14T00:00:00", "Maurice Ravel's Concerto in G debuts with piano soloist Marguerite Long and Ravel conducting the Lamoureux Orchestra."], ["1932-01-15T00:00:00", "About 6 million are unemployed in Germany."], ["1932-01-22T00:00:00", "The 1932 Salvadoran peasant uprising begins, it is suppressed by the government of Maximiliano Hernández Martínez"], ["1932-01-24T00:00:00", "Marshal Pietro Badoglio declares the end of Libyan resistance."], ["1932-01-26T00:00:00", "The British submarine M2 sinks with all 60 hands."], ["1932-01-28T00:00:00", "Conflict between Japan and China in the Battle of Shanghai."], ["1932-01-29T00:00:00", "The minority government of Karl Buresch in Austria ends the governmental crisis."], ["1932-01-31T00:00:00", "Japanese warships arrive in Nanking."], ["1932-02-01T00:00:00", "Brave New World, a novel by Aldous Huxley, is first published."], ["1932-02-02T00:00:00", "A general World Disarmament Conference begins in Geneva. The principal issue at the conference is the demand made by Germany for gleichberechtigung (\"equality of status\" i.e. abolishing Part V of the Treaty of Versailles, which had disarmed Germany) and the French demand for sécurité (\"security\" i.e. maintaining Part V)."], ["1932-02-02T00:00:00", "The League of Nations again recommends negotiations between the Republic of China and Japan."], ["1932-02-02T00:00:00", "The Reconstruction Finance Corporation begins operations in Washington, D.C."], ["1932-02-04T00:00:00", "The 1932 Winter Olympics open in Lake Placid, New York."], ["1932-02-04T00:00:00", "Japan occupies Harbin, China."], ["1932-02-09T00:00:00", "Junnosuke Inoue, prominent Japanese businessman, banker and former governor of the Bank of Japan is assassinated by right-wing extremist group the League of Blood in the League of Blood Incident."], ["1932-02-11T00:00:00", "Pope Pius XI meets Benito Mussolini in Vatican City."], ["1932-02-15T00:00:00", "Clara, Lu & Em, generally regarded as the first daytime network soap opera, debuts in its morning time slot over the Blue Network of NBC Radio, having originally been a late evening program."], ["1932-02-18T00:00:00", "Japan declares Manzhouguo (Japanese name for Manchuria) formally independent from China."], ["1932-02-22T00:00:00", "The first Purple Heart is awarded."], ["1932-02-24T00:00:00", "Women's suffrage is granted in Brazil."], ["1932-02-25T00:00:00", "Adolf Hitler obtains German citizenship by naturalization, opening the opportunity for him to run in the 1932 election for Reichspräsident."], ["1932-02-27T00:00:00", "The Mäntsälä rebellion occurs in Finland."], ["1932-03-01T00:00:00", "Charles Lindbergh, Jr., the infant son of Anne Morrow Lindbergh and Charles Lindbergh, is kidnapped from the family home near Hopewell, New Jersey."], ["1932-03-01T00:00:00", "Japan proclaims Manchuria an independent state and installs Puyi as puppet emperor."], ["1932-03-02T00:00:00", "The Mäntsälä rebellion ends in failure; Finnish democracy prevails. The Lapua Movement is condemned by conservative Finnish President Pehr Evind Svinhufvud in a radio speech."], ["1932-03-05T00:00:00", "Dan Takuma, prominent Japanese businessman and director of the Mitsui Zaibatsu conglomerate is assassinated by the radical right-wing League of Blood group."], ["1932-03-07T00:00:00", "Four people are killed when police fire upon 3,000 unemployed autoworkers marching outside the Ford River Rouge Plant in Dearborn, Michigan."], ["1932-03-09T00:00:00", "Éamon de Valera is elected President of the Executive Council of the Irish Free State. It is the first change of government in the Irish Free State since its foundation 10 years previously."], ["1932-03-14T00:00:00", "George Eastman, founder of Kodak, commits suicide."], ["1932-03-18T00:00:00", "Peace negotiations between China and Japan begin."], ["1932-03-19T00:00:00", "The Sydney Harbour Bridge opens."], ["1932-03-20T00:00:00", "The Graf Zeppelin begins a regular route to South America."], ["1932-03-25T00:00:00", "Tarzan the Ape Man opens, with Olympic gold medal swimmer Johnny Weissmuller in the title role. (Weismuller will star in a total of twelve Tarzan films.)"], ["1932-04-05T00:00:00", "- 10,000 disgruntled Newfoundlanders march on their legislature to show discontent with their current political situation; this is a flash point in the demise of the Dominion of Newfoundland."], ["1932-04-05T00:00:00", "- Kreuger & Toll, the company of the \"Match King\" Ivar Kreuger, collapses."], ["1932-04-05T00:00:00", "- The first Alko stores are opened in Finland at 10 in the morning (local time) following the end of Prohibition in that country, resulting in a new mnemonic \"543210\"."], ["1932-04-06T00:00:00", "U.S. president Herbert Hoover supports armament limitations at the World Disarmament Conference."], ["1932-04-06T00:00:00", "The trial against fraudulent art dealer Otto Wacker begins in Berlin."], ["1932-04-11T00:00:00", "Paul von Hindenburg is re-elected president of Germany."], ["1932-04-13T00:00:00", "The German Chancellor Heinrich Brüning bans the SA and the SS as threats to public order, arguing that they are chiefly responsible for the wave of political violence afflicting Germany."], ["1932-04-14T00:00:00", "John Cockcroft and Ernest Walton focus a proton beam on lithium and split its nucleus."], ["1932-04-17T00:00:00", "Haile Selassie announces an anti-slavery law in Abyssinia."], ["1932-04-19T00:00:00", "German art dealer Otto Wacker is sentenced to 19 months in prison for selling fraudulent paintings he attributed to Vincent van Gogh."], ["1932-04-25T00:00:00", "Two of the companions of Islamic prophet, Muhammad, are moved from their graves upon informing of water in the graves in the dream of King Faisal of Iraq in Salmaan Paak, Iraq. Their names are Hudhayfah ibn al-Yaman and Jabir ibn Abd-Allah."], ["1932-04-29T00:00:00", "Korean pro-independence paramilitary Yun Bong-gil detonates a bomb at a gathering of Japanese government and mililtary officials in Shanghai's Hongkou Park, killing General Yoshinori Shirakawa and injuring Mamoru Shigemitsu and Vice Admiral Kichisaburō Nomura."], ["1932-05-02T00:00:00", "Comedian Jack Benny's radio show airs for the first time."], ["1932-05-06T00:00:00", "Paul Gorguloff shoots French president Paul Doumer in Paris; Doumer dies the next day."], ["1932-05-06T00:00:00", "The politically powerful General Kurt von Schleicher meets secretly with Adolf Hitler. General Schleicher tells Hitler that he is scheming to bring down the Brüning government and asks for Nazi support of the new \"presidential government\" Schleicher is planning to form. Schleicher and Hitler negotiated a \"gentlemen's agreement\" where in exchange for lifting the ban on the SA and SS and having the Reichstag dissolved for early elections that summer, the Nazis will support Schleicher's new chancellor."], ["1932-05-10T00:00:00", "- Albert Lebrun becomes the new president of France."], ["1932-05-10T00:00:00", "- Violent scenes in the Reichstag as Hermann Göring and other Nazi MRDs attack the Defense Minister General Wilhelm Groener for his lack of belief in a supposed Social Democratic putsch. After the debate, General Schleicher tells Groener that he has lost the confidence of the Army and must resign at once."], ["1932-05-12T00:00:00", "- Ten weeks after his abduction, the infant son of Charles Lindbergh is found dead just a few miles from the Lindbergh home."], ["1932-05-12T00:00:00", "- General Wilhelm Groener resigns as Defense Minister. Schleicher takes control of the Defense Ministry."], ["1932-05-13T00:00:00", "The Premier of New South Wales, Jack Lang, is dismissed by the State Governor, Sir Philip Game."], ["1932-05-15T00:00:00", "Japanese troops leave Shanghai. Back in Japan, the May 15 Incident as an attempted military coup is known occurs. The Japanese prime minister Tsuyoshi Inukai is assassinated by naval officers."], ["1932-05-16T00:00:00", "Massive riots between Hindus and Muslims in Bombay leave thousands dead and injured."], ["1932-05-20T00:00:00", "Federación Obrera de la Industria de la Carne initiates a major strike in the Argentinian meat-packing industry."], ["1932-05-26T00:00:00", "Judgement in Donoghue v Stevenson handed down in the House of Lords, creating the neighbour principle in English law."], ["1932-05-29T00:00:00", "The first of approximately 15,000 World War I veterans arrive in Washington, D.C. demanding the immediate payment of their military bonus, becoming known as the Bonus Army."], ["1932-05-30T00:00:00", "German chancellor Heinrich Brüning is dismissed by President von Hindenburg. President Hindenburg asks Franz von Papen to form a new government, known as the \"Government of the President's Friends\", which is openly dedicated to the destruction of democracy and the Weimar Republic. The downfall of Brüning is largely the work of Schleicher, who been scheming against him since the beginning of May. Schleicher takes the position of Defense Minister in his friend Papen's government."], ["1932-06-04T00:00:00", "A military coup occurs in Chile."], ["1932-06-04T00:00:00", "The Papen government dissolves the Reichstag for elections on 31 July 1932 in the full expectation that the Nazis will win the largest number of seats."], ["1932-06-06T00:00:00", "The Revenue Act of 1932 is enacted, creating the first gas tax in the United States at 1 cent per US gallon (0.26 ¢/L) sold."], ["1932-06-14T00:00:00", "The Papen government lifts the ban against the SS and SA in Germany."], ["1932-06-20T00:00:00", "The Benelux customs union is negotiated."], ["1932-06-24T00:00:00", "After a relatively bloodless military rebellion, Siam becomes a constitutional monarchy."], ["1932-06-29T00:00:00", "The comedy serial Vic and Sade debuts on NBC Radio."], ["1932-07-05T00:00:00", "António de Oliveira Salazar becomes the fascist prime minister of Portugal (for the next 36 years)."], ["1932-07-07T00:00:00", "The French submarine Prométhée sinks off Cherbourg; 66 are killed."], ["1932-07-08T00:00:00", "The Dow Jones Industrial Average reaches its lowest level of the Great Depression, bottoming out at 41.22."], ["1932-07-09T00:00:00", "The Constitutionalist Revolution starts in Brazil, with the uprising of the state of São Paulo."], ["1932-07-09T00:00:00", "Lausanne conference ends, agrees to cancel reparations against Germany."], ["1932-07-12T00:00:00", "Norway annexes northern Greenland."], ["1932-07-12T00:00:00", "Hedley Verity establishes a new first-class cricket record by taking all ten wickets for only ten runs against Nottinghamshire on a pitch affected by a storm."], ["1932-07-17T00:00:00", "Altona Bloody Sunday: In Altona, Germany, armed communists attack a National Socialist demonstration; 18 are killed and many other political street fights follow."], ["1932-07-20T00:00:00", "The Preußenschlag in Germany. The Papen government sends out the Reichswehr under General Gerd von Rundstedt to depose the elected SPD government in Prussia under Otto Braun. The coup gives Papen control of Prussia, the most powerful Land in Germany, and is a major blow to German democracy."], ["1932-07-21T00:00:00", "British Empire Economic Conference opens in Ottawa, Canada."], ["1932-07-28T00:00:00", "U.S. President Herbert Hoover orders the U.S. Army to forcibly evict the Bonus Army of World War I veterans gathered in Washington, D.C. Troops disperse the last of the Bonus Army the next day."], ["1932-07-30T00:00:00", "The 1932 Summer Olympics open in Los Angeles."], ["1932-07-30T00:00:00", "Walt Disney's Flowers and Trees, the first animated cartoon to be presented in full Technicolor, premieres in Los Angeles. It releases in theaters, along with the film version of Eugene O'Neill's Strange Interlude (starring Norma Shearer and Clark Gable); Flowers and Trees goes on to win the first Academy Award for Best Animated Short."], ["1932-07-31T00:00:00", "Reichstag election sees the Nazis win 37% of the vote, becoming the largest party in the Reichstag."], ["1932-08-01T00:00:00", "The second International Polar Year, an international scientific collaboration, begins."], ["1932-08-01T00:00:00", "Forrest Mars produces the first Mars bar in his Slough factory in England."], ["1932-08-02T00:00:00", "The first positron is discovered by Carl D. Anderson."], ["1932-08-05T00:00:00", "Hitler meets with Schleicher and reneges on the \"gentlemen's agreement\", demanding that he be appointed Chancellor. Schleicher agrees to support Hitler as Chancellor provided that he can remain minister of defense. Schleicher sets up a meeting between Hindenburg and Hitler on for the 13 August to discuss Hitler's possible appointment as chancellor."], ["1932-08-06T00:00:00", "The first Venice Film Festival is held."], ["1932-08-06T00:00:00", "In Germany the first worldwide Autobahn opened by Konrad Adenauer: Bundesautobahn 555."], ["1932-08-07T00:00:00", "Raymond Edward Welch becomes the first one legged man to scale the 6,288 ft. Mount Washington, NH."], ["1932-08-09T00:00:00", "- The Papen government in Germany, which likes to take a tough \"law and order\" stance, passes via Article 48 a law proscribing the death penalty for a variety of offenses and with the court system simplified so that the courts can hand down as many death sentences as possible."], ["1932-08-09T00:00:00", "- The Potempa Murder case: In the German town of Potempa, five Nazi \"Brownshirts\" break into the house of Konrad Pietrzuch, a Communist miner, and proceed to castrate and beat him to death in front of his mother. The case attracts much media attention in Germany. The murderers were released from jail after Adolf Hitler became Chancellor of Germany."], ["1932-08-10T00:00:00", "A 5.1 kg chondrite-type meteorite breaks fragments and strikes earth near the town of Archie, Missouri."], ["1932-08-11T00:00:00", "To celebrate Constitution Day in Germany, Chancellor Franz von Papen and his interior minister Baron Wilhelm von Gayl-apparently without any sense of irony-present a set of proposed amendments to the Weimar constitution for a \"New State\", which would have gutted democracy and transform Germany into a dictatorship if implemented. Papen argues that to deal with the Great Depression requires the destruction of democracy as only a dictatorship is capable of solving Germany's problems."], ["1932-08-13T00:00:00", "Hitler meets President von Hindenburg and asks him to appoint him Chancellor. Hindenburg refuses under the grounds that Hitler is not qualified to be Chancellor and asks him instead to serve as Vice-Chancellor in Papen's government. Hitler in turn announces his \"all or nothing\" strategy in which he will oppose every government not headed by himself and will accept no office other than Chancellor."], ["1932-08-18T00:00:00", "Auguste Piccard reaches an altitude of 16,197 m (53,140 ft) with a hot air balloon."], ["1932-08-20T00:00:00", "The Ottawa conference ends with the adoption of Imperial Preference tariff, turning the British Empire into one economic zone with a series of tariffs meant to exclude non-empire states from competing within the markets of Britain; the Dominions; and the rest of the empire."], ["1932-08-22T00:00:00", "The five SA men involved in the torture and murder of Konrad Pietrzuch are quickly convicted and sentenced to death under an emergency law introduced by the Papen government on 8 August. The Potempa case becomes a cause célèbre in Germany with the Nazis demonstrating for amnesty for the \"Potempa five\" under the grounds they were justified in killing the Communist Pietrzuch; Hitler sends a telegram congratulating the \"Potempa five\" for the murder. Many Germans arguing that the \"Potempa five\" are patriotic heroes who should not be executed while others maintain the death sentences are appropriate given the brutality of the torture and murder."], ["1932-08-23T00:00:00", "The Panama Civil Aviation Authority is established."], ["1932-08-30T00:00:00", "Hermann Göring is elected as Speaker of the German Reichstag."], ["1932-08-31T00:00:00", "A total solar eclipse is visible from northern Canada through northeastern Vermont, New Hampshire, southwestern Maine and the Capes of Massachusetts."], ["1932-09-01T00:00:00", "Germany walks out of the World Disarmament Conference under the grounds that the other powers are refusing to grant gleichberechtigung. "], ["1932-09-02T00:00:00", "Despite the court's sentence of death against the \"Potempa five\", Chancellor von Papen in his capacity as Reich Commissioner of Prussia refuses to have the \"Potempa five\" executed under the grounds that they were not aware of the emergency law at the time they committed the murder, but in reality because he is still hoping for Nazi support for his government."], ["1932-09-09T00:00:00", "Generalitat of Catalonia is restored within the Second Spanish Republic from September 25 until the collapse of the Republic in 1939."], ["1932-09-09T00:00:00", "Beginning of the Chaco War a conflict between Paraguay and Bolivia because of delimitation problems and others."], ["1932-09-10T00:00:00", "The IND Eighth Avenue Line, at this time the world's longest subway line (31 miles (50 km)), begins operation in Manhattan."], ["1932-09-11T00:00:00", "Canadian operations end on the International Railway (New York-Ontario)."], ["1932-09-12T00:00:00", "The very unpopular Papen government is defeated on a massive motion of no-confidence in the Reichstag. With the exceptions of the German People's Party and the German National People's Party, every party in the Reichstag votes for the no-confidence motion. Papen has Hindenburg dissolve the Reichstag for new elections in November."], ["1932-09-20T00:00:00", "Mohandas K. Gandhi begins a hunger strike in Poona prison, India."], ["1932-09-22T00:00:00", "Soviet famine of 1932-33 begins, millions starve to death as a result of forced collectivization and as part of the government's effort to break rural resistance to its policies. The Soviet regimes denies the famine and allows millions to die."], ["1932-09-23T00:00:00", "The Kingdom of Hejaz and Nejd is proclaimed the Kingdom of Saudi Arabia, concluding the country's unification under the rule of Ibn Saud."], ["1932-09-27T00:00:00", "Ryutin Affair at its height in the Soviet Union. The Soviet Politburo meets and condemns the so-called \"Ryutin Platform\" and agrees to expel those associated with it from the Communist Party, but refuses Stalin's request to execute those associated with the \"Ryutin Platform\"."], ["1932-10-01T00:00:00", "- Babe Ruth makes his famous called shot in the fifth inning of game 3 of the 1932 World Series."], ["1932-10-01T00:00:00", "- Gyula Gömbös becomes Prime Minister of Hungary, marking the first time a member of the radical right has become Hungary's head of government."], ["1932-10-03T00:00:00", "Iraq becomes an independent kingdom under Faisal."], ["1932-10-15T00:00:00", "Tata Airlines (later to become Air India) makes its first flight."], ["1932-10-15T00:00:00", "The Michigan Marching Band (at this time called the Varsity band) debuts Script Ohio at the Michigan versus Ohio State game in Columbus."], ["1932-10-19T00:00:00", "Prince Gustav Adolf of Sweden marries Princess Sibylla of Saxe-Coburg and Gotha."], ["1932-10-23T00:00:00", "Fred Allen's radio comedy show debuts on CBS."], ["1932-11-01T00:00:00", "The San Francisco Opera House opens."], ["1932-11-03T00:00:00", "Strike by transport workers in Berlin. The Nazis and the Communists both co-operate in support of the strike. The Nazi-Communist co-operation hurts the Nazis at the upcoming election with many right-wing voters switching back to the German National People's Party."], ["1932-11-06T00:00:00", "The Reichstag election is held. The Nazis remain the largest party, but their share of the seats drops from 37% to 32%."], ["1932-11-07T00:00:00", "Buck Rogers in the 25th Century debuts on American radio. It is the first science fiction program on radio."], ["1932-11-08T00:00:00", "U.S. presidential election, 1932: Democratic Governor of New York Franklin D. Roosevelt defeats Republican President Herbert Hoover in a landslide victory."], ["1932-11-09T00:00:00", "A hurricane and huge waves kill about 2,500 in Santa Cruz del Sur in the worst natural disaster in Cuban history."], ["1932-11-09T00:00:00", "Geneva massacre: Military of Switzerland fire on a socialist ant-fascist demonstration in Geneva leaving 13 dead and 60 injured."], ["1932-11-16T00:00:00", "New York City's Palace Theatre fully converts to a cinema, which is considered the final death knell of vaudeville as a popular entertainment in the United States."], ["1932-11-19T00:00:00", "The second wife of Joseph Stalin is found dead in her home."], ["1932-11-21T00:00:00", "German president Hindenburg begins negotiations with Adolf Hitler about the formation of a new government."], ["1932-11-24T00:00:00", "In Washington, D.C., the FBI Scientific Crime Detection Laboratory (better known as the FBI Crime Lab) officially opens."], ["1932-11-30T00:00:00", "The Polish Cipher Bureau breaks the German Enigma cipher."], ["1932-12-01T00:00:00", "Germany returns to the World Disarmament Conference after the others powers agree to accept gleichberechtigung  \"in principle\". Henceforward, it is clear that Germany will be allowed to rearm beyond the limits imposed by the Treaty of Versailles."], ["1932-12-03T00:00:00", "Hindenburg names Kurt von Schleicher as German chancellor after he ousts Papen. Papen is deeply angry about how his former friend Schleicher has brought him down and decides that he will do anything to get back into power."], ["1932-12-04T00:00:00", "Chancellor Schleicher meets with Gregor Strasser and offers to appoint him Vice-Chancellor and Reich Commissioner for Prussia out of the hope that if faced with a split in the NSDAP, Hitler will support his government."], ["1932-12-05T00:00:00", "At a secret meeting of the Nazi leaders, Strasser urges Hitler to drop his \"all or nothing\" strategy and accept Schleicher's offer to have the Nazis serve in his cabinet. Hitler gives a dramatic speech saying that Schleicher's offer is not acceptable and he will stick to his \"all or nothing\" strategy whatever the consequences might be and wins the Nazi leadership over to his viewpoint."], ["1932-12-08T00:00:00", "Gregor Strasser resigns as the chief of the NSDAP's organizational department in protest against Hitler's \"all or nothing\" strategy."], ["1932-12-12T00:00:00", "Japan and the Soviet Union reform their diplomatic connections."], ["1932-12-19T00:00:00", "BBC World Service begins broadcasting as the BBC Empire Service."], ["1932-12-23T00:00:00", "A coal mine in Moweaqua, Illinois, kills 54."], ["1932-12-24T00:00:00", "A methane gas explosion causes the Moweaqua Coal Mine Disaster which claims 54 lives."], ["1932-12-25T00:00:00", "An earthquake in the Kansu Province in China kills 70,000."], ["1932-12-25T00:00:00", "IG Farben file a patent application in Germany for the medical application of the first sulfonamide oral antibiotic, which will be marketed as Prontosil, following Gerhard Domagk's laboratory demonstration of its properties as an antibiotic."], ["1932-12-27T00:00:00", "- Radio City Music Hall opens in New York City."], ["1932-12-27T00:00:00", "- Internal passports are introduced in the Soviet Union."], ["1932-12-28T00:00:00", "The Cologne banker Kurt von Schröder-who is a close friend of Papen and a NSDAP member-meets with Adolf Hitler to tell him that Papen wants to set up a meeting to discuss how they can work together. Papen wants Nazi support to return to the Chancellorship while Hitler wants Papen to convince Hindenburg to appoint him Chancellor. Hitler agrees to meet Papen on 3 January 1933."]]