[["1970-01-01T00:00:00", "Unix time begins at 00:00:00 UTC."], ["1970-01-04T00:00:00", "1970 Tonghai earthquake: An earthquake of 7.7 Richter magnitude scale in Tonghai County, Yunnan province, China, kills at least 15,621."], ["1970-01-05T00:00:00", "The first episode of United States soap opera All My Children is broadcast on the ABC television network."], ["1970-01-12T00:00:00", "Biafra capitulates, ending the Nigerian Civil War."], ["1970-01-14T00:00:00", "Diana Ross and The Supremes perform their farewell live concert together at the Frontier Hotel in Las Vegas. Ross's replacement, Jean Terrell, is introduced onstage at the end of the last show."], ["1970-01-15T00:00:00", "After a 32-month fight for independence from Nigeria, Biafran forces under Philip Effiong formally surrender to General Yakubu Gowon."], ["1970-01-20T00:00:00", "The Greater London Council announces its plans for the Thames Barrier at Woolwich to prevent flooding (the barrier opens in 1981)."], ["1970-01-21T00:00:00", "Five lifeboatmen are killed when a Fraserburgh, Scotland vessel, The Duchess of Kent, capsizes."], ["1970-01-21T00:00:00", "Pan American Airways offers the first commercially scheduled 747 service from John F. Kennedy International Airport to London Heathrow Airport."], ["1970-01-23T00:00:00", "Joseph Fielding Smith becomes the 10th President of The Church of Jesus Christ of Latter-day Saints"], ["1970-01-26T00:00:00", "Mick Jagger is fined £200 for possession of cannabis."], ["1970-02-01T00:00:00", "A train collision near Buenos Aires, Argentina kills 236."], ["1970-02-10T00:00:00", "An avalanche at Val-d'Isère, France kills 39 tourists."], ["1970-02-11T00:00:00", "Ōsumi, Japan's first satellite, is launched on a Lambda-4 rocket."], ["1970-02-13T00:00:00", "Black Sabbath's eponymous debut album is released; often regarded as the first true heavy metal album."], ["1970-02-14T00:00:00", "The iconic live album The Who: Live at Leeds is recorded."], ["1970-02-17T00:00:00", "MacDonald family massacre: Jeffrey R. MacDonald kills his wife and children at Fort Bragg, North Carolina, claiming that drugged-out \"hippies\" did it.\n\n"], ["1970-02-17T00:00:00", "Author David Irving is ordered to pay £40,000 libel damages to Capt. John Broome over his book The Destruction of Convoy PQ17."], ["1970-02-18T00:00:00", "A jury finds the Chicago Seven defendants not guilty of conspiring to incite a riot, in charges stemming from the violence at the 1968 Democratic National Convention. Five of the defendants are found guilty on the lesser charge of crossing state lines to incite a riot."], ["1970-02-19T00:00:00", "Poseidon bubble: shares in Australian nickel mining company Poseidon NL, which stood at $0.80 in September 1969, peak at around $280 before the speculative bubble bursts."], ["1970-02-21T00:00:00", "Construction begins on the Boğaziçi Bridge crossing the Bosphorus in Istanbul."], ["1970-02-22T00:00:00", "Guyana becomes a Republic within the Commonwealth of Nations."], ["1970-02-26T00:00:00", "Chevrolet releases the second generation Camaro."], ["1970-03-01T00:00:00", "Rhodesia severs its last tie with the United Kingdom, declaring itself a republic."], ["1970-03-05T00:00:00", "The Nuclear Non-Proliferation Treaty goes into effect, after ratification by 56 nations."], ["1970-03-06T00:00:00", "A bomb being constructed by members of the Weathermen and meant to be planted at a military dance in New Jersey, explodes, killing 3 members of the organization."], ["1970-03-06T00:00:00", "Süleyman Demirel of AP forms the new government of Turkey (32nd government)."], ["1970-03-07T00:00:00", "Citroën introduces the SM at the Geneva Auto Salon."], ["1970-03-07T00:00:00", "A solar eclipse passes along the Atlantic coast region. Totality is visible across southern Mexico and across the southeast coast of the United States, Nantucket, and Nova Scotia."], ["1970-03-12T00:00:00", "Teenagers in the United Kingdom vote for the first time, in a by-election in Bridgwater."], ["1970-03-15T00:00:00", "The Expo '70 World's Fair opens in Suita, Osaka, Japan."], ["1970-03-16T00:00:00", "The complete New English Bible is published."], ["1970-03-17T00:00:00", "My Lai Massacre: The United States Army charges 14 officers with suppressing information related to the incident."], ["1970-03-18T00:00:00", "General Lon Nol ousts Prince Norodom Sihanouk of Cambodia."], ["1970-03-18T00:00:00", "United States Postal Service workers in New York City go on strike; the strike spreads to the state of California and the cities of Akron, Ohio, Philadelphia, Chicago, Boston, and Denver; 210,000 out of 750,000 U.S. postal employees walk out. President Nixon assigns military units to New York City post offices. The strike lasts 2 weeks."], ["1970-03-20T00:00:00", "The Agency for Cultural and Technical Co-operation (ACCT) (Agence de Coopération Culturelle et Technique) is founded."], ["1970-03-21T00:00:00", "The first Earth Day proclamation is issued by San Francisco Mayor Joseph Alioto."], ["1970-03-21T00:00:00", "\"All Kinds of Everything\", sung by Dana (music and text by Derry Lindsay and Jackie Smith), wins the Eurovision Song Contest 1970 for Ireland."], ["1970-03-31T00:00:00", "NASA's Explorer 1, the first American satellite and Explorer program spacecraft, reenters Earth's atmosphere after 12 years in orbit."], ["1970-03-31T00:00:00", "Japan Airlines Flight 351, carrying 131 passengers and 7 crew from Tokyo to Fukuoka, is hijacked by Japanese Red Army members. All passengers are eventually freed."], ["1970-04-01T00:00:00", "American President Richard Nixon signs the Public Health Cigarette Smoking Act into law, banning cigarette television advertisements in the United States from January 1, 1971."], ["1970-04-01T00:00:00", "American Motors Corporation introduces the Gremlin."], ["1970-04-01T00:00:00", "The 1970 United States Census begins. There are 203,392,031 United States residents on this day."], ["1970-04-04T00:00:00", "The remains of Adolf Hitler, Eva Braun, Joseph Goebbels, Magda Goebbels and the Goebbels children are crushed and thrown into the Biederitz river at a KGB center in Magdeburg, East Germany."], ["1970-04-06T00:00:00", "BBC Radio 4 broadcasts the first edition of PM."], ["1970-04-08T00:00:00", "A huge gas explosion at a subway construction site in Osaka, Japan kills 79 and injures over 400."], ["1970-04-08T00:00:00", "Israeli Air Force F-4 Phantom II fighter bombers kill 47 Egyptian school children at an elementary school in what is known as Bahr el-Baqar massacre. The single-floor school is hit by 5 bombs and 2 air-to-ground missiles."], ["1970-04-10T00:00:00", "In a press release written in mock-interview style, that is included in promotional copies of his first solo album, Paul McCartney announces that he has left the Beatles. (See Nicholas Schaffner, The Beatles Forever (New York: Cameron House, 1977), 135.)"], ["1970-04-10T00:00:00", "The Elton John album is released, the second album by Elton John, but the first to chart and the first to be released in America."], ["1970-04-11T00:00:00", "An avalanche at a tuberculosis sanatorium in the French Alps kills 74, mostly young boys."], ["1970-04-11T00:00:00", "Apollo program: Apollo 13 (Jim Lovell, Fred Haise, Jack Swigert) is launched toward the Moon."], ["1970-04-13T00:00:00", "An oxygen tank in the Apollo 13 spacecraft explodes, forcing the crew to abort the mission and return in 4 days."], ["1970-04-16T00:00:00", "Rev. Ian Paisley wins a by-election to gain a seat in the House of Commons of Northern Ireland."], ["1970-04-16T00:00:00", "The National Westminster Bank begins trading in the United Kingdom."], ["1970-04-17T00:00:00", "Apollo program: Apollo 13 splashes down safely in the Pacific."], ["1970-04-21T00:00:00", "The Principality of Hutt River \"secedes\" from Australia (it remains unrecognised by Australia and other nations)."], ["1970-04-22T00:00:00", "The first Earth Day is celebrated in the U.S."], ["1970-04-24T00:00:00", "China's first satellite (Dong Fang Hong 1) is launched into orbit using a Long March-1 Rocket (CZ-1)."], ["1970-04-26T00:00:00", "The World Intellectual Property Organization (WIPO) is founded."], ["1970-04-29T00:00:00", "The U.S. invades Cambodia to hunt out the Viet Cong; widespread, large antiwar protests occur in the U.S."], ["1970-05-01T00:00:00", "Demonstrations against the trial of the New Haven Nine, Bobby Seale, and Ericka Huggins draw 12,000. President Richard Nixon orders U.S. forces to cross into neutral Cambodia, threatening to widen the Vietnam War, sparking nationwide riots and leading to the Kent State shootings."], ["1970-05-04T00:00:00", "Kent State shootings: Four students at Kent State University in Ohio are killed and 9 wounded by Ohio National Guardsmen, at a protest against the incursion into Cambodia."], ["1970-05-06T00:00:00", "Arms Crisis in the Republic of Ireland: Charles Haughey and Neil Blaney are dismissed as members of the Irish Government, for accusations of their involvement in a plot to import arms for use by the Provisional IRA in Northern Ireland."], ["1970-05-06T00:00:00", "Feyenoord wins the European Cup after a 2-1 win over Celtic."], ["1970-05-08T00:00:00", "Hard Hat Riot: Unionized construction workers attack about 1,000 students and others protesting the Kent State shootings near the intersection of Wall Street and Broad Street and at New York City Hall."], ["1970-05-08T00:00:00", "The Beatles release their 12th and final album, Let It Be."], ["1970-05-08T00:00:00", "The New York Knicks win their first NBA championship, defeating the Los Angeles Lakers 113-99 in Game 7 of the world championship series at Madison Square Garden."], ["1970-05-09T00:00:00", "In Washington, D.C., 100,000 people demonstrate against the Vietnam War."], ["1970-05-10T00:00:00", "The Boston Bruins win their first Stanley Cup since 1941 when Bobby Orr scores a goal 40 seconds into overtime for a 4-3 victory which completes a four-game sweep of the St. Louis Blues."], ["1970-05-11T00:00:00", "Henry Marrow is killed in an alleged hate crime in Oxford, North Carolina."], ["1970-05-11T00:00:00", "Lubbock tornado: An F5 tornado hits downtown Lubbock, Texas, the first to hit a downtown district of a major city since Topeka, Kansas in 1966; 28 are killed."], ["1970-05-12T00:00:00", "The 1976 Winter Olympics are awarded to Denver, Colorado but it is later rejected in 1972."], ["1970-05-14T00:00:00", "Ulrike Meinhof helps Andreas Baader escape and create the Red Army Faction which exists until 1998."], ["1970-05-14T00:00:00", "In the second day of violent demonstrations at Jackson State University in Jackson, Mississippi, state law enforcement officers fire into the demonstrators, killing 2 and injuring 12."], ["1970-05-17T00:00:00", "Thor Heyerdahl sets sail from Morocco on the papyrus boat Ra II, to sail the Atlantic Ocean."], ["1970-05-23T00:00:00", "A fire occurs in the Britannia Bridge over the Menai Strait near Bangor, Caernarfonshire, Wales, contributing to its partial destruction and amounting to approximately £1,000,000 worth of fire damage."], ["1970-05-24T00:00:00", "The scientific drilling of the Kola Superdeep Borehole begins in the USSR."], ["1970-05-26T00:00:00", "The Soviet Tupolev Tu-144 becomes the first commercial transport to exceed Mach 2."], ["1970-05-27T00:00:00", "A British expedition climbs the south face of Annapurna I."], ["1970-05-31T00:00:00", "The 1970 Ancash earthquake causes a landslide that buries the town of Yungay, Peru; more than 47,000 people are killed."], ["1970-05-31T00:00:00", "The 1970 FIFA World Cup is inaugurated in Mexico."], ["1970-06-01T00:00:00", "Soyuz 9, a two-man spacecraft, is launched in the Soviet Union."], ["1970-06-02T00:00:00", "Norway announces it has rich oil deposits off its North Sea coast."], ["1970-06-04T00:00:00", "Tonga gains independence from the United Kingdom."], ["1970-06-07T00:00:00", "The Who become the first act to perform rock music (their rock opera, Tommy) at the Metropolitan Opera House, New York."], ["1970-06-08T00:00:00", "A coup in Argentina brings a new junta of service chiefs; on June 18, Roberto M. Levingston becomes President."], ["1970-06-11T00:00:00", "The United States gets its first female generals, Anna Mae Hays and Elizabeth P. Hoisington."], ["1970-06-12T00:00:00", "NDFLOAG guerrillas attack military garrisons at Izki and Nizwa in Oman."], ["1970-06-13T00:00:00", "The Long and Winding Road becomes The Beatles 20th and final single to reach Number One on the US Billboard Hot 100 chart."], ["1970-06-18T00:00:00", "United Kingdom general election, 1970: the Conservative Party wins and Edward Heath becomes Prime Minister, ousting the Labour government of Harold Wilson after nearly six years in power. The election result is something of a surprise, as most of the opinion polls had predicted a third successive Labour win."], ["1970-06-21T00:00:00", "Brazil defeats Italy 4-1 to win the 1970 FIFA World Cup."], ["1970-06-21T00:00:00", "Penn Central declares Section 77 bankruptcy, the largest ever US corporate bankruptcy up to this date."], ["1970-06-24T00:00:00", "The United States Senate repeals the Gulf of Tonkin Resolution of 1964."], ["1970-06-28T00:00:00", "U.S. ground troops withdraw from Cambodia."], ["1970-06-30T00:00:00", "Riverfront Stadium in Cincinnati opens."], ["1970-07-01T00:00:00", "Colorado State College changes its name to University of Northern Colorado."], ["1970-07-01T00:00:00", "The U.S. Food and Drug Administration (FDA) is subordinated to Public Health Service."], ["1970-07-03T00:00:00", "The French Army detonates a 914 kiloton thermonuclear device in the Mururoa Atoll. It is their fourth and largest nuclear test."], ["1970-07-04T00:00:00", "A chartered Dan-Air De Havilland Comet crashes into the mountains north of Barcelona; at least 112 people are killed."], ["1970-07-04T00:00:00", "Bob Hope and other entertainers gather in Washington, D.C. for Honor America Day, a nonpartisan holiday event."], ["1970-07-04T00:00:00", "Longtime radio music countdown show American Top 40 debuts on 5 U.S. stations with Casey Kasem as host."], ["1970-07-05T00:00:00", "Air Canada Flight 621 crashes at Toronto International Airport, Toronto, Ontario; all 109 passengers and crew are killed."], ["1970-07-11T00:00:00", "The first tunnel under the Pyrenees links the towns of Aragnouet (France) and Bielsa (Spain)."], ["1970-07-12T00:00:00", "Thor Heyerdahl's papyrus boat Ra II arrives in Barbados."], ["1970-07-16T00:00:00", "Three Rivers Stadium in Pittsburgh opens."], ["1970-07-21T00:00:00", "The Aswan High Dam in Egypt is completed."], ["1970-07-23T00:00:00", "Said bin Taimur, Sultan of Muscat and Oman, is deposed in a palace coup by his son, Qaboos."], ["1970-07-23T00:00:00", "Two CS gas canisters are thrown into the chamber of the British House of Commons."], ["1970-07-30T00:00:00", "Damages totalling £485,528 are awarded to 28 Thalidomide victims."], ["1970-07-31T00:00:00", "NBC anchor Chet Huntley retires from full-time broadcasting."], ["1970-08-07T00:00:00", "Harold Haley, Marin County Superior Court Judge, is taken hostage and murdered, in an effort to free George Jackson from police custody."], ["1970-08-17T00:00:00", "Venera program: Venera 7 is launched toward Venus. It later becomes the first spacecraft to successfully transmit data from the surface of another planet."], ["1970-08-26T00:00:00", "Women's Strike for Equality takes place down Fifth Avenue in New York City."], ["1970-08-29T00:00:00", "Rubén Salazar is shot and killed during a rally in East Los Angeles."], ["1970-09-01T00:00:00", "An assassination attempt against King Hussein of Jordan precipitates the Black September crisis."], ["1970-09-03T00:00:00", "September 6 - Israeli forces fight Palestinian guerillas in southern Lebanon."], ["1970-09-05T00:00:00", "Vietnam War - Operation Jefferson Glenn: The United States 101st Airborne Division and the South Vietnamese 1st Infantry Division initiate a new operation in Thua Thien Province (the operation ends in October 1971)."], ["1970-09-05T00:00:00", "Formula One driver Jochen Rindt is killed in qualifying for the Italian Grand Prix. He becomes World Driving Champion anyhow, first to earn the honor posthumously."], ["1970-09-06T00:00:00", "Dawson's Field hijackings, The Popular Front for the Liberation of Palestine hijacks 4 passenger aircraft from Pan Am, TWA and Swissair on flights to New York from Brussels, Frankfurt and Zürich."], ["1970-09-07T00:00:00", "An anti-war rally is held at Valley Forge, Pennsylvania, attended by John Kerry, Jane Fonda and Donald Sutherland."], ["1970-09-07T00:00:00", "Fighting breaks out between Arab guerillas and government forces in Amman, Jordan."], ["1970-09-09T00:00:00", "Guinea recognizes East Germany."], ["1970-09-09T00:00:00", "Elvis Presley begins his first concert tour since 1958 in Phoenix, Arizona, at the Veterans Memorial Coliseum."], ["1970-09-10T00:00:00", "Cambodian government forces break the siege of Kompong Tho after 3 months."], ["1970-09-10T00:00:00", "The Chevrolet Vega is introduced."], ["1970-09-11T00:00:00", "The Ford Pinto is introduced."], ["1970-09-13T00:00:00", "The covert incursion of Operation Tailwind is instigated by the American forces in southeast Laos."], ["1970-09-13T00:00:00", "The first New York City Marathon begins."], ["1970-09-15T00:00:00", "King Hussein of Jordan forms a military government with Muhammad Daoud as the prime minister."], ["1970-09-20T00:00:00", "Syrian armored forces cross the Jordanian border."], ["1970-09-20T00:00:00", "Luna 16 lands on the Moon and lifts off the next day with samples. It lands on Earth September 24."], ["1970-09-21T00:00:00", "Palestinian armored forces reinforce Palestinian guerillas in Irbidi, Jordan."], ["1970-09-21T00:00:00", "Monday Night Football debuts on ABC; the Cleveland Browns defeat the New York Jets 31-21 in front of more than 85,000 fans at Cleveland Stadium."], ["1970-09-22T00:00:00", "The International Hydrographic Organization (IHO) is founded."], ["1970-09-22T00:00:00", "Tunku Abdul Rahman resigns as prime minister of Malaysia, and is succeeded by his deputy Tun Abdul Razak."], ["1970-09-23T00:00:00", "The first women's only tennis tournament begins in Houston, known as the Houston Women's Invitation."], ["1970-09-26T00:00:00", "The Laguna Fire starts in San Diego County, burning 175,425 acres (709.92 km2)."], ["1970-09-27T00:00:00", "Richard Nixon begins a tour of Europe, visiting Italy, Yugoslavia, Spain, the United Kingdom and Ireland."], ["1970-09-28T00:00:00", "Gamal Abdel Nasser dies; Vice President Anwar Sadat is named temporary president of Egypt."], ["1970-09-29T00:00:00", "The U.S. Congress gives President Richard Nixon authority to sell arms to Israel."], ["1970-09-29T00:00:00", "In Berlin, Baader-Meinhof Gang members rob 3 banks, with loot totaling over DM200,000."], ["1970-10-02T00:00:00", "Under the National Environmental Policy Act (NEPA) the Environmental Science Services Administration (ESSA) Corps, one of seven federal uniformed services of the United States, is renamed to NOAA Commissioned Officer Corps under the soon to be formed National Oceanic and Atmospheric Administration (NOAA)."], ["1970-10-02T00:00:00", "The Wichita State University football team's \"Gold\" plane crashes in Colorado, killing most of the players. They were on their way (along with administrators and fans) to a game with Utah State University."], ["1970-10-02T00:00:00", "Pink Floyd releases Atom Heart Mother. It becomes their first number 1 album."], ["1970-10-03T00:00:00", "In Lebanon, the government of Prime Minister Rashid Karami resigns."], ["1970-10-03T00:00:00", "The National Oceanic and Atmospheric Administration (NOAA) is formed."], ["1970-10-03T00:00:00", "The Weather Bureau is renamed to National Weather Service, as part of NOAA."], ["1970-10-04T00:00:00", "Jochen Rindt becomes Formula One World Driving Champion, first to earn the honor posthumously."], ["1970-10-04T00:00:00", "In Bolivia, Army Commander General Rogelio Miranda and a group of officers rebel and demand the resignation of President Alfredo Ovando Candía, who fires him."], ["1970-10-04T00:00:00", "National Educational Television ends operations, being succeeded by PBS."], ["1970-10-05T00:00:00", "U.S. President Richard Nixon's European tour ends."], ["1970-10-05T00:00:00", "The Front de libération du Québec (FLQ) kidnaps James Cross in Montreal and demands release of all its imprisoned members. The next day the Canadian government announces it will not meet the demand, beginning Quebec's October Crisis."], ["1970-10-05T00:00:00", "The Public Broadcasting Service begins broadcasting."], ["1970-10-06T00:00:00", "Bolivian President Alfredo Ovando Candía resigns; General Rogelio Miranda takes over but resigns soon after."], ["1970-10-06T00:00:00", "French President Georges Pompidou visits the Soviet Union."], ["1970-10-07T00:00:00", "General Juan José Torres becomes the new President of Bolivia."], ["1970-10-08T00:00:00", "The U.S. Foreign Office announces that renewal of arms sales to Pakistan."], ["1970-10-08T00:00:00", "Soviet author Aleksandr Solzhenitsyn is awarded the Nobel Prize in Literature."], ["1970-10-08T00:00:00", "Vietnam War: In Paris, a Communist delegation rejects U.S. President Richard Nixon's October 7 peace proposal as \"a maneuver to deceive world opinion.\""], ["1970-10-09T00:00:00", "The Khmer Republic is proclaimed in Cambodia which begins the Civil War with the Khmer Rouge."], ["1970-10-10T00:00:00", "Fiji becomes independent."], ["1970-10-10T00:00:00", "October Crisis: In Montreal, a national crisis hits Canada when Quebec Minister of Labour Pierre Laporte becomes the second statesman kidnapped by members of the FLQ terrorist group."], ["1970-10-11T00:00:00", "Eleven French soldiers are killed in a shootout with rebels in Chad."], ["1970-10-12T00:00:00", "Vietnam War: U.S. President Richard Nixon announces that the United States will withdraw 40,000 more troops before Christmas."], ["1970-10-13T00:00:00", "Canada and the People's Republic of China establish diplomatic relations."], ["1970-10-13T00:00:00", "Saeb Salam forms a government in Lebanon."], ["1970-10-14T00:00:00", "A Chinese nuclear test is conducted in Lop Nor."], ["1970-10-15T00:00:00", "In Egypt, a referendum supports Anwar Sadat 90.04%."], ["1970-10-15T00:00:00", "A section of the new West Gate Bridge in Melbourne collapses into the river below, killing 35 construction workers."], ["1970-10-15T00:00:00", "The domestic Soviet Aeroflot Flight 244 is hijacked and diverted to Turkey."], ["1970-10-16T00:00:00", "October Crisis: The Canadian government declares a state of emergency and outlaws the Quebec Liberation Front."], ["1970-10-17T00:00:00", "October Crisis: Pierre Laporte is found murdered in south Montreal."], ["1970-10-17T00:00:00", "A cholera epidemic breaks out in Istanbul."], ["1970-10-17T00:00:00", "Anwar Sadat officially becomes President of Egypt."], ["1970-10-20T00:00:00", "The Soviet Union launches the Zond 8 lunar probe."], ["1970-10-20T00:00:00", "Egyptian president Anwar Sadat names Mahmoud Fawzi as his prime minister."], ["1970-10-21T00:00:00", "A U.S. Air Force plane makes an emergency landing near Leninakan, Soviet Union. The Soviets release the American officers, including 2 generals, November 10."], ["1970-10-22T00:00:00", "Chilean army commander René Schneider is shot in Santiago; the government declares a state of emergency. Schneider dies October 25."], ["1970-10-24T00:00:00", "Salvador Allende is elected President of Chile."], ["1970-10-25T00:00:00", "The wreck of the Confederate submarine Hunley is found off Charleston, South Carolina, by pioneer underwater archaeologist, Dr. E. Lee Spence, then just 22 years old. Hunley was the first submarine in history to sink a ship in warfare."], ["1970-10-26T00:00:00", "Garry Trudeau's comic strip Doonesbury debuts in approximately two dozen newspapers in the United States."], ["1970-10-28T00:00:00", "In Jordan, the government of Ahmed Toukan resigns; the next prime minister is Wasfi al-Tal."], ["1970-10-28T00:00:00", "A cholera outbreak in eastern Slovakia causes Hungary to close its border with Czechoslovakia."], ["1970-10-28T00:00:00", "Gary Gabelich drives the rocket-powered Blue Flame to an official land speed record at 622.407 mph (1,001.667 km/h) on the dry lake bed of the Bonneville Salt Flats in Utah. The record, the first above 1 000 km/h, stands for nearly 13 years."], ["1970-10-30T00:00:00", "In Vietnam, the worst monsoon to hit the area in 6 years causes large floods, kills 293, leaves 200,000 homeless and virtually halts the Vietnam War."], ["1970-11-01T00:00:00", "Club Cinq-Sept fire in Saint-Laurent-du-Pont, France, kills 146."], ["1970-11-03T00:00:00", "Democrats sweep the U.S. Congressional midterm elections; Ronald Reagan is reelected governor of California; Jimmy Carter is elected governor of Georgia."], ["1970-11-03T00:00:00", "Salvador Allende becomes president of Chile."], ["1970-11-04T00:00:00", "Vietnam War - Vietnamization: The United States turns control of the air base in the Mekong Delta to South Vietnam."], ["1970-11-04T00:00:00", "Social workers in Los Angeles take custody of Genie, a girl who had been kept in solitary confinement since her birth."], ["1970-11-05T00:00:00", "Vietnam War: The United States Military Assistance Command in Vietnam reports the lowest weekly American soldier death toll in 5 years (24 soldiers die that week, which is the fifth consecutive week the death toll is below 50; 431 are reported wounded that week, however)."], ["1970-11-08T00:00:00", "Egypt, Libya and Sudan announce their intentions to form a federation."], ["1970-11-08T00:00:00", "Tom Dempsey, who was born with a deformed right foot and right hand, sets a National Football League record by kicking a 63-yard field goal to lift the New Orleans Saints to a 19-17 victory over the Detroit Lions at Tulane Stadium."], ["1970-11-08T00:00:00", "The British comedy television series, The Goodies debuts on BBC 2."], ["1970-11-09T00:00:00", "The Soviet Union launches Luna 17."], ["1970-11-09T00:00:00", "Vietnam War: The Supreme Court of the United States votes 6-3 not to hear a case by the state of Massachusetts, about the constitutionality of a state law granting Massachusetts residents the right to refuse military service in an undeclared war."], ["1970-11-10T00:00:00", "Vietnam War - Vietnamization: For the first time in 5 years, an entire week ends with no reports of United States combat fatalities in Southeast Asia."], ["1970-11-12T00:00:00", "Soviet author Andrei Amalrik is sentenced to 3 years for 'anti-Soviet' writings."], ["1970-11-13T00:00:00", "Hafez al-Assad comes to power in Syria, following a military coup within the Ba'ath Party."], ["1970-11-13T00:00:00", "1970 Bhola cyclone: A 120-mph (193 km/h) tropical cyclone hits the densely populated Ganges Delta region of East Pakistan (now Bangladesh), killing an estimated 500,000 people (considered the 20th century's worst cyclone disaster). It gives rise to the temporary island of New Moore / South Talpatti."], ["1970-11-14T00:00:00", "Southern Airways Flight 932 crashes in Wayne County, West Virginia; all 75 on board, including 37 players and 5 coaches from the Marshall University football team, are killed."], ["1970-11-14T00:00:00", "The Soviet Union enters the ICAO, making Russian the fourth official language of the organization."], ["1970-11-16T00:00:00", "The Lockheed L-1011 TriStar flies for the first time."], ["1970-11-17T00:00:00", "Vietnam War: Lieutenant William Calley goes on trial for the My Lai Massacre."], ["1970-11-17T00:00:00", "Luna programme: The Soviet Union lands Lunokhod 1 on Mare Imbrium (Sea of Rains) on the Moon. This is the first roving remote-controlled robot to land on another world, and is released by the orbiting Luna 17 spacecraft."], ["1970-11-18T00:00:00", "U.S. President Richard Nixon asks the U.S. Congress for US$155 million in supplemental aid for the Cambodian government (US $85 million is for military assistance to prevent the overthrow of the government of Premier Lon Nol by the Khmer Rouge and North Vietnam)."], ["1970-11-18T00:00:00", "The United Nations Security Council demands that no government recognize Rhodesia."], ["1970-11-19T00:00:00", "European Economic Community prime ministers meet in Munich."], ["1970-11-21T00:00:00", "Syrian Prime Minister Hafez al-Assad forms a new government but retains the post of defense minister."], ["1970-11-21T00:00:00", "In Ethiopia, the Eritrean Liberation Front kills an Ethiopian general."], ["1970-11-21T00:00:00", "Vietnam War - Operation Ivory Coast: A joint Air Force and Army team raids the Sơn Tây prison camp in an attempt to free American POWs thought to be held there (no Americans are killed, but the prisoners have already moved to another camp; all U.S. POWs are moved to a handful of central prison complexes as a result of this raid)."], ["1970-11-22T00:00:00", "Guinean president Ahmed Sékou Touré accuses Portugal of an attack when hundreds of mercenaries land near the capital Conakry."], ["1970-11-23T00:00:00", "Rodgers and Hammerstein's Oklahoma! makes its network TV debut, when CBS telecasts the 1955 film version as a 3-hour Thanksgiving special."], ["1970-11-25T00:00:00", "In Tokyo, author and Tatenokai militia leader Yukio Mishima and his followers take over the headquarters of the Japan Self-Defense Forces in an attempted coup d'état. After Mishima's speech fails to sway public opinion towards his right-wing political beliefs, including restoration of the powers of the Emperor, he commits seppuku (public ritual suicide)."], ["1970-11-26T00:00:00", "East Pakistan leader Sheikh Mujibur Rahman accuses the central government of negligence in catastrophe relief."], ["1970-11-26T00:00:00", "Pope Paul VI begins an Asian tour."], ["1970-11-27T00:00:00", "Bolivian artist Benjamin Mendoza tries to assassinate Pope Paul VI during his visit in Manila."], ["1970-11-30T00:00:00", "British Caledonian Airways Ltd. (BCal) is formed."], ["1970-12-01T00:00:00", "The Italian House of Representatives accepts the new divorce law."], ["1970-12-01T00:00:00", "Ethiopia recognizes the People's Republic of China."], ["1970-12-01T00:00:00", "The Basque ETA kidnaps West German Eugen Beihl in San Sebastián."], ["1970-12-01T00:00:00", "Luis Echeverría becomes president of Mexico."], ["1970-12-02T00:00:00", "The United States Environmental Protection Agency is established."], ["1970-12-03T00:00:00", "October Crisis: In Montreal, kidnapped British Trade Commissioner James Cross is released by the Front de libération du Québec terrorist group after being held hostage for 60 days. Police negotiate his release and in return the Government of Canada grants 5 terrorists from the FLQ's Chenier Cell their request for safe passage to Cuba."], ["1970-12-03T00:00:00", "Burgos Trial: In Burgos, Spain, the trial of 16 Basque terrorism suspects begins."], ["1970-12-04T00:00:00", "The Spanish government declares a 3-month martial law in the Basque county of Guipuzco, over strikes and demonstrations."], ["1970-12-04T00:00:00", "The U.N. announces that Portuguese navy and army units were responsible for the attempted invasion of Guinea."], ["1970-12-05T00:00:00", "The Asian and Australian tour of Pope Paul VI ends."], ["1970-12-05T00:00:00", "Fluminense wins the Brazil Football Championship."], ["1970-12-07T00:00:00", "Giovanni Enrico Bucher, the Swiss ambassador to Brazil, is kidnapped in Rio de Janeiro; kidnappers demand the release of 70 political prisoners."], ["1970-12-07T00:00:00", "The U.N. General Assembly supports the isolation of South Africa for its apartheid policies."], ["1970-12-07T00:00:00", "During his visit to the Polish capital, German Chancellor Willy Brandt goes down on his knees in front of a monument to the victims of the Warsaw Ghetto, which will become known as the Warschauer Kniefall (\"Warsaw Genuflection\")."], ["1970-12-12T00:00:00", "A landslide in western Colombia leaves 200 dead."], ["1970-12-13T00:00:00", "The government of Poland announces food price increases. Riots and looting lead to a bloody confrontation between the rioters and the government on December 15."], ["1970-12-15T00:00:00", "The USSR's Venera 7 becomes the first spacecraft to land successfully on Venus and transmit data back to Earth."], ["1970-12-15T00:00:00", "The South Korean ferry Namyong Ho capsizes off Korea Strait; 308 people are killed."], ["1970-12-16T00:00:00", "The Ethiopian government declares a state of emergency in the county of Eritrea over the activities of the Eritrean Liberation Front."], ["1970-12-17T00:00:00", "Polish 1970 protests: Soldiers fire on civilians returning to work in Gdynia. Martial law is imposed in the country until December 22."], ["1970-12-20T00:00:00", "General Secretary of the Polish United Workers' Party, Władysław Gomułka, resigns; Edward Gierek replaces him."], ["1970-12-20T00:00:00", "An Egyptian delegation leaves for Moscow to ask for economic and military aid."], ["1970-12-21T00:00:00", "The Grumman F-14 Tomcat makes its first flight."], ["1970-12-22T00:00:00", "The Libyan Revolutionary Council declares that it will nationalize all foreign banks in the country."], ["1970-12-22T00:00:00", "Franz Stangl, the ex-commander of Treblinka, is sentenced to life imprisonment."], ["1970-12-23T00:00:00", "The Polish government freezes food prices for 2 years."], ["1970-12-23T00:00:00", "The Bolivian government releases Régis Debray."], ["1970-12-23T00:00:00", "The North Tower of the World Trade Center is topped out at 1,368 feet (417 m), making it the tallest building in the world."], ["1970-12-23T00:00:00", "Law 70-001 is enacted in the Democratic Republic of the Congo, amending article 4 of the constitution and making the country a single-party state."], ["1970-12-25T00:00:00", "The ETA releases Eugen Beihl."], ["1970-12-27T00:00:00", "India's president declares new elections."], ["1970-12-28T00:00:00", "Burgos Trial: Three Basques are sentenced to death, twelve others sentenced to imprisonment (terms from 12 to 62 years), and one is released."], ["1970-12-28T00:00:00", "The suspected killers of Pierre Laporte, Jacques and Paul Rose and Francis Sunard, are arrested near Montreal."], ["1970-12-29T00:00:00", "U.S. President Richard Nixon signs into law the Occupational Safety and Health Act."], ["1970-12-30T00:00:00", "In Viscaya in the Basque country of Spain, 15,000 go on strike in protest at the Burgos trial death sentences. Francisco Franco commutes the sentences to 30 years in prison."], ["1970-12-31T00:00:00", "Paul McCartney sues in Britain to dissolve The Beatles' legal partnership."]]