[["1941-01-01T00:00:00", "Thailand Prime Minister Plaek Phibunsongkhram decrees January 1 as the official start of the Thai solar calendar new year (thus the previous year that began April 1 had only 9 months)."], ["1941-01-03T00:00:00", "A decree (Normalschrifterlass) promulgated in Nazi Germany by Martin Bormann on behalf of Adolf Hitler requires replacement of blackletter typefaces by Antiqua."], ["1941-01-04T00:00:00", "The short subject Elmer's Pet Rabbit is released, marking the second appearance of Bugs Bunny, and also the first to have his name on a title card."], ["1941-01-05T00:00:00", "WWII: At the Battle of Bardia in Libya, Australian and British troops defeat Italian forces, the first battle of the war in which an Australian Army formation takes part."], ["1941-01-06T00:00:00", "The keel of the USS Missouri is laid at the New York Navy Yard in Brooklyn."], ["1941-01-10T00:00:00", "The Lend-Lease Act is introduced into the United States Congress."], ["1941-01-11T00:00:00", "The British Royal Navy light cruiser HMS Southampton (83) is sunk off Malta."], ["1941-01-13T00:00:00", "All persons born in Puerto Rico since this day are declared U.S. citizens by birth, through U.S. federal law."], ["1941-01-14T00:00:00", "WWII: Commerce raiding German auxiliary cruiser Pinguin captures the Norwegian whaling fleet near Bouvet Island, effectively ending Southern Ocean whaling for the duration of the war."], ["1941-01-15T00:00:00", "John Vincent Atanasoff and Clifford Berry describe the workings of the Atanasoff-Berry computer in print."], ["1941-01-19T00:00:00", "WWII: British troops attack Italian-held Eritrea."], ["1941-01-20T00:00:00", "Chief Justice Charles Evans Hughes swears in U.S. President Franklin D. Roosevelt for his third term."], ["1941-01-22T00:00:00", "WWII: Battle of Tobruk: Australian and British forces capture Tobruk from the Italians."], ["1941-01-22T00:00:00", "In Sweden, Victor Hasselblad registers the Hasselblad camera company."], ["1941-01-23T00:00:00", "Aviator Charles Lindbergh testifies before the U.S. Congress and recommends that the United States negotiate a neutrality pact with Adolf Hitler."], ["1941-01-27T00:00:00", "WWII: Joseph Grew, the U.S. ambassador to Japan, reports to Washington a rumor overheard at a diplomatic reception concerning a planned surprise attack on Pearl Harbor, Hawaii."], ["1941-01-30T00:00:00", "WWII: Australians capture Derna, Libya, from the Italians."], ["1941-02-03T00:00:00", "WWII: The Nazis forcibly restore Pierre Laval to office in occupied Vichy France."], ["1941-02-04T00:00:00", "WWII: The United Service Organization (USO) is created to entertain American troops."], ["1941-02-05T00:00:00", "Air Training Corps: The Air Training Corps is formed in the United Kingdom."], ["1941-02-06T00:00:00", "WWII: Fall of Benghazi to the Western Desert Force. Lieutenant-General Erwin Rommel is appointed commander of Afrika Korps."], ["1941-02-08T00:00:00", "WWII: The U.S. House of Representatives passes the Lend-Lease Act."], ["1941-02-09T00:00:00", "Winston Churchill, in a worldwide broadcast, tells the United States to show its support by sending arms to the British: \"Give us the tools, and we will finish the job.\""], ["1941-02-12T00:00:00", "WWII: Erwin Rommel arrives in Tripoli."], ["1941-02-12T00:00:00", "Reserve Constable Albert Alexander, a patient at the Radcliffe Infirmary in Oxford, becomes the first person treated with penicillin intravenously, by Howard Florey's team. He reacts positively but there is insufficient supply of the drug to reverse his terminal infection. A successful treatment is achieved during May."], ["1941-02-13T00:00:00", "Aircraft from HMS Formidable attack Massawa in Eritrea."], ["1941-02-14T00:00:00", "WWII: Admiral Kichisaburō Nomura begins his duties as Japanese Ambassador to the United States."], ["1941-02-22T00:00:00", "WWII: HMS Shropshire bombards Barawa, on the coast between Kismayo and Mogadishu."], ["1941-02-23T00:00:00", "Glenn T. Seaborg isolates and discovers plutonium."], ["1941-02-25T00:00:00", "WWII: - The occupied Netherlands starts the first popular uprising in Europe against the Axis powers, the \"February strike\" against German deportation of Jews in Amsterdam and surroundings."], ["1941-02-25T00:00:00", "WWII: - British submarine HMS Upright attacks an Italian convoy sinking the cruiser Armando Diaz."], ["1941-02-27T00:00:00", "WWII: The New Zealand Division cruiser HMS Leander (1931) sinks Italian armed merchant raider Ramb I off the Maldives."], ["1941-03-01T00:00:00", "WWII: Bulgaria signs the Tripartite Pact, thus joining the Axis powers."], ["1941-03-01T00:00:00", "W47NV begins operations in Nashville, Tennessee, becoming the first FM radio station."], ["1941-03-01T00:00:00", "Arthur L. Bristol becomes Rear Admiral for the United States Navy's Support Force, Atlantic Fleet."], ["1941-03-04T00:00:00", "WWII: Operation Claymore - British Commandos carry out a successful raid on the Lofoten Islands off the north coast of Norway."], ["1941-03-08T00:00:00", "WWII: The U.S. Senate passes the Lend-Lease Act."], ["1941-03-11T00:00:00", "WWII: Franklin D. Roosevelt, President of the United States, signs the Lend-Lease Act into law, providing for the U.S. to provide Lend-Lease aid to the Allies."], ["1941-03-15T00:00:00", "Richard C. Hottelet is arrested by the Gestapo on \"suspicion of espionage\", but eventually released in July as part of a prisoner exchange with the U.S."], ["1941-03-16T00:00:00", "A group of U.S. warships arrive in Auckland, New Zealand, on a goodwill visit. On March 20, they arrive in Sydney, Australia."], ["1941-03-17T00:00:00", "In Washington, D.C., the National Gallery of Art is officially opened by President Franklin D. Roosevelt."], ["1941-03-17T00:00:00", "British Minister of Labour Ernest Bevin calls for women to fill vital jobs."], ["1941-03-22T00:00:00", "Washington state's Grand Coulee Dam begins to generate electricity."], ["1941-03-24T00:00:00", "WWII: Rommel launches his first offensive in Cyrenaica."], ["1941-03-25T00:00:00", "WWII: The Kingdom of Yugoslavia joins the Axis powers in Vienna."], ["1941-03-27T00:00:00", "WWII: - Battle of Cape Matapan: Off the Peloponnese coast in the Mediterranean, British naval forces defeat those of Italy, sinking 5 warships. Battle ends on March 29."], ["1941-03-27T00:00:00", "WWII: - An anti-Axis coup d'état in Yugoslavia forces Prince Paul into exile; 17-year-old King Peter II assumes power."], ["1941-03-27T00:00:00", "WWII: - Japanese spy Takeo Yoshikawa arrives in Honolulu to study the Pacific Fleet at Pearl Harbor in preparation for a future attack."], ["1941-03-30T00:00:00", "WWII: - All German, Italian and Danish ships anchored in United States waters are taken into \"protective custody\"."], ["1941-03-30T00:00:00", "WWII: - A German Lorenz cipher machine operator sends a 4,000-character message twice, allowing British mathematician Bill Tutte to decipher the machine's coding mechanism."], ["1941-04-04T00:00:00", "WWII: Axis forces capture Benghazi."], ["1941-04-06T00:00:00", "WWII: Germany invades Yugoslavia and Greece."], ["1941-04-09T00:00:00", "The U.S. acquires full military defense rights in Greenland."], ["1941-04-10T00:00:00", "WWII: - The U.S. destroyer USS Niblack, while picking up survivors from a sunken Dutch freighter, drops depth charges on a German U-boat (the first \"shot in anger\" fired by America against Germany)."], ["1941-04-10T00:00:00", "WWII: - The Independent State of Croatia, a puppet state of the Axis powers, is established with Ustaše leader Ante Pavelić as head (Poglavnik) of the government."], ["1941-04-12T00:00:00", "WWII: German troops enter Belgrade."], ["1941-04-13T00:00:00", "The Soviet Union and Japan sign a neutrality pact."], ["1941-04-15T00:00:00", "WWII: Axis forces reach Halfaya Pass on the Libyan-Egyptian frontier."], ["1941-04-17T00:00:00", "WWII: The Yugoslav Royal Army capitulates."], ["1941-04-18T00:00:00", "WWII: Prime Minister of Greece Alexandros Koryzis commits suicide as German troops approach Athens."], ["1941-04-19T00:00:00", "Bertolt Brecht's anti-war play Mother Courage and Her Children (German: Mutter Courage und ihre Kinder) receives its first theatrical production at the Schauspielhaus Zürich."], ["1941-04-21T00:00:00", "WWII: Greece capitulates. Commonwealth troops and some elements of the Greek Army withdraw to Crete."], ["1941-04-23T00:00:00", "The America First Committee holds its first mass rally in New York City, with Charles Lindbergh as keynote speaker."], ["1941-04-25T00:00:00", "Franklin D. Roosevelt, at his regular press conference, criticizes Charles Lindbergh by comparing him to the Copperheads of the Civil War period. In response, Lindbergh resigns his commission in the U.S. Army Air Corps Reserve on April 28."], ["1941-04-27T00:00:00", "WWII: German troops enter Athens."], ["1941-05-01T00:00:00", "The breakfast cereal Cheerios is introduced as CheeriOats by General Mills."], ["1941-05-01T00:00:00", "Orson Welles' film Citizen Kane premieres in New York City."], ["1941-05-01T00:00:00", "The first Defense Bonds and Defense Savings Stamps go on sale in the United States, to help fund the greatly increased production of military equipment."], ["1941-05-02T00:00:00", "Anglo-Iraqi War: British combat operations against the rebel government of Rashid Ali in the Kingdom of Iraq begin."], ["1941-05-05T00:00:00", "WWII: Emperor Haile Selassie enters Addis Ababa, which has been liberated from Italian forces; this date is subsequently commemorated as Liberation Day in Ethiopia."], ["1941-05-06T00:00:00", "At California's March Field, entertainer Bob Hope performs his first USO Show."], ["1941-05-08T00:00:00", "WWII: The German auxiliary cruiser Pinguin is sunk by HMS Cornwall (56) in the Indian Ocean."], ["1941-05-09T00:00:00", "WWII: The German submarine U-110 is captured by the British Royal Navy. On board is the latest Enigma cryptography machine, which Allied cryptographers later use to break coded German messages."], ["1941-05-10T00:00:00", "WWII: The British House of Commons is damaged by the Luftwaffe in an air raid."], ["1941-05-10T00:00:00", "Rudolf Hess parachutes into Scotland, claiming to be on a peace mission."], ["1941-05-12T00:00:00", "Konrad Zuse presents the Z3, the world's first working programmable, fully automatic computer, in Berlin."], ["1941-05-15T00:00:00", "The first British jet aircraft, the Gloster E.28/39, is flown."], ["1941-05-15T00:00:00", "Joe DiMaggio's 56-game hitting streak begins as the New York Yankees' center fielder goes one for four against Chicago White Sox Pitcher Eddie Smith."], ["1941-05-19T00:00:00", "The Viet Minh is formed in at Pác Bó in Vietnam to overthrow French rule of the nation as an alliance between the Indochina Communist party, led by Ho Chi Minh, and the Nationalist party. It will become the Viet Cong during the Vietnam War."], ["1941-05-20T00:00:00", "WWII: The Battle of Crete begins as Germany launches an airborne invasion of Crete."], ["1941-05-21T00:00:00", "German submarine U-69 (1940) sinks the U.S.-flagged SS Robin Moor off the west African coast, having allowed the passengers and crew to disembark."], ["1941-05-24T00:00:00", "WWII: In the North Atlantic, German battleship Bismarck sinks battlecruiser HMS Hood, killing all but 3 crewmen from a total of 1,418 aboard the pride of the Royal Navy."], ["1941-05-24T00:00:00", "The British submarine HMS Upholder torpedoes and sinks the Italian ocean liner SS Conte Rosso."], ["1941-05-26T00:00:00", "WWII: In the North Atlantic, Fairey Swordfish aircraft from the carrier HMS Ark Royal cripple the steering of German battleship Bismarck in an aerial torpedo attack."], ["1941-05-27T00:00:00", "WWII: Franklin D. Roosevelt, President of the United States, proclaims an \"unlimited national emergency.\""], ["1941-05-27T00:00:00", "WWII: German battleship Bismarck is sunk in the North Atlantic, killing 2,300. It is eventually found in 1989."], ["1941-05-27T00:00:00", "The Swiss Socialist Federation is banned."], ["1941-05-30T00:00:00", "WWII: Manolis Glezos and Apostolos Santas tear down the Nazi swastika on the Acropolis in Athens, and replace it with the Greek flag."], ["1941-05-31T00:00:00", "Anglo-Iraqi War: British troops complete the re-occupation of the Kingdom of Iraq, returning Prince 'Abd al-Ilah to power as regent for Faisal II."], ["1941-06-05T00:00:00", "Four thousand Chongqing residents are asphyxiated in a bomb shelter during the Bombing of Chongqing."], ["1941-06-05T00:00:00", "A Serbian ammunition depot explodes at Smederevo on the outskirts of Belgrade, Serbia, killing 2,500, and injuring over 4,500."], ["1941-06-08T00:00:00", "WWII: British and Free French forces invade Syria."], ["1941-06-13T00:00:00", "TASS, the official Soviet news agency, denies reports of tension between Germany and the Soviet Union."], ["1941-06-14T00:00:00", "Soviet officials deport about 65,000 people from Estonia, Latvia and Lithuania to Siberia."], ["1941-06-14T00:00:00", "All German and Italian assets in the United States are frozen."], ["1941-06-16T00:00:00", "All German and Italian consulates in the United States are ordered closed and their staffs to leave the country by July 10."], ["1941-06-16T00:00:00", "WWII: British Fleet Air Arm aircraft sink the Vichy French ship Chevalier Paul."], ["1941-06-20T00:00:00", "United States Army Air Corps becomes the Army Air Forces."], ["1941-06-20T00:00:00", "Walt Disney's live-action animated feature, The Reluctant Dragon, is released."], ["1941-06-22T00:00:00", "WWII and Operation Barbarossa: Germany invades the Soviet Union."], ["1941-06-22T00:00:00", "WWII: Winston Churchill promises all possible British assistance to the Soviet Union in a worldwide broadcast: \"Any man or state who fights against Nazidom will have our aid. Any man or state who marches with Hitler is our foe.\""], ["1941-06-22T00:00:00", "WWII: Italy and Romania declare war on the Soviet Union."], ["1941-06-22T00:00:00", "WWII: The First Sisak Partisan Brigade, the first anti-fascist armed unit in occupied Europe, is founded by Yugoslav partisans near Sisak, Croatia."], ["1941-06-22T00:00:00", "WWII: June Uprising in Lithuania and establishment of a Provisional Government of Lithuania begun by the Lithuanian Activist Front in an attempt to liberate Lithuania from Soviet occupation."], ["1941-06-23T00:00:00", "WWII: Hungary and Slovakia declare war on the Soviet Union."], ["1941-06-24T00:00:00", "The Soviet Information Bureau, predecessor of RIA Novosti, is founded."], ["1941-06-25T00:00:00", "WWII: Finland as a co-belligerent with Germany attacks the Soviet Union to start the Continuation War."], ["1941-06-28T00:00:00", "WWII: Albania declares war on the Soviet Union."], ["1941-06-29T00:00:00", "WWII: Hitler's second-in-command Reichsmarshall Hermann Göring is appointed as Hitler's successor in a written decree. The decree will come into effect should Hitler die in the middle of the war. (The decree becomes void in April 1945 after Göring tries to assume power while Hitler is still alive, leading to Göring's expulsion from the Nazi Party.)"], ["1941-07-01T00:00:00", "Commercial TV authorized by the FCC."], ["1941-07-01T00:00:00", "NBC television begins commercial operation on WNBT on channel 1. The world's first legal TV commercial, for Bulova watches, occurs at 2:29 PM over WNBT before a baseball game between the Brooklyn Dodgers and Philadelphia Phillies. The 10-second spot displayed a picture of a clock superimposed on a map of the United States, accompanied by the voice-over \"America runs on Bulova time.\"  As a one-off special, the first quiz show called \"Uncle Bee\" was telecast on WNBT's inaugural broadcast day, followed later the same day by Ralph Edwards hosting the second game show broadcast on United States television, Truth or Consequences, as simulcast on radio and TV and sponsored by Ivory soap. Weekly broadcasts of the show commenced in 1956, with Bob Barker."], ["1941-07-01T00:00:00", "CBS television begins commercial operation on New York station WCBW (now WCBS-TV) on channel 2."], ["1941-07-02T00:00:00", "WWII: Empire of Japan calls up 1 million men for military service."], ["1941-07-03T00:00:00", "WWII: Joseph Stalin, in his first address since the German invasion, calls upon the Soviet people to carry out a \"scorched earth\" policy of resistance to the bitter end."], ["1941-07-04T00:00:00", "The Holocaust: The Massacre of Polish scientists and writers is committed by Nazi German troops in the occupied Polish city of Lwów."], ["1941-07-05T00:00:00", "WWII: - Operation Barbarossa: German troops reach the Dnieper River."], ["1941-07-05T00:00:00", "WWII: - British troopship SS Anselm is torpedoed and sunk by German submarine U-96 in the Atlantic Ocean with the loss of around 250 out of about 1310 on board."], ["1941-07-07T00:00:00", "WWII: American forces take over the defense of Iceland from the British."], ["1941-07-10T00:00:00", "The Holocaust: Jedwabne pogrom: Local ethnic Poles massacre at least 340 Jewish residents of Jedwabne in occupied Poland."], ["1941-07-13T00:00:00", "WWII: Montenegro starts the second popular uprising in Europe against the Axis powers (the first being the \"February strike\" of February 25 (above) in the Netherlands)."], ["1941-07-14T00:00:00", "WWII: Vichy France signs armistice terms ending all fighting in Syria and Lebanon."], ["1941-07-17T00:00:00", "Joe DiMaggio's 56 game hitting streak ends."], ["1941-07-19T00:00:00", "WWII: A BBC broadcast by \"Colonel Britton\" calls on the people of occupied Europe to resist the Nazis under the slogan \"V for Victory\"."], ["1941-07-19T00:00:00", "The first episode The Midnight Snack in which Tom and Jerry are officially named, more than a year after their first production Puss Gets the Boot"], ["1941-07-23T00:00:00", "WWII: Italian aircraft damage the British destroyer HMS Fearless which has to be sunk."], ["1941-07-25T00:00:00", "Introduction of Postal codes in Germany"], ["1941-07-26T00:00:00", "WWII: - In response to the Japanese occupation of French Indochina, U.S. President Franklin D. Roosevelt orders the seizure of all Japanese assets in the United States."], ["1941-07-26T00:00:00", "WWII: - General Douglas MacArthur is named commander of all U.S. forces in the Philippines; the Philippines Army is ordered nationalized by President Roosevelt."], ["1941-07-29T00:00:00", "The Vichy Regime signs the Protocol Concerning Joint Defense and Joint Military Cooperation with the Empire of Japan, giving the Japanese a total of eight airfields, allowing them greater troop presence and the use of the Indochinese financial system in return for continued French autonomy."], ["1941-07-30T00:00:00", "WWII: The Holocaust: The Ustaše massacred 700-1,200 Serbs inside a Serbian Orthodox church in Glina, Croatia."], ["1941-07-31T00:00:00", "WWII: The Holocaust: Under instructions from Adolf Hitler, Nazi official Hermann Göring orders S.S. General Reinhard Heydrich to \"submit to me as soon as possible a general plan of the administrative material and financial measures necessary for carrying out the desired Final Solution of the Jewish question.\""], ["1941-08-01T00:00:00", "First production Willys MB U.S. Army Jeep."], ["1941-08-05T00:00:00", "Provisional Government of Lithuania dissolved."], ["1941-08-06T00:00:00", "Six-year-old Elaine Esposito goes to have an appendix operation in Florida and lapses into a coma, dying 37 years later, still comatose."], ["1941-08-07T00:00:00", "WWII: British submarine HMS Severn sinks an Italian Marconi-class submarine.The famous Bangali poet -Rabindranath Tagore died."], ["1941-08-09T00:00:00", "Franklin D. Roosevelt and Winston Churchill meet onboard ship at Naval Station Argentia, Newfoundland. The Atlantic Charter (released August 14), setting goals for postwar international cooperation, is created as a result."], ["1941-08-16T00:00:00", "HMS Mercury Royal Navy Signals School and Combined Signals School opens at Leydene, near Petersfield, Hampshire, England."], ["1941-08-18T00:00:00", "Adolf Hitler orders a temporary halt to Nazi Germany's systematic euthanasia of the mentally ill and handicapped due to protests. However, graduates of the T-4 Euthanasia Program are then transferred to concentration camps, where they continue in their trade."], ["1941-08-22T00:00:00", "WWII: France: The German Occupation Authority announces that anyone working for or aiding the Free French will be sentenced to death."], ["1941-08-24T00:00:00", "WWII: A Luftwaffe bomb hits an Estonian steamer with 3,500 Soviet-mobilized Estonian men on board, killing 598 of them."], ["1941-08-25T00:00:00", "WWII: The Anglo-Soviet invasion of Iran begins."], ["1941-08-27T00:00:00", "WWII: Pierre Laval is shot in an assassination attempt at Versailles, France."], ["1941-08-28T00:00:00", "WWII: German troops capture Tallinn, Estonia from the Soviet Union, while attacks on the evacuating Soviet ships leave more than 12,000 dead in one of the bloodiest naval battles of World War II. German forces will capture the entire Estonian territory by 6 December."], ["1941-08-28T00:00:00", "WWII: The Soviet Union announces blowing up of the massive Dnieper Hydroelectric Station and dam at Zaporizhia to prevent its capture by the Germans."], ["1941-08-31T00:00:00", "The Great Gildersleeve debuts on NBC Radio in the United States."], ["1941-09-03T00:00:00", "The Holocaust: SS-Hauptsturmführer Karl Fritzsch first uses the pesticide Zyklon B to execute Soviet prisoners of war en masse at Auschwitz concentration camp; eventually it will be used to kill about 1.2 million people."], ["1941-09-06T00:00:00", "The Holocaust: The requirement to wear the Star of David with the word \"Jew\" inscribed, is extended to all Jews over the age of 6 in German-occupied areas."], ["1941-09-08T00:00:00", "WWII: The Siege of Leningrad begins: German forces begin a siege against the Soviet Union's second-largest city, Leningrad. Stalin orders the Volga Germans deported to Siberia."], ["1941-09-11T00:00:00", "WWII: Charles Lindbergh, at an America First Committee rally in Des Moines, Iowa, accuses \"the British, the Jewish, and the Roosevelt administration\" of leading the United States toward war. Widespread condemnation of Lindbergh follows."], ["1941-09-12T00:00:00", "WWII: The first snowfall is reported on the Russian front."], ["1941-09-14T00:00:00", "The State of Vermont \"declares war\" on Germany, by defining the United States to be in \"armed conflict\" in order to extend a wartime bonus to Vermonters in the service."], ["1941-09-15T00:00:00", "The Estonian Self-Administration, headed by Hjalmar Mäe, is appointed by the German military administration."], ["1941-09-16T00:00:00", "Rezā Shāh of Iran is forced to resign in favor of his son Mohammad Reza Pahlavi, under pressure from the United Kingdom and the Soviet Union."], ["1941-09-27T00:00:00", "The first liberty ship, the SS Patrick Henry, is launched at Baltimore."], ["1941-09-28T00:00:00", "WWII: The Drama Uprising against the Bulgarian occupation in northern Greece begins."], ["1941-09-29T00:00:00", "WWII: The Moscow Conference begins; U.S. representative Averell Harriman and British representative Lord Beaverbrook meet with Soviet foreign minister Molotov to arrange urgent assistance for Russia."], ["1941-10-01T00:00:00", "The Holocaust: The Nazi German Majdanek concentration camp (Konzentrationslager Lublin) opens in occupied Poland on the outskirts of the town Lublin. Between October 1941 and July 1944 at least 200,000 people will be killed in the camp."], ["1941-10-01T00:00:00", "New Zealand Division of the Royal Navy becomes the Royal New Zealand Navy"], ["1941-10-02T00:00:00", "WWII: Operation Typhoon begins as Germany launches an all-out offensive against Moscow."], ["1941-10-07T00:00:00", "John Curtin becomes the 14th Prime Minister of Australia."], ["1941-10-08T00:00:00", "WWII: In their invasion of the Soviet Union, Germany reaches the Sea of Azov with the capture of Mariupol."], ["1941-10-11T00:00:00", "October 12 - Fire destroys a Firestone Tire & Rubber Co. plant in Fall River, Massachusetts, consuming 15,850 tons of rubber and causing a setback to the United States war effort."], ["1941-10-13T00:00:00", "The Holocaust: Heinrich Himmler instructs SS and Police Leader Odilo Globocnik to begin construction of Bełżec; the first of the Operation Reinhard extermination camps."], ["1941-10-15T00:00:00", "British submarine HMS Torbay bombards the port of Apollonia, Cyrenaica in Italian Libya."], ["1941-10-16T00:00:00", "WWII: The Soviet government moves to Kuibyshev (modern Samara), but Stalin remains in Moscow."], ["1941-10-17T00:00:00", "WWII: The destroyer USS Kearny is torpedoed and damaged near Iceland, killing 11 sailors (the first American military casualties of the war)."], ["1941-10-18T00:00:00", "General Hideki Tōjō becomes the 40th Prime Minister of Japan."], ["1941-10-23T00:00:00", "Walt Disney's fourth animated film Dumbo is released."], ["1941-10-24T00:00:00", "Franz von Werra disappears during a flight over the North Sea."], ["1941-10-30T00:00:00", "WWII: Franklin D. Roosevelt, President of the United States, approves US$1 billion in Lend-Lease aid to the Soviet Union."], ["1941-10-31T00:00:00", "WWII: The destroyer USS Reuben James is torpedoed by a German U-boat near Iceland, killing more than 100 United States Navy sailors."], ["1941-10-31T00:00:00", "Last day of carving on Mount Rushmore in South Dakota."], ["1941-11-06T00:00:00", "WWII: Soviet leader Joseph Stalin addresses the Soviet Union for only the second time during his three-decade rule (the first time was earlier this year on July 2). He states that 350,000 Soviet troops have been killed in German attacks but that the Germans have lost 4.5 million soldiers (a gross exaggeration) and that Soviet victory is near."], ["1941-11-07T00:00:00", "WWII: The Soviet hospital ship Armenia is sunk by German aircraft while evacuating refugees, wounded military and the staff of several Crimean hospitals. It is estimated that more than 5,000 died in the sinking."], ["1941-11-10T00:00:00", "In a speech at the Mansion House, London, Winston Churchill promises \"should the United States become involved in war with Japan, the British declaration will follow within the hour\"."], ["1941-11-12T00:00:00", "WWII: - As the Battle of Moscow begins, temperatures around Moscow drop to -12 °C, and the Soviet Union launches ski troops for the first time against the freezing German forces near the city."], ["1941-11-12T00:00:00", "WWII: - The Soviet cruiser Chervona Ukraina is hit three times in the Severnaya Bay by bombs from German Junkers Ju 87 Stuka dive bombers from II./StG 77 during the Siege of Sevastopol."], ["1941-11-14T00:00:00", "WWII: - The British aircraft carrier HMS Ark Royal sinks under tow off Gibraltar after being torpedoed the previous day by German submarine U-81."], ["1941-11-14T00:00:00", "WWII: - The Holocaust: In Slonim (Byelorussian SSR), German forces engaged in Operation Barbarossa murder 9000 Jews this day."], ["1941-11-17T00:00:00", "WWII: Joseph Grew, the United States ambassador to Japan, cables to Washington, D.C., a warning that Japan may strike suddenly and unexpectedly."], ["1941-11-18T00:00:00", "WWII: Operation Crusader, a British Eighth Army operation to relieve the Siege of Tobruk in North Africa, begins."], ["1941-11-19T00:00:00", "WWII: Both commerce raiding German auxiliary cruiser Kormoran and Australian cruiser HMAS Sydney sink following a battle off the coast of Western Australia. There are no survivors from the 645 Australian sailors aboard Sydney."], ["1941-11-21T00:00:00", "The radio program King Biscuit Time is broadcast for the first time (it later becomes the longest running daily radio broadcast in history and the most famous live blues radio program)."], ["1941-11-22T00:00:00", "WWII: HMS Devonshire sinks commerce raiding German auxiliary cruiser Atlantis, ending the longest warship cruise of the war (622 days without in-port replenishment or repair)."], ["1941-11-26T00:00:00", "WWII: - The Hull note (Outline of Proposed Basis for Agreement Between the United States and Japan), named for Secretary of State Cordell Hull, is delivered to the Empire of Japan by the United States."], ["1941-11-26T00:00:00", "WWII: - A fleet of 6 aircraft carriers commanded by Japanese Vice Admiral Chūichi Nagumo leaves Hitokapu Bay for Pearl Harbor under strict radio silence."], ["1941-11-27T00:00:00", "WWII: Germans reach their closest approach to Moscow. They are subsequently frozen by cold weather and attacks by the Soviets."], ["1941-11-27T00:00:00", "A group of young men stop traffic on U.S. Highway 99 south of Yreka, California, handing out fliers proclaiming the establishment of the State of Jefferson."], ["1941-12-01T00:00:00", "WWII: - Fiorello La Guardia, Mayor of New York City and Director of the Office of Civilian Defense, signs Administrative Order 9, creating the Civil Air Patrol under the authority of the United States Army Air Forces."], ["1941-12-01T00:00:00", "WWII: - A state of emergency is declared in British Malaya and the Straits Settlements."], ["1941-12-02T00:00:00", "WWII: The code message \"Climb Mount Niitaka\" is transmitted to the Japanese task force, indicating that negotiations have broken down and that the attack on Pearl Harbor is to be carried out according to plan."], ["1941-12-04T00:00:00", "The State of Jefferson is declared in Yreka, California, with a judge, John Childs, as governor."], ["1941-12-06T00:00:00", "WWII: - Soviet counterattacks begin against German troops encircling Moscow. The Wehrmacht is subsequently pushed back over 200 miles."], ["1941-12-06T00:00:00", "WWII: - The United Kingdom declares war on Finland and Romania."], ["1941-12-06T00:00:00", "WWII: British submarine HMS Perseus is sunk by a mine off Cephalonia."], ["1941-12-08T00:00:00", "WWII: The Battle of Hong Kong begins shortly after 8:00 a.m. (local time), less than eight hours after the attack on Pearl Harbor, when Japanese forces invade Hong Kong, which is defended by British, Canadian and local troops. The United Kingdom officially declares war on the Empire of Japan."], ["1941-12-08T00:00:00", "WWII: Japanese Invasion of Shanghai International Settlement, Began to occupy the British and the American sectors after the attack on Pearl Harbor."], ["1941-12-08T00:00:00", "WWII: The Japanese occupation of the Philippines begins ten hours after the attack on Pearl Harbor when Japanese forces invade Luzon and destroy U.S. aircraft on Clark Field."], ["1941-12-08T00:00:00", "WWII: President of the United States Franklin D. Roosevelt delivers his \"Infamy Speech\" to a Joint session of the United States Congress at 12:30 p.m. EST (17.30 GMT). Transmitted live over all four major national networks it attracts the largest audience ever for an American radio broadcast, over 81% of homes. Within an hour, Congress agrees to the President's request for a United States declaration of war upon Japan and he signs it at 4:10 p.m."], ["1941-12-08T00:00:00", "WWII: Australia, New Zealand, The Netherlands, the Free French, Yugoslavia, Costa Rica, Cuba, El Salvador Guatemala and Honduras also officially declare war on Japan, and the Republic of China declares war on the Axis powers."], ["1941-12-08T00:00:00", "WWII: Japanese also attack British Malaya and Thailand."], ["1941-12-08T00:00:00", "WWII: The German advance on Moscow (Operation Typhoon) is suspended for the winter."], ["1941-12-08T00:00:00", "The Holocaust: the Nazi German Chełmno extermination camp opens in occupied Poland near the village of Chełmno nad Nerem. Between December 1941-April 1943 and June 1944-January 1945 at least 153,000 people will be killed in the camp."], ["1941-12-10T00:00:00", "WWII: - The British battleship HMS Prince of Wales and battlecruiser HMS Repulse are sunk by Japanese aircraft in the South China Sea north of Singapore."], ["1941-12-10T00:00:00", "WWII: - The Provisional Government of the Republic of Korea officially declare war on Japan."], ["1941-12-11T00:00:00", "WWII: - Germany and Italy declare war on the United States. The U.S. responds in kind."], ["1941-12-11T00:00:00", "WWII: - Mildred Gillars (\"Axis Sally\") delivers her first propaganda broadcast to Allied troops."], ["1941-12-12T00:00:00", "WWII: - Hungary and Romania declare war on the United States."], ["1941-12-12T00:00:00", "WWII: - British India declares war on the Empire of Japan."], ["1941-12-12T00:00:00", "WWII: - The United States seizes the French ship SS Normandie."], ["1941-12-12T00:00:00", "WWII: - The Kimura Detachment of the Japanese Imperial forces is occupied in Legaspi, Albay, Philippines."], ["1941-12-13T00:00:00", "Sweden's low temperature record of -53 °C is set in a village within the Vilhelmina Municipality."], ["1941-12-14T00:00:00", "WWII: The Independent State of Croatia declares war on the United States and the United Kingdom."], ["1941-12-19T00:00:00", "WWII: - Hitler becomes Supreme Commander-in-Chief of the German Army."], ["1941-12-19T00:00:00", "WWII: - Twelve days after the Japanese raid on Pearl Harbor, the United States Naval Academy in Annapolis, Maryland graduates its \"Class of 1942\" a semester early so as to induct the graduating students without delay into the U.S. Navy and/or Marine Corps as officers, for immediate stationing in the war."], ["1941-12-21T00:00:00", "Thailand and Japan sign a military alliance."], ["1941-12-21T00:00:00", "The Holocaust: Stanisławów Ghetto established."], ["1941-12-22T00:00:00", "WWII: Arcadia Conference opens in Washington, D.C., the first meeting on military strategy between the heads of government of the United Kingdom and the United States following the latter's entry into the war."], ["1941-12-23T00:00:00", "WWII: A second Japanese landing attempt on Wake Island is successful, and the American garrison surrenders after a full night and morning of fighting."], ["1941-12-24T00:00:00", "WWII: - British forces capture Benghazi."], ["1941-12-24T00:00:00", "WWII: - Dutch submarine HNLMS K XVI is the first Allied ship to sink a Japanese warship, sinking the destroyer Sagiri near Sarawak; K XVI is herself torpedoed the following day by Japanese submarine I 66."], ["1941-12-25T00:00:00", "WWII: - The Battle of Hong Kong ends after 17 days with surrender of the British Crown colony to the Japanese."], ["1941-12-25T00:00:00", "WWII: - Admiral Émile Muselier seizes the archipelago of Saint Pierre and Miquelon, the first part of France to be liberated by the Free French Forces."], ["1941-12-26T00:00:00", "WWII: Winston Churchill becomes the first British Prime Minister to address a joint session of the United States Congress."], ["1941-12-27T00:00:00", "WWII: British Commandos raid the Norwegian port of Vaagso, causing Hitler to reinforce the garrison and defenses, drawing vital troops away from other areas."]]