[["1938-01-01T00:00:00", "The California Golden Bears defeat the Alabama Crimson Tide in the 1938 Rose Bowl. Final score 13-0."], ["1938-01-01T00:00:00", "The Company 1938 OEM Industrial Groups was officially registered."], ["1938-01-01T00:00:00", "The new Constitution of Estonia enters into force, ending the Era of Silence and the authoritarian regime."], ["1938-01-01T00:00:00", "Sir Alexander Cadogan succeeds Sir Robert Vansittart as permanent under-secretary at the British Foreign Office; Vansittart is \"kicked upstairs\" by being given the new and unimportant office of Chief Diplomatic Advisor to the Government."], ["1938-01-01T00:00:00", "The Merrie Melodies cartoon short Daffy Duck & Egghead is released, being the first cartoon to give Daffy Duck his current name, as well as his second appearance."], ["1938-01-27T00:00:00", "The Niagara Bridge at Niagara Falls, New York collapses due to an ice jam."], ["1938-01-27T00:00:00", "German War Minister Field Marshal Werner von Blomberg resigns, following the revelation that his new wife had previously posed for pornographic photos."], ["1938-02-04T00:00:00", "Adolf Hitler abolishes the War Ministry and creates the Oberkommando der Wehrmacht (High Command of the Armed Forces), giving him direct control of the German military. In addition, Hitler sacks political and military leaders considered unsympathetic to his philosophy or policies. General Werner von Fritsch is forced to resign as Commander of Chief of the German Army following accusations of homosexuality, and replaced by General Walther von Brauchitsch. Foreign Minister Baron Konstantin von Neurath is sacked and replaced by Joachim von Ribbentrop."], ["1938-02-04T00:00:00", "Walt Disney's Snow White and the Seven Dwarfs, the first cel-animated feature in motion picture history, is released in the United States following a premiere the previous year."], ["1938-03-03T00:00:00", "The Santa Ana River in California spills over its banks during a rainy winter, killing 58 people in Orange County and causing trouble as far inland as Palm Springs."], ["1938-03-03T00:00:00", "Oil is discovered in Saudi Arabia."], ["1938-03-03T00:00:00", "Sir Nevile Henderson, British Ambassador to Germany, presents a proposal to Hitler for an international consortium to rule much of Africa (in which Germany would be assigned a leading role) in exchange for a German promise never to resort to war to change her frontiers; Hitler rejects the British offer."], ["1938-03-18T00:00:00", "Mexico nationalizes all foreign-owned oil properties within its borders."], ["1938-03-18T00:00:00", "General Werner von Fritsch is acquitted of charges of homosexuality at his court-martial."], ["1938-03-27T00:00:00", "Italian mathematician Ettore Majorana disappears suddenly under mysterious circumstances while going by ship from Palermo to Naples."], ["1938-04-10T00:00:00", "Édouard Daladier becomes prime minister of France. He appoints as Foreign Minister a leading advocate of the policy of appeasement, Georges Bonnet, effectively negating Blum's reassurances of March 14."], ["1938-04-10T00:00:00", "In a result that astonished even Hitler, the Austrian electorate in a national referendum approved Anschluss by an overwhelming 99.73%."], ["1938-05-05T00:00:00", "The Vatican recognizes Francisco Franco's government in Spain."], ["1938-05-05T00:00:00", "General Ludwig Beck, Chief of the German Army's General Staff, submits a memorandum to Hitler opposing Fall Grün (Case Green), the plan for a war with Czechoslovakia, under the grounds that Germany is ill-prepared for the world war likely to result from such an attack."], ["1938-05-25T00:00:00", "Spanish Civil War: Alicante is bombed by fascist rebels, resulting in 313 deaths."], ["1938-05-25T00:00:00", "The Soviet ambassador to the United States, A.A. Troyanovsky, declares Moscow ready to defend Czechoslovakia."], ["1938-06-23T00:00:00", "The Civil Aeronautics Act is signed into law, forming the Civil Aeronautics Authority in the United States."], ["1938-06-23T00:00:00", "Marineland opens near St. Augustine, Florida."], ["1938-07-03T00:00:00", "The steam locomotive Mallard sets the world speed record for steam by reaching 125.88 mph."], ["1938-07-03T00:00:00", "The last reunion of the Blue and Gray commemorates the 75th anniversary of the Battle of Gettysburg in Gettysburg, Pennsylvania."], ["1938-07-28T00:00:00", "A revolt against the Ioannis Metaxas dictatorship is put down in Chania, Greece."], ["1938-07-28T00:00:00", "Hawaii Clipper disappears with six passengers and nine crew en route from Guam to Manila."], ["1938-08-18T00:00:00", "The Thousand Islands Bridge, connecting the United States with Canada, is dedicated by U.S. President Franklin D. Roosevelt."], ["1938-08-18T00:00:00", "Colonel General Ludwig Beck, convinced that Hitler's decision to attack Czechoslovakia will lead to a general European war, resigns his position as Chief of the Army General Staff in protest."], ["1938-08-18T00:00:00", "Ewald von Kleist-Schmenzin arrives in London looking for British support for an anti-Nazi putsch, using the looming crisis over the Sudetenland as a pretext. His private mission is dismissed by Neville Chamberlain as unimportant (Chamberlain refers to von Kleist as a \"Jacobite\"), but he finds a sympathetic if powerless audience in Winston Churchill."], ["1938-09-18T00:00:00", "During a meeting between Neville Chamberlain and the recently elected Premier of France, Édouard Daladier, and Daladier's Foreign Minister, Georges Bonnet, it becomes apparent neither the English nor the French governments are prepared to go to war over the Sudetenland. The Soviet Union declares it will come to the defence of Czechoslovakia only if France honours her commitment to defend Czech independence."], ["1938-09-18T00:00:00", "Mussolini makes a speech in Trieste, Italy where he indicates that Italy is supporting Germany in the Sudeten crisis."], ["1938-09-21T00:00:00", "In the early hours of the day, representatives of the French and British governments call on Czechoslovak President Edvard Beneš to tell him France and Britain will not fight Hitler if he decides to annex the Sudetenland by force. Late in the afternoon the Czechoslovak government capitulates to the French and British demands."], ["1938-09-21T00:00:00", "Winston Churchill warns of grave consequences to European security if Czechoslovakia is partitioned. The same day, Soviet Foreign Commissar Maxim Litvinov makes a similar statement in the League of Nations."], ["1938-09-21T00:00:00", "The 1938 New England hurricane strikes Long Island and southern New England, killing over 300 along the Rhode Island shoreline and 600 altogether."], ["1938-09-21T00:00:00", "Following the capitulation of the Czech government to Germany's demands both Poland and Hungary demand slices of Czech territory where their nationals reside."], ["1938-09-22T00:00:00", "Unable to survive the previous day's capitulation to the demands of the English and French governments, Czechoslovak premier Milan Hodža resigns. General Jan Syrový takes his place."], ["1938-09-22T00:00:00", "Neville Chamberlain arrives in the city of Bad Godesberg for another round of talks with Hitler over the Sudetenland crisis. Hitler raises his demands to include occupation of all German Sudeten territories by October 1. That night after a telephone conference, Chamberlain reverses himself and advises the Czechoslovaks to mobilize."], ["1938-09-22T00:00:00", "Olsen and Johnson's musical comedy revue Hellzapoppin begins its 3-year run on Broadway."], ["1938-09-23T00:00:00", "The Czechoslovak army mobilizes."], ["1938-09-23T00:00:00", "As the Polish army masses along the Czech border the Soviet Union warns Poland if it crosses the Czech frontier Russia will regard the 1932 non-aggression pact between the two countries void."], ["1938-09-24T00:00:00", "Sir Eric Phipps, British Ambassador to France, reports to London, \"all that is best in France is against war, almost at any price\", being opposed only by a \"small, but noisy and corrupt, war group\". Phipps's report creates major doubts about the ability and/or willingness of France to go to war."], ["1938-09-24T00:00:00", "At 1:30 AM, Adolf Hitler and Neville Chamberlain conclude their talks on the Sudetenland. Chamberlain agrees to take Hitler's demands, codified in the Godesberg Memorandum, personally to the Czech Government. The Czech Government rejects the demands, as does Chamberlain's own cabinet. The French Government also initially rejects the terms and orders a partial mobilization of the French army."], ["1938-09-29T00:00:00", "Colonel Graham Christie, former British military attaché in Berlin, is told by Carl Friedrich Goerdeler that the mobilization of the Royal Navy has badly damaged the popularity of the Nazi regime, as the German public realizes that Fall Grün is likely to cause a world war."], ["1938-09-29T00:00:00", "Munich Agreement: German, Italian, British and French leaders agree to German demands regarding annexation of the Sudetenland in Czechoslovakia. The Czechoslovak government is largely excluded from the negotiations and is not a signatory to the agreement."], ["1938-09-29T00:00:00", "The Republic of Hatay is declared in Syria"], ["1938-10-02T00:00:00", "Tiberias massacre: Arab raiders murder 19 Jewish immigrants."], ["1938-10-02T00:00:00", "Disgusted with Neville Chamberlain's conduct at Munich, Duff Cooper resigns his post as First Lord of the Admiralty. With his resignation, formal debate begins in the Parliament of the United Kingdom on the Munich Agreement, but with Chamberlain at the peak of his popularity, there can be little doubt His Majesty's Government will receive a vote of confidence."], ["1938-10-05T00:00:00", "Edvard Beneš, president of Czechoslovakia, resigns."], ["1938-10-05T00:00:00", "In Nazi Germany, Jews' passports were invalidated, and those who needed a passport for emigration purposes were given one marked with the letter J (\"Jude\" – \"Jew\")."], ["1938-10-24T00:00:00", "The minimum wage is established by law in the United States."], ["1938-10-24T00:00:00", "French Foreign Minister Georges Bonnet carries out a major purge of the Qui d'Orsay, sacking or exiling a number of anti-appeasement officials such as Pierre Comert and René Massigli."], ["1938-10-24T00:00:00", "At a \"friendly luncheon\" in Berchtesgaden, German foreign minister Joachim von Ribbentrop tells Józef Lipski, the Polish ambassador to Germany, that the Free City of Danzig must return to Germany, that the Germans must be given extraterritorial rights in the Polish Corridor, and that Poland must sign the Anti-Comintern Pact."], ["1938-10-27T00:00:00", "DuPont announces a name for its new synthetic yarn: \"nylon\"."], ["1938-10-27T00:00:00", "Jews with Polish citizenship are evicted from Nazi Germany."], ["1938-11-10T00:00:00", "On the eve of Armistice Day, Kate Smith sings Irving Berlin's God Bless America for the first time on her weekly radio show."], ["1938-11-10T00:00:00", "İsmet İnönü becomes the second president of Turkey."], ["1938-11-16T00:00:00", "The first reported \"attack\" of the Halifax Slasher mass hysteria incident."], ["1938-11-16T00:00:00", "Britain formally recognised Italy's control of Ethiopia. In return Mussolini agreed to withdraw 10,000 troops from Spain."], ["1938-11-30T00:00:00", "The Czechoslovak parliament elects Emil Hácha as the new president of Czechoslovakia."], ["1938-11-30T00:00:00", "Benito Mussolini and his Foreign Minister Count Galeazzo Ciano order \"spontaneous\" demonstrations in the Italian Chamber of Deputies, demanding that France cede Tunisia, Nice, Corsica and French Somaliland to Italy. This begins an acute crisis in Franco-Italian relations that lasts until March 1939."], ["1938-11-30T00:00:00", "Corneliu Zelea Codreanu, leader of the Romanian fascist Iron Guard, is murdered on the orders of King Carol II. Officially, Codreanu and the 13 other Iron Guard leaders are \"shot while trying to escape\"."], ["1938-11-30T00:00:00", "A general strike is called in France by the French Communist Party to protest the laws of November 12."], ["1938-12-11T00:00:00", "Kingdom of Yugoslavia parliamentary election: The opposition gains votes but not seats."], ["1938-12-11T00:00:00", "Following elections in the Lithuanian city of Memel the Lithuanian Nazi party wins over 90% of the votes."], ["1938-01-01T00:00:00", "Robert Jankel, British coachbuilder (d. 2005)"], ["1938-01-01T00:00:00", "Frank Langella, American actor"], ["1938-01-02T00:00:00", "Farouk El-Baz, Egyptian American space scientist"], ["1938-01-02T00:00:00", "Ian Brady, British serial killer"], ["1938-01-02T00:00:00", "Hans Herbjørnsrud, Norwegian author"], ["1938-01-02T00:00:00", "Goh Kun, Mayor of Seoul"], ["1938-01-02T00:00:00", "Dana Ulery, American computer scientist"], ["1938-01-10T00:00:00", "Donald Knuth, American mathematician and computer scientist"], ["1938-01-10T00:00:00", "Willie McCovey, American baseball player"], ["1938-01-11T00:00:00", "Fischer Black, American economist (d. 1995)"], ["1938-01-11T00:00:00", "Alastair Morton, British railway executive (d. 2004)"], ["1938-01-12T00:00:00", "Teresa del Conde, Mexican art critic and historian"], ["1938-01-12T00:00:00", "Lewis Fiander, Australian actor"], ["1938-01-12T00:00:00", "Noel McNamara, Australian justice campaigner and commentator"], ["1938-01-13T00:00:00", "Paavo Heininen, Finnish composer"], ["1938-01-13T00:00:00", "Nachi Nozawa, Japanese voice actor (d. 2010)"], ["1938-01-14T00:00:00", "Jack Jones, American singer and actor"], ["1938-01-14T00:00:00", "Allen Toussaint, American musician and composer"], ["1938-01-25T00:00:00", "Etta James, American singer (d. 2012)"], ["1938-01-25T00:00:00", "Shotaro Ishinomori, Japanese author, Father of \"Henshin heroes\" (d. 1998)"], ["1938-01-25T00:00:00", "Vladimir Vysotsky, Russian singer-songwriter, poet, actor (d. 1980)"], ["1938-01-31T00:00:00", "Queen Beatrix of the Netherlands"], ["1938-01-31T00:00:00", "Lynn Carlin, American actress"], ["1938-02-11T00:00:00", "Bevan Congdon, New Zealand cricketer"], ["1938-02-11T00:00:00", "Simone de Oliveira, Portuguese actress and singer"], ["1938-02-11T00:00:00", "Manuel Noriega, Panamanian general and dictator"], ["1938-02-24T00:00:00", "James Farentino, American actor (d. 2012)"], ["1938-02-24T00:00:00", "Phil Knight, American sportswear entrepreneur"], ["1938-03-04T00:00:00", "Angus MacLise, American musician, occultist and calligrapher; drummer for The Velvet Underground (d. 1979)"], ["1938-03-04T00:00:00", "Don Perkins, American football player"], ["1938-03-04T00:00:00", "Paula Prentiss, American actress"], ["1938-03-07T00:00:00", "David Baltimore, American biologist, recipient of the Nobel Prize in Physiology or Medicine"], ["1938-03-07T00:00:00", "Janet Guthrie, American race car driver"], ["1938-03-17T00:00:00", "Rudolf Nureyev, Russian-born dancer and choreographer (d. 1993)"], ["1938-03-17T00:00:00", "Keith Michael Patrick O'Brien, Roman Catholic prelate; Archbishop of Edinburgh"], ["1938-03-18T00:00:00", "Shashi Kapoor, Indian actor, director, and producer"], ["1938-03-18T00:00:00", "Charley Pride, American baseball player and country musician"], ["1938-04-07T00:00:00", "Freddie Hubbard, American jazz trumpeter (d. 2008)"], ["1938-04-07T00:00:00", "Jerre Levy, American psychologist"], ["1938-04-10T00:00:00", "Viktor Chernomyrdin, Russian politician (d. 2010)"], ["1938-04-10T00:00:00", "Don Meredith, American football player and broadcaster (d. 2010)"], ["1938-04-11T00:00:00", "Michael Deaver, Reagan Administration Deputy White House Chief of Staff (d. 2007)"], ["1938-04-11T00:00:00", "Kurt Moll, German bass"], ["1938-04-22T00:00:00", "Alan Bond, English-born Australian businessman (d. 2015)"], ["1938-04-22T00:00:00", "Issey Miyake, Japanese fashion designer"], ["1938-04-22T00:00:00", "Adam Raphael, English journalist and editor"], ["1938-04-26T00:00:00", "Duane Eddy, American musician"], ["1938-04-26T00:00:00", "Maurice Williams, American musician"], ["1938-04-29T00:00:00", "Bernard Madoff, American criminal; financial fraudster"], ["1938-04-29T00:00:00", "Larry Niven, American author"], ["1938-05-26T00:00:00", "William Bolcom, American composer and music arranger"], ["1938-05-26T00:00:00", "Pauline Parker, New Zealand convicted murderer"], ["1938-05-26T00:00:00", "Teresa Stratas, Canadian operatic soprano"], ["1938-05-31T00:00:00", "Johnny Paycheck, American country singer (d. 2003)"], ["1938-05-31T00:00:00", "Peter Yarrow, American singer"], ["1938-06-19T00:00:00", "Wahoo McDaniel, American football player and professional wrestler (d. 2002)"], ["1938-06-19T00:00:00", "Ian Smith, Australian actor"], ["1938-07-06T00:00:00", "Tony Lewis, English cricketer"], ["1938-07-06T00:00:00", "Luana Patten, American actress (d. 1996)"], ["1938-07-18T00:00:00", "Ian Stewart, Scottish musician (The Rolling Stones) (d. 1985)"], ["1938-07-18T00:00:00", "Paul Verhoeven, Dutch film director"], ["1938-07-20T00:00:00", "Roger Hunt, English footballer"], ["1938-07-20T00:00:00", "Dame Diana Rigg, English actress"], ["1938-07-20T00:00:00", "Natalie Wood, American actress (d. 1981)"], ["1938-07-23T00:00:00", "Juliet Anderson, American actress (d. 2010)"], ["1938-07-23T00:00:00", "Ronny Cox, American actor"], ["1938-07-23T00:00:00", "Bert Newton, Australian actor and television show host"], ["1938-07-28T00:00:00", "Luis Aragonés, Spanish football player and manager (d. 2014)"], ["1938-07-28T00:00:00", "Alberto Fujimori, President of Peru"], ["1938-07-29T00:00:00", "Anthony Joseph Burgess, Papua New Guinean Roman Catholic bishop (d. 2013)"], ["1938-07-29T00:00:00", "Peter Jennings, Canadian-born television news reporter (d. 2005)"], ["1938-08-08T00:00:00", "Otto Rehhagel, German football player and manager"], ["1938-08-08T00:00:00", "Connie Stevens, American actress, singer and businesswoman"], ["1938-08-09T00:00:00", "Leonid Kuchma, President of Ukraine"], ["1938-08-09T00:00:00", "Rod Laver, Australian tennis player"], ["1938-08-19T00:00:00", "Valentin Mankin, Ukrainian Soviet sailor, Olympic triple champion and silver medalist (d. 2014)"], ["1938-08-19T00:00:00", "Diana Muldaur, American actress"], ["1938-08-24T00:00:00", "Halldór Blöndal, Icelandic politician"], ["1938-08-24T00:00:00", "David Freiberg, American musician (Quicksilver Messenger Service and Jefferson Starship)"], ["1938-08-28T00:00:00", "Maurizio Costanzo, Italian television news reporter"], ["1938-08-28T00:00:00", "Paul Martin, 21st Prime Minister of Canada"], ["1938-09-02T00:00:00", "Clarence Felder, American actor"], ["1938-09-02T00:00:00", "Giuliano Gemma, Italian actor (d. 2013)"], ["1938-09-10T00:00:00", "David Hamilton, British radio and TV personality"], ["1938-09-10T00:00:00", "Karl Lagerfeld, German fashion designer and photographer"], ["1938-09-13T00:00:00", "Angus Alan Douglas Douglas-Hamilton, 15th Duke of Hamilton/12th Duke of Brandon (d. 2010)"], ["1938-09-13T00:00:00", "John Smith, Scottish politician (d. 1994)"], ["1938-10-14T00:00:00", "Farah Diba, Empress of Iran"], ["1938-10-14T00:00:00", "Ron Lancaster, Canadian Football League quarterback and coach (d. 2008)"], ["1938-10-16T00:00:00", "Carl Gunter, Jr., Louisiana State Representative (d. 1999)"], ["1938-10-16T00:00:00", "Nico, German-American singer (d. 1988)"], ["1938-10-29T00:00:00", "Ralph Bakshi, Israeli cartoonist, film director, and video producer"], ["1938-10-29T00:00:00", "Ellen Johnson Sirleaf, President of Liberia"], ["1938-11-02T00:00:00", "Pat Buchanan, American political operative, journalist, pundit and one-time presidential candidate"], ["1938-11-02T00:00:00", "David Lane, American white nationalist (d. 2007)"], ["1938-11-05T00:00:00", "Enéas Carneiro, Brazilian politician (d. 2007)"], ["1938-11-05T00:00:00", "Joe Dassin, French singer (d. 1980)"], ["1938-11-06T00:00:00", "Mack Jones, American baseball player (d. 2004)"], ["1938-11-06T00:00:00", "Branko Mikasinovich, Serbian-American journalist"], ["1938-11-24T00:00:00", "Oscar Robertson, American basketball player"], ["1938-11-24T00:00:00", "Charles Starkweather, American spree killer (d. 1959)"], ["1938-12-04T00:00:00", "Andre V. Marrou, U.S. Presidential candidate"], ["1938-12-04T00:00:00", "Yvonne Minton, Australian soprano"], ["1938-12-08T00:00:00", "Ken Delo, American singer"], ["1938-12-08T00:00:00", "John Kofi Agyekum Kufuor, President of Ghana"], ["1938-12-16T00:00:00", "Frank Deford, American sportswriter"], ["1938-12-16T00:00:00", "Liv Ullmann, Norwegian actress"], ["1938-12-17T00:00:00", "Carlo Little, British drummer (d. 2005)"], ["1938-12-17T00:00:00", "Peter Snell, New Zealand athlete"], ["1938-03-02T00:00:00", "William Blomfield, New Zealand cartoonist (b. 1866)"], ["1938-03-02T00:00:00", "Ben Harney, American composer and pianist (b. 1871)"], ["1938-03-13T00:00:00", "Nikolai Bukharin, Soviet politician (b. 1888)"], ["1938-03-13T00:00:00", "Clarence Darrow, American attorney (b. 1857)"], ["1938-07-04T00:00:00", "Otto Bauer, Austrian Social Democratic politician (b. 1881)"], ["1938-07-04T00:00:00", "Suzanne Lenglen, French tennis champion (b. 1899)"], ["1938-10-27T00:00:00", "Lascelles Abercrombie, English poet and critic (b. 1881)"], ["1938-10-27T00:00:00", "Alma Gluck, American soprano (b. 1884)"], ["1938-11-09T00:00:00", "Vasily Blyukher, Soviet military commander (b. 1889)"], ["1938-11-09T00:00:00", "Ernst vom Rath, German diplomat (b. 1909)"]]