[["1953-01-05T00:00:00", "Samuel Beckett's play Waiting for Godot has its first public stage première in French as En attendant Godot at the Théâtre de Babylone in Paris."], ["1953-01-06T00:00:00", "The Asian Socialist Conference opens in Rangoon, Burma."], ["1953-01-07T00:00:00", "United States President Harry S. Truman announces the United States has developed a hydrogen bomb."], ["1953-01-12T00:00:00", "Estonian émigrés found a government-in-exile in Oslo."], ["1953-01-14T00:00:00", "Marshal Josip Broz Tito is chosen President of Yugoslavia."], ["1953-01-14T00:00:00", "The CIA-sponsored Robertson Panel first meets to discuss the UFO phenomenon."], ["1953-01-15T00:00:00", "Georg Dertinger, foreign minister of East Germany, is arrested for spying."], ["1953-01-19T00:00:00", "71.1% of all television sets in the United States are tuned into I Love Lucy to watch Lucy give birth to Little Ricky, which is more people than those who tuned into Dwight Eisenhower's inauguration the next day. This record has yet to be broken."], ["1953-01-20T00:00:00", "Dwight D. Eisenhower succeeds Harry S. Truman as the 34th President of the United States."], ["1953-01-22T00:00:00", "The Crucible, a drama by Arthur Miller, opens on Broadway."], ["1953-01-24T00:00:00", "Mau Mau Uprising: Rebels in Kenya kill the Ruck family (father, mother, and six-year-old son)."], ["1953-01-24T00:00:00", "Walter Ulbricht announces that agriculture will be collectivized in East Germany."], ["1953-01-28T00:00:00", "Derek Bentley is executed for murder at Wandsworth Prison in London."], ["1953-02-01T00:00:00", "The surge of the North Sea flood continues from the previous day."], ["1953-02-05T00:00:00", "Walt Disney's feature film Peter Pan premieres."], ["1953-02-11T00:00:00", "President Dwight D. Eisenhower refuses a clemency appeal for Ethel and Julius Rosenberg."], ["1953-02-11T00:00:00", "The Soviet Union breaks diplomatic relations with Israel after a bomb explosion at the Soviet embassy in reaction to the 'Doctors' plot'."], ["1953-02-12T00:00:00", "The Nordic Council is inaugurated."], ["1953-02-13T00:00:00", "Transsexual Christine Jorgensen returns to New York after successful sex reassignment surgery in Denmark."], ["1953-02-16T00:00:00", "The Pakistan Academy of Sciences is established in Pakistan."], ["1953-02-19T00:00:00", "Georgia approves the first literature censorship board in the United States."], ["1953-02-21T00:00:00", "Nitroform Products Company plant in Newark was destroyed by an explosion."], ["1953-02-25T00:00:00", "Release, in France, of Jacques Tati's film Les vacances de M. Hulot, introducing the gauche character of Monsieur Hulot."], ["1953-02-28T00:00:00", "James Watson and Francis Crick of the University of Cambridge announce their discovery of the structure of the DNA molecule."], ["1953-02-28T00:00:00", "Greece, Turkey, and Yugoslavia sign the Balkan Pact."], ["1953-03-01T00:00:00", "Joseph Stalin suffers a stroke after an all-night dinner with Soviet Union interior minister Lavrentiy Beria and future premiers Georgi Malenkov, Nikolai Bulganin, and Nikita Khrushchev. The stroke paralyzes the right side of his body and renders him unconscious until his death on March 5."], ["1953-03-01T00:00:00", "Bernard Freyberg, 1st Baron Freyberg is made deputy constable and lieutenant governor of Windsor Castle."], ["1953-03-06T00:00:00", "Georgy Maksimilianovich Malenkov succeeds Joseph Stalin as Premier and First Secretary of the Communist Party of the Soviet Union."], ["1953-03-08T00:00:00", "The Thieves World, which had been transformed into the Russian mafia, are freed from prisons by the Malenkov regime which ends the Bitch Wars."], ["1953-03-13T00:00:00", "The United Nations Security Council nominates Dag Hammarskjöld as United Nations Secretary General."], ["1953-03-14T00:00:00", "Nikita Khrushchev is selected First Secretary of the Soviet Communist Party."], ["1953-03-17T00:00:00", "The first nuclear test of Operation Upshot-Knothole is conducted in Nevada, with 1,620 spectators at 3.4 km (2.1 mi)."], ["1953-03-18T00:00:00", "An earthquake hits western Turkey, killing 250."], ["1953-03-19T00:00:00", "The 25th Academy Awards ceremony is held (the first one broadcast on television)."], ["1953-03-26T00:00:00", "Jonas Salk announces his polio vaccine."], ["1953-03-29T00:00:00", "A fire at the Littlefield Nursing Home in Largo, Florida, kills 33 persons, including singer-songwriter Arthur Fields."], ["1953-04-07T00:00:00", "Dag Hammarskjöld is elected United Nations Secretary-General."], ["1953-04-08T00:00:00", "Jomo Kenyatta is sentenced to seven years in prison for the alleged organization of the Mau Mau Uprising."], ["1953-04-10T00:00:00", "The Melbourne Knights is founded as Croatia SC in Melbourne."], ["1953-04-13T00:00:00", "Ian Fleming publishes his first James Bond novel, Casino Royale, in the United Kingdom."], ["1953-04-13T00:00:00", "The German football team SG Dynamo Dresden is founded."], ["1953-04-16T00:00:00", "President Eisenhower delivers his \"Chance for Peace\" speech to the National Association of Newspaper Editors."], ["1953-04-16T00:00:00", "A four-story building in Chicago belonging to the Habar Corporation catches fire, killing 35 employees."], ["1953-04-17T00:00:00", "Mickey Mantle hits a 565-foot (172 m) home run at Griffith Stadium in Washington, D.C. Mantle's home run is believed to be the longest home run in baseball history by many historians."], ["1953-04-20T00:00:00", "Frank Sinatra and the arranger Nelson Riddle began their first recording sessions together at Capitol Records, which would result in some of the defining recordings of Sinatra's career."], ["1953-04-25T00:00:00", "Francis Crick and James Watson publish \"Molecular Structure of Nucleic Acids: A Structure for Deoxyribose Nucleic Acid\", their description of the double helix structure of DNA."], ["1953-05-02T00:00:00", "Hussein is crowned King of Jordan."], ["1953-05-05T00:00:00", "Aldous Huxley first tries the psychedelic hallucinogen, mescaline, inspiring his book The Doors of Perception."], ["1953-05-09T00:00:00", "France agrees to the provisional independence of Cambodia with King Norodom Sihanouk."], ["1953-05-10T00:00:00", "The town of Chemnitz in East Germany becomes Karl Marx Stadt."], ["1953-05-11T00:00:00", "The Waco tornado outbreak: A F5 tornado hits in the downtown section of Waco, Texas, killing 114."], ["1953-05-15T00:00:00", "The Standards And Recommended Practices (SARPS) for Aeronautical Information Service (AIS) were adopted by the ICAO Council. These SARPS are in Annex 15 to the Chicago Convention and 15 May is celebrated by the AIS community as “World AIS Day”."], ["1953-05-18T00:00:00", "At Rogers Dry Lake, Californian Jackie Cochran becomes the first woman to break the sound barrier (in a F-86 Sabrejet at an average speed of 652.337 miles-per-hour)."], ["1953-05-25T00:00:00", "Nuclear testing: At the Nevada Test Site, the United States conducts its only nuclear artillery test: Upshot-Knothole Grable."], ["1953-05-29T00:00:00", "Sir Edmund Hillary and Tenzing Norgay become the first men to reach the summit of Mount Everest."], ["1953-06-01T00:00:00", "Uprising in Plzeň: Currency reform causes riots in Czechoslovakia."], ["1953-06-02T00:00:00", "Coronation of Queen Elizabeth II of the United Kingdom at Westminster Abbey."], ["1953-06-07T00:00:00", "Italian general election: the Christian Democracy party wins a plurality in both legislative houses."], ["1953-06-08T00:00:00", "Flint-Worcester tornado outbreak sequence: A tornado kills 115 in Flint, Michigan (the last to claim more than 100 lives until the 2011 Joplin tornado)."], ["1953-06-08T00:00:00", "Austria and the Soviet Union form diplomatic relations."], ["1953-06-08T00:00:00", "Ivo Sanader, the \"Čaća\", was born."], ["1953-06-09T00:00:00", "CIA Technical Services Staff head Sidney Gottlieb approves of the use of LSD in a MKULTRA subproject."], ["1953-06-09T00:00:00", "Flint-Worcester tornado outbreak sequence: A tornado spawned from the same storm system as the Flint tornado hits in Worcester, Massachusetts, killing 94."], ["1953-06-13T00:00:00", "Hungarian Prime Minister Mátyás Rákosi is replaced by Imre Nagy."], ["1953-06-16T00:00:00", "The Soviet Union and Yugoslavia form diplomatic relations."], ["1953-06-17T00:00:00", "Workers Uprising in East Germany: The Soviet Union orders a division of troops into East Berlin to quell a rebellion."], ["1953-06-18T00:00:00", "Egypt declares itself a republic."], ["1953-06-18T00:00:00", "Tachikawa air disaster: A United States Air Force Douglas C-124 Globemaster II crashes just after takeoff from Tachikawa Airfield near Tokyo, Japan, killing all 129 people on board in the worst air crash in history at this time and the first with a confirmed death toll exceeding 100."], ["1953-06-30T00:00:00", "The first Chevrolet Corvette is built at Flint, Michigan."], ["1953-06-30T00:00:00", "First roll-on/roll-off ferry crossing of the English Channel, Dover-Boulogne."], ["1953-07-03T00:00:00", "First ascent of Nanga Parbat in the Pakistan Himalayas, the world's ninth highest mountain, is made by Austrian climber Hermann Buhl alone."], ["1953-07-04T00:00:00", "Strikes and riots hit coal mining regions in Poland."], ["1953-07-05T00:00:00", "The European Economic Community (EEC) holds its first assembly in Strasbourg, France."], ["1953-07-09T00:00:00", "The US Treasury formally renames the Bureau of Internal Revenue; the new name (which had previously been used informally) is the Internal Revenue Service."], ["1953-07-10T00:00:00", "The Soviet official newspaper Pravda announces that Lavrentiy Beria has been deposed as head of the NKVD."], ["1953-07-17T00:00:00", "The greatest recorded loss of United States midshipmen in a single event results from an aircraft crash near NAS Whiting Field."], ["1953-07-23T00:00:00", "Howard Hawks's musical film Gentlemen Prefer Blondes, starring Marilyn Monroe and Jane Russell, is released by 20th Century Fox."], ["1953-07-26T00:00:00", "Fidel Castro and his brother lead a disastrous assault on the Moncada Barracks, preliminary to the Cuban Revolution."], ["1953-07-26T00:00:00", "The Short Creek raid is carried out on a polygynous Mormon sect in Arizona."], ["1953-07-27T00:00:00", "The Korean War ends with the Korean Armistice Agreement: United Nations Command (Korea) (United States), People's Republic of China, North Korea sign an armistice agreement at Panmunjom and the north remains communist while the south remains capitalist."], ["1953-08-05T00:00:00", "Operation Big Switch: Prisoners of war are repatriated after the Korean War."], ["1953-08-08T00:00:00", "Soviet prime minister Georgi Malenkov announces that the Soviet Union has a hydrogen bomb."], ["1953-08-12T00:00:00", "A magnitude 7.2 earthquake totally devastates most of the Ionian Sea islands in Greece's worst natural disaster in centuries."], ["1953-08-13T00:00:00", "Four million workers go on strike in France to protest against austerity measures."], ["1953-08-17T00:00:00", "The first planning session of Narcotics Anonymous is held in Southern California (see October 5)."], ["1953-08-18T00:00:00", "The second Kinsey Report, Sexual Behavior in the Human Female, is published in the US."], ["1953-08-19T00:00:00", "Cold War: The CIA helps to overthrow the government of Mohammad Mosaddegh in Iran, and retain Shah Mohammad Reza Pahlavi on the throne (see Operation Ajax)."], ["1953-08-20T00:00:00", "The French government ousts King Mohammed V of Morocco and exiles him to Corsica."], ["1953-08-20T00:00:00", "The United States returns to West Germany 382 ships it had captured during World War II."], ["1953-08-25T00:00:00", "The general strike ends in France."], ["1953-09-04T00:00:00", "The discovery of REM sleep is first published by researchers Eugene Aserinsky and Nathaniel Kleitman."], ["1953-09-05T00:00:00", "The United Nations rejects the Soviet Union's suggestion to accept China as a member."], ["1953-09-07T00:00:00", "Nikita Khrushchev becomes head of the Soviet Central Committee."], ["1953-09-12T00:00:00", "U.S. Senator John Fitzgerald Kennedy marries Jacqueline Lee Bouvier at St. Mary's Church in Newport, Rhode Island."], ["1953-09-25T00:00:00", "A hurricane in South-East Asia kills over 1,000 people."], ["1953-09-25T00:00:00", "The first German prisoners of war return from the Soviet Union to West Germany."], ["1953-09-26T00:00:00", "Rationing of cane sugar ends in the UK."], ["1953-10-05T00:00:00", "Earl Warren is appointed Chief Justice of the United States by U.S. president Dwight D. Eisenhower."], ["1953-10-05T00:00:00", "The first meeting of Narcotics Anonymous is held (the first planning session was held August 17)."], ["1953-10-06T00:00:00", "The United Nations Children's Fund (UNICEF) is made a permanent specialized agency of the United Nations."], ["1953-10-09T00:00:00", "Konrad Adenauer is re-elected as German chancellor."], ["1953-10-09T00:00:00", "The Guyanese constitution is suspended."], ["1953-10-10T00:00:00", "Roland (Monty) Burton wins the 1953 London to Christchurch air race in under 23 hours flying time."], ["1953-10-10T00:00:00", "The Mutual Defense Treaty Between the United States and the Republic of Korea is concluded in Washington D.C."], ["1953-10-12T00:00:00", "The play The Caine Mutiny Court-Martial opens at Plymouth Theatre, New York."], ["1953-10-23T00:00:00", "The Philippines' DZAQ-TV3 (now ABS-CBN) makes its initial telecast, becoming Asia's first commercial television broadcaster."], ["1953-10-30T00:00:00", "Cold War: U.S. President Dwight D. Eisenhower formally approves the top secret document of the United States National Security Council NSC 162/2, which states that the United States' arsenal of nuclear weapons must be maintained and expanded to counter the communist threat."], ["1953-11-05T00:00:00", "David Ben-Gurion resigns as prime minister of Israel."], ["1953-11-09T00:00:00", "The Laotian Civil War begins between the Kingdom of Laos and the Pathet Lao. - The Kingdom of Laos gains its independence from the French Army."], ["1953-11-09T00:00:00", "The Laotian Civil War begins between the Kingdom of Laos and the Pathet Lao. - In Cambodia the Khmer Issarak begins to fight the French Army and the nation joins the First Indochina War but the Kingdom is established."], ["1953-11-20T00:00:00", "The Douglas D-558-2 Skyrocket, piloted by Scott Crossfield, becomes the first manned aircraft to reach Mach 2."], ["1953-11-21T00:00:00", "Puerto Williams is founded in Chile as the southernmost settlement of the world."], ["1953-11-21T00:00:00", "Authorities at the British Natural History Museum announce that the skull of the Piltdown Man, one of the most famous fossil skulls in the world, is a hoax."], ["1953-11-25T00:00:00", "England loses 6-3 to Hungary at Wembley Stadium, their first ever loss to a continental team at home."], ["1953-11-29T00:00:00", "French paratroopers take Điện Biên Phủ."], ["1953-11-30T00:00:00", "Edward Mutesa II, the kabaka (king) of Buganda, is deposed and exiled to London by Sir Andrew Benjamin Cohen, Governor of Uganda."], ["1953-12-02T00:00:00", "The United Kingdom and Iran reform diplomatic relations."], ["1953-12-06T00:00:00", "With the NBC Symphony Orchestra, conductor Arturo Toscanini performs what he claims is his favorite Beethoven symphony, Eroica, for the last time. The live performance is broadcast nationwide on radio, and later released on records and CD."], ["1953-12-07T00:00:00", "A visit to Iran by American Vice President Richard Nixon sparks several days of riots, as an reaction to the August 19 overthrow of the government of Mohammed Mossadegh by the US-backed Shah. Three students are shot dead by police in Tehran. This event becomes an annual commemoration."], ["1953-12-08T00:00:00", "U.S. president Dwight D. Eisenhower delivers his Atoms for Peace address to the United Nations General Assembly in New York City."], ["1953-12-10T00:00:00", "Albert Schweitzer is given the 1952 Nobel Peace Prize."], ["1953-12-17T00:00:00", "The U.S. Federal Communications Commission (FCC) approves color television (using the NTSC standard)."], ["1953-12-23T00:00:00", "The Soviet Union announces officially that Lavrentiy Beria has been executed."], ["1953-12-24T00:00:00", "Tangiwai disaster: A railway bridge collapses at Tangiwai, New Zealand, sending a fully loaded passenger train into the Whangaehu River; 151 are killed."], ["1953-12-25T00:00:00", "The Amami Islands are returned to Japan after 8 years of United States military occupation."], ["1953-12-30T00:00:00", "The first color television sets go on sale for about US$1,175."]]