[["1992-01-01T00:00:00", "The Atari 2600 is finally discontinued 15 years after its introduction in September 1977"], ["1992-01-01T00:00:00", "Boutros Boutros-Ghali of Egypt replaces Javier Pérez de Cuéllar of Peru as United Nations Secretary-General."], ["1992-01-01T00:00:00", "George H. W. Bush becomes the first U.S. President to address the Australian Parliament."], ["1992-01-11T00:00:00", "Singer Paul Simon is the first major artist to tour South Africa after the end of the cultural boycott."], ["1992-01-11T00:00:00", "Shanda Sharer is tortured and burned to death in Madison, Indiana by 4 teenage girls."], ["1992-01-22T00:00:00", "Rebel forces occupy Zaire's national radio station in Kinshasa and broadcast a demand for the government's resignation."], ["1992-01-22T00:00:00", "STS-42: Dr. Roberta Bondar becomes the first Canadian woman in space, aboard Space Shuttle Discovery."], ["1992-01-24T00:00:00", "In El Salvador, an army colonel and a lieutenant of the Atlacatl Battalion are each sentenced to 30 years in prison for the 1989 murder of six Jesuit priests and their housekeepers."], ["1992-01-24T00:00:00", "China and Israel establish diplomatic relations."], ["1992-01-26T00:00:00", "Boris Yeltsin announces that Russia will stop targeting cities of the United States and her allies with nuclear weapons. In return George H. W. Bush announces that the United States and her allies will stop targeting Russia and the remaining communist states with nuclear weapons."], ["1992-01-26T00:00:00", "In Mauritania, security forces open fire on opponents of President of Mauritania Maaouya Ould Sid'Ahmed Taya, killing at least 5 people."], ["1992-01-27T00:00:00", "Macy's files for bankruptcy."], ["1992-01-27T00:00:00", "Nagorno-Karabakh War: in the disputed territory of Nagorno-Karabakh, fighting between Armenians and Azeris leaves at least 60 people dead."], ["1992-02-01T00:00:00", "President of the United States George H. W. Bush meets with President of Russia Boris Yeltsin at Camp David, where they formally declare that the Cold War is over."], ["1992-02-01T00:00:00", "The United States Coast Guard begins deporting the first of some 14,000 refugees from Haiti."], ["1992-02-18T00:00:00", "Iraq disarmament crisis: The Executive Chairman of UNSCOM details Iraq's refusal to abide by UN Security Council disarmament resolutions."], ["1992-02-18T00:00:00", "The New Hampshire primary is won by Paul Tsongas on the Democratic side; for the Republicans, Pat Buchanan has a surprisingly strong showing (37%) against incumbent president George H. W. Bush."], ["1992-02-27T00:00:00", "In Albuquerque, New Mexico, 79 year-old Stella Liebeck is burned by a cup of coffee at a McDonald's located near the city."], ["1992-03-19T00:00:00", "Paul Tsongas withdraws from the Democratic Party presidential primaries, virtually assuring a victory for Bill Clinton."], ["1992-03-19T00:00:00", "Dow Corning announces that it will stop manufacturing silicone breast implants."], ["1992-03-22T00:00:00", "In French regional elections, the conservative Rally for the Republic and the centre-right Union for French Democracy win in a landslide, capturing 20 of 22 metropolitan regional presidencies."], ["1992-03-22T00:00:00", "STS-45: Space Shuttle Atlantis takes off from Cape Canaveral carrying instruments designed to study global warming."], ["1992-03-24T00:00:00", "The Open Skies Treaty is signed in Helsinki, Finland to establish a program of unarmed survelliance flights over the 34 member states. It went into effect on January 1, 2002."], ["1992-03-25T00:00:00", "The International Atomic Energy Agency orders Iraq to destroy an industrial complex at Al Atheer that is being used to manufacture nuclear weapons."], ["1992-03-25T00:00:00", "Pakistan beats England to win the Cricket World Cup for the very first time."], ["1992-04-05T00:00:00", "The Assembly of Bosnia and Herzegovina (without the presence of Serb political delegates) proclaims independence from the Socialist Federal Republic of Yugoslavia."], ["1992-04-05T00:00:00", "Bosnian War: Serb troops, following a mass rebellion of Serbs in Bosnia and Herzegovina against the Bosnian declaration of independence from Yugoslavia, besiege the city of Sarajevo."], ["1992-04-05T00:00:00", "Approximately 500,000 people march on Washington, D. C. in support of abortion rights in advance of oral arguments in the case of Planned Parenthood v. Casey."], ["1992-04-05T00:00:00", "President of Peru Alberto Fujimori issues Decree Law 25418, dissolving the Congress of the Republic of Peru, imposing censorship and having opposition politicians arrested, setting off the 1992 Peruvian constitutional crisis."], ["1992-04-06T00:00:00", "Barney & Friends makes its debut on PBS."], ["1992-04-06T00:00:00", "Microsoft releases Windows 3.1."], ["1992-04-09T00:00:00", "A Miami jury convicts former Panamanian ruler Manuel Noriega of assisting Colombia's cocaine cartel."], ["1992-04-09T00:00:00", "The United Kingdom general election is narrowly won by the Conservative Party led by Prime Minister of the United Kingdom John Major."], ["1992-04-20T00:00:00", "Seville, Spain's 6-month Universal Exhibition, called Seville Expo '92, opens."], ["1992-04-20T00:00:00", "The Freddie Mercury Tribute Concert, held at Wembley Stadium, is televised live to over 1 billion people and raises millions of dollars for AIDS research."], ["1992-05-07T00:00:00", "STS-49: Space Shuttle Endeavour makes its maiden flight, as a replacement for Space Shuttle Challenger."], ["1992-05-07T00:00:00", "The Michigan Legislature approves the Twenty-seventh Amendment to the United States Constitution. With that approval, the amendment had been adopted by 38 states and is thereby approved."], ["1992-05-07T00:00:00", "The Sydney River McDonald's murders in Nova Scotia, Canada got international attention as three employees where killed and a fourth was left permanently disabled during a botched robbery. It was the first fast food restaurant murders in Canada."], ["1992-05-15T00:00:00", "The Commonwealth of Independent States Collective Security Treaty (CST) is signed (effective 20 April 1994)."], ["1992-05-15T00:00:00", "The Genoa Expo '92 World's Fair opens in Genoa, Italy."], ["1992-05-22T00:00:00", "The Tonight Show Starring Johnny Carson airs its final show on NBC."], ["1992-05-24T00:00:00", "In Thailand, Suchinda Kraprayoon agrees to resign."], ["1992-05-24T00:00:00", "Serbian irregulars kill at least 16 people on a bread line in Sarajevo."], ["1992-06-16T00:00:00", "A 'Joint Understanding' agreement on arms reduction is signed by U.S. President George H. W. Bush and Russian President Boris Yeltsin (this is later codified in START II)."], ["1992-06-16T00:00:00", "A federal grand jury indicts Caspar Weinberger for his role in covering up the Iran–Contra affair."], ["1992-06-23T00:00:00", "The Israeli legislative election is won by the Israeli Labor Party under the leadership of Yitzhak Rabin, ousting a Likud government."], ["1992-06-23T00:00:00", "Gambino crime family boss John Gotti is sentenced to life without parole for the murder of Paul Castellano and other crimes."], ["1992-06-26T00:00:00", "Denmark beats Germany 2–0 to win the 1992 UEFA European Football Championship at Ullevi Stadium in Gothenburg, Sweden."], ["1992-06-26T00:00:00", "United States Secretary of the Navy Henry L. Garrett III resigns in the wake of the Tailhook scandal."], ["1992-06-28T00:00:00", "Estonia holds a referendum on its constitution, which will come into effect on July 3."], ["1992-06-28T00:00:00", "Junko Tabei scales Puncak Jaya to become the first woman to complete the Seven Summits."], ["1992-06-29T00:00:00", "A bodyguard assassinates President Mohamed Boudiaf of Algeria."], ["1992-06-29T00:00:00", "The Supreme Court of the United States upholds the 1973 decision of Roe v. Wade in Planned Parenthood v. Casey, a 5-4 decision."], ["1992-07-06T00:00:00", "July 8 – The 18th G7 summit is held in Munich."], ["1992-07-10T00:00:00", "In Miami, former Panamanian leader Manuel Noriega is sentenced to 40 years in prison for drug and racketeering violations."], ["1992-07-10T00:00:00", "The Giotto spacecraft flies past Comet 26P/Grigg–Skjellerup, gathering measurements about the comet."], ["1992-07-16T00:00:00", "Ross Perot announces he is ending his presidential campaign."], ["1992-07-16T00:00:00", "At the 1992 Democratic National Convention, Arkansas Governor Bill Clinton accepts his party's presidential nomination on behalf of the \"forgotten middle class\"."], ["1992-07-19T00:00:00", "A car bomb placed by the Mafia (with the collaboration of Italian intelligence) kills judge Paolo Borsellino and 5 members of his escort."], ["1992-07-19T00:00:00", "The Cabinet of Israel approves a freeze on new settlements in the occupied territories, a move expected to reinvigorate the Middle East Peace Process."], ["1992-07-20T00:00:00", "Václav Havel resigns as president of Czechoslovakia."], ["1992-07-20T00:00:00", "An airlift of food and medicine to Sarajevo is halted after 23 days due to renewed fighting."], ["1992-07-20T00:00:00", "A Bell Boeing V-22 Osprey crashes in the Potomac River as it approaches Marine Corps Base Quantico, killing all 7 people on board."], ["1992-07-31T00:00:00", "The ex-Soviet Republic of Georgia becomes the 179th member of the United Nations."], ["1992-07-31T00:00:00", "Thai Airways International Flight 311, an Airbus A310-300, crashes into a mountain north of Kathmandu, Nepal killing all 113 people on board."], ["1992-07-31T00:00:00", "China General Aviation Flight 7552 bound for Xiamen crashes soon after taking off from Nanjing Dajiaochang Airport, killing 108 of the 116 people on board."], ["1992-08-03T00:00:00", "August 4 – Millions of black South Africans participate in a general strike called by the African National Congress to protest the lack of progress in negotiations with the government of President of South Africa F. W. de Klerk."], ["1992-08-24T00:00:00", "A special commission in Brazil concludes that there is sufficient evidence to begin impeachment proceedings against President of Brazil Fernando Collor de Mello, finding he had accepted millions of dollars worth of illegal payments from business interests."], ["1992-08-24T00:00:00", "China and South Korea establish diplomatic relations."], ["1992-09-07T00:00:00", "In Ciskei, members of the Ciskei Defence Force loyal to dictator Oupa Gqozo open fire into a crowd of anti-Gqozo protestors organized by the African National Congress, killing at least 28 people and wounding nearly 200."], ["1992-09-07T00:00:00", "President of Tajikistan Rahmon Nabiyev is forced to resign following weeks of clan and religious warfare that left nearly 2,000 people dead."], ["1992-09-12T00:00:00", "STS-47: Dr. Mae Jemison becomes the first African-American woman to travel into space, aboard the Space Shuttle Endeavour."], ["1992-09-12T00:00:00", "In Peru, police arrest Abimael Guzmán, the leader of the Shining Path guerilla movement, who had evaded capture for 12 years."], ["1992-09-23T00:00:00", "A large Provisional Irish Republican Army bomb destroys the forensic laboratories in Belfast."], ["1992-09-23T00:00:00", "Operation Julin is the last nuclear test conducted by the United States at the Nevada Test Site."], ["1992-10-01T00:00:00", "The Cartoon Network is first broadcast on television."], ["1992-10-01T00:00:00", "Ross Perot reenters the U.S. presidential election."], ["1992-10-04T00:00:00", "El Al Flight 1862 crashes in Amsterdam, Netherlands; 43 are killed, many more injured."], ["1992-10-04T00:00:00", "The government of Mozambique signs a truce with leaders of RENAMO, ending the 16-year-old Mozambican Civil War."], ["1992-10-11T00:00:00", "The Catechism of the Catholic Church is promulgated by Pope John Paul II with his apostolic constitution, Fidei depositum."], ["1992-10-11T00:00:00", "President George H. W. Bush, Arkansas Governor Bill Clinton, and Ross Perot participate in the first of 3 televised debates."], ["1992-10-12T00:00:00", "In the Dominican Republic, Pope John Paul II celebrates the 500th anniversary of the meeting of 2 cultures."], ["1992-10-12T00:00:00", "The 1992 Cairo earthquake kills 543 people and injures more than 6,500."], ["1992-11-13T00:00:00", "The government of Peru announces it has arrested a small group of army officers who were plotting the assassination of President Alberto Fujimori."], ["1992-11-13T00:00:00", "A report by the World Meteorological Organization reports an unprecedented level of ozone depletion in both the Arctic and Antarctic."], ["1992-11-13T00:00:00", "Boxer Riddick Bowe defeats Evander Holyfield to become undisputed heavyweight champion."], ["1992-11-24T00:00:00", "In the People's Republic of China, a China Southern Airlines domestic flight crashes, killing all 141 people on board."], ["1992-11-24T00:00:00", "Elizabeth II describes this year as an annus horribilis (horrible year), due to various scandals damaging the image of the Royal Family, as well as the Windsor Castle fire."], ["1992-11-24T00:00:00", "The first commercial worldwide release in the videogame industry, nicknamed \"Sonic 2sday\", celebrates the release of the sequel to Sonic the Hedgehog, with an international release day event for the now best selling Sega Genesis game, Sonic the Hedgehog 2."], ["1992-11-25T00:00:00", "Disney's Aladdin is released in theaters everywhere."], ["1992-11-25T00:00:00", "The Czechoslovakia Federal Assembly votes to split the country into the Czech Republic and Slovakia, starting on January 1, 1993."], ["1992-11-25T00:00:00", "In a national referendum related to abortion, voters in Ireland reject the proposed Twelfth Amendment of the Constitution Bill, 1992 (Ireland) but approve the Thirteenth Amendment of the Constitution of Ireland and the Fourteenth Amendment of the Constitution of Ireland."], ["1992-11-30T00:00:00", "The trial of 14 South Vietnamese accused of murdering 24 North Vietnamese begins in Hong Kong (ends November 29, 1994)."], ["1992-11-30T00:00:00", "Secretary-General of the United Nations Boutros Boutros-Ghali encourages the United Nations Security Council to pass United Nations Security Council Resolution 794, authorizing military intervention in the Somali Civil War to allow emergency food supplies to reach the people of Somalia. The Council passes the resolution on December 3, and United States Marines begin arriving in Somalia on December 9."], ["1992-12-03T00:00:00", "UN Security Council Resolution 794 is unanimously passed, approving a coalition of United Nations peacekeepers led by the United States to form UNITAF, tasked with ensuring humanitarian aid gets distributed and establishing peace in Somalia."], ["1992-12-03T00:00:00", "The Greek oil tanker Aegean Sea, carrying 80,000 tonnes of crude oil, runs aground in a storm while on approach to La Coruña, Spain, and spills much of its cargo."], ["1992-12-03T00:00:00", "The first SMS message is sent over the Vodafone GSM network in the United Kingdom."], ["1992-12-21T00:00:00", "A Dutch DC-10, flight Martinair MP 495, crashes at Faro Airport, killing 56 people."], ["1992-12-21T00:00:00", "President of Serbia Slobodan Milošević defeats Milan Panić in the Serbian presidential election."], ["1992-12-24T00:00:00", "President-elect Bill Clinton names the final members of his cabinet."], ["1992-12-24T00:00:00", "President George H. W. Bush pardons 6 national security officials implicated in the Iran–Contra affair, including Caspar Weinberger."], ["1992-01-16T00:00:00", "Diana Golbi, Israeli singer"], ["1992-01-16T00:00:00", "Maja Keuc, Slovenian singer"], ["1992-01-19T00:00:00", "Logan Lerman, American actor"], ["1992-01-19T00:00:00", "Mac Miller, American rapper"], ["1992-01-19T00:00:00", "Shawn Johnson, American Olympic gymnast"], ["1992-01-27T00:00:00", "Sam Barry, Irish tennis player"], ["1992-01-27T00:00:00", "Connor Widdows, Canadian actor"], ["1992-01-28T00:00:00", "Hunter Renfroe, American baseball player"], ["1992-01-28T00:00:00", "Simone, Danish singer"], ["1992-01-30T00:00:00", "Tom Ince, English footballer"], ["1992-01-30T00:00:00", "Matthew Werkmeister, Australian stage and television actor"], ["1992-02-01T00:00:00", "Kelli Goss, American actress"], ["1992-02-05T00:00:00", "Neymar, Brazilian footballer"], ["1992-02-05T00:00:00", "Kejsi Tola, Albanian singer"], ["1992-02-09T00:00:00", "Valentina Barron, Australian actress"], ["1992-02-09T00:00:00", "Ana Yorkira Binet, Dominican volleyball player"], ["1992-02-09T00:00:00", "Darya Melnikova, Russian actress"], ["1992-02-09T00:00:00", "Avan Jogia, Canadian actor"], ["1992-02-18T00:00:00", "Logan Miller, American actor and musician"], ["1992-02-18T00:00:00", "Melinda Shankar, Canadian actress"], ["1992-02-20T00:00:00", "Nastassja Burnett, Italian tennis player"], ["1992-02-20T00:00:00", "Jarred Tinordi, American ice hockey player"], ["1992-02-25T00:00:00", "Max Aaron, American figure skater"], ["1992-02-25T00:00:00", "Zahia Dehar, French lingerie designer"], ["1992-02-26T00:00:00", "Sean Abbott, Australian cricketer"], ["1992-02-26T00:00:00", "Mikael Granlund, Finnish ice-hockey player"], ["1992-02-26T00:00:00", "Ai Shinozaki, Japanese gravure idol and singer"], ["1992-03-02T00:00:00", "Charlie Coyle, American hockey player"], ["1992-03-04T00:00:00", "Jazmin Grace Grimaldi, daughter of Albert II, Prince of Monaco"], ["1992-03-04T00:00:00", "Jared Sullinger, American basketball player"], ["1992-03-13T00:00:00", "L, South Korean singer (Infinite), dancer and actor"], ["1992-03-13T00:00:00", "George MacKay, English actor"], ["1992-03-13T00:00:00", "Antoni Sarcevic, English footballer"], ["1992-03-13T00:00:00", "Kaya Scodelario, English actress and model"], ["1992-03-15T00:00:00", "Sosie Bacon, American actress"], ["1992-03-15T00:00:00", "Mary Lou, American actress"], ["1992-03-23T00:00:00", "Kyrie Irving, American-Australian basketball player"], ["1992-03-23T00:00:00", "Vanessa Morgan, Canadian actress and singer"], ["1992-03-26T00:00:00", "Nina Agdal, Danish model"], ["1992-03-26T00:00:00", "Haley Ramm, American actress"], ["1992-03-28T00:00:00", "Elena Bogdan, Romanian tennis player"], ["1992-03-28T00:00:00", "Liam Hess, British actor"], ["1992-03-28T00:00:00", "Sergi Gómez, Spanish footballer"], ["1992-04-04T00:00:00", "Alexa Nikolas, American actress"], ["1992-04-04T00:00:00", "Jacquelyn Jablonski, American model"], ["1992-04-04T00:00:00", "Lucy May Barker, British stage and screen actress"], ["1992-04-04T00:00:00", "Christina Metaxa, Cypriot singer-songwriter"], ["1992-04-13T00:00:00", "Melodie Monrose, Martiniquais model"], ["1992-04-13T00:00:00", "George North, Welsh rugby player"], ["1992-04-13T00:00:00", "Paul Richardson, American football player"], ["1992-04-14T00:00:00", "Oliver Bohm, Swedish ice hockey player"], ["1992-04-15T00:00:00", "Amy Diamond, Swedish pop singer"], ["1992-04-15T00:00:00", "Richard Sandrak, Ukrainian bodybuilder"], ["1992-04-15T00:00:00", "John Guidetti, Swedish footballer"], ["1992-04-18T00:00:00", "Alexandra Adornetto, Australian novelist of The Strangest Adventures series"], ["1992-04-22T00:00:00", "Robin van Helsum, Dutch fraudster"], ["1992-04-22T00:00:00", "Joc Pederson, American baseball player"], ["1992-04-27T00:00:00", "Keenan Allen, American football player"], ["1992-04-27T00:00:00", "Allison Iraheta, American singer"], ["1992-04-27T00:00:00", "James Duke Mason, American actor"], ["1992-04-30T00:00:00", "Kenny Agostino, American professional ice hockey player"], ["1992-04-30T00:00:00", "Marc-André ter Stegen, German footballer"], ["1992-05-04T00:00:00", "Courtney Jines, American actress"], ["1992-05-04T00:00:00", "Grace Phipps, American actress and singer"], ["1992-05-04T00:00:00", "Ashley Rickards, American actress"], ["1992-05-06T00:00:00", "Baekhyun, South Korean singer (EXO)"], ["1992-05-06T00:00:00", "Vanesa Gabriela Leiro, Argentine actress and singer"], ["1992-05-06T00:00:00", "Jonas Valančiūnas, Lithuanian basketball player"], ["1992-05-08T00:00:00", "Ana Mulvoy-Ten, British actress"], ["1992-05-08T00:00:00", "Olivia Culpo, Miss Universe 2012 American beauty pageant titleholder"], ["1992-05-18T00:00:00", "Spencer Breslin, American actor"], ["1992-05-18T00:00:00", "Brian Idowu, Russian athlete"], ["1992-05-18T00:00:00", "Laurie Kingsbury, Canadian athlete"], ["1992-05-18T00:00:00", "Kevin Mendy, French athlete"], ["1992-05-18T00:00:00", "John Persson, Swedish athlete"], ["1992-05-18T00:00:00", "Nina Petushkova, Russian figure skater"], ["1992-05-19T00:00:00", "Eleanor Tomlinson, English actress"], ["1992-05-19T00:00:00", "Heather Watson, British tennis player"], ["1992-05-19T00:00:00", "Xiao Wen Ju, Chinese model"], ["1992-05-19T00:00:00", "Sam Smith, British soul singer"], ["1992-05-20T00:00:00", "Enes Kanter, Turkish basketball player"], ["1992-05-21T00:00:00", "Hutch Dano, American actor"], ["1992-05-21T00:00:00", "Olivia Olson, American actress and singer"], ["1992-05-30T00:00:00", "Harrison Barnes, American basketball player"], ["1992-05-30T00:00:00", "Danielle Harold, English actress"], ["1992-06-23T00:00:00", "Kate Melton, American actress"], ["1992-06-23T00:00:00", "Bridget Sloan, American artistic gymnast"], ["1992-06-24T00:00:00", "David Alaba, Austrian football player"], ["1992-06-24T00:00:00", "Raven Goodwin, American actress"], ["1992-06-26T00:00:00", "Melanie Amaro, American singer"], ["1992-06-26T00:00:00", "Jennette McCurdy, American actress and singer"], ["1992-06-30T00:00:00", "Holliston Coleman, American actress"], ["1992-06-30T00:00:00", "Lynx and Lamb Gaede, twin American Neo-Nazi musicians"], ["1992-07-03T00:00:00", "Maasa Sudo, Japanese singer"], ["1992-07-03T00:00:00", "Nathalia Ramos, Spanish actress and singer"], ["1992-07-07T00:00:00", "Toni Garrn, German model"], ["1992-07-07T00:00:00", "Holly Hagan, English television personality"], ["1992-07-08T00:00:00", "Kelsey-Beth Crossley, English actress"], ["1992-07-08T00:00:00", "Sky Ferreira, American singer, songwriter, model, and actress"], ["1992-07-10T00:00:00", "Kristin Allen, American acrobatic gymnast"], ["1992-07-10T00:00:00", "Eva Lim, Dutch figure skater"], ["1992-07-20T00:00:00", "Paige Hurd, American actress"], ["1992-07-20T00:00:00", "Jordan Rodrigues, Australian actor"], ["1992-07-21T00:00:00", "Jessica Barden, English actress"], ["1992-07-21T00:00:00", "Rachael Flatt, American figure skater"], ["1992-08-03T00:00:00", "Karlie Kloss, American model"], ["1992-08-04T00:00:00", "Tiffany Evans, American singer"], ["1992-08-04T00:00:00", "Dylan and Cole Sprouse, American twin actors"], ["1992-08-18T00:00:00", "Rebecca Brown, American actress and musician"], ["1992-08-18T00:00:00", "Amy Willerton, British model. Miss Universe GB 2013"], ["1992-08-21T00:00:00", "RJ Mitte, American actor"], ["1992-08-21T00:00:00", "Bobi Mojsoski, Macedonian singer"], ["1992-08-21T00:00:00", "Felipe Nasr, Brazilian race car driver"], ["1992-09-02T00:00:00", "Konrad Abeltshauser, German professional ice hockey player"], ["1992-09-02T00:00:00", "Michele Gumabao, Filipino volleyball player and television personality"], ["1992-09-09T00:00:00", "Frencheska Farr, Filipina singer, model and dancer"], ["1992-09-09T00:00:00", "Damian McGinty, Irish singer and actor"], ["1992-09-11T00:00:00", "Desireé Bassett, American guitarist and recording artist"], ["1992-09-11T00:00:00", "Maria Gabriela de Faría, Venezuelan actress and singer"], ["1992-09-16T00:00:00", "Nick Jonas, American singer-songwriter and actor"], ["1992-09-16T00:00:00", "Jake Roche, British actor and singer (Rixton)"], ["1992-09-21T00:00:00", "Mariya Muzychuk, Ukrainian chess player"], ["1992-09-21T00:00:00", "Chen, South Korean singer (EXO)"], ["1992-09-22T00:00:00", "Philip Hindes, British cyclist"], ["1992-09-24T00:00:00", "Jack Sock, American tennis player"], ["1992-09-28T00:00:00", "Skye McCole Bartusiak, American actress (d. 2014)"], ["1992-09-28T00:00:00", "Keir Gilchrist, Canadian actor"], ["1992-09-28T00:00:00", "Tyler Lockett, American football player"], ["1992-09-28T00:00:00", "Koko Tsurumi, Japanese artistic gymnast"], ["1992-10-05T00:00:00", "Eric Cabral, Canadian actor and voice actor"], ["1992-10-05T00:00:00", "Hirotaka Chiba, Japanese actor and voice actor"], ["1992-10-05T00:00:00", "Lais Ribeiro, Brazilian model"], ["1992-10-28T00:00:00", "Lexi Ainsworth, American actress"], ["1992-10-28T00:00:00", "Jermaine Crawford, American actor"], ["1992-11-10T00:00:00", "Wilfried Zaha, English footballer"], ["1992-11-21T00:00:00", "Conor Maynard, British singer"], ["1992-11-21T00:00:00", "Megan Mace and Liz Mace, American fraternal twin recording artists (Megan and Liz)"], ["1992-11-23T00:00:00", "Miley Cyrus, American actress and singer"], ["1992-11-23T00:00:00", "Gabriel Landeskog, Swedish hockey player"], ["1992-11-23T00:00:00", "EunB, South Korean singer (Ladies' Code) (d. 2014)"], ["1992-11-27T00:00:00", "Chanyeol, South Korean singer (EXO)"], ["1992-11-27T00:00:00", "Tola Szlagowska, Polish singer"], ["1992-11-28T00:00:00", "Adam Hicks, American rapper, actor and dancer"], ["1992-11-28T00:00:00", "Jake Miller, American rapper and songwriter"], ["1992-12-14T00:00:00", "Ryo Miyaichi, Japanese footballer"], ["1992-01-01T00:00:00", "Grace Hopper, American computer scientist (b. 1906)"], ["1992-01-01T00:00:00", "George M. Ferris, American investment banker and philanthropist (b. 1893)"], ["1992-01-01T00:00:00", "Edward Leslie Gray, politician and member of the Legislative Assembly of Alberta from Alberta, Canada (b. 1895)"], ["1992-01-01T00:00:00", "Kenneth Emory, American anthropologist (b. 1897)"], ["1992-01-01T00:00:00", "Josef R. Sheetz, American military commander during World War II (b. 1895)"], ["1992-01-01T00:00:00", "Francis J. Field, philatelist and stamp dealer (b. 1895)"], ["1992-01-09T00:00:00", "Bill Naughton, British playwright (b. 1910)"], ["1992-01-09T00:00:00", "Hans Jenny (pedologist), soil scientist and expert on pedology (b. 1899)"], ["1992-01-11T00:00:00", "Shanda Sharer, American murder victim (b. 1979)"], ["1992-01-18T00:00:00", "Aleksandr Almetov, Soviet Olympic ice hockey player (b. 1940)"], ["1992-01-18T00:00:00", "Theodore Leslie Futch, United States Army officer with the rank of Brigadier General (b. 1895)"], ["1992-01-23T00:00:00", "Freddie Bartholomew, British actor (b. 1924)"], ["1992-01-23T00:00:00", "Ian Wolfe, American actor (b. 1896)"], ["1992-01-27T00:00:00", "Sally Hayfron, Wife of Robert Mugabe and first lady of Zimbabwe (b. 1933)"], ["1992-01-27T00:00:00", "Gwen Ffrangcon-Davies, British actress and centenarian (b. 1891)"], ["1992-01-31T00:00:00", "Mel Hein, American football player (New York Giants) and member of the Pro Football Hall of Fame (b.1909)"], ["1992-02-16T00:00:00", "Jules Gros, Breton linguist specializing in popular language (b. 1890)"], ["1992-02-16T00:00:00", "Angela Carter, English novelist and journalist (b. 1940)"], ["1992-02-16T00:00:00", "Jânio Quadros, 22nd President of Brazil (b. 1917)"], ["1992-02-16T00:00:00", "Abbas al-Musawi, Lebanese Shia cleric and Secretary General of Hezbollah (b. 1952)."], ["1992-02-20T00:00:00", "Dick York, American actor (b. 1928)"], ["1992-02-20T00:00:00", "Roberto D'Aubuisson, Salvadorean Army officer and right-wing political leader (b. 1944)"], ["1992-02-20T00:00:00", "A. J. Casson, member of the Canadian group of artists known as the Group of Seven (b. 1898)"], ["1992-02-20T00:00:00", "Eugene R. Black, Sr., American banker, former president of the World Bank (b. 1898)"], ["1992-02-29T00:00:00", "Buddy O'Grady, American basketball player and coach (b. 1920)"], ["1992-03-04T00:00:00", "Néstor Almendros, Spanish cinematographer (b. 1930)"], ["1992-03-04T00:00:00", "Art Babbitt, American animator (b. 1907)"], ["1992-03-11T00:00:00", "László Benedek, Hungarian film director (b. 1905)"], ["1992-03-11T00:00:00", "Richard Brooks, American film director (b. 1912)"], ["1992-03-11T00:00:00", "Liu Geping, Chinese politician (b. 1904)"], ["1992-03-21T00:00:00", "John Ireland, American actor (b. 1914)"], ["1992-03-21T00:00:00", "Natalie Sleeth, American composer (b. 1930)"], ["1992-03-26T00:00:00", "Barbara Frum, Canadian journalist (b. 1937)"], ["1992-04-04T00:00:00", "Samuel Reshevsky, seven-time U.S. Chess Champion (b. 1911)"], ["1992-04-04T00:00:00", "Vintilă Horia, Romanian writer (b. 1915)"], ["1992-04-05T00:00:00", "Nawab Zulfikar Ali Khan, Indian Royal- Titular Nawab of Rampur; Indian politician and army major (b. 1933)"], ["1992-04-05T00:00:00", "Suada Dilberović, Bosnian medical student. First casualty of the Siege of Sarajevo (b. 1968)"], ["1992-04-05T00:00:00", "Molly Picon, American actress (b. 1898)"], ["1992-04-05T00:00:00", "Sam Walton, American businessman, founder of Wal-Mart (b. 1918)"], ["1992-04-10T00:00:00", "Peter D. Mitchell, British biochemist, recipient of the Nobel Prize in Chemistry (b. 1920)"], ["1992-04-10T00:00:00", "Sam Kinison, American comedian (b. 1953)"], ["1992-04-14T00:00:00", "David Miller, American film director (b. 1909)"], ["1992-04-14T00:00:00", "Sammy Price, American pianist and bandleader (b. 1908)"], ["1992-04-19T00:00:00", "Frankie Howerd, British comedian and actor (b. 1917)"], ["1992-04-19T00:00:00", "Kristen French, Canadian murder victim (b. 1976)"], ["1992-04-23T00:00:00", "Czesław Zbierański, Polish engineer, pioneer of Polish aviation, major of Polish Army (b. 1885)"], ["1992-04-23T00:00:00", "Satyajit Ray, Indian filmmaker (b. 1921)"], ["1992-04-23T00:00:00", "Elmer Allison, American socialist political activist and newspaper editor (b. 1883)"], ["1992-04-23T00:00:00", "Tanka Prasad Acharya Nepalese politician, former Prime Minister (b.1912)"], ["1992-05-13T00:00:00", "Gisela Elsner, German writer (b. 1937)"], ["1992-05-13T00:00:00", "F. E. McWilliam, Northern Irish sculptor (b. 1909)"], ["1992-05-14T00:00:00", "Lyle Alzado, American football player (b. 1949)"], ["1992-05-14T00:00:00", "Nie Rongzhen, Chinese Communist military leader (b. 1899)"], ["1992-05-18T00:00:00", "Janusz Kruk, Polish musician (b. 1946)"], ["1992-05-18T00:00:00", "Jake Leicht, American athlete (b. 1919)"], ["1992-05-18T00:00:00", "Skip Stephenson, American actor and comedian (b. 1940)"], ["1992-05-18T00:00:00", "Marshall Thompson, American actor (b. 1925)"], ["1992-05-22T00:00:00", "Abraham Moles, French sociologist and psychologist (b. 1920)"], ["1992-05-22T00:00:00", "Tony Accardo, American gangster (b. 1906)"], ["1992-05-23T00:00:00", "Atahualpa Yupanqui, Argentine singer, songwriter and guitarist (b. 1908)"], ["1992-05-23T00:00:00", "Giovanni Falcone, Italian judge (b. 1939)"], ["1992-05-23T00:00:00", "William Keene, American actor (b. 1915)"], ["1992-05-25T00:00:00", "Philip Habib, Lebanese-American diplomat (b. 1920)"], ["1992-05-25T00:00:00", "Tulio Demicheli, Argentine film director (b. 1914)"], ["1992-06-07T00:00:00", "Bill France, Sr., American founder of NASCAR (b. 1909)"], ["1992-06-11T00:00:00", "Marjorie Newell Robb, Survivor of the sinking of RMS Titanic in 1912 (b. 1889)"], ["1992-06-15T00:00:00", "Warren Prall Watters,ounding archbishop of the Free Church of Antioch (b. 1890)"], ["1992-06-18T00:00:00", "Carlos Humberto Perette, Argentinian politician, former Vice President (b. 1915)"], ["1992-06-18T00:00:00", "Mordecai Ardon, Israeli painter (b. 1896)"], ["1992-06-18T00:00:00", "Peter Allen, Australian singer, songwriter (b. 1944)"], ["1992-06-21T00:00:00", "Joan Fuster, Spanish writer (b. 1922)"], ["1992-06-21T00:00:00", "Li Xiannian, former President of the People's Republic of China and one of the Eight Elders of the Communist Party of China (b. 1909)"], ["1992-06-25T00:00:00", "Jerome Brown, American football player (b. 1965)"], ["1992-06-25T00:00:00", "James Stirling, British architect (b. 1926)"], ["1992-06-28T00:00:00", "Mikhail Tal, eighth World Chess Champion (b. 1936)"], ["1992-06-28T00:00:00", "Guy Nève, racing driver (b. 1955)"], ["1992-06-29T00:00:00", "Mohamed Boudiaf, Algerian politician, president of the Republic (b. 1919)"], ["1992-06-29T00:00:00", "Pierre Billotte, French Army officer and politician (b. 1906)"], ["1992-07-04T00:00:00", "Ástor Piazzolla, Argentine tango composer (b. 1921)"], ["1992-07-04T00:00:00", "Francis Perrin, French nuclear physicist (b. 1901)"], ["1992-07-05T00:00:00", "Paul Hackman, Canadian musician (b. 1953)"], ["1992-07-10T00:00:00", "Albert Pierrepoint, British executioner (b. 1905)"], ["1992-07-10T00:00:00", "Doris Tate, American campaigner for the rights of crime victims (b. 1924)"], ["1992-07-13T00:00:00", "Alex Wojciechowicz, American football player (Detroit Lions) and member of the Pro Football Hall of Fame (b. 1915)"], ["1992-07-13T00:00:00", "Cicely Williams, Jamaican physician (b. 1893)"], ["1992-07-14T00:00:00", "Giuseppe Prezzolini, Italian literary critic, journalist, editor and writer (b. 1882)"], ["1992-07-15T00:00:00", "Hammer DeRoburt, first President of Nauru (b. 1922)"], ["1992-07-16T00:00:00", "Buck Buchanan, American football player (Kansas City Chiefs) and member of the Pro Football Hall of Fame (b. 1940)"], ["1992-07-19T00:00:00", "Allen Newell, computer scientist (b. 1927)"], ["1992-07-19T00:00:00", "Paolo Borsellino, Italian judge (b. 1940)"], ["1992-07-23T00:00:00", "Rosemary Sutcliff, British author (b. 1920)"], ["1992-07-23T00:00:00", "Suleiman Frangieh, Lebanese statesman, former President of the Republic (b. 1910)"], ["1992-07-30T00:00:00", "Brenda Marshall, American actress (b. 1915)"], ["1992-07-30T00:00:00", "Joe Shuster, Canadian-American comic book artist (b. 1914)"], ["1992-08-03T00:00:00", "Wang Hongwen, Chinese Communist politician (b. 1935)"], ["1992-08-03T00:00:00", "Bertil Ohlin, Swedish economist and politician (b. 1899)"], ["1992-08-04T00:00:00", "František Tomášek, Czech Catholic cardinal (b. 1899)"], ["1992-08-04T00:00:00", "Seichō Matsumoto, Japanese writer and journalist (b. 1909)"], ["1992-08-05T00:00:00", "Rob Muldoon, former Prime Minister of New Zealand (b. 1921)"], ["1992-08-05T00:00:00", "Jeff Porcaro, American musician (b. 1954)"], ["1992-08-08T00:00:00", "Abolqassem Al Khoei, Iranian-Iraqi Shia ayatollah and scholar (b. 1899)"], ["1992-08-08T00:00:00", "Alison Gertz, American AIDS activist (b. 1966)"], ["1992-08-18T00:00:00", "John Sturges, American film director (b. 1911)"], ["1992-08-18T00:00:00", "Keith Henderson, Scottish painter (b. 1911)"], ["1992-08-18T00:00:00", "Christopher McCandless, American itinerant and hiker, Starvation (b. 1968)"], ["1992-08-19T00:00:00", "Curtis M. Scott, American role-playing game designer (birth unknown, age 32)"], ["1992-09-01T00:00:00", "Morris Carnovsky, American actor (b. 1897)"], ["1992-09-01T00:00:00", "Piotr Jaroszewicz, Polish politician, former Prime Minister (b. 1909)"], ["1992-09-04T00:00:00", "John van Dreelen, Dutch actor (b. 1922)"], ["1992-09-05T00:00:00", "Billy Herman, American baseball player (Chicago Cubs) and member of the MLB Hall of Fame) (b. 1909)"], ["1992-09-05T00:00:00", "Fritz Leiber, American author (b. 1910)"], ["1992-09-06T00:00:00", "Mervyn Johns, distinctive Welsh film and television character actor (b. 1899)"], ["1992-09-12T00:00:00", "Anthony Perkins, American actor (b. 1932)"], ["1992-09-12T00:00:00", "Ruth Nelson, American actress (b. 1905)"], ["1992-09-12T00:00:00", "Hans F. Koenekamp, American special effects artist and cinematographer (b. 1891)"], ["1992-09-18T00:00:00", "Princess Margaret of Denmark,princess of Denmark and Iceland (b. 1895)"], ["1992-09-21T00:00:00", "Bill Williams, American actor"], ["1992-10-04T00:00:00", "Denny Hulme, New Zealand race car driver (b. 1936)"], ["1992-10-05T00:00:00", "Eddie Kendricks, American singer (b. 1939)"], ["1992-10-12T00:00:00", "John Hancock, American actor (b. 1941)"], ["1992-10-12T00:00:00", "Ulysses Guimarães, Brazilian politician (b. 1916)"], ["1992-10-17T00:00:00", "Yoshihiro Hattori, Japanese exchange student (b. 1975)"], ["1992-10-17T00:00:00", "Herman Johannes, Indonesian professor, scientist and politician (b. 1912)"], ["1992-10-19T00:00:00", "Arthur Wint, Jamaican Olympic runner (b. 1920)"], ["1992-10-19T00:00:00", "Gert Bastian, German politician (b. 1913)"], ["1992-10-19T00:00:00", "Petra Kelly, German politician (b. 1947)"], ["1992-10-22T00:00:00", "Red Barber, American sportscaster (b. 1908)"], ["1992-10-22T00:00:00", "Cleavon Little, American actor (b. 1939)"], ["1992-10-24T00:00:00", "Laurie Colwin, American author (b. 1944)"], ["1992-10-25T00:00:00", "Roger Miller, American singer (b. 1936)"], ["1992-10-25T00:00:00", "Adelino da Palma Carlos, Portuguese politician, former Prime Minister (b. 1905)"], ["1992-10-31T00:00:00", "Gary Rippingale, English ice hockey player (b. 1974)"], ["1992-11-04T00:00:00", "George Klein, Canadian inventor (b. 1904)"], ["1992-11-04T00:00:00", "José Luis Sáenz de Heredia, Spanish film director (b. 1911)"], ["1992-11-07T00:00:00", "Alexander Dubček, Slovakian politician, former First Secretary of the Communist Party of Czechoslovakia (b. 1921)"], ["1992-11-07T00:00:00", "Jack Kelly, American actor (b. 1927)"], ["1992-11-07T00:00:00", "Richard Yates, American writer (b. 1926)"], ["1992-11-23T00:00:00", "Roy Acuff, American singer (b. 1903)"], ["1992-11-23T00:00:00", "Mohamed Benhima, former Prime Minister of Morocco (b. 1924)"], ["1992-11-29T00:00:00", "Emilio Pucci, Italian fashion designer (b. 1914)"], ["1992-11-29T00:00:00", "Jean Dieudonné, French mathematician (b. 1906)"], ["1992-12-01T00:00:00", "Esau Khamati Oriedo, Kenyan of African ancestry; an anti-colonialism activist and crusader (b. 1888)"], ["1992-12-02T00:00:00", "Michael Gothard, British actor (b. 1939)"], ["1992-12-03T00:00:00", "Luis Alcoriza, Mexican film director (b. 1918)"], ["1992-12-03T00:00:00", "Nureddin al-Atassi, Syrian Baathist, former President of the Republic (b. 1929)"], ["1992-12-06T00:00:00", "Mimi Smith, maternal aunt and guardian of John Lennon (b. 1906)"], ["1992-12-06T00:00:00", "Percy Herbert, English actor (b. 1920)"], ["1992-12-12T00:00:00", "Ali Amini, Iranian politician, former Prime Minister of Iran (b. 1905)"], ["1992-12-12T00:00:00", "Suzanne Lilar, Belgian essayist, novelist and playwright (b. 1901)"], ["1992-12-21T00:00:00", "Stella Adler, American acting teacher (b. 1901)"], ["1992-12-21T00:00:00", "Nathan Milstein, Ukrainian-born violinist (b. 1903)"], ["1992-12-21T00:00:00", "Albert King, American musician (b. 1923)"], ["1992-12-22T00:00:00", "Frederick William Franz, a member of the Governing Body of Jehovah's Witnesses and 4th President of Watch Tower Bible and Tract Society (b. 1893)"], ["1992-12-22T00:00:00", "Ted Willis, British television dramatist and author (b. 1914)"], ["1992-12-25T00:00:00", "Ted Croker, English former football official (b. 1924)"], ["1992-12-25T00:00:00", "Monica Dickens, English author (b. 1915)"], ["1992-12-25T00:00:00", "Jules Gros, Breton linguist specializing in popular language (b. 1890)"]]