[["1957-01-01T00:00:00", "The Saarland joins West Germany."], ["1957-01-01T00:00:00", "An Irish Republican Army attack on the Brookeborough police barracks leads to the deaths of Seán South and Fergal O'Hanlon."], ["1957-01-01T00:00:00", "Italian conductor Arturo Toscanini suffers the stroke that leads to his death a little over two weeks later."], ["1957-01-02T00:00:00", "The San Francisco and Los Angeles stock exchanges merge to form the Pacific Coast Stock Exchange."], ["1957-01-03T00:00:00", "Hamilton Watch Company introduces the first electric watch."], ["1957-01-04T00:00:00", "After 69 years the last issue of Collier's Weekly magazine is published."], ["1957-01-05T00:00:00", "Russell Endean becomes the first batsman to be dismissed for having handled the ball in test match cricket."], ["1957-01-06T00:00:00", "Elvis Presley appears on The Ed Sullivan Show for the 3rd and final time. He is only shown from the waist up, even during the gospel segment, singing \"Peace In The Valley\". Ed Sullivan describes Elvis thus: \"This is a real decent, fine boy. We've never had a pleasanter experience on our show with a big name than we've had with you. You're thoroughly all right.\""], ["1957-01-09T00:00:00", "British Prime Minister Anthony Eden resigns."], ["1957-01-10T00:00:00", "Harold Macmillan becomes the Prime Minister of the United Kingdom."], ["1957-01-11T00:00:00", "The African Convention is founded in Dakar."], ["1957-01-13T00:00:00", "Wham-O Company produces the first Frisbee."], ["1957-01-14T00:00:00", "Kripalu Maharaj is named fifth Jagadguru (world teacher) after giving seven days of speeches before 500 Hindu scholars. - Humphrey Bogart passes away after a long battle with cancer."], ["1957-01-15T00:00:00", "Release, in Japan, of the film Throne of Blood, Akira Kurosawa's reworking of Macbeth."], ["1957-01-16T00:00:00", "The Cavern Club opens in Liverpool."], ["1957-01-20T00:00:00", "Dwight D. Eisenhower is inaugurated for a second term as President of the United States."], ["1957-01-20T00:00:00", "Israel withdraws from the Sinai Peninsula (captured from Egypt on October 29, 1956)."], ["1957-01-20T00:00:00", "The New York City \"Mad Bomber\", George P. Metesky, is arrested in Waterbury, Connecticut, and is charged with planting more than 30 bombs."], ["1957-01-23T00:00:00", "Ku Klux Klan members force truck driver Willie Edwards to jump off a bridge into the Alabama River; he drowns as a result."], ["1957-01-26T00:00:00", "The Ibirapuera Planetarium (the first in the Southern Hemisphere) is inaugurated in the city of São Paulo, Brazil."], ["1957-01-31T00:00:00", "Three students on a junior high school playground in Pacoima, California, are among the 8 persons killed following a mid-air collision between a Douglas DC-7 airliner and a Northrop F-89 Scorpion fighter jet, in the skies above the San Fernando Valley section of Los Angeles, US."], ["1957-02-02T00:00:00", "President Iskander Mirza of Pakistan lays the foundation-stone of the Guddu Barrage across the Indus River near Sukkur."], ["1957-02-04T00:00:00", "France prohibits U.N. involvement in Algeria."], ["1957-02-04T00:00:00", "The first nuclear-powered submarine, the USS Nautilus, logs its 60,000th nautical mile, matching the endurance of the fictional Nautilus described in Jules Verne's novel \"20,000 Leagues Under the Sea\". It is decommissioned on March 3, 1980."], ["1957-02-04T00:00:00", "A coal gas explosion at the giant Bishop coal mine in Bishop, Virginia kills 37 men."], ["1957-02-06T00:00:00", "The Soviets announce that Raoul Wallenberg had died in a Soviet prison \"possibly of a heart attack\" on July 17, 1947."], ["1957-02-15T00:00:00", "Andrei Gromyko becomes foreign minister of the Soviet Union."], ["1957-02-16T00:00:00", "The \"Toddlers' Truce\", a controversial television closedown between 6.00 p.m. and 7.00 p.m., is abolished in the United Kingdom."], ["1957-02-16T00:00:00", "Ingmar Bergman's film The Seventh Seal opens in Sweden."], ["1957-02-17T00:00:00", "A fire at a home for the elderly in Warrenton, Missouri, kills 72 people."], ["1957-02-18T00:00:00", "Kenyan rebel leader Dedan Kimathi is executed by the British colonial government."], ["1957-02-18T00:00:00", "The last person to be executed in New Zealand, Walter James Bolton, is hanged at Mount Eden Prison for poisoning his wife."], ["1957-02-23T00:00:00", "The founding congress of the Senegalese Popular Bloc opens in Dakar."], ["1957-02-25T00:00:00", "The Boy In The Box is discovered along a sidewalk in Philadelphia, Pennsylvania. The boy is described as Caucasian in appearance and 4 to 6 years old. The case still remains unsolved."], ["1957-03-01T00:00:00", "U Nu becomes Prime Minister of Burma."], ["1957-03-01T00:00:00", "Arturo Lezama becomes President of the National Council of Government of Uruguay."], ["1957-03-01T00:00:00", "Sud Aviation forms from a merger between SNCASE (Société Nationale de Constructions Aéronautiques du Sud Est) and SNCASO (Société Nationale de Constructions Aéronautiques du Sud Ouest)."], ["1957-03-01T00:00:00", "Dr. Seuss' The Cat in the Hat is published in the United States."], ["1957-03-03T00:00:00", "Net als toen by Corry Brokken (music by Guus Jansen, text by Willy van Hemert) wins the Eurovision Song Contest 1957 for the Netherlands."], ["1957-03-04T00:00:00", "Standard & Poor's first publishes the S&P 500 guide."], ["1957-03-06T00:00:00", "United Kingdom colonies Gold Coast and British Togoland become the independent nation of Ghana."], ["1957-03-06T00:00:00", "Zodi Ikhia founds the Nigerien Democratic Front (FDN) in Niger."], ["1957-03-07T00:00:00", "The United States Congress approves the Eisenhower Doctrine on assistance to threatened foreign regimes."], ["1957-03-08T00:00:00", "Egypt re-opens the Suez Canal."], ["1957-03-10T00:00:00", "Floodgates of The Dalles Dam are closed, inundating Celilo Falls and ancient Indian fisheries along the Columbia River in Oregon."], ["1957-03-13T00:00:00", "The United States Federal Bureau of Investigation arrests labor union leader Jimmy Hoffa and charges him with bribery."], ["1957-03-13T00:00:00", "The Anglo-Jordanian Treaty of 1948 expires."], ["1957-03-14T00:00:00", "President Sukarno declares martial law in Indonesia."], ["1957-03-17T00:00:00", "1957 Cebu Douglas C-47 crash: Philippine President Ramon Magsaysay and 24 others are killed in a plane crash."], ["1957-03-20T00:00:00", "The French news magazine L'Express reveals that the French army tortures Algerian prisoners."], ["1957-03-25T00:00:00", "The Treaty of Rome (patto di Roma) establishes the European Economic Community (EEC; predecessor of the European Union) between Italy, France, West Germany, Belgium, the Netherlands and Luxembourg."], ["1957-03-26T00:00:00", "22-year-old Elvis Presley buys Graceland on 3734 Bellevue Boulevard (Highway 51 South) for $US100,000. He and his family move from the house on 1034 Audubon Drive."], ["1957-03-27T00:00:00", "The 29th Academy Awards ceremony is held in Hollywood. Around the World in 80 Days wins Best Picture."], ["1957-03-31T00:00:00", "Rodgers and Hammerstein's Cinderella, the team's only musical written especially for television, is telecast live and in color by CBS, starring Julie Andrews in the title role. The production is seen by millions, but this 1957 version is not to be telecast again for more than 40 years, when a kinescope of it is shown."], ["1957-04-01T00:00:00", "The first new conscripts join the Bundeswehr."], ["1957-04-05T00:00:00", "The Communist Party of India wins the elections in Kerala, making E. M. S. Namboodiripad its first chief minister."], ["1957-04-09T00:00:00", "Egypt reopens the Suez Canal to all shipping."], ["1957-04-12T00:00:00", "The United Kingdom announces that Singapore will gain self-rule on January 1, 1958."], ["1957-04-12T00:00:00", "Allen Ginsberg's Howl and Other Poems, printed in England, is seized by U.S. customs officials on the grounds of obscenity."], ["1957-04-15T00:00:00", "The Distant Early Warning Line is handed over by contractors to the U.S. and Canadian military."], ["1957-04-15T00:00:00", "White Rock secedes from Surrey, British Columbia, following a referendum."], ["1957-04-17T00:00:00", "Suspected English serial killer John Bodkin Adams is found not guilty of murder at the Old Bailey."], ["1957-04-24T00:00:00", "First broadcast of BBC Television astronomy series The Sky at Night in the U.K., presented by Patrick Moore. This will run with the same presenter until his death in December 2012."], ["1957-05-02T00:00:00", "Vincent Gigante fails to assassinate mafioso Frank Costello in Manhattan."], ["1957-05-03T00:00:00", "Brooklyn Dodgers owner Walter O'Malley agrees to move the team from Brooklyn, New York, to Los Angeles."], ["1957-05-16T00:00:00", "Paul-Henri Spaak becomes the new Secretary General of NATO."], ["1957-05-22T00:00:00", "42,000-pound hydrogen bomb accidentally fell from a bomber near Albuquerque "], ["1957-05-24T00:00:00", "Anti-American riots erupt in Taipei, Taiwan."], ["1957-05-30T00:00:00", "Real Madrid beats Fiorentina 2-0 at Santiago Bernabéu Stadium, Madrid and wins the 1956-57 European Cup (football)."], ["1957-06-01T00:00:00", "Three-year-old thoroughbred Gallant Man wins the Peter Pan Stakes at Belmont Park."], ["1957-06-09T00:00:00", "Broad Peak, on the China-Pakistan border, is first ascended."], ["1957-06-15T00:00:00", "Oklahoma celebrates its semi-centennial statehood. A brand new 1957 Plymouth Belvedere is buried in a time capsule (to be opened 50 years later on June 15, 2007)."], ["1957-06-15T00:00:00", "Gallant Man wins the Belmont Stakes at Belmont Park in record time."], ["1957-06-20T00:00:00", "Toru Takemitsu's Requiem for Strings is first performed, by the Tokyo Symphony Orchestra."], ["1957-06-21T00:00:00", "John Diefenbaker becomes the 13th Prime Minister of Canada."], ["1957-06-25T00:00:00", "The United Church of Christ is formed in Cleveland, Ohio, by the merger of the Congregational Christian Churches and the Evangelical and Reformed Church."], ["1957-06-27T00:00:00", "Hurricane Audrey demolishes Cameron, Louisiana, U.S., killing 400 people."], ["1957-07-06T00:00:00", "John Lennon and Paul McCartney meet for the first time, as teenagers at Woolton Fete, 3 years before forming the Beatles."], ["1957-07-09T00:00:00", "Elvis Presley's Loving You opens in theaters."], ["1957-07-11T00:00:00", "His Highness Prince Karim Aga Khan becomes the 49th Imam of the Shia Ismaili Muslims at age 20. His grandfather Sir Sultan Mohammed Shah Aga Khan III appoints Prince Karim in his will."], ["1957-07-14T00:00:00", "Rawya Ateya takes her seat in the National Assembly of Egypt, thereby becoming the first female parliamentarian in the Arab world."], ["1957-07-16T00:00:00", "United States Marine Major John Glenn flies an F8U supersonic jet from California to New York in 3 hours, 23 minutes and 8 seconds, setting a new transcontinental speed record."], ["1957-07-25T00:00:00", "Tunisia becomes a republic, with Habib Bourguiba its first president."], ["1957-07-28T00:00:00", "The 6th World Festival of Youth and Students, a high point of the Khrushchev Thaw, kicks off in Moscow."], ["1957-07-28T00:00:00", "Heavy rains and mudslides at Isahaya, western Kyūshū, Japan, kill 992."], ["1957-07-28T00:00:00", "A strong earthquake shakes Mexico City and Mexican port city Acapulco."], ["1957-07-29T00:00:00", "The International Atomic Energy Agency is established."], ["1957-08-04T00:00:00", "Juan Manuel Fangio, driving for Maserati, wins the Formula One German Grand Prix, clinching (with 4 wins that season) his record 5th world drivers championship, including his 4th consecutive championship (also a record); these 2 records endure for nearly half a century."], ["1957-08-05T00:00:00", "American Bandstand, a local dance show produced by WFIL-TV in Philadelphia, joins the ABC Television Network."], ["1957-08-21T00:00:00", "U.S. President Dwight D. Eisenhower announces a 2-year suspension of nuclear testing."], ["1957-08-28T00:00:00", "United States Senator Strom Thurmond (D-SC) sets the record for the longest filibuster with his 24-hour, 18-minute speech railing against a civil rights bill."], ["1957-08-31T00:00:00", "The Federation of Malaya gains independence from the United Kingdom. Tuanku Abdul Rahman ibni Almarhum Tuanku Muhammad, Yang di-Pertuan Besar of Negeri Sembilan becomes the first Yang di-Pertuan Agong of Malaya."], ["1957-08-31T00:00:00", "Malaysia National Day"], ["1957-09-01T00:00:00", "175 die in Jamaica's worst railway disaster."], ["1957-09-03T00:00:00", "The Wolfenden report on homosexuality is published in the United Kingdom."], ["1957-09-04T00:00:00", "American Civil Rights Movement - Little Rock Crisis: Governor Orval Faubus of Arkansas calls out the US National Guard, to prevent African-American students from enrolling in Central High School in Little Rock."], ["1957-09-04T00:00:00", "The Ford Motor Company introduces the Edsel on what the company proclaims as \"E Day\"."], ["1957-09-05T00:00:00", "The first edition of Jack Kerouac's On the Road goes on sale."], ["1957-09-07T00:00:00", "NBC introduces an animated version of its famous \"living color\" peacock logo."], ["1957-09-09T00:00:00", "Catholic Memorial School opens its doors for the first time in Boston."], ["1957-09-14T00:00:00", "Have Gun, Will Travel premieres on CBS."], ["1957-09-21T00:00:00", "Olav V becomes King of Norway on the death of his father Haakon VII."], ["1957-09-21T00:00:00", "The sailing ship Pamir sinks off the Azores in a hurricane."], ["1957-09-23T00:00:00", "The Academy Award-winning movie The Three Faces of Eve is released."], ["1957-09-24T00:00:00", "U.S. President Dwight D. Eisenhower sends federal troops to Arkansas to provide safe passage into Central High School for the Little Rock Nine."], ["1957-09-26T00:00:00", "Leonard Bernstein's musical West Side Story makes its first appearance on Broadway and runs for 732 performances."], ["1957-09-29T00:00:00", "The Kyshtym disaster occurs at the Mayak nuclear reprocessing plant in Russia."], ["1957-10-02T00:00:00", "David Lean's film The Bridge on the River Kwai opens in the UK."], ["1957-10-04T00:00:00", "Space Age - Sputnik program: The Soviet Union launches Sputnik 1, the first artificial satellite to orbit the earth."], ["1957-10-04T00:00:00", "Canada's Avro Arrow is unveiled to the public."], ["1957-10-04T00:00:00", "The sitcom Leave It to Beaver premieres on CBS."], ["1957-10-09T00:00:00", "Neil H. McElroy is sworn in as United States Secretary of Defense."], ["1957-10-10T00:00:00", "U.S. President Dwight D. Eisenhower apologizes to the finance minister of Ghana, Komla Agbeli Gbedemah, after he is refused service in a Dover, Delaware restaurant."], ["1957-10-10T00:00:00", "A fire at the Windscale power station in the UK releases radioactive material into the surrounding environment, including iodine-131."], ["1957-10-11T00:00:00", "The Jodrell Bank radio telescope opens in Cheshire, UK."], ["1957-10-11T00:00:00", "The orbit of the last stage of the R-7 Semyorka rocket (carrying Sputnik I) is first successfully calculated on an IBM 704 computer by teams at The M.I.T. Computation Center and Operation Moonwatch, Cambridge, Massachusetts."], ["1957-10-12T00:00:00", "Ayn Rand's novel Atlas Shrugged is published."], ["1957-10-16T00:00:00", "Antonio Vilas Boas, a Brazilian farmer claims to have been abducted by extraterrestrials. in what is known to be the first famous abduction case."], ["1957-10-21T00:00:00", "Two trains collide in Turkey; 95 die."], ["1957-10-21T00:00:00", "The U.S. military sustains its first combat fatality in Vietnam, Army Capt. Hank Cramer of the 1st Special Forces Group."], ["1957-10-23T00:00:00", "Morocco begins its invasion of Ifni."], ["1957-10-25T00:00:00", "Mafia boss Albert Anastasia is assassinated in a barber shop, at the Park Sheraton Hotel in New York City, US."], ["1957-10-27T00:00:00", "Celâl Bayar is re-elected president of Turkey."], ["1957-10-31T00:00:00", "Toyota begins exporting vehicles to the U.S., beginning with the Toyota Crown and the Toyota Land Cruiser"], ["1957-11-01T00:00:00", "The Mackinac Bridge, the world's longest suspension bridge between anchorages at the time, opens in the US to connect Michigan's two peninsulas."], ["1957-11-01T00:00:00", "The westbound tube AKA the first tube of the Hampton Roads Bridge-Tunnel linking to Norfolk, Virginia and Hampton, Virginia opens at a cost of $44 million."], ["1957-11-03T00:00:00", "Sputnik program: The Soviet Union launches Sputnik 2, with the first animal to orbit the Earth (a dog named Laika) on board."], ["1957-11-07T00:00:00", "Cold War: In the United States, the Gaither Report calls for more American missiles and fallout shelters."], ["1957-11-08T00:00:00", "Film Jailhouse Rock opens across the U.S. to reach #3, and Elvis Presley continues to gain more notoriety."], ["1957-11-13T00:00:00", "Gordon Gould invents the laser."], ["1957-11-13T00:00:00", "Flooding in the Po Valley of Italy leads to flooding also in Venice."], ["1957-11-14T00:00:00", "Apalachin Meeting: American Mafia leaders meet in Apalachin, New York at the house of Joseph Barbara; the meeting is broken up by a curious patrolman."], ["1957-11-15T00:00:00", "A plane crash in the Isle of Wight leaves 43 dead."], ["1957-11-15T00:00:00", "Yugoslavia announces the end of an economic boycott of Franco's Spain (although it does not reinstitute diplomatic relations)."], ["1957-11-16T00:00:00", "Serial killer Edward Gein murders his last victim, Bernice Worden of Plainfield, Wisconsin, US."], ["1957-11-16T00:00:00", "U.S. President Dwight D. Eisenhower has a stroke."], ["1957-11-16T00:00:00", "Adnan Menderes of DP forms the new government of Turkey (23rd government,last government formed by DP and Adnan Menderes)"], ["1957-11-30T00:00:00", "Indonesian president Sukarno survives a grenade attack at the Cikini School in Jakarta, but six children are killed."], ["1957-12-01T00:00:00", "In Indonesia, Sukarno announces the nationalization of 246 Dutch businesses."], ["1957-12-04T00:00:00", "The Lewisham train disaster in the UK leaves 92 dead."], ["1957-12-05T00:00:00", "All 326,000 Dutch nationals are expelled from Indonesia."], ["1957-12-06T00:00:00", "The first U.S. attempt to launch a satellite fails when the Vanguard rocket blows up on the launch pad."], ["1957-12-10T00:00:00", "Canadian diplomat Lester B. Pearson receives the Nobel Peace Prize for his peacekeeping efforts in the United Nations."], ["1957-12-18T00:00:00", "The Bridge on the River Kwai is released in the U.S. It goes on to win the Academy Award for Best Picture. Additional Oscars go to Alec Guinness (Best Actor) and David Lean (Best Director), among others. This is Lean's first Oscar for directing."], ["1957-12-19T00:00:00", "Meredith Willson's classic musical The Music Man, starring Robert Preston, debuts on Broadway."], ["1957-12-20T00:00:00", "The Boeing 707 airliner flies for the first time."], ["1957-12-22T00:00:00", "The CBS afternoon anthology series Seven Lively Arts presents Tchaikovsky's ballet The Nutcracker on U.S. television for the first time, although heavily abridged."]]