[["2009-01-01T00:00:00", "Austria, Japan, Mexico, Turkey, and Uganda assume their seats on the United Nations Security Council."], ["2009-01-01T00:00:00", "Asunción, the capital of Paraguay, becomes the American Capital of Culture and Vilnius and Linz become the European Capitals of Culture."], ["2009-01-01T00:00:00", "Slovakia adopts the euro as its national currency, replacing the Slovak koruna."], ["2009-01-03T00:00:00", "Israel launches a ground invasion of the Gaza Strip as the Gaza War enters its second week."], ["2009-01-07T00:00:00", "Russia shuts off all gas supplies to Europe through Ukraine. Prime Minister Vladimir Putin publicly endorses the move and urges greater international involvement in the energy dispute."], ["2009-01-13T00:00:00", "Ethiopian military forces begin pulling out of Somalia, where they have tried to maintain order for nearly two years."], ["2009-01-17T00:00:00", "Israel announces a unilateral ceasefire in the Gaza War. It comes into effect the following day, on which Hamas declares a ceasefire of its own."], ["2009-01-20T00:00:00", "Barack Obama succeeds George W. Bush as the 44th President of the United States, and becomes the first African-American President."], ["2009-01-21T00:00:00", "Israel completes its withdrawal from the Gaza Strip. Intermittent air strikes by both sides of the preceding war continue in the weeks to follow."], ["2009-01-22T00:00:00", "Congolese rebel leader Laurent Nkunda is captured by Rwandan forces after crossing over the border into Rwanda."], ["2009-01-26T00:00:00", "The first trial at the International Criminal Court is held. Former Union of Congolese Patriots leader Thomas Lubanga is accused of training child soldiers to kill, pillage, and rape."], ["2009-01-26T00:00:00", "The Icelandic government and banking system collapse; Prime Minister Geir Haarde immediately resigns."], ["2009-02-01T00:00:00", "Patriarch Kirill of Moscow is enthroned as the Patriarch of the Russian Orthodox Church."], ["2009-02-01T00:00:00", "Jóhanna Sigurðardóttir is appointed as the new Prime Minister of Iceland, becoming the world's first openly lesbian head of government."], ["2009-02-07T00:00:00", "The deadliest bushfires in Australian history begin; they kill 173, injure 500 more, and leave 7,500 homeless. The fires come after Melbourne records the highest-ever temperature (46.4 °C, 115 °F) of any capital city in Australia. The majority of the fires are ignited by either fallen or clashing power lines or deliberately lit."], ["2009-02-08T00:00:00", "The Taliban releases a video of Polish geologist Piotr Stańczak, whom they had abducted a few months earlier, being beheaded. It is the first killing of a Western hostage in Pakistan since American journalist Daniel Pearl was murdered in 2002."], ["2009-02-10T00:00:00", "A Russian and an American satellite collide over Siberia, creating a large amount of space debris."], ["2009-02-11T00:00:00", "Morgan Tsvangirai is sworn in as the new Prime Minister of Zimbabwe following the power-sharing deal with President Robert Mugabe signed in September 2008."], ["2009-02-17T00:00:00", "The JEM rebels in Darfur, Sudan sign a pact with the Sudanese government, planning a ceasefire within the next three months."], ["2009-02-26T00:00:00", "Former Serbian president Milan Milutinović is acquitted by the International Criminal Tribunal for the former Yugoslavia regarding war crimes during the Kosovo War in 1998/1999."], ["2009-03-02T00:00:00", "The President of Guinea-Bissau, João Bernardo Vieira, is assassinated during an armed attack on his residence in Bissau."], ["2009-03-03T00:00:00", "Gunmen attack a bus carrying Sri Lankan cricketers in Lahore, Pakistan, killing eight people and injuring several others."], ["2009-03-04T00:00:00", "The International Criminal Court (ICC) issues an arrest warrant for Sudanese President Omar al-Bashir for war crimes and crimes against humanity in Darfur. Al-Bashir is the first sitting head of state to be indicted by the ICC since its establishment in 2002."], ["2009-03-07T00:00:00", "NASA's Kepler Mission, a space photometer that will search for extrasolar planets in the Milky Way galaxy, is launched from Cape Canaveral Air Force Station, Florida, USA."], ["2009-03-17T00:00:00", "The President of Madagascar, Marc Ravalomanana, is overthrown in a coup d'état, following a month of rallies in Antananarivo. The military appoints opposition leader Andry Rajoelina as the new president."], ["2009-04-01T00:00:00", "Albania and Croatia are admitted to the North Atlantic Treaty Organization (NATO)."], ["2009-04-02T00:00:00", "The second G-20 summit, involving state leaders rather than the usual finance ministers, meets in London. Its main focus is an ongoing global financial crisis."], ["2009-04-05T00:00:00", "North Korea launches a rocket from its Tonghae Satellite Launching Ground, which it says is carrying the Kwangmyŏngsŏng-2 satellite, prompting an emergency meeting of - but no official reaction from - the United Nations Security Council."], ["2009-04-06T00:00:00", "L'Aquila earthquake: A 6.3 magnitude earthquake strikes near L'Aquila, Italy, killing nearly 300 and injuring more than 1,500."], ["2009-04-07T00:00:00", "Former Peruvian President Alberto Fujimori is sentenced to 25 years in prison for ordering killings and kidnappings by security forces."], ["2009-04-08T00:00:00", "Maersk Alabama hijacking: Cargo ship MV Maersk Alabama is captured by Somali pirates, the first successful pirate seizure of a ship registered under the American flag since the 1820s."], ["2009-04-10T00:00:00", "A political crisis begins in Fiji when President Josefa Iloilo suspends the nation's Constitution, dismisses all judges and constitutional appointees and assumes all governance in the country after the Court of Appeal rules that the government of Prime Minister Frank Bainimarama is illegal."], ["2009-04-12T00:00:00", "Maersk Alabama hijacking: The United States Navy rescues Captain Richard Phillips, killing three pirates and capturing a fourth."], ["2009-04-17T00:00:00", "Thirty-four heads of state and government meet in Port of Spain, Trinidad for the 5th Summit of the Americas."], ["2009-04-18T00:00:00", "Roxana Saberi, an Iranian-American journalist, is sentenced to eight years in prison for espionage by an Iranian court. She is released the following month, after an appeals court reduces and suspends her sentence."], ["2009-04-21T00:00:00", "UNESCO launches The World Digital Library."], ["2009-04-24T00:00:00", "2009 swine flu outbreak: The World Health Organization expresses concern at the spread of influenza from Mexico and the United States to other countries. International cases and resulting deaths are confirmed."], ["2009-04-29T00:00:00", "Amidst Russia's effort to improve relations with NATO and with the West in general, NATO expels two Russian diplomats from NATO headquarters in Brussels over a spy scandal in Estonia. Russia's Foreign Ministry criticises the expulsions."], ["2009-05-18T00:00:00", "The third C40 Large Cities Climate Leadership Group meets in Seoul."], ["2009-05-18T00:00:00", "Following more than a quarter-century of fighting, the Sri Lankan Civil War ends with the total military defeat of the LTTE."], ["2009-05-19T00:00:00", "Sri Lanka announces victory in its 27-year war against the terrorist organisation Liberation Tigers of Tamil Eelam."], ["2009-05-23T00:00:00", "Former President of South Korea Roh Moo-hyun, under investigation for alleged bribery during his presidential term, commits suicide."], ["2009-05-25T00:00:00", "North Korea announces that it has conducted a second successful nuclear test in North Hamgyong Province. The United Nations Security Council condemns the reported test."], ["2009-06-01T00:00:00", "Air France Flight 447, en route from Rio de Janeiro, Brazil, to Paris, crashes into the Atlantic Ocean, killing all 228 on board."], ["2009-06-03T00:00:00", "The General Assembly of the Organization of American States votes to lift the 1962 suspension of Cuba from the organization."], ["2009-06-11T00:00:00", "The outbreak of the H1N1 influenza strain, commonly referred to as \"swine flu\", is deemed a global pandemic, becoming the first condition since the Hong Kong flu of 1967-1968 to receive this designation."], ["2009-06-13T00:00:00", "Following the apparent reelection of Iranian president Mahmoud Ahmadinejad, supporters of defeated candidate Mir-Hossein Mousavi accuse the government of fraud, and launch a series of sustained protests; the first such protests in Iran since 1979."], ["2009-06-18T00:00:00", "NASA launches the Lunar Reconnaissance Orbiter/LCROSS probes to the Moon, the first American lunar mission since Lunar Prospector in 1998."], ["2009-06-20T00:00:00", "The death of Neda Agha-Soltan, an Iranian student shot during a protest, is captured on what soon becomes a viral video that helps to turn Neda into an international symbol of the civil unrest following the presidential election."], ["2009-06-21T00:00:00", "As a step toward total independence from the Kingdom of Denmark, Greenland assumes control over its law enforcement, judicial affairs, and natural resources. Greenlandic becomes the official language."], ["2009-06-25T00:00:00", "The death of American entertainer Michael Jackson triggers an outpouring of worldwide grief. Online, reactions to the event cripple several major websites and services, as the abundance of people accessing the web addresses pushes internet traffic to potentially unprecedented and historic levels."], ["2009-06-28T00:00:00", "The Supreme Court of Honduras orders the arrest and exile of President Manuel Zelaya, claiming he was violating the nation's constitution by holding a referendum to stay in power. The ouster is condemned by the United Nations, the Organization of American States, and multiple nations around the world."], ["2009-06-30T00:00:00", "Yemenia Flight 626 crashes off the coast of Moroni, Comoros, killing all but one of the 153 passengers and crew."], ["2009-07-04T00:00:00", "The Organization of American States suspends Honduras due to the country's recent political crisis after its refusal to reinstate President Zelaya."], ["2009-07-05T00:00:00", "Over 150 are killed when a few thousand ethnic Uyghurs target local Han Chinese during major rioting in Ürümqi, Xinjiang."], ["2009-07-07T00:00:00", "A public memorial service is held for musician Michael Jackson. It is regarded as one of the most prominent funerals of all time since the death of Elvis Presley in 1977."], ["2009-07-15T00:00:00", "Caspian Airlines Flight 7908 crashes near Qazvin, Iran, killing all 168 on board."], ["2009-07-16T00:00:00", "Iceland's national parliament, the Althingi, votes to pursue joining the EU."], ["2009-07-22T00:00:00", "The longest total solar eclipse of the 21st century, lasting up to 6 minutes and 38.8 seconds, occurs over parts of Asia and the Pacific Ocean."], ["2009-08-03T00:00:00", "Bolivia becomes the first South American country to declare the right of indigenous people to govern themselves."], ["2009-08-04T00:00:00", "North Korean leader Kim Jong-il pardons two American journalists, who had been arrested and imprisoned for illegal entry earlier in the year, after former U.S. President Bill Clinton meets with Kim in North Korea."], ["2009-08-07T00:00:00", "Typhoon Morakot hits Taiwan, killing 500 and stranding more than 1,000 via the worst flooding on the island in half a century."], ["2009-08-14T00:00:00", "The United Kingdom imposes direct rule on the Turks and Caicos Islands after an inquiry that found evidence of government corruption."], ["2009-08-20T00:00:00", "Abdelbaset al-Megrahi, imprisoned for the 1988 bombing of Pan Am Flight 103, is released by the Scottish government on compassionate grounds as he has terminal prostate cancer. He returns to his native Libya."], ["2009-09-25T00:00:00", "At the G-20 Pittsburgh summit, world leaders announce that the G-20 will assume greater leverage over the world economy, replacing the role of the G8, in an effort to prevent another financial crisis like that in 2008."], ["2009-09-26T00:00:00", "Typhoon Ketsana begins to cause record amounts of rainfall in Manila, Philippines, leading to the declaration of a \"state of calamity\" in 25 provinces."], ["2009-09-28T00:00:00", "At least 157 demonstrators are killed in a clash with the Guinean military."], ["2009-09-29T00:00:00", "An 8.3-magnitude earthquake triggers a tsunami near the Samoan Islands. Many communities and harbors in Samoa and American Samoa are destroyed, and at least 189 are killed."], ["2009-09-30T00:00:00", "A 7.6-magnitude earthquake strikes just off the coast of Sumatra, killing around 1,000 in Indonesia."], ["2009-10-01T00:00:00", "Paleontologists announce the discovery of an Ardipithecus ramidus fossil skeleton, deeming it the oldest remains of a human ancestor yet found."], ["2009-10-02T00:00:00", "The International Olympic Committee awards the 2016 Summer Olympics to Rio de Janeiro, Brazil."], ["2009-10-02T00:00:00", "Ireland holds a second referendum on the EU's Lisbon Treaty. The amendment is approved by the Irish electorate, having been rejected in the Lisbon I referendum held in June 2008."], ["2009-10-20T00:00:00", "European astronomers discover 32 exoplanets."], ["2009-11-03T00:00:00", "The Czech Republic becomes the final member-state of the European Union to sign the Treaty of Lisbon, thereby permitting that document's initiation into European law."], ["2009-11-03T00:00:00", "The Prime Minister of Belgium, Herman Van Rompuy, is designated the first permanent President of the European Council, a position he takes up on December 1, 2009."], ["2009-11-08T00:00:00", "Eva Brunne installed as Bishop of Stockholm (Church of Sweden), the world's first openly lesbian bishop."], ["2009-11-13T00:00:00", "Having analyzed the data from the LCROSS lunar impact, NASA announces that it has found a \"significant\" quantity of water in the Moon's Cabeus crater."], ["2009-11-20T00:00:00", "CERN restarts the Large Hadron Collider particle accelerator in Geneva, Switzerland; they had shut it down on September 19, 2008."], ["2009-11-23T00:00:00", "In the Philippines, at least 58 are abducted and killed in an election-related massacre in the province of Maguindanao. This appears to be the deadliest attack on journalists in recent history."], ["2009-11-27T00:00:00", "Dubai requests a debt deferment following its massive renovation and development projects, as well as the late 2000s economic crisis. The announcement causes global stock markets to drop."], ["2009-12-01T00:00:00", "The Treaty of Lisbon comes into force."], ["2009-12-07T00:00:00", "December 18 - The UNFCCC's United Nations Climate Change Conference 2009 conference is held in Copenhagen, Denmark."], ["2009-12-10T00:00:00", "James Cameron's film Avatar is released, and becomes the highest grossing film to date."], ["2009-12-16T00:00:00", "Astronomers discover GJ1214b, the first-known exoplanet on which water could exist."]]