[["1935-01-01T00:00:00", "The Italian colonies of Tripoli and Cyrenaica are joined together as Libya."], ["1935-01-03T00:00:00", "The trial of Bruno Richard Hauptmann, accused of the kidnapping and murder of Charles Lindbergh, Jr., begins in Flemington, New Jersey."], ["1935-01-04T00:00:00", "Dry Tortugas National Park is established."], ["1935-01-07T00:00:00", "Italian premier Benito Mussolini and French Foreign Minister Pierre Laval conclude an agreement in which each power agrees not to oppose the other's colonial claims."], ["1935-01-11T00:00:00", "Amelia Earhart becomes the first person to fly solo from Hawaii to California."], ["1935-01-13T00:00:00", "A plebiscite in the Territory of the Saar Basin shows that 90.3% of those voting wish to join Germany."], ["1935-01-16T00:00:00", "The FBI kills the Barker Gang, including Ma Barker, in a shootout."], ["1935-01-19T00:00:00", "Coopers Inc. sells the world's first men's briefs, as \"jockeys\", in Chicago."], ["1935-01-24T00:00:00", "The first canned beer is sold in Richmond, Virginia, United States, by Gottfried Krueger Brewing Company."], ["1935-01-28T00:00:00", "Iceland becomes the first country to legalize abortion on medical grounds."], ["1935-01-30T00:00:00", "In Nazi Germany the political independence of the federal states such as Prussia is effectively abolished by the \"Law on Reich Governors\" (Reichsstatthaltergesetz)."], ["1935-02-13T00:00:00", "Bruno Richard Hauptmann is convicted and sentenced to death for the kidnapping and murder of Charles Lindbergh, Jr."], ["1935-02-15T00:00:00", "The discovery and clinical development of Prontosil, the first broadly effective antibiotic, is published in a series of articles by Gerhard Domagk and others in Germany's pre-eminent medical journal, Deutsche Medizinische Wochenschrift."], ["1935-02-22T00:00:00", "Airplanes are banned from flying over the White House."], ["1935-02-23T00:00:00", "The classic Mickey Mouse cartoon The Band Concert is released by United Artists."], ["1935-02-26T00:00:00", "In Nazi Germany, Adolf Hitler orders reinstatement of the air force, the Luftwaffe, in violation of the 1919 Treaty of Versailles."], ["1935-02-26T00:00:00", "At Daventry in England, Robert Watson-Watt first demonstrates the use of radar to detect aircraft."], ["1935-02-28T00:00:00", "Ladby ship - Viking ship grave discovered."], ["1935-03-01T00:00:00", "1935 Greek coup d'état attempt: Nikolaos Plastiras, Anastasios Papoulas and other Venizelists lead a coup against the People's Party government in Greece. The attempt is suppressed by March 11 and the leaders condemned to death for treason."], ["1935-03-01T00:00:00", "İsmet İnönü forms the new government in Turkey. (8th government; During Atatürk's presidency, İnönü has served seven times as a prime minister.)"], ["1935-03-02T00:00:00", "King Prajadhipok (Rama VII) of Siam abdicates the throne. He is succeeded by his 9-year-old-nephew Ananda Mahidol (Rama VIII)."], ["1935-03-08T00:00:00", "Faithful dog Hachikō dies on the spot where he had awaited his dead owner for nine years in Japan."], ["1935-03-09T00:00:00", "Porky Pig makes his debut as the first major Looney Tunes character in I Haven't Got a Hat."], ["1935-03-16T00:00:00", "Adolf Hitler announces German re-armament in violation of the 1919 Treaty of Versailles."], ["1935-03-19T00:00:00", "Harlem riot of 1935: A race riot breaks out in Harlem (New York City) after a rumor circulates that a teenage Puerto Rican shoplifter in the S. H. Kress & Co. department store has been brutally beaten."], ["1935-03-21T00:00:00", "Persia is renamed Iran."], ["1935-03-22T00:00:00", "The world's first television program is transmitted from the Funkturm in Berlin, Germany."], ["1935-04-01T00:00:00", "The North American NA-16, prototype of the North American T-6 Texan or Harvard flying trainer, flies for the first time."], ["1935-04-14T00:00:00", "Dust Bowl: The great dust storm in the United States hits eastern New Mexico and Colorado, and western Oklahoma the hardest. It will be made famous by Woody Guthrie in his \"dust bowl ballads\"."], ["1935-04-15T00:00:00", "Roerich Pact, a Pan-American treaty on the protection of cultural artefacts, is signed in Washington D.C."], ["1935-04-16T00:00:00", "Fibber McGee and Molly debuts on NBC Radio in the United States."], ["1935-04-17T00:00:00", "Sun Myung Moon, a teenage Presbyterian convert in Korea under Japanese rule, claims to have a revelation from Jesus telling him to complete his mission from almost 2,000 years ago."], ["1935-04-24T00:00:00", "William Christian Bullitt, Jr., the United States Ambassador to the Soviet Union, hosts the elaborately prepared Spring Ball of the Full Moon which is said to have surpassed all other embassy parties in Moscow's history."], ["1935-04-27T00:00:00", "FA Cup (Association football): Sheffield Wednesday F.C. beat West Bromwich Albion 4-2 at Wembley Stadium in England."], ["1935-04-29T00:00:00", "The first edition of the Vuelta a España is raced and goes on to become one of the 3 Grand Tours of road bicycle racing."], ["1935-05-06T00:00:00", "New Deal: Executive Order 7034 creates the Works Progress Administration (WPA) in the United States."], ["1935-05-14T00:00:00", "Northamptonshire gains (over Somerset at Taunton by 48 runs) what proves to be their last victory for 99 matches, easily a record in the County Championship. Their next Championship win is not until 29 May 1939."], ["1935-05-15T00:00:00", "Joseph Stalin opens the Moscow Metro to the public."], ["1935-05-19T00:00:00", "T. E. Lawrence (\"Lawrence of Arabia\") dies as the result of a motorcycle accident in Dorset, England."], ["1935-05-21T00:00:00", "In Nazi Germany, Adolf Hitler announces the reintroduction of conscription to the Wehrmacht in violation of the 1919 Treaty of Versailles."], ["1935-05-24T00:00:00", "The first nighttime Major League Baseball game is played between the Cincinnati Reds and Philadelphia Phillies at Crosley Field in Cincinnati, Ohio."], ["1935-05-27T00:00:00", "Schechter Poultry Corp. v. United States (the \"Sick Chicken Case\"): The Supreme Court of the United States declares that the National Industrial Recovery Act, a major component of the New Deal, is unconstitutional."], ["1935-05-29T00:00:00", "The French Compagnie Générale Transatlantique ocean liner SS Normandie sets out on her maiden voyage from Le Havre to New York, which she will reach in 4 days, 3 hours and 14 minutes, taking the Blue Riband; she gains the eastbound record on her return passage."], ["1935-05-30T00:00:00", "Eventual Baseball Hall of Famer Babe Ruth appears in his last career game, playing for the Boston Braves in Philadelphia against the Phillies."], ["1935-05-31T00:00:00", "1935 Balochistan earthquake: A 7.1 magnitude earthquake destroys Quetta in modern-day Pakistan, killing 40,000."], ["1935-05-31T00:00:00", "20th Century Pictures, Inc., becomes 20th Century Fox."], ["1935-06-09T00:00:00", "He-Umezu Agreement: China's Kuomintang government concedes Japanese military control of north-eastern China."], ["1935-06-10T00:00:00", "Alcoholics Anonymous is founded in Akron, Ohio by William G. Wilson and Dr. Robert Smith."], ["1935-06-12T00:00:00", "Senator Huey Long of Louisiana makes the longest speech on Senate record, taking 15½ hours and containing 150,000 words."], ["1935-06-12T00:00:00", "End of the Chaco War, a war between Paraguay and Bolivia."], ["1935-06-13T00:00:00", "James J. Braddock defeats Max Baer at Madison Square Garden Bowl to win the heavyweight boxing championship of the world."], ["1935-06-18T00:00:00", "Anglo-German Naval Agreement: Britain agrees to a German navy equal to 35% of her own naval tonnage."], ["1935-06-24T00:00:00", "Carlos Gardel, the legendary Franco-Argentine \"Father of Tango\", dies in a plane crash in Medellín, Colombia."], ["1935-07-04T00:00:00", "The RMS Mauretania sails from Southampton to Jarrow"], ["1935-07-16T00:00:00", "The world's first parking meters are installed in Oklahoma City."], ["1935-08-05T00:00:00", "The Leo Burnett Advertising Agency opens in Chicago."], ["1935-08-14T00:00:00", "United States President Franklin D. Roosevelt signs the Social Security Act into law."], ["1935-08-15T00:00:00", "Humorist Will Rogers and aviator Wiley Post are killed when Post's plane crashes shortly after takeoff near Barrow, Alaska."], ["1935-09-02T00:00:00", "1935 Labor Day hurricane: The strongest hurricane ever to strike the United States landfalls in the Upper Florida Keys as a Category 5 storm with 185 mph winds, killing 423."], ["1935-09-08T00:00:00", "Carl Weiss kills Huey Long, U.S. Senator from Louisiana, in the Louisiana Capitol Building in Baton Rouge."], ["1935-09-13T00:00:00", "Howard Hughes, flying the Hughes H-1 Racer, sets an airspeed record of 352 mph (566 km/h)."], ["1935-09-15T00:00:00", "The Nuremberg Laws go into effect in Germany, removing citizenship from Jews."], ["1935-09-24T00:00:00", "Earl W. Bascom and his brother Weldon produce the first night rodeo held outdoors under electric lights at Columbia, Mississippi."], ["1935-09-29T00:00:00", "The London and North Eastern Railway's first A4 Class streamlined steam locomotive A4 2509 Silver Link makes her inaugural journey from London King's Cross."], ["1935-09-30T00:00:00", "U.S. President Franklin D. Roosevelt dedicates Hoover Dam."], ["1935-09-30T00:00:00", "The London and North Eastern Railway commences the Silver Jubilee, Britain's first streamline train service."], ["1935-10-10T00:00:00", "A tornado destroys the 160 metre tall wooden radio tower in Langenberg, Germany. As a result of this catastrophe, wooden radio towers are phased out."], ["1935-10-14T00:00:00", "In the Canadian federal election, the Liberal Party of William Lyon Mackenzie King wins a majority government, defeating the Conservative Party of Prime Minister R. B. Bennett."], ["1935-10-16T00:00:00", "Mr. Bernard Tussaud completes the wax figure of Lady Alice Scott and the Duke of Gloucester."], ["1935-11-05T00:00:00", "Parker Brothers releases the board game Monopoly in the United States."], ["1935-11-08T00:00:00", "A dozen labor leaders come together to announce the creation of the Congress of Industrial Organizations (CIO), an organization charged with pushing the cause for industrial unionism in North America."], ["1935-11-14T00:00:00", "In the United Kingdom general election, Prime Minister Stanley Baldwin returns to office at the head of a National Government led by the Conservative Party with a large but reduced majority."], ["1935-11-22T00:00:00", "The flying boat China Clipper takes off from Alameda, California to deliver the first airmail cargo across the Pacific Ocean; on November 29 the aircraft reaches its final destination, Manila, and delivers over 110,000 pieces of mail."], ["1935-11-23T00:00:00", "Jacques and Thérèse Tréfouël, Daniel Bovet and Federico Nitti, in the laboratory of Ernest Fourneau at the Pasteur Institute in Paris, discover that sulfanilamide is the active component of Prontosil."], ["1935-11-30T00:00:00", "The 1935 British-made film Scrooge, the first all-talking film version of the Charles Dickens classic A Christmas Carol, opens in the U.S. after its British release."], ["1935-12-09T00:00:00", "American newspaper editor Walter Liggett is killed in a gangland murder plot."], ["1935-12-12T00:00:00", "Lebensborn program in support of Nazi eugenics is founded by Heinrich Himmler in Germany."], ["1935-12-12T00:00:00", "Opening of the De La Warr Pavilion at Bexhill-on-Sea, designed by Erich Mendelsohn and Serge Chermayeff, a pioneering example of International Style architecture in the British Isles."], ["1935-12-17T00:00:00", "Douglas DST, prototype of the Douglas DC-3 airliner, first flies, in the United States. More than 16,000 of the model will eventually be produced."], ["1935-12-18T00:00:00", "Samuel Hoare resigns as British foreign secretary and is replaced by Anthony Eden."], ["1935-12-18T00:00:00", "The socialist party of Sri Lanka, the Lanka Sama Samaja Party, is founded."], ["1935-12-27T00:00:00", "Mao Zedong issues the Wayaobu Manifesto, On Tactics Against Japanese Imperialism, calling for a National United Front against the Japanese invasion."], ["1935-12-28T00:00:00", "Pravda publishes a letter from Pavel Postyshev, who revives the New Year tree tradition in the Soviet Union."]]