[["1989-01-02T00:00:00", "Prime Minister Ranasinghe Premadasa takes office as the third President of Sri Lanka."], ["1989-01-04T00:00:00", "Gulf of Sidra incident (1989): Two Libyan MiG-23 \"Floggers\" are engaged and shot down by 2 US Navy F-14 Tomcats."], ["1989-01-07T00:00:00", "Hirohito (posthumous name: Emperor Shōwa) dies, and Akihito is enthroned as the Emperor of Japan immediately, followed by the change in the era name from Showa to Heisei on the following day."], ["1989-01-08T00:00:00", "Kegworth air disaster: A British Midland Boeing 737 crashes on approach to East Midlands Airport, leaving 47 dead."], ["1989-01-10T00:00:00", "In accordance with United Nations Security Council Resolution 626 and the New York Accords, Cuban troops begin withdrawing from Angola."], ["1989-01-11T00:00:00", "President of the United States Ronald Reagan delivers his farewell address to the nation."], ["1989-01-15T00:00:00", "Thirty-five European nations, meeting in Vienna, agree to strengthen human rights and strengthen East-West trade."], ["1989-01-15T00:00:00", "A pro-democracy demonstration in Prague is attacked by the police."], ["1989-01-17T00:00:00", "Stockton schoolyard shooting: Patrick Edward Purdy kills 5 children, wounds 30 and then shoots himself in Stockton, California."], ["1989-01-18T00:00:00", "The Polish United Workers' Party votes to legalize Solidarity."], ["1989-01-18T00:00:00", "Ante Marković succeeds Branko Mikulić as Prime Minister of Yugoslavia."], ["1989-01-20T00:00:00", "George H. W. Bush succeeds Ronald Reagan as the 41st President of the United States of America."], ["1989-01-23T00:00:00", "A powerful earthquake in the Tajik Soviet Socialist Republic kills around 275 people."], ["1989-01-29T00:00:00", "The British children's television show, Thomas & Friends, begins airing in the U.S. with the series premiere of Shining Time Station on PBS"], ["1989-01-30T00:00:00", "Prime Minister of Canada Brian Mulroney shuffles his cabinet, appointing 6 new ministers and reassigning the responsibilities of 19 others."], ["1989-02-01T00:00:00", "Joan Kirner becomes Victoria's first female Deputy Premier, after the resignation of Robert Fordham over the VEDC (Victorian Economic Development Co-operation) Crisis."], ["1989-02-02T00:00:00", "Soviet war in Afghanistan: The last Soviet Union armored column leaves Kabul, ending 9 years of military occupation since 1979."], ["1989-02-02T00:00:00", "Carlos Andrés Pérez takes office as President of Venezuela."], ["1989-02-02T00:00:00", "Satellite television service Sky Television plc is launched in Europe."], ["1989-02-03T00:00:00", "A military coup overthrows Alfredo Stroessner, dictator of Paraguay since 1954."], ["1989-02-03T00:00:00", "After a stroke, P. W. Botha resigns his party's leadership and the presidency of South Africa."], ["1989-02-06T00:00:00", "The government of the People's Republic of Poland holds formal talks with representatives of Solidarity movement for the first time since 1981."], ["1989-02-07T00:00:00", "The People's National Party, led by Michael Manley, wins the Jamaican general election."], ["1989-02-07T00:00:00", "The Los Angeles City Council bans the sale or possession of semiautomatic firearms."], ["1989-02-10T00:00:00", "Ron Brown is elected chairman of the Democratic National Committee, becoming the first African American to lead a major United States political party."], ["1989-02-10T00:00:00", "U.S. President Bush meets Canadian prime minister Mulroney in Ottawa, laying the groundwork for the Acid Rain Treaty of 1991."], ["1989-02-11T00:00:00", "Barbara Clementine Harris is consecrated as the first female bishop of the Episcopal Church in the United States of America (and also the first female bishop in the worldwide Anglican Communion)."], ["1989-02-14T00:00:00", "Union Carbide agrees to pay US$470 million to the Indian government for damages it caused in the 1984 Bhopal disaster."], ["1989-02-14T00:00:00", "The Satanic Verses controversy: Ayatollah Ruhollah Khomeini, Supreme Leader of Iran (d. June 3), issues a fatwa calling for the death of Indian-born British author Salman Rushdie and his publishers for issuing the novel The Satanic Verses (1988)."], ["1989-02-14T00:00:00", "The first of 24 Global Positioning System satellites is placed into orbit."], ["1989-02-15T00:00:00", "Soviet war in Afghanistan: The Soviet Union announces that all of its troops have left Afghanistan."], ["1989-02-15T00:00:00", "Following a campaign that saw over 1,000 people killed in massive campaign-related violence, the United National Party wins the Sri Lankan parliamentary election."], ["1989-02-16T00:00:00", "Pan Am Flight 103: Investigators announce that the cause of the crash was a bomb hidden inside a radio-cassette player."], ["1989-02-17T00:00:00", "The Arab Maghreb Union (AMU) is formed."], ["1989-02-17T00:00:00", "South African police raid the home of Winnie Mandela and arrest four of her bodyguards."], ["1989-02-20T00:00:00", "In Canada's Yukon Territory, the ruling New Democrats narrowly maintain control of the Yukon Legislative Assembly, winning 9 seats vs. the Progressive Conservative Party's 7."], ["1989-02-23T00:00:00", "After protracted testimony, the U.S. Senate Armed Services Committee rejects, 11-9, President Bush's nomination of John Tower for Secretary of Defense."], ["1989-02-24T00:00:00", "The funeral of Hirohito is attended by representatives of 160 nations."], ["1989-02-24T00:00:00", "The Satanic Verses controversy: Iran places a US $3-million bounty on the head of The Satanic Verses author Salman Rushdie."], ["1989-02-24T00:00:00", "After 44 years, the Estonian flag is raised at the Pikk Hermann Castle tower in Tallinn."], ["1989-02-27T00:00:00", "Venezuela is rocked by the Caracazo, a wave of protests and looting."], ["1989-03-01T00:00:00", "The Berne Convention, an international treaty on copyrights, is ratified by the United States."], ["1989-03-01T00:00:00", "A curfew is imposed in Kosovo, where protests continue over the alleged intimidation of the Serb minority."], ["1989-03-01T00:00:00", "Louis Wade Sullivan and James D. Watkins start terms of office as U.S. Secretary of Health and Human Services and U.S. Secretary of Energy respectively."], ["1989-03-01T00:00:00", "The Politieke Partij Radicalen, Pacifistisch Socialistische Partij, Communistische Partij Nederland and the Evangelical People's Party amalgamate to form Netherlands political party GroenLinks (GL, GreenLeft)."], ["1989-03-02T00:00:00", "Twelve European Community nations agree to ban the production of all chlorofluorocarbons (CFCs) by the end of the century."], ["1989-03-03T00:00:00", "Jammu Siltavuori abducts and murders two 8-year-old girls in the Myllypuro suburb of Helsinki, Finland."], ["1989-03-03T00:00:00", "Portugal wins the FIFA U-20 World Cup, defeating Nigeria on the final by 2-0 in Riyadh, Saudi Arabia."], ["1989-03-04T00:00:00", "Time Inc. and Warner Communications announce plans for a merger, forming Time Warner."], ["1989-03-04T00:00:00", "The Purley station rail crash in London leaves 5 dead and 94 injured."], ["1989-03-04T00:00:00", "The first ACT (Australian Capital Territory) elections are held."], ["1989-03-07T00:00:00", "Iran breaks off diplomatic relations with the United Kingdom over Salman Rushdie's The Satanic Verses."], ["1989-03-09T00:00:00", "A strike forces financially troubled Eastern Air Lines into bankruptcy."], ["1989-03-13T00:00:00", "A geomagnetic storm causes the collapse of the Hydro-Québec power grid. Six million people are left without power for 9 hours. Some areas in the northeastern U.S. and in Sweden also lose power, and aurorae are seen as far as Texas. - Tim Berners-Lee produces the proposal document that will become the blueprint for the World Wide Web."], ["1989-03-14T00:00:00", "Gun control: U.S. President George H. W. Bush bans the importation of certain guns deemed assault weapons into the United States."], ["1989-03-14T00:00:00", "Christian General Michel Aoun declares a 'War of Liberation' to rid Lebanon of Syrian forces and their allies."], ["1989-03-15T00:00:00", "Israel hands over Taba to Egypt, ending a seven-year territorial dispute."], ["1989-03-16T00:00:00", "The Central Committee of the Communist Party of the Soviet Union approves agricultural reforms allowing farmers the right to lease state-owned farms for life."], ["1989-03-17T00:00:00", "The Civic Tower of Pavia, built in the 14th century, crumbles down."], ["1989-03-17T00:00:00", "Alfredo Cristiani is elected President of El Salvador."], ["1989-03-20T00:00:00", "Australian Prime Minister Bob Hawke weeps on national television as he admits marital infidelity."], ["1989-03-22T00:00:00", "Clint Malarchuk of the NHL Buffalo Sabres suffers an almost fatal injury when another player accidentally slits his throat."], ["1989-03-22T00:00:00", "Asteroid 4581 Asclepius approaches the Earth at a distance of 700,000 kilometers."], ["1989-03-23T00:00:00", "Stanley Pons and Martin Fleischmann announce that they have achieved cold fusion at the University of Utah."], ["1989-03-24T00:00:00", "Exxon Valdez oil spill: In Alaska's Prince William Sound, the Exxon Valdez spills 240,000 barrels (38,000 m3) of oil after running aground."], ["1989-03-27T00:00:00", "The first contested elections for the Soviet parliament result in losses for the Communist Party."], ["1989-03-29T00:00:00", "The 61st Academy Awards are held at the Shrine Auditorium in Los Angeles, with Rain Man winning Best Picture."], ["1989-04-01T00:00:00", "Margaret Thatcher's new local government tax, the Poll tax, is introduced in Scotland."], ["1989-04-01T00:00:00", "In South-West Africa, fighting erupts between SWAPO guerrillas and the South West African Police, on the day that a cease-fire was supposed to end the South African Border War according to United Nations Security Council Resolution 435. By April 6, nearly 300 people are killed."], ["1989-04-04T00:00:00", "A failed coup attempt against Prosper Avril, President of Haiti, leads to a standoff between mutinous troops and the government which ends April 10, with the government regaining control of the country."], ["1989-04-04T00:00:00", "In Brussels, Belgium, NATO celebrates its 40th anniversary."], ["1989-04-05T00:00:00", "The Polish Government and the Solidarity labor union sign an agreement restoring Solidarity to legal status, and agreeing to hold democratic elections on June 1."], ["1989-04-06T00:00:00", "National Safety Council of Australia chief executive John Friedrich is arrested after defrauding investors to the tune of $235 million."], ["1989-04-07T00:00:00", "The Soviet submarine K-278 Komsomolets sinks in the Barents Sea, killing 41."], ["1989-04-09T00:00:00", "Georgian demonstrators are massacred by Red Army soldiers in Tbilisi's central square during a peaceful rally; 20 citizens are killed, many injured."], ["1989-04-09T00:00:00", "A dispute over grazing rights leads to the beginning of the Mauritania-Senegal Border War."], ["1989-04-11T00:00:00", "Ron Hextall becomes the first goaltender in NHL history to score a goal in the playoffs."], ["1989-04-14T00:00:00", "The U.S. government seizes the Irvine, California, Lincoln Savings and Loan Association; Charles Keating (for whom the Keating Five were named) eventually goes to jail, as part of the massive 1980s savings and loan crisis which costs U.S. taxpayers nearly $200 billion in bailouts, and many people their life savings."], ["1989-04-15T00:00:00", "The death of Hu Yaobang sparks the beginning of the Tiananmen Square protests of 1989."], ["1989-04-15T00:00:00", "The Hillsborough disaster, one of the biggest tragedies in European football, claims the life of 96 Liverpool supporters."], ["1989-04-17T00:00:00", "Poland, Solidarity is again legalized and allowed to participate in semi-free elections on June 4."], ["1989-04-19T00:00:00", "Trisha Meili is attacked while jogging in New York City's Central Park; as her identity remains secret for years, she becomes known as the \"Central Park Jogger.\""], ["1989-04-19T00:00:00", "A gun turret explodes on the U.S. battleship Iowa, killing 47 crew members."], ["1989-04-20T00:00:00", "NATO debates modernising short range missiles; although the U.S. and U.K. are in favour, West German Chancellor Helmut Kohl obtains a concession deferring a decision."], ["1989-04-21T00:00:00", "Students from Beijing, Shanghai, Xi'an, and Nanjing begin protesting in Tiananmen Square."], ["1989-04-23T00:00:00", "Zaid al-Rifai resigns as Prime Minister of Jordan in the wake of riots over government imposed price hikes that began on April 18."], ["1989-04-25T00:00:00", "Noboru Takeshita resigns as Prime Minister of Japan in the wake of a stock-trading scandal."], ["1989-04-25T00:00:00", "The term of Baginda Almutawakkil Alallah Sultan Iskandar Al-Haj ibni Almarhum Sultan Ismail as the 8th Yang di-Pertuan Agong of Malaysia ends."], ["1989-04-25T00:00:00", "Motorola introduces the Motorola MicroTAC Personal Cellular Telephone, then the world's smallest mobile phone."], ["1989-04-26T00:00:00", "Sultan Azlan Muhibbudin Shah ibni Almarhum Sultan Yusuff Izzudin Shah Ghafarullahu-lahu, Sultan of Perak, becomes the 9th Yang di-Pertuan Agong of Malaysia."], ["1989-04-26T00:00:00", "Zaid ibn Shaker succeeds Zaid al-Rifai as Prime Minister of Jordan."], ["1989-04-26T00:00:00", "The Daulatpur-Saturia tornado, the deadliest tornado ever recorded, kills an estimated 1,300 people in the Dhaka Division of Bangladesh."], ["1989-04-26T00:00:00", "The first episode of Dragon Ball Z was released."], ["1989-04-27T00:00:00", "A major demonstration occurs in Beijing, as part of the Tiananmen Square protests."], ["1989-04-28T00:00:00", "Pope John Paul II begins a 9-day trip to Madagascar, Zambia, Malawi, and Réunion."], ["1989-05-01T00:00:00", "Andrés Rodríguez, who had seized power and declared himself President of Paraguay during a military coup in February, wins a landslide election in a general election marked by charges of fraud."], ["1989-05-01T00:00:00", "Disney-MGM Studios at Walt Disney World opens to the public for the first time."], ["1989-05-02T00:00:00", "The first crack in the Iron Curtain: Hungary dismantles 150 miles (240 km) of barbed wire fencing along the border with Austria."], ["1989-05-02T00:00:00", "The coalition government of Prime Minister of the Netherlands Ruud Lubbers collapses in a dispute about a pollution cleanup plan."], ["1989-05-03T00:00:00", "Cold War - Perestroika - The first McDonald's restaurant in the USSR begins construction in Moscow. It will open on 31 January 1990."], ["1989-05-04T00:00:00", "Oliver North convicted on charges related to the Iran-Contra affair. His conviction was thrown out on appeal in 1991 because of his immunized testimony."], ["1989-05-06T00:00:00", "Yugoslavia wins the Eurovision Song Contest in Lausanne with the song Rock me performed by Riva."], ["1989-05-06T00:00:00", "Magnum XL-200 opens at Cedar Point amusement park in Sandusky, Ohio as the world's tallest and fastest roller coaster."], ["1989-05-09T00:00:00", "Andrew Peacock deposes John Howard as Federal Opposition Leader of Australia."], ["1989-05-10T00:00:00", "The government of President of Panama Manuel Noriega declares void the result of the May 7 presidential election, which Noriega had lost to Guillermo Endara."], ["1989-05-11T00:00:00", "President Bush orders 1,900 U.S. troops to Panama to protect Americans there."], ["1989-05-11T00:00:00", "The ACT (Australian Capital Territory) Legislative Assembly meets for the first time."], ["1989-05-14T00:00:00", "Mikhail Gorbachev visits China, the first Soviet leader to do so since Nikita Khrushchev in the 1960s."], ["1989-05-14T00:00:00", "Carlos Menem wins the Argentine presidential election."], ["1989-05-15T00:00:00", "Australia's first private tertiary institution, Bond University, opens on the Gold Coast."], ["1989-05-16T00:00:00", "Ethiopia Coup Attempt: Senior military officers stage a coup attempt in Ethiopia hours after President Mengistu Haile Mariam leaves on a visit to East Germany."], ["1989-05-17T00:00:00", "More than 1 million Chinese protestors march through Beijing demanding greater democracy."], ["1989-05-19T00:00:00", "1989 Ürümqi unrest: Uyghur and Hui Muslim protesters riot in front of the government building in Ürümqi, China."], ["1989-05-19T00:00:00", "Tiananmen Square protests of 1989: Zhao Ziyang meets the demonstrators in Tiananmen Square."], ["1989-05-19T00:00:00", "Ciriaco De Mita resigns as Prime Minister of Italy."], ["1989-05-20T00:00:00", "Tiananmen Square protests of 1989: The Chinese government declares martial law in Beijing."], ["1989-05-22T00:00:00", "The Nordland Days in Leningrad region (Leningrad Oblast) open."], ["1989-05-29T00:00:00", "Amid food riots and looting set off by inflation, the Government of Argentina declares a nationwide state of siege."], ["1989-05-29T00:00:00", "Boris Yeltsin gains a seat on the Supreme Soviet of the Soviet Union."], ["1989-05-29T00:00:00", "Tiananmen Square protests of 1989: The 10 m (33 ft) high Goddess of Democracy statue is unveiled in Tiananmen Square by student demonstrators."], ["1989-05-29T00:00:00", "NATO agrees to talks with the Soviet Union on reducing the number of short-range nuclear weapons in Europe."], ["1989-05-29T00:00:00", "An attempted assassination of Miguel Maza Marquez, director of the Departamento Administrativo de Seguridad (DAS) in Bogotá, Colombia is committed by members of the Medellín Cartel, who kill 4 and injure 37."], ["1989-05-31T00:00:00", "Six members of the guerrilla group Revolutionary Movement Tupac Amaru (MRTA) of Peru, shoot dead 8 transsexuals, in the city of Tarapoto."], ["1989-06-02T00:00:00", "Sōsuke Uno succeeds Noboru Takeshita as Prime Minister of Japan."], ["1989-06-03T00:00:00", "Fighting breaks out in the Uzbek Soviet Socialist Republic between ethnic Uzbeks and the Turkish minority; more than 100 people are killed by June 15."], ["1989-06-03T00:00:00", "The SkyDome (now known as Rogers Centre) opens in Toronto."], ["1989-06-03T00:00:00", "The world's first HDTV broadcasts commence in Japan, in analog."], ["1989-06-04T00:00:00", "The Tiananmen Square crackdown takes place in Beijing on the army's approach to the square, and the final stand-off in the square is covered live on television."], ["1989-06-04T00:00:00", "Solidarity's victory in Polish elections is the first of many anti-communist revolutions in Central and Eastern Europe in 1989."], ["1989-06-04T00:00:00", "Ufa train disaster: A natural gas explosion near Ufa, Russia kills 645 as 2 trains passing each other throw sparks near a leaky pipeline."], ["1989-06-05T00:00:00", "An unknown Chinese protestor, \"Tank Man\", stands in front of a column of military tanks on Chang'an Avenue in Beijing, temporarily halting them, an incident which achieves iconic status internationally through images taken by Western photographers."], ["1989-06-06T00:00:00", "The Ayatollah Khomeini's first funeral is aborted by officials after a large crowd storms the funeral procession, nearly destroying Khomeini's wooden coffin in order to get a last glimpse of his body. At one point, Khomeini's body almost falls to the ground, as the crowd attempt to grab pieces of the death shroud."], ["1989-06-07T00:00:00", "Surinam Airways Flight 764 crashes in Paramaribo, Suriname; killing 176."], ["1989-06-12T00:00:00", "The Corcoran Gallery of Art removes Robert Mapplethorpe's gay photography exhibition."], ["1989-06-13T00:00:00", "The wreck of the German battleship Bismarck, which was sunk in 1941, is located 600 miles (970 km) west of Brest, France."], ["1989-06-15T00:00:00", "In the Irish general election, the Fianna Fáil party, led by Taoiseach Charles Haughey, fails to win a majority."], ["1989-06-16T00:00:00", "A crowd of 250,000 gathers at Heroes Square in Budapest for the historic reburial of Imre Nagy, the former Hungarian prime minister who had been executed in 1958."], ["1989-06-18T00:00:00", "In the first Greek legislative election of the year, the Panhellenic Socialist Movement, led by Prime Minister of Greece Andreas Papandreou, loses control of the Hellenic Parliament, leading to Papandreou's resignation the next day."], ["1989-06-21T00:00:00", "British police arrest 250 people for celebrating the summer solstice at Stonehenge."], ["1989-06-22T00:00:00", "Ireland's first universities established since independence in 1922, Dublin City University and the University of Limerick, open."], ["1989-06-24T00:00:00", "Jiang Zemin becomes General Secretary of the Communist Party of China."], ["1989-06-30T00:00:00", "A military coup led by Omar al-Bashir ousts the civilian government of Prime Minister of Sudan Sadiq al-Mahdi."], ["1989-07-02T00:00:00", "Andreas Papandreou, Prime Minister of Greece resigns; a new government is formed under Tzannis Tzannetakis."], ["1989-07-05T00:00:00", "President of South Africa P. W. Botha meets the imprisoned Nelson Mandela face to face for the first time."], ["1989-07-05T00:00:00", "The television show Seinfeld premieres."], ["1989-07-06T00:00:00", "The Tel Aviv-Jerusalem bus 405 suicide attack, the first Palestinian suicide attack on Israel, takes place."], ["1989-07-09T00:00:00", "Steffi Graf and Boris Becker of West Germany win singles titles at the 1989 Wimbledon Championships."], ["1989-07-10T00:00:00", "Approximately 300,000 Siberian coal miners go on strike, demanding better living conditions and less bureaucracy; it is the largest Soviet labor strike since the 1920s."], ["1989-07-12T00:00:00", "In the Republic of Ireland, the Taoiseach Charles Haughey returns to power after Fianna Fáil forms a coalition with the Progressive Democrats."], ["1989-07-14T00:00:00", "France celebrates the 200th anniversary of the French Revolution."], ["1989-07-17T00:00:00", "The Northrop Grumman B-2 Spirit Stealth Bomber makes its first flight."], ["1989-07-17T00:00:00", "Poland and the Vatican re-establish diplomatic relations after approximately 50 years."], ["1989-07-18T00:00:00", "Actress Rebecca Schaeffer is murdered by an obsessed fan, leading to stricter stalking laws in California."], ["1989-07-19T00:00:00", "The National Assembly of the Republic of Poland elects Wojciech Jaruzelski to the new and powerful post of President of Poland."], ["1989-07-19T00:00:00", "United Airlines Flight 232 (Douglas DC-10) crashes in Sioux City, Iowa, killing 112; 184 on board survive."], ["1989-07-20T00:00:00", "Burmese opposition leader Aung San Suu Kyi is placed under house arrest. She is released in 2010."], ["1989-07-21T00:00:00", "A total blockade of Armenia and NKAO by Azerbaijan begins."], ["1989-07-23T00:00:00", "Japan's ruling Liberal Democratic Party loses control of the House of Councillors, the LDP's worst electoral showing in 34 years, leading to Prime Minister Uno announcing he will resign to take responsibility for the result."], ["1989-07-23T00:00:00", "Giulio Andreotti takes office as Prime Minister of Italy."], ["1989-07-26T00:00:00", "A federal grand jury indicts Cornell University student Robert Tappan Morris for releasing a computer virus, making him the first person to be prosecuted under the 1986 Computer Fraud and Abuse Act."], ["1989-07-27T00:00:00", "In what was the largest prison sentence to date, Thai financial scammer Mae Chamoy Thipyaso and her accomplices are each sentenced to 141,078 years in prison."], ["1989-07-28T00:00:00", "In the Iranian presidential election, electors overwhelmingly elect Akbar Hashemi Rafsanjani as President of Iran and endorse changes to the Constitution of the Islamic Republic of Iran, increasing the powers of the president."], ["1989-07-31T00:00:00", "In Lebanon, Hezbollah announces that it has hanged U.S. Marine Lt. Col. William R. Higgins in retaliation for Israel's July 28 kidnapping of Hezbollah leader Abdel Karim Obeid. The same day, the United Nations Security Council passes United Nations Security Council Resolution 638, condemning the taking of hostages by both sides in the conflict."], ["1989-07-31T00:00:00", "Nintendo releases the Game Boy portable video game system in North America."], ["1989-08-02T00:00:00", "Pakistan is readmitted to the Commonwealth of Nations after leaving it in 1972."], ["1989-08-05T00:00:00", "Jaime Paz Zamora is elected President of Bolivia, taking office the next day."], ["1989-08-07T00:00:00", "U.S. Congressman Mickey Leland (D-TX) and 15 others die in a plane crash in Ethiopia."], ["1989-08-07T00:00:00", "The presidents of five Central American countries agree that the U.S.-backed contras fighting the government of Nicaragua should be disbanded and evicted from their bases in Honduras by December 5."], ["1989-08-07T00:00:00", "Federal Express purchases Flying Tiger Line for approximately 800 million U.S. dollars."], ["1989-08-08T00:00:00", "Prime Minister of New Zealand David Lange resigns for health reasons and is replaced by Geoffrey Palmer."], ["1989-08-08T00:00:00", "STS-28: Space Shuttle Columbia takes off on a secret 5-day military mission."], ["1989-08-09T00:00:00", "Toshiki Kaifu becomes Prime Minister of Japan."], ["1989-08-09T00:00:00", "The asteroid 4769 Castalia is the first asteroid directly imaged by radar from Arecibo Observatory."], ["1989-08-09T00:00:00", "A measure to rescue the savings and loan industry is signed into law by President Bush, launching the largest federal rescue to date."], ["1989-08-10T00:00:00", "Army General Colin Powell became the first black chairman of the Joint Chiefs of Staff after being nominated by President Bush."], ["1989-08-13T00:00:00", "A hot air balloon accident near Alice Springs, Australia kills 13."], ["1989-08-14T00:00:00", "P. W. Botha resigns as President of South Africa."], ["1989-08-14T00:00:00", "The Sega Genesis is released in North America."], ["1989-08-15T00:00:00", "F. W. de Klerk becomes the seventh and last State President of apartheid South Africa."], ["1989-08-18T00:00:00", "Leading presidential hopeful Luis Carlos Galán is assassinated near Bogotá in Colombia."], ["1989-08-19T00:00:00", "Polish president Wojciech Jaruzelski nominates Solidarity activist Tadeusz Mazowiecki to be Prime Minister, the first non-communist in power in 42 years."], ["1989-08-19T00:00:00", "The Pan-European Picnic, a peace demonstration, is held on the Austrian-Hungarian border."], ["1989-08-20T00:00:00", "In Beverly Hills, California, Lyle and Erik Menendez shoot their wealthy parents to death in the family's den."], ["1989-08-20T00:00:00", "Fifty-one people die when the Marchioness pleasure boat collides with a barge on the River Thames adjacent to Southwark Bridge."], ["1989-08-21T00:00:00", "The 21st anniversary of the crushing of the Prague Spring is commemorated by a demonstration in the city."], ["1989-08-23T00:00:00", "Two million indigenous people of Estonian, Latvian and Lithuanian SSRs join hands to demand freedom and independence from Soviet occupation, forming an uninterrupted 600 km human chain called the Baltic Way."], ["1989-08-23T00:00:00", "Hungary removes border restrictions with Austria."], ["1989-08-23T00:00:00", "All of Australia's 1,645 domestic airline pilots resign over an airline's move to sack and sue them over a dispute."], ["1989-08-23T00:00:00", "Yusef Hawkins is shot in the Bensonhurst section of Brooklyn, New York, sparking racial tensions between African Americans and Italian Americans."], ["1989-08-24T00:00:00", "Colombia's cocaine traffickers declare \"total and absolute war\" against the government and begin a series of bombings and arson attacks."], ["1989-08-24T00:00:00", "Voyager 2 makes its closest approach to Neptune."], ["1989-08-24T00:00:00", "Record-setting baseball player Pete Rose agrees to a lifetime ban from the sport following allegations of illegal gambling, thereby preventing his induction into the Baseball Hall of Fame."], ["1989-08-24T00:00:00", "Indonesia's first privately owned television station, Rajawali Citra Televisi Indonesia, (RCTI) begins broadcasting."], ["1989-08-24T00:00:00", "Tadeusz Mazowiecki of Solidarity is elected Prime Minister of Poland."], ["1989-08-25T00:00:00", "Voyager 2 passes the planet Neptune and its moon Triton."], ["1989-08-31T00:00:00", "In the aftermath of the Chadian-Libyan conflict of 1978-87, representatives of Libya and Chad agree to let the International Court of Justice determine ownership of the Aouzou Strip, which had been occupied by Libya since 1973."], ["1989-09-06T00:00:00", "South African general election, 1989, the last held under apartheid, returns the National Party to power with a much-reduced majority."], ["1989-09-06T00:00:00", "In the Dutch general election, the Christian Democratic Appeal, led by Ruud Lubbers wins 54 seats, and is ultimately able to form a government on November 7 after entering into coalition with the Labour Party."], ["1989-09-06T00:00:00", "England holds Sweden to a 0-0 draw in Sweden, qualifying for the 1990 FIFA World Cup. The game becomes famous after Terry Butcher sustains a deep cut to his forehead early in the game. He receives stitches but plays on the entire game. By the end of the game, the front of Butcher's white shirt and shorts are almost entirely covered in blood."], ["1989-09-07T00:00:00", "Representatives of the government of Ethiopia and Eritrean separatists meet in Atlanta, with former U.S. President Jimmy Carter attempting to broker a peace settlement."], ["1989-09-08T00:00:00", "Partnair Flight 394 flies past an F-16 Fighting Falcon on its way home, then the Convair 580 rolls upside down and falls in the North Sea."], ["1989-09-10T00:00:00", "The Hungarian government opens the country's western borders to refugees from the German Democratic Republic."], ["1989-09-14T00:00:00", "An agreement of cooperation between Leningrad Oblast (Russia) and Nordland County (Norway) is signed in Leningrad, by chairmen Lev Kojkolainen and Sigbjørn Eriksen."], ["1989-09-18T00:00:00", "alleged coup attempt in Burkina Faso foiled."], ["1989-09-19T00:00:00", "The Catholic Church calls for removal of the Carmelite convent located near the former Auschwitz concentration camp, whose presence had offended some Jewish leaders."], ["1989-09-19T00:00:00", "UTA Flight 772 explodes over Niger, killing all 171 people on board (the Islamic Jihad Organization claims responsibility)."], ["1989-09-19T00:00:00", "Burkinabé ministers Jean-Baptiste Boukary Lingani and Henri Zongo executed following their arrest the previous day."], ["1989-09-20T00:00:00", "F. W. de Klerk is sworn in as the seventh and last State President of apartheid South Africa."], ["1989-09-22T00:00:00", "1989 Deal barracks bombing: An IRA bomb explodes at the Royal Marine School of Music in Deal, Kent, United Kingdom, leaving 11 dead and 22 injured."], ["1989-09-23T00:00:00", "A cease-fire in the Lebanese Civil War stops the violence that had killed 900 people since March."], ["1989-09-26T00:00:00", "Vietnam announces that it has withdrawn the last of its troops from the State of Cambodia, ending an 11-year occupation."], ["1989-09-30T00:00:00", "Nearly 7,000 East Germans who had come to Prague on special refugee trains are allowed to leave for the West."], ["1989-09-30T00:00:00", "The Senegambia Confederation is dissolved over border disagreements."], ["1989-10-01T00:00:00", "Civil union between partners in a same-sex relationship becomes legal in Denmark under a law enacted on June 7, the world's first such legislation."], ["1989-10-03T00:00:00", "Manuel Noriega, military leader of Panama, foils a plot by junior officers to overthrow him."], ["1989-10-03T00:00:00", "The government of East Germany closes the country's border with Czechoslovakia to prevent further emigration to the West."], ["1989-10-05T00:00:00", "The Dalai Lama wins the Nobel Peace Prize."], ["1989-10-06T00:00:00", "Bette Davis, First Lady of American Cinema, dies at 81."], ["1989-10-07T00:00:00", "The communist Hungarian Socialist Workers' Party votes to reorganize itself as a socialist party, to be named the Hungarian Socialist Party."], ["1989-10-07T00:00:00", "The first mass demonstration against the socialistic regime in the GDR began in Plauen, East Germany, at 7 October 1989 and it was the beginning of a series of mass demonstrations in the whole GDR which ultimately led to the unification of Germany in 1990."], ["1989-10-09T00:00:00", "An official news agency in the Soviet Union reports the landing of a UFO in Voronezh."], ["1989-10-09T00:00:00", "In Leipzig, East Germany, protesters demand the legalization of opposition groups and democratic reforms."], ["1989-10-13T00:00:00", "Friday the 13th mini-crash: The Dow Jones Industrial Average plunges 190.58 points, or 6.91 percent, to close at 2,569.26, most likely after the junk bond market collapses."], ["1989-10-13T00:00:00", "Gro Harlem Brundtland, leader of the Labour Party, resigns as Prime Minister of Norway. She is succeeded by Jan P. Syse, leader of the Conservative Party, on October 16."], ["1989-10-15T00:00:00", "Walter Sisulu is released from prison in South Africa."], ["1989-10-17T00:00:00", "The Loma Prieta earthquake, measuring 7.1 on the Richter scale, strikes the San Francisco-Oakland region of Northern California, killing 67 people and delaying the 1989 World Series for 10 days."], ["1989-10-18T00:00:00", "The Communist leader of East Germany, Erich Honecker, is forced to step down as leader of the country after a series of health problems, and is succeeded by Egon Krenz."], ["1989-10-18T00:00:00", "The National Assembly of Hungary votes to restore multiparty democracy."], ["1989-10-18T00:00:00", "NASA launches the unmanned Galileo orbiter on a mission to study the planet Jupiter."], ["1989-10-19T00:00:00", "The Guildford Four are freed after 14 years."], ["1989-10-19T00:00:00", "The Wonders of Life pavilion opens at Epcot in Walt Disney World, Florida."], ["1989-10-21T00:00:00", "The Heads of Government of the Commonwealth of Nations issue the Langkawi Declaration on the Environment, making environmental sustainability one of the Commonwealth's main priorities."], ["1989-10-23T00:00:00", "The Hungarian Republic is officially declared by president Mátyás Szűrös (replacing the Hungarian People's Republic), exactly 33 years after the Hungarian Revolution of 1956."], ["1989-10-23T00:00:00", "The Phillips Disaster in Pasadena, Texas kills 23 and injures 314 others."], ["1989-10-31T00:00:00", "The Grand National Assembly of Turkey elects Prime Minister Turgut Özal as the eighth President of Turkey."], ["1989-10-31T00:00:00", "Half a million people demonstrate in the East German city of Leipzig."], ["1989-11-01T00:00:00", "The President of Nicaragua ends a cease-fire with U.S.-backed contras that had been in effect since April 1988."], ["1989-11-01T00:00:00", "The border between East Germany and Czechoslovakia is reopened."], ["1989-11-02T00:00:00", "North Dakota and South Dakota celebrate their 100th birthdays."], ["1989-11-03T00:00:00", "East German refugees arrive at the West German town of Hof after being allowed through Czechoslovakia."], ["1989-11-04T00:00:00", "Typhoon Gay devastates Thailand's Chumphon Province."], ["1989-11-06T00:00:00", "The Asia-Pacific Economic Cooperation (APEC) is founded."], ["1989-11-07T00:00:00", "Douglas Wilder wins the Virginia governor's race, becoming the first elected African American governor in the United States."], ["1989-11-07T00:00:00", "David Dinkins becomes the first African American mayor of New York City."], ["1989-11-07T00:00:00", "Cold War: The Communist government of East Germany resigns, although SED leader Egon Krenz remains head of state."], ["1989-11-09T00:00:00", "Cold War and Fall of the Berlin Wall: Günter Schabowski accidentally states in a live broadcast press conference that new rules for traveling from East Germany to West Germany will be put in effect \"immediately\". East Germany opens checkpoints in the Berlin Wall, allowing its citizens to travel freely to West Germany for the first time in decades (November 17 celebrates Germans tearing the wall down)."], ["1989-11-09T00:00:00", "Yıldırım Akbulut of ANAP forms the new government of Turkey (47th government)."], ["1989-11-10T00:00:00", "After 45 years of Communist rule in Bulgaria, Bulgarian Communist Party leader Todor Zhivkov is replaced by Foreign Minister Petar Mladenov, who changes the party's name to the Bulgarian Socialist Party."], ["1989-11-10T00:00:00", "Gaby Kennard becomes the first Australian woman to fly solo around the world."], ["1989-11-10T00:00:00", "CKO (a Canadian national all-news radio network) suddenly terminates all broadcasting during the newscast at noon (Eastern time), due to financial losses (the station began broadcasting on July 1, 1977)."], ["1989-11-11T00:00:00", "Louie Espinoza is inaugurated as WBO World Featherweight Champion."], ["1989-11-12T00:00:00", "Brazil holds its first free presidential election since 1960. This marks the first time that all Ibero-American nations, excepting Cuba, have elected constitutional governments simultaneously."], ["1989-11-13T00:00:00", "Hans-Adam II becomes Prince of Liechtenstein on the death of his father, Prince Franz Joseph II."], ["1989-11-14T00:00:00", "Elections are held in Namibia, leading to a victory for the South West Africa People's Organisation."], ["1989-11-15T00:00:00", "Lech Wałęsa, leader of Poland's Solidarity movement, addresses a Joint session of the United States Congress."], ["1989-11-15T00:00:00", "Brazil holds the first round of its first free election in 29 years; Fernando Collor de Mello and Luiz Inácio Lula da Silva are qualified to the second round, which will be disputed the following month."], ["1989-11-16T00:00:00", "Six Jesuit priests—among them Ignacio Ellacuría, Segundo Montes, and Ignacio Martín-Baró—their housekeeper, and her teenage daughter, are murdered by U.S. trained Salvadoran soldiers (for more information see Murder of UCA scholars)."], ["1989-11-16T00:00:00", "The first American cosmetics shop, an Estée Lauder outlet, opens in Moscow."], ["1989-11-16T00:00:00", "South African President F. W. de Klerk announces the scrapping of the Separate Amenities Act."], ["1989-11-16T00:00:00", "UNESCO adopts the Seville Statement on Violence at the 25th session of its General Conference."], ["1989-11-17T00:00:00", "Cold War - Velvet Revolution: A peaceful student demonstration in Prague, Czechoslovakia, is severely beaten back by riot police. This sparks a revolution aimed at overthrowing the Communist government (it succeeds on December 29)."], ["1989-11-17T00:00:00", "Disney's The Little Mermaid premieres in selected theaters."], ["1989-11-20T00:00:00", "Cold War - Velvet Revolution: The number of peaceful protesters assembled in Prague, Czechoslovakia, swells from 200,000 the day before to an estimated half-million."], ["1989-11-21T00:00:00", "The Members of the Constituent Assembly of Namibia begin to draft the Constitution of Namibia, which will be the constitution of the newly independent Namibia."], ["1989-11-22T00:00:00", "In West Beirut, a bomb explodes near the motorcade of Lebanese President René Moawad and kills him."], ["1989-11-24T00:00:00", "Following a week of demonstrations demanding free elections and other reforms, General Secretary Miloš Jakeš and other leaders of the Communist Party of Czechoslovakia resign. Jakeš is replaced by Karel Urbánek."], ["1989-11-26T00:00:00", "Uruguayan general election, 1989: Luis Alberto Lacalle is elected President of Uruguay."], ["1989-11-28T00:00:00", "Cold War - Velvet Revolution: The Communist Party of Czechoslovakia announces they will give up their monopoly on political power (elections held in December bring the first non-communist government to Czechoslovakia in more than 40 years)."], ["1989-11-29T00:00:00", "Rajiv Gandhi resigns as Prime Minister of India after his party, the Indian National Congress, loses about half of its seats in the Indian general election."], ["1989-11-30T00:00:00", "Deutsche Bank board member Alfred Herrhausen is killed by a bomb (the Red Army Faction claims responsibility for the murder)."], ["1989-12-01T00:00:00", "In a meeting with Pope John Paul II, President of the Soviet Union Mikhail Gorbachev pledges greater religious freedom for citizens of the Soviet Union."], ["1989-12-01T00:00:00", "Cold War: East Germany's parliament abolishes the constitutional provision granting the Communist-dominated SED its monopoly on power. Egon Krenz, the Politburo and the Central Committee resign 2 days later."], ["1989-12-01T00:00:00", "A military coup attempt begins in the Philippines against the government of Philippine President Corazon C. Aquino. It is crushed by United States intervention ending by December 9."], ["1989-12-02T00:00:00", "The Solar Maximum Mission scientific research satellite, launched in 1980, crashes back to earth."], ["1989-12-02T00:00:00", "V. P. Singh takes office as Prime Minister of India."], ["1989-12-02T00:00:00", "In the Republic of China legislative election, the Kuomintang suffers its worst election setback in 40 years in power, winning only 53% of the popular vote."], ["1989-12-02T00:00:00", "The Second Malayan Emergency concludes with a peace agreement. The Malayan Communist Party disbands and Chin Peng remains in exile in Thailand until his death in 2013."], ["1989-12-02T00:00:00", "The last two Japanese World War II holdout troops surrender."], ["1989-12-03T00:00:00", "The entire leadership of the ruling Socialist Unity Party in East Germany, including Egon Krenz, resigns."], ["1989-12-03T00:00:00", "Cold War: Malta Summit - In a meeting off the coast of Malta, U.S. President George H. W. Bush and Soviet leader Mikhail Gorbachev release statements indicating that the Cold War between their nations may be coming to an end."], ["1989-12-04T00:00:00", "Prime Minister of Jordan Zaid ibn Shaker resigns and is replaced by Mudar Badran."], ["1989-12-06T00:00:00", "The DAS Building bombing occurs in Bogotá, killing at least 100 people."], ["1989-12-06T00:00:00", "Egon Krenz resigns as Chairman of the State Council of the German Democratic Republic, and is replaced by Manfred Gerlach, the first non-Communist to hold that post."], ["1989-12-06T00:00:00", "École Polytechnique massacre (or Montreal Massacre): Marc Lépine, an anti-feminist gunman, murders 14 young women at the École Polytechnique de Montréal."], ["1989-12-06T00:00:00", "The last episode of the classic era of Doctor Who is broadcast on British television."], ["1989-12-07T00:00:00", "Ladislav Adamec resigns as Prime Minister of Czechoslovakia. He is succeeded by Marián Čalfa on December 10."], ["1989-12-07T00:00:00", "The Lithuanian Soviet Socialist Republic becomes the first of the republics of the Soviet Union to abolish the Communist Party's monopoly on power."], ["1989-12-09T00:00:00", "The Socialist Unity Party of Germany elects the reformist Gregor Gysi as party leader."], ["1989-12-10T00:00:00", "President of Czechoslovakia Gustáv Husák swears in a new cabinet with a non-Communist and then immediately resigns as president."], ["1989-12-10T00:00:00", "Tsakhiagiin Elbegdorj announces the establishment of Mongolia's democratic movement, that peacefully changes the second oldest communist country into a democratic society."], ["1989-12-11T00:00:00", "The International Trans-Antarctica Expedition, a group of six explorers from six nations, reaches the South Pole."], ["1989-12-14T00:00:00", "Chile holds its first free election in 16 years, electing Patricio Aylwin as president."], ["1989-12-15T00:00:00", "Drug baron José Gonzalo Rodríguez Gacha is killed by Colombian police."], ["1989-12-17T00:00:00", "The Romanian Revolution begins in Timișoara when rioters break into the building housing the District Committee of the Romanian Communist Party and cause extensive damage. Their attempts to set the buildings on fire are foiled by military units."], ["1989-12-17T00:00:00", "Brazil holds the second round of its first free election in 29 years; Fernando Collor de Mello is elected to serve as President from 1990."], ["1989-12-17T00:00:00", "The first full-length episode of the animated series The Simpsons, \"Simpsons Roasting on an Open Fire\", is shown on Fox television in the United States."], ["1989-12-19T00:00:00", "Workers in Romanian cities go on strike in protest against the communist regime."], ["1989-12-20T00:00:00", "The United States invasion of Panama (\"Operation Just Cause\") is launched in an attempt to overthrow Panamanian dictator Manuel Noriega."], ["1989-12-21T00:00:00", "Nicolae Ceaușescu addresses an assembly of some 110,000 people outside the Romanian Communist Party headquarters in Bucharest. The crowd begin to protest against Ceaușescu and he orders the army to attack the protesters."], ["1989-12-22T00:00:00", "After a week of bloody demonstrations, Ion Iliescu takes over as president of Romania, ending the communist dictatorship of Nicolae Ceaușescu, who flees his palace in a helicopter to escape inevitable execution after the palace is invaded by rioters. The Romanian troops, who the day before had followed Ceaușescu's orders to attack the demonstrators, change sides and join the uprising."], ["1989-12-22T00:00:00", "Two tourist coaches collide on the Pacific highway north of Kempsey, Australia, killing 35."], ["1989-12-23T00:00:00", "Nicolae and Elena Ceauşescu are captured in Târgoviște."], ["1989-12-25T00:00:00", "Romanian leader Nicolae Ceaușescu and his wife Elena are executed by military troops after being found guilty of crimes against humanity."], ["1989-12-25T00:00:00", "Bank of Japan governors announce a major interest rate hike, eventually leading to the peak and fall of the bubble economy."], ["1989-12-28T00:00:00", "A magnitude 5.6 earthquake hits Newcastle, New South Wales, Australia, killing 13 people."], ["1989-12-29T00:00:00", "Václav Havel is elected president of Czechoslovakia."], ["1989-12-29T00:00:00", "Riots break out after Hong Kong decides to forcibly repatriate Vietnamese refugees."], ["1989-12-29T00:00:00", "Nikkei 225 for Tokyo Stock Exchange hits its all-time intra-day high of 38,957.44 and closing high at 38,915.87."], ["1989-12-29T00:00:00", "Spümcø, the company that produces Ren and Stimpy, is incorporated in California."], ["1989-12-31T00:00:00", "Poland's president signs the Balcerowicz Plan, ending the state socialist system in Poland in favor of a capitalist system and Polish involvement in the Warsaw Pact."]]