[["2010-01-03T00:00:00", "The United States and the United Kingdom close their embassies in Yemen due to the ongoing security threat by Al-Qaeda."], ["2010-01-04T00:00:00", "The tallest man-made structure to date, the Burj Khalifa in Dubai, United Arab Emirates, is officially opened."], ["2010-01-08T00:00:00", "The Togo national football team is involved in an attack in Cabinda Province, Angola, and as a result withdraws from the Africa Cup of Nations. The attack was perpetrated by the FLEC, their first since the Angolan Civil War."], ["2010-01-12T00:00:00", "A 7.0-magnitude earthquake occurs in Haiti, devastating the nation's capital, Port-au-Prince. With a confirmed death toll over 316,000, it is the seventh deadliest on record."], ["2010-01-15T00:00:00", "The longest annular solar eclipse of the 3rd millennium occurs."], ["2010-01-15T00:00:00", "The Chadian Civil War (2005-10) officially ends"], ["2010-01-25T00:00:00", "Ethiopian Airlines Flight 409 crashes into the Mediterranean shortly after take-off from Beirut-Rafic Hariri International Airport, killing all 90 people on board."], ["2010-02-03T00:00:00", "The sculpture L'Homme qui marche I by Alberto Giacometti sells in London for £65 million (US$103.7 million), setting a new world record for a work of art sold at auction."], ["2010-02-12T00:00:00", "February 28 - The 2010 Winter Olympics are held in Vancouver and Whistler, Canada."], ["2010-02-18T00:00:00", "The President of Niger, Mamadou Tandja, is overthrown after a group of soldiers storms the presidential palace and form a ruling junta, the Supreme Council for the Restoration of Democracy headed by chef d'escadron Salou Djibo."], ["2010-02-27T00:00:00", "An 8.8-magnitude earthquake occurs in Chile, triggering a tsunami over the Pacific and killing at least 525. The earthquake is one of the largest in recorded history."], ["2010-03-16T00:00:00", "The Kasubi Tombs, Uganda's only cultural World Heritage Site, are destroyed by fire."], ["2010-03-26T00:00:00", "The ROKS Cheonan, a South Korean Navy ship carrying 104 personnel, sinks off the country's west coast, killing 46. In May, an independent investigation blames North Korea, which denies the allegations."], ["2010-04-07T00:00:00", "Kyrgyz President Kurmanbek Bakiyev flees Bishkek amid fierce rioting, sparking a sociopolitical crisis. Former foreign minister Roza Otunbayeva is placed at the head of an interim government as the opposition seizes control."], ["2010-04-10T00:00:00", "The President of Poland, Lech Kaczyński, is among 96 killed when their airplane crashes in Smolensk, western Russia while on their way to commemorate the Soviet Katyn massacre."], ["2010-04-13T00:00:00", "A 6.9-magnitude earthquake occurs in Qinghai, China, killing at least 2,000 and injuring more than 10,000."], ["2010-04-14T00:00:00", "Volcanic ash from one of several eruptions beneath Mount Eyjafjallajökull, an ice cap in Iceland, begins to disrupt air traffic across northern and western Europe."], ["2010-04-20T00:00:00", "The Deepwater Horizon oil drilling platform explodes in the Gulf of Mexico, killing 11 workers. The resulting Horizon oil spill, one of the largest in history, spreads for several months, damaging the waters and the United States coastline, and prompting international debate and doubt about the practice and procedures of offshore drilling."], ["2010-04-27T00:00:00", "Standard & Poor's downgrades Greece's sovereign credit rating to junk 4 days after the activation of a €45-billion EU-IMF bailout, triggering the decline of stock markets worldwide and of the euro's value, and furthering a European sovereign debt crisis."], ["2010-05-02T00:00:00", "The eurozone and the International Monetary Fund agree to a €110 billion bailout package for Greece. The package involves sharp Greek austerity measures."], ["2010-05-04T00:00:00", "Nude, Green Leaves and Bust by Pablo Picasso sells in New York for US$106.5 million, setting another new world record for a work of art sold at auction."], ["2010-05-07T00:00:00", "Scientists conducting the Neanderthal genome project announce that they have sequenced enough of the Neanderthal genome to suggest that Neanderthals and humans may have interbred."], ["2010-05-12T00:00:00", "Afriqiyah Airways Flight 771 crashes at runway at Tripoli International Airport in Libya, killing 103 of the 104 people on board."], ["2010-05-19T00:00:00", "Protests in Bangkok, Thailand, end with a bloody military crackdown, killing 91 and injuring more than 2,100."], ["2010-05-20T00:00:00", "Scientists announced that they have created a functional synthetic genome."], ["2010-05-20T00:00:00", "Five paintings worth €100 million are stolen from the Musée d'Art Moderne de la Ville de Paris."], ["2010-05-22T00:00:00", "Air India Express Flight 812 overshoots the runway at Mangalore International Airport in India, killing 158 and leaving 8 survivors."], ["2010-05-31T00:00:00", "Nine activists are killed in a clash with soldiers when Israeli Navy forces raid and capture a flotilla of ships attempting to break the Gaza blockade."], ["2010-06-10T00:00:00", "June 14 - Ethnic riots in Kyrgyzstan between Kyrgyz and Uzbeks result in the deaths of hundreds."], ["2010-06-11T00:00:00", "July 11 - The 2010 FIFA World Cup is held in South Africa, and is won by Spain, with the runner-up being the Netherlands."], ["2010-07-08T00:00:00", "The first 24-hour flight by a solar-powered plane is completed by the Solar Impulse."], ["2010-07-25T00:00:00", "WikiLeaks, an online publisher of anonymous, covert, and classified material, leaks to the public over 90,000 internal reports about the United States-led involvement in the War in Afghanistan from 2004 to 2010."], ["2010-07-29T00:00:00", "Heavy monsoon rains begin to cause widespread flooding (pictured) in the Khyber Pakhtunkhwa province of Pakistan. Over 1,600 are killed, and more than one million are displaced by the floods."], ["2010-08-10T00:00:00", "The World Health Organization declares the H1N1 influenza pandemic over, saying worldwide flu activity has returned to typical seasonal patterns."], ["2010-09-04T00:00:00", "A 7.1 magnitude earthquake rocks Christchurch, New Zealand causing large amounts of damage but no direct fatalities. It is the first in a series of earthquakes between 2010 and 2012 that resulted in the deaths of 187 people and over $40 billion worth of damage. Seismologists noted that the earthquake sequence was highly unusual, and likely to never happen again anywhere else in the world."], ["2010-10-10T00:00:00", "The Netherlands Antilles are dissolved, with the islands being split up and given a new constitutional status."], ["2010-10-22T00:00:00", "The International Space Station surpasses the record for the longest continuous human occupation of space, having been continuously inhabited since November 2, 2000 (3641 days)."], ["2010-10-23T00:00:00", "In preparation for the Seoul summit, finance ministers of the G-20 agree to reform the International Monetary Fund and shift 6% of the voting shares to developing nations and countries with emerging markets."], ["2010-10-25T00:00:00", "An earthquake and consequent tsunami off the coast of Sumatra, Indonesia, kills over 400 people and leaves hundreds missing."], ["2010-10-26T00:00:00", "December: Repeated eruptions of Mount Merapi volcano in Central Java, Indonesia, and accompanying pyroclastic flows of scalding gas, pumice, and volcanic ash descending the erupting volcano kill 300 people and force hundreds of thousands of residents to evacuate."], ["2010-11-04T00:00:00", "Aero Caribbean Flight 883 crashes in central Cuba, killing all 68 people on board."], ["2010-11-11T00:00:00", "November 12 - The G-20 summit is held in Seoul, South Korea. Korea becomes the first non-G8 nation to host a G-20 leaders summit."], ["2010-11-13T00:00:00", "Burmese opposition politician Aung San Suu Kyi is released from her house arrest after being incarcerated since 1989."], ["2010-11-17T00:00:00", "Researchers at CERN trap 38 antihydrogen atoms for a sixth of a second, marking the first time in history that humans have trapped antimatter."], ["2010-11-20T00:00:00", "Participants of the 2010 NATO Lisbon summit issue the Lisbon Summit Declaration."], ["2010-11-21T00:00:00", "Eurozone countries agree to a rescue package for the Republic of Ireland from the European Financial Stability Facility in response to the country's financial crisis."], ["2010-11-23T00:00:00", "North Korea shells Yeonpyeong Island, prompting a military response by South Korea. The incident causes an escalation of tension on the Korean Peninsula and prompts widespread international condemnation. The United Nations declares it to be one of the most serious incidents since the end of the Korean War."], ["2010-11-28T00:00:00", "WikiLeaks releases a collection of more than 250,000 American diplomatic cables, including 100,000 marked \"secret\" or \"confidential\"."], ["2010-11-29T00:00:00", "The European Union agree to an €85 billion rescue deal for Ireland from the European Financial Stability Facility, the International Monetary Fund and bilateral loans from the United Kingdom, Denmark and Sweden."], ["2010-11-29T00:00:00", "December 10 - The 2010 United Nations Climate Change Conference is held in Cancún, Mexico. Also referred to as the 16th Conference of the Parties of the United Nations Framework Convention on Climate Change (COP 16), it serves too as the 6th meeting of the Parties to the Kyoto Protocol (CMP 6)."], ["2010-12-18T00:00:00", "The Arab Spring begins."], ["2010-12-21T00:00:00", "The first total lunar eclipse to occur on the day of the Northern winter solstice and Southern summer solstice since 1638 takes place."]]