[["1927-01-01T00:00:00", "The Cristero War erupts in Mexico when Catholic rebels attack the government, which had placed heavy restrictions on the Catholic Church."], ["1927-01-07T00:00:00", "The first transatlantic telephone call is made via radio from New York City to London."], ["1927-01-09T00:00:00", "A military rebellion is crushed in Lisbon, Portugal."], ["1927-01-15T00:00:00", "Teddy Wakelam gives the first sports commentary on BBC Radio."], ["1927-01-19T00:00:00", "Great Britain sends troops to China to protect foreign nationals from spreading anti-foreign riots in Central China."], ["1927-01-30T00:00:00", "Right-wing veterans and the Republikanischer Schutzbund clash in Schattendorf, Austria, with two fatalities resulting (see also July 15)."], ["1927-02-12T00:00:00", "The first British troops land in Shanghai."], ["1927-02-14T00:00:00", "An earthquake in Yugoslavia kills 100."], ["1927-02-19T00:00:00", "A general strike in Shanghai protests the presence of British troops."], ["1927-02-19T00:00:00", "In the United States, the silent romantic comedy film It starring Clara Bow, is released, popularising the concept of the \"It girl\"."], ["1927-02-23T00:00:00", "The U.S. Federal Radio Commission (later renamed the Federal Communications Commission) begins to regulate the use of radio frequencies."], ["1927-03-04T00:00:00", "A diamond rush in South Africa includes trained athletes that have been hired by major companies to stake claims."], ["1927-03-07T00:00:00", "A Richter scale 7.6 magnitude earthquake kills at least 2,925 at Toyooka and Mineyama area, in western Honshu, Japan."], ["1927-03-10T00:00:00", "Albania mobilizes in case of an attack by Yugoslavia."], ["1927-03-11T00:00:00", "In New York City, the Roxy Theatre is opened by Samuel Roxy Rothafel."], ["1927-03-11T00:00:00", "The first armored car robbery is committed by the Flatheads Gang near Pittsburgh."], ["1927-03-13T00:00:00", "Fritz Lang's culturally influential film Metropolis premieres in Germany."], ["1927-03-24T00:00:00", "Nanking Incident: After six foreigners have been killed in Nanking and it appears that Kuomintang and Communist Party of China forces would overrun the foreign consulates, warships of the U.S. Navy and the British Royal Navy fire shells and shot to disperse the crowds."], ["1927-04-01T00:00:00", "The U.S. Bureau of Prohibition is founded (under the Department of the Treasury)."], ["1927-04-05T00:00:00", "In Britain, the Trade Disputes and Trade Unions Act 1927 forbids strikes of support."], ["1927-04-07T00:00:00", "Bell Telephone Co. transmits an image of Herbert Hoover (then the Secretary of Commerce), which becomes the first successful long distance demonstration of television."], ["1927-04-12T00:00:00", "The Royal and Parliamentary Titles Act 1927 renames the United Kingdom of Great Britain and Ireland as the United Kingdom of Great Britain and Northern Ireland. The change acknowledges that the Irish Free State is no longer part of the Kingdom."], ["1927-04-12T00:00:00", "Kuomintang troops kill a number of communist-supporting workers in Shanghai. The incident is called the April 12 Incident, or the Shanghai Massacre. The 1st United Front between the Nationalists and Communist ends, and the Civil War lasting until 1949 begins."], ["1927-04-14T00:00:00", "The first Volvo automobile rolled off the production line in Gothenburg, Sweden."], ["1927-04-18T00:00:00", "The Kuomintang (Nationalist Chinese) set up a government in Nanking, China."], ["1927-04-21T00:00:00", "A banking crisis hits Japan."], ["1927-04-27T00:00:00", "The Carabineros de Chile (Chilean national police force and gendarmery) are created."], ["1927-04-27T00:00:00", "João Ribeiro de Barros becomes the first non-European to make a transatlantic flight, flying from Genoa, Italy, to Fernando de Noronha, Brazil."], ["1927-05-09T00:00:00", "The Australian Parliament convenes for the first time in Canberra, Australian Capital Territory. Previously, the Parliament had met in Melbourne, State of Victoria."], ["1927-05-11T00:00:00", "The Academy of Motion Picture Arts and Sciences, the \"Academy\" in \"Academy Awards\", is founded."], ["1927-05-12T00:00:00", "British police officers raid the office of the Soviet trade delegation in London."], ["1927-05-13T00:00:00", "King George V proclaims the change of his title from King of the United Kingdom of Great Britain and Ireland to King of Great Britain and Northern Ireland."], ["1927-05-17T00:00:00", "U.S. Army aviation pioneer Major Harold Geiger dies in the crash of his Airco DH.4 airplane, at Olmsted Field, Pennsylvania."], ["1927-05-18T00:00:00", "Bath School disaster: a series of violent attacks results in 45 deaths, mostly of school children, in Bath Township, Michigan."], ["1927-05-20T00:00:00", "By the Treaty of Jeddah, the United Kingdom recognizes the sovereignty of Ibn Saud over the Kingdom of Hejaz and Nejd, the future Saudi Arabia."], ["1927-05-22T00:00:00", "A magnitude 8.6 earthquake in Xining, China kills about 200,000 people."], ["1927-05-23T00:00:00", "Nearly 600 members of the American Institute of Electrical Engineers and the Institute of Radio Engineers view a live demonstration of television at the Bell Telephone Building in New York City, just over a year after John Logie Baird of Scotland had first demonstrated an electromechanical television system to the members of the Royal Society in London."], ["1927-05-24T00:00:00", "The United Kingdom cuts its diplomatic relations with the Soviet Union due to revelations of espionage and underground agitation."], ["1927-06-04T00:00:00", "Yugoslavia severs diplomatic relations with Albania."], ["1927-06-07T00:00:00", "Pyotr Voykov, the Soviet ambassador to Poland, is murdered."], ["1927-06-09T00:00:00", "The Soviet Union executes 20 for alleged espionage."], ["1927-06-13T00:00:00", "Léon Daudet, the leader of the French monarchists, is arrested in France."], ["1927-06-13T00:00:00", "A ticker tape parade is held for the aviator Charles Lindbergh down 5th Avenue in New York City."], ["1927-06-29T00:00:00", "A total eclipse of the sun takes place over Wales, northern England, southern Scotland, Norway, northern Sweden, northmost Finland, and the northmost extremes of Russia."], ["1927-07-01T00:00:00", "The Food, Drug, and Insecticide Administration (FDIA) is established as a United States federal agency."], ["1927-07-10T00:00:00", "Kevin O'Higgins, Vice-President of the Executive Council of the Irish Free State and Minister for Justice, is assassinated by the anti-Treaty Irish Republican Army in Dublin."], ["1927-07-11T00:00:00", "The 1927 Jericho earthquake strikes Palestine, killing around 300 people. The effects are especially severe in Nablus, but damage and fatalities are also reported in many areas of Palestine and Transjordan such as Amman, Salt, Jordan, and Lydda."], ["1927-07-15T00:00:00", "July Revolt of 1927: 85 protesters and five policemen are left dead after the police in Vienna fire on an angry crowd, mostly members of the Social Democratic Party of Austria; more than 600 people are injured."], ["1927-07-24T00:00:00", "The Menin Gate is dedicated as a war memorial at Ypres, Belgium."], ["1927-08-01T00:00:00", "The Communist Chinese People's Liberation Army is formed during the Nanchang Uprising."], ["1927-08-02T00:00:00", "U.S. President Calvin Coolidge announces, \"I do not choose to run for president in 1928.\""], ["1927-08-07T00:00:00", "The Peace Bridge opens between Fort Erie, Ontario and Buffalo, New York."], ["1927-08-10T00:00:00", "The Mount Rushmore Park is rededicated. President Calvin Coolidge promises national funding for the proposed carving of the presidential figures."], ["1927-08-22T00:00:00", "200 people demonstrate in Hyde Park, London against the death sentencing of Italian immigrant anarchists Sacco and Vanzetti."], ["1927-08-23T00:00:00", "Sacco and Vanzetti are executed."], ["1927-08-24T00:00:00", "August 25 - Hurricane hits the Atlantic Provinces of Canada, causing massive damage and at least 56 deaths."], ["1927-08-26T00:00:00", "Paul R. Redfern leaves Brunswick, Georgia, flying his Stinson Detroiter \"Port of Brunswick\" to attempt a solo nonstop flight to Rio de Janeiro, Brazil. He later crashes in the Venezuelan jungle, but the crash site has never been found."], ["1927-09-07T00:00:00", "The University of Minas Gerais is founded in Brazil."], ["1927-09-14T00:00:00", "An underwater earthquake in Japan kills over 100 people."], ["1927-09-18T00:00:00", "The Columbia Phonographic Broadcasting System (later known as CBS) is formed and goes on the air with 47 radio stations."], ["1927-09-25T00:00:00", "A treaty signed by the League of Nations Slavery Commission abolishes all types of slavery."], ["1927-09-27T00:00:00", "79 are killed and 550 are injured in the East St. Louis Tornado, the 2nd costliest and at least 24th deadliest tornado in U.S. history."], ["1927-10-04T00:00:00", "The actual carving begins at Mount Rushmore, South Dakota."], ["1927-10-06T00:00:00", "The Jazz Singer opens in the United States and it becomes a huge success, although silent films continue to be made for some time."], ["1927-10-08T00:00:00", "Murderers' Row: The New York Yankees complete a four-game sweep of the Pittsburgh Pirates in the World Series."], ["1927-10-09T00:00:00", "The Mexican government crushes a rebellion in Veracruz."], ["1927-10-18T00:00:00", "The first flight of Pan American Airways takes off from Key West, Florida, bound for Havana, Cuba."], ["1927-10-27T00:00:00", "The Italian steamer ship Principessa Mafalda capsizes off Porto Seguro, Brazil. At least 314 people are killed."], ["1927-10-27T00:00:00", "Queen Wilhelmina of the Netherlands opens the Meuse-Waal Canal in Nijmegen, Holland"], ["1927-10-27T00:00:00", "At 5:50 a.m. a ground fault gives way, causing the mine and part of the town of Worthington to collapse into a large chasm located in Ontario. Nobody is injured in the incident, as the area had been evacuated the night before after a mine foreman noticed abnormal rock shifts in the mine."], ["1927-11-01T00:00:00", "İsmet İnönü forms a new government in Turkey (The 5th government)."], ["1927-11-03T00:00:00", "November 4 - Floods devastating Vermont cause the \"worst natural disaster in the state's history\"."], ["1927-11-04T00:00:00", "Frank Heath and his horse Gypsy Queen return to Washington, D.C., having completed a two-year journey of 11,356 miles to all 48 of the states (of that time)."], ["1927-11-12T00:00:00", "Mahatma Gandhi makes his first and last visit to Ceylon."], ["1927-11-12T00:00:00", "Leon Trotsky is expelled from the Soviet Communist Party, leaving Joseph Stalin with undisputed control of the Soviet Union."], ["1927-11-12T00:00:00", "The Holland Tunnel opens to traffic as the first vehicular tunnel under the Hudson River linking New Jersey with New York City."], ["1927-11-14T00:00:00", "The Pittsburgh gasometer explosion: Three Equitable Gas storage tanks in the North Side of Pittsburgh explode, killing 26 people and causing damage estimated between $4.0 million and $5.0 million."], ["1927-11-21T00:00:00", "The Colorado state police open fire on 500 rowdy but unarmed miners during a strike, killing six of them."], ["1927-12-02T00:00:00", "Following 19 years of Ford Model T production, the Ford Motor Company unveils the Ford Model A as its new automobile."], ["1927-12-14T00:00:00", "Iraq gains independence from the United Kingdom."], ["1927-12-15T00:00:00", "Marion Parker, 12, is kidnapped in Los Angeles. Her dismembered body is found on December 19, prompting the largest manhunt to date on the West Coast for her killer, William Edward Hickman, who is arrested on December 22 in Oregon."], ["1927-12-17T00:00:00", "The U.S. submarine S-4 is accidentally rammed and sunk by the United States Coast Guard cutter John Paulding off Provincetown, Massachusetts, killing everyone aboard despite several unsuccessful attempts to raise the submarine."], ["1927-12-27T00:00:00", "Kern and Hammerstein's musical play, Show Boat, based on Edna Ferber's novel, opens on Broadway and then goes on to become the first great classic of the American musical theater."], ["1927-12-30T00:00:00", "The first Japanese commuter metro line, the Tokyo Metro Ginza Line, opens."]]