[["2008-01-01T00:00:00", "Cyprus and Malta adopt the euro."], ["2008-01-01T00:00:00", "A suicide bombing occurs in Zayouna, Baghdad, killing over 25 people during a funeral over the deaths from the preceding attack."], ["2008-01-02T00:00:00", "The price of petroleum hits $100 per barrel for the first time."], ["2008-01-03T00:00:00", "A car bomb detonates, killing at least 4 and injuring 68, in Diyarbakır, Turkey. Police blame Kurdish rebels."], ["2008-01-08T00:00:00", "An attempted assassination of Maldivian president Maumoon Abdul Gayoom is thwarted after a Boy Scout grabs the attacker's knife. The Boy Scout is injured, but after a scuffle police arrest the attacker."], ["2008-01-12T00:00:00", "A Macedonian Army Mil Mi-17 helicopter crashes in thick fog southeast of Skopje, killing all 11 military personnel on board."], ["2008-01-14T00:00:00", "At 19:04:39 UTC, the MESSENGER space probe is at its closest approach during its first flyby of the planet Mercury."], ["2008-01-15T00:00:00", "The Federal Court of Australia orders a Japanese whaling company to stop research whaling within their exclusive economic zone."], ["2008-01-21T00:00:00", "Stock markets around the world plunge amid growing fears of a U.S. recession, fueled by the 2007 subprime mortgage crisis."], ["2008-01-22T00:00:00", "Russia stages the largest naval exercise since the fall of the Soviet Union in 1991 in the Bay of Biscay. The Russian aircraft carrier Admiral Kuznetsov, along with 11 support vessels and 47 long-range bomber aircraft, practises strike tactics off the coast of France and Spain, and test-launches nuclear-capable missiles in foreign waters."], ["2008-01-23T00:00:00", "Polish Air Force EADS CASA C-295 crashes on approach to the 12th Air Base near Mirosławiec; all 20 personnel on board die."], ["2008-01-23T00:00:00", "Thousands of Palestinians cross into Egypt, as the border wall with Gaza in Rafah is blown up by militants."], ["2008-01-24T00:00:00", "A peace deal ends the Kivu conflict in the Democratic Republic of the Congo."], ["2008-01-25T00:00:00", "China's worst snowstorm since 1954 kills 133, delays traffic, and causes massive power outages in central and southern parts of the country."], ["2008-01-29T00:00:00", "Iran's judiciary sentences to prison 54 Bahá'í Faith followers for \"anti-regime propaganda\"."], ["2008-02-02T00:00:00", "Rebels attack the capital of Chad, N'Djamena."], ["2008-02-04T00:00:00", "Iran opens its first space center and launches a rocket into space."], ["2008-02-04T00:00:00", "A Palestinian suicide bomber kills 1 and wounds 13 in a Dimona, Israel shopping center."], ["2008-02-05T00:00:00", "U.S. stock market indices plunge more than 3% after a report shows signs of economic recession in the service sector. The S&P 500 fall 3.2%, The Dow Jones Industrial Average drops 370 points."], ["2008-02-05T00:00:00", "February 6 - A tornado outbreak, the deadliest in 23 years, kills 58 in the Southern United States."], ["2008-02-07T00:00:00", "STS-122: Space Shuttle Atlantis launches to deliver the European-built Columbus science laboratory to the International Space Station."], ["2008-02-10T00:00:00", "The 2008 Namdaemun fire severely damages Namdaemun, the first National Treasure of South Korea."], ["2008-02-11T00:00:00", "President of East Timor José Ramos-Horta is seriously wounded in an attack on his home by rebel soldiers. Rebel leader Alfredo Reinado is killed by Ramos-Horta's security guards during the attack."], ["2008-02-12T00:00:00", "PDVSA, a state oil company in Venezuela, suspends sales of crude oil to ExxonMobil, in response to a legal challenge by them."], ["2008-02-12T00:00:00", "Bridgestone, under investigation for an alleged price-fixing cartel, uncovers improper payments of at least 150 million Japanese yen to foreign governments and withdraws from the marine hose business."], ["2008-02-13T00:00:00", "Prime Minister Kevin Rudd of Australia delivers a formal apology to the Stolen Generations."], ["2008-02-17T00:00:00", "Kosovo formally declares independence from Serbia, with support from some countries but opposition from others."], ["2008-02-18T00:00:00", "The British government introduces emergency legislation temporarily to nationalize Northern Rock, the 5th largest mortgage bank in the UK, due to the bank's financial crisis."], ["2008-02-18T00:00:00", "A general election is held in Pakistan, delayed from January 8 due to riots in the wake of the assassination of Benazir Bhutto. Opposition parties, including Bhutto's, take more than half of the seats, while President Pervez Musharraf's party suffers a huge defeat."], ["2008-02-19T00:00:00", "Fidel Castro announces his resignation as President of Cuba, effective February 24."], ["2008-02-20T00:00:00", "The United States Navy destroys a spy satellite containing toxic fuel, by shooting it down with a missile launched from the USS Lake Erie in the Pacific Ocean."], ["2008-02-20T00:00:00", "A total lunar eclipse crosses North and South America, Europe, Africa, and Southwest Asia."], ["2008-02-22T00:00:00", "Former building society Northern Rock is the first bank in Europe to be taken into state control, due to the U.S. subprime mortgage financial crisis."], ["2008-02-22T00:00:00", "No survivors are found after a rescue helicopter discovers the wreckage of Santa Bárbara Airlines Flight 518 just northeast of Mérida, Venezuela. The commercial plane had 46 people on board, including crew."], ["2008-02-24T00:00:00", "Raúl Castro is unanimously elected as President of Cuba by the National Assembly."], ["2008-03-01T00:00:00", "In Gaza Strip, at least 52 Palestinians and 2 Israeli soldiers are killed in the most intense Israeli air strikes since 2005."], ["2008-03-02T00:00:00", "2008 Andean diplomatic crisis: Venezuela and Ecuador move troops to the Colombian border, following a Colombian raid against FARC guerrillas inside Ecuador's national territory, in which senior commander Raúl Reyes is killed."], ["2008-03-06T00:00:00", "Eight Israeli civilians are killed and 9 wounded when a Palestinian attacker opens fire at a Jewish seminary in Jerusalem."], ["2008-03-09T00:00:00", "The first European Space Agency Automated Transfer Vehicle, a cargo spacecraft for the International Space Station, launches from Guiana Space Centre in French Guiana."], ["2008-03-14T00:00:00", "Demonstrations by Tibetan separatists turn violent as rioters target government and Han Chinese-owned buildings."], ["2008-03-15T00:00:00", "A gun factory explosion in Gërdec, Albania, kills more than 30. Over the following week, Albania, Kosovo, and some surrounding countries supply and support Gërdec's population with food, blood, etc."], ["2008-03-19T00:00:00", "An exploding star halfway across the visible universe becomes the farthest known object ever visible to the naked eye."], ["2008-03-24T00:00:00", "Bhutan holds its first-ever general elections."], ["2008-03-25T00:00:00", "A 414 square kilometer (160 sq. mi.2) chunk of Antarctica's Wilkins Ice Shelf disintegrates, leaving the entire shelf at risk."], ["2008-03-25T00:00:00", "African Union and Comoros forces invade the rebel-held island of Anjouan."], ["2008-04-08T00:00:00", "The Privy Council of the United Kingdom approves Sark's dismantling of its feudal system to comply with the European Convention on Human Rights. and the first elections under the new law will be held in December 2008 and the new chamber will first convene in January 2009."], ["2008-04-15T00:00:00", "A Hewa Bora Airways DC-9 crashes into a residential area of Goma, Democratic Republic of the Congo."], ["2008-04-22T00:00:00", "Surgeons at London's Moorfields Eye Hospital perform the first operations using bionic eyes, implanting them into 2 blind patients."], ["2008-04-27T00:00:00", "The Taliban attempts to assassinate Afghan President Hamid Karzai in a military parade in Kabul."], ["2008-04-28T00:00:00", "India sets a world record by sending 10 satellites into orbit in a single launch."], ["2008-04-28T00:00:00", "71 die in a train crash in Shandong, China."], ["2008-05-03T00:00:00", "Over 133,000 in Burma/Myanmar are killed by Cyclone Nargis, the deadliest natural disaster since the Boxing Day Tsunami in 2004."], ["2008-05-07T00:00:00", "Dmitry Medvedev takes office as President of Russia, replacing Vladimir Putin."], ["2008-05-08T00:00:00", "Armed clashes and fighting begin in Lebanon."], ["2008-05-11T00:00:00", "Burma/Myanmar holds a constitutional referendum."], ["2008-05-12T00:00:00", "Over 69,000 are killed in central south-west China by the Wenchuan quake, an earthquake measuring 7.9 Moment magnitude scale. The epicenter is 90 kilometers (56 mi) west-northwest of the provincial capital Chengdu, Sichuan province."], ["2008-05-13T00:00:00", "A series of bomb blasts kills at least 63 and injures 216 in Jaipur, India."], ["2008-05-14T00:00:00", "NASA announces the discovery of Supernova remnant G1.9+0.3."], ["2008-05-15T00:00:00", "An oil pipeline explosion in Ijegun, Nigeria, kills 100."], ["2008-05-23T00:00:00", "The Union of South American Nations, a supranational union, is created by a union between the Andean Community and Mercosur."], ["2008-05-23T00:00:00", "The International Court of Justice awards Middle Rocks to Malaysia and Pedra Branca to Singapore, ending a 29-year territorial dispute between the 2 countries."], ["2008-05-25T00:00:00", "NASA's Phoenix spacecraft becomes the first to land on the northern polar region of Mars."], ["2008-05-28T00:00:00", "The Federal Democratic Republic of Nepal is established after the Assembly votes overwhelmingly in favor of abolishing the country's 240-year-old monarchy. Girija Prasad Koirala becomes temporary head of state."], ["2008-05-30T00:00:00", "The Convention on Cluster Munitions is adopted in Dublin."], ["2008-06-02T00:00:00", "A car bomb explodes outside the Danish embassy in Islamabad, Pakistan, killing at least five people."], ["2008-06-08T00:00:00", "In the Akihabara area of Tokyo, Japan, a 25-year-old man stabs seven to death and wounds 10, before being arrested."], ["2008-06-10T00:00:00", "Fire engulfs Sudan Airways Flight 109 after it lands in Khartoum, killing 44."], ["2008-06-11T00:00:00", "The Fermi Gamma-ray Space Telescope is launched."], ["2008-06-11T00:00:00", "Canadian Prime Minister Stephen Harper apologizes to Canada's First Nations for the Canadian Indian residential school system."], ["2008-06-12T00:00:00", "Ireland votes to reject the Treaty of Lisbon, in the only referendum to be held by a European Union member state on the treaty."], ["2008-06-14T00:00:00", "A 6.9 magnitude earthquake in Iwate Prefecture, Japan, kills 12 and injures more than 400."], ["2008-06-14T00:00:00", "Expo 2008 starts in Zaragoza, Spain (ends in September) with the topic \"Water and sustainable development\"."], ["2008-06-22T00:00:00", "Typhoon Fengshen hits the Philippines and capsizes the ferry MV Princess of the Stars, leaving hundreds dead or missing."], ["2008-06-27T00:00:00", "Zimbabwean President Robert Mugabe is reelected with 85.5 per cent of the vote in the second round of the controversial presidential election."], ["2008-06-27T00:00:00", "After three decades as the Chairman of Microsoft Corporation, Bill Gates steps down from daily duties to concentrate on philanthropy."], ["2008-07-02T00:00:00", "Íngrid Betancourt and 14 other hostages are rescued from FARC by Colombian security forces."], ["2008-07-07T00:00:00", "A suicide-bomber drives an explosives-laden automobile into the front gates of the Indian embassy in Kabul, Afghanistan, killing 58 and injuring over 150."], ["2008-07-07T00:00:00", "July 9 - The 34th G8 summit is held in Tōyako, Hokkaidō, Japan."], ["2008-07-10T00:00:00", "Former Macedonian Interior Minister Ljube Boškoski is acquitted of all charges, by a UN Tribunal accusing him of war crimes."], ["2008-07-15T00:00:00", "July 20 - World Youth Day takes place in Sydney, Australia. Pope Benedict XVI appears at the event."], ["2008-07-21T00:00:00", "Radovan Karadžić, the first president of the Republika Srpska, is arrested in Belgrade, Serbia, on allegations of war crimes, following a 12-year-long manhunt."], ["2008-07-22T00:00:00", "The United Progressive Alliance-led government in India survives a crucial no-confidence vote, based on disagreements between the Indian National Congress and Left Front, over the Indo-US nuclear deal."], ["2008-07-23T00:00:00", "Ram Baran Yadav is sworn in as the first President of Nepal."], ["2008-07-25T00:00:00", "A series of 7 bomb blasts rock Bangalore, India, killing 2 and injuring 20; the next day, a series of bomb blasts in Ahmedabad, Gujarat, India, kills 45 and injures over 160 people."], ["2008-07-27T00:00:00", "At least 17 are killed and over 154 wounded in 2 blasts in Istanbul."], ["2008-07-28T00:00:00", "At least 48 are dead and over 287 injured after bombs explode in Baghdad and Kirkuk, Iraq."], ["2008-08-01T00:00:00", "A total eclipse of the Sun is visible from Canada and extends across northern Greenland, the Arctic, central Russia, Mongolia, and China."], ["2008-08-01T00:00:00", "George Tupou V is crowned as the new King of Tonga, an event that had been delayed for over 2 years following the 2006 Nuku‘alofa riots."], ["2008-08-03T00:00:00", "A stampede at a Hindu temple at Naina Devi in Bilaspur, Himachal Pradesh, India, kills 162 and injures 400."], ["2008-08-04T00:00:00", "Two members of the East Turkestan Islamic Movement, which had threatened to attack the Beijing Olympics, kill 16 and injure another 16 officers at a police station in Kashgar, Xinjiang, China."], ["2008-08-06T00:00:00", "President Sidi Ould Cheikh Abdallahi of Mauritania is deposed in a military coup d'état."], ["2008-08-07T00:00:00", "The 2008 South Ossetia war begins, as Georgia and Russia launch a major offensive inside the separatist region of South Ossetia after days of border skirmishes between the two sides."], ["2008-08-08T00:00:00", "August 24 - The 2008 Summer Olympics take place in Beijing, China."], ["2008-08-10T00:00:00", "A propane facility explodes in Toronto overnight and causes a large-scale evacuation, resulting in 2 deaths."], ["2008-08-15T00:00:00", "Pushpa Kamal Dahal (known as Prachanda) is sworn in as the first Prime Minister of the Federal Democratic Republic of Nepal, after the Nepalese monarchy was abolished in May."], ["2008-08-17T00:00:00", "Michael Phelps surpasses Mark Spitz in Gold Medals won at a single Olympics, winning eight."], ["2008-08-18T00:00:00", "Pervez Musharraf resigns as President of Pakistan, under impeachment pressure from the coalition government."], ["2008-08-19T00:00:00", "Taliban insurgents kill 10 and injure 21 French soldiers in an ambush in Afghanistan."], ["2008-08-19T00:00:00", "A suicide bomber rams a car into an Algerian military academy, killing 43 and injuring 45."], ["2008-08-20T00:00:00", "Spanair Flight 5022, from Madrid to Gran Canaria, skids off the runway and crashes at Barajas Airport with 172 on board. Of them, 154 die and 18 survive."], ["2008-08-21T00:00:00", "At least 60 die following twin suicide bombings outside the Pakistan Ordnance Factories in Wah, Pakistan."], ["2008-08-22T00:00:00", "Pirates hijack German, Iranian, and Japanese cargo ships off the coast of Somalia, in 7 such attacks since June 20."], ["2008-08-24T00:00:00", "An aircraft crashes in Guatemala, killing 10, including 4 Americans on a humanitarian mission."], ["2008-08-24T00:00:00", "Iran Aseman Airlines Flight 6895 crashes upon takeoff near Manas International Airport in Bishkek, Kyrgyzstan, killing 68."], ["2008-08-26T00:00:00", "Russia unilaterally recognizes the independence of Georgian breakaway republics Abkhazia and South Ossetia."], ["2008-08-26T00:00:00", "September 1 - Hurricane Gustav makes landfall on Louisiana as Category 2 and kills 7 in the United States, after making landfall on western Cuba as Category 4, and killing 66 in Haiti, 8 in the Dominican Republic, and 11 in Jamaica."], ["2008-08-28T00:00:00", "September 7 - Hurricane Hanna kills 7 in the United States, and 529 in Haiti, mostly due to deluges and mudslides."], ["2008-09-01T00:00:00", "September 14 - Hurricane Ike makes landfall on Texas as Category 2 and kills 27 in the United States, after killing four in Cuba, 1 in the Dominican Republic, and 75 in Haiti."], ["2008-09-02T00:00:00", "Political crisis in Thailand: Prime Minister Samak Sundaravej of Thailand declares a state of emergency in Bangkok."], ["2008-09-03T00:00:00", "Prime Minister Yousaf Raza Gillani of Pakistan survives an assassination attempt near Islamabad, while on his way to meet British Leader of the Opposition David Cameron."], ["2008-09-03T00:00:00", "Presidents Demetris Christofias and Mehmet Ali Talat hold peace talks in Nicosia, aimed at reunifying Cyprus."], ["2008-09-06T00:00:00", "At least 8 boulders dislodge from a cliff near Cairo, Egypt, killing at least 90 and burying an estimated 500 people."], ["2008-09-09T00:00:00", "Political crisis in Thailand: The Constitutional Court of Thailand orders Prime Minister Samak Sundaravej to resign, after he is paid for appearing on a television cooking show."], ["2008-09-10T00:00:00", "The proton beam is circulated for the first time in the Large Hadron Collider, the world's largest and highest-energy particle accelerator, located at CERN, near Geneva, under the Franco-Swiss border."], ["2008-09-10T00:00:00", "The 2008 Bandar Abbas earthquake strikes southern Iran, killing 7 and injuring 45 people."], ["2008-09-12T00:00:00", "A Metrolink train collides head-on into a freight train in Los Angeles, killing 25 and injuring 130."], ["2008-09-14T00:00:00", "Aeroflot Flight 821 crashes near the city of Perm, Russia, killing all 88 on board."], ["2008-09-14T00:00:00", "Churches are attacked in Mangalore and southern Karnataka, India, leading to Christian protests and strong police suppression."], ["2008-09-15T00:00:00", "Following negotiations, President Robert Mugabe and opposition leaders Morgan Tsvangirai and Arthur Mutambara sign a power-sharing deal, making Tsvangirai the new Prime Minister of Zimbabwe."], ["2008-09-15T00:00:00", "Lehman Brothers files for Chapter 11 bankruptcy protection, laying the catalyst for the Global financial crisis."], ["2008-09-17T00:00:00", "The International Astronomical Union classifies Haumea as the 5th dwarf planet in the Solar System."], ["2008-09-20T00:00:00", "A suicide truck bomb explosion destroys the Marriott Hotel in Islamabad, Pakistan, killing at least 60 and injuring 266."], ["2008-09-25T00:00:00", "Shenzhou 7, the third manned Chinese spaceflight and the first with 3 crew members, is successfully launched. China becomes the third country ever to conduct a spacewalk."], ["2008-09-28T00:00:00", "SpaceX Falcon 1 becomes the world's first privately developed space launch vehicle to successfully make orbit."], ["2008-09-29T00:00:00", "The DOW loses 777 points, the biggest one-day point decline ever. The drop comes after the House of Representatives votes down a $700 billion bank bailout plan."], ["2008-09-30T00:00:00", "A Jodhpur temple stampede in western India kills over 224 people, and injures 400."], ["2008-10-03T00:00:00", "Global financial crisis: U.S. President George W. Bush signs the revised Emergency Economic Stabilization Act into law, creating a 700 billion dollar Treasury fund to purchase failing bank assets."], ["2008-10-06T00:00:00", "NASA's MESSENGER spacecraft makes its second of three flybys of Mercury, decreasing the velocity for orbital insertion on March 18, 2011."], ["2008-10-06T00:00:00", "An earthquake measuring 6.6 magnitude kills at least 65 in Kyrgyzstan."], ["2008-10-06T00:00:00", "Symantec acquires PC Tools for $262,000,000."], ["2008-10-07T00:00:00", "Global financial crisis: Russia agrees to provide Iceland with a four-billion-euro loan."], ["2008-10-07T00:00:00", "The meteoroid 2008 TC3 impacts Earth, becoming the first such object to be discovered prior to impact."], ["2008-10-09T00:00:00", "Global financial crisis: Following a major banking and financial crisis in Iceland, the Icelandic Financial Supervisory Authority takes control of the 3 largest banks in the country: Kaupthing Bank, Landsbanki, and Glitnir."], ["2008-10-12T00:00:00", "Craig Lowndes and Jamie Whincup win the 2008 Supercheap Auto Bathurst 1000 for Ford and Triple 8."], ["2008-10-14T00:00:00", "Canadian federal election, 2008: Prime Minister Stephen Harper is re-elected with a stronger minority government."], ["2008-10-17T00:00:00", "The United Nations General Assembly elects Turkey, Austria, Japan, Uganda, and Mexico to two-year terms on the Security Council."], ["2008-10-21T00:00:00", "The Large Hadron Collider (LHC) is officially inaugurated. It is a collaboration of over 10,000 scientists and engineers from over 100 countries as well as hundreds of universities and laboratories."], ["2008-10-22T00:00:00", "The Indian Space Research Organisation successfully launches the Chandrayaan-1 spacecraft on a lunar exploration mission."], ["2008-10-29T00:00:00", "Global financial crisis: Hungary's currency and stock markets rise on the news that it will receive an international economic bailout package worth $25 billion from the IMF, European Union, and World Bank."], ["2008-10-29T00:00:00", "Delta Air Lines merges with Northwest Airlines, forming the world's largest commercial carrier."], ["2008-11-04T00:00:00", "United States presidential election, 2008: Democratic U. S. Senator Barack Obama is elected the 44th President of the United States, and becomes the first African-American President-elect."], ["2008-11-06T00:00:00", "King Jigme Khesar Namgyel Wangchuck of Bhutan is crowned, having ascended to the throne in 2006."], ["2008-11-07T00:00:00", "The 2008 Pétionville school collapse kills at least 92 in Pétionville, Haiti."], ["2008-11-08T00:00:00", "An accident aboard Russian submarine Nerpa kills 20."], ["2008-11-11T00:00:00", "The Queen Elizabeth 2 departs on her last voyage from Southampton, UK to Dubai, UAE. She will become a floating hotel at Palm Jumeirah."], ["2008-11-14T00:00:00", "STS-126: The Space Shuttle Endeavour uses the MPLM Leonardo to deliver experiment and storage racks to the International Space Station (there will be only 3 more launches of Space Shuttle Endeavour after this mission)."], ["2008-11-19T00:00:00", "Claudia Castillo of Spain becomes the first person to have a successful trachea transplant using a tissue-engineered organ."], ["2008-11-20T00:00:00", "The Buzzard Coulee meteorite falls over Canada."], ["2008-11-22T00:00:00", "November 23 - The APEC Peru 2008 Summit is held in Lima."], ["2008-11-24T00:00:00", "The 2008 Santa Catarina floods in Santa Catarina, Brazil, kill 126 and force the evacuation of over 78,000 people."], ["2008-11-25T00:00:00", "Greenland holds a referendum for increased autonomy from Denmark. The vote is over 75% in favour."], ["2008-11-25T00:00:00", "Political crisis in Thailand: Protesters from the People's Alliance for Democracy party storm into Suvarnabhumi Airport and block flights from taking off. More protesters seize control of Don Mueang Airport the following day."], ["2008-11-25T00:00:00", "A car bomb in St. Petersburg, Russia, kills 3 people and injures 1."], ["2008-11-26T00:00:00", "November 29 - A series of terrorist attacks in Mumbai, India by Pakistan-based Islamic militants who lay siege over a hotel for 2 days, results in 195 casualties, and over 250 injured."], ["2008-11-27T00:00:00", "The longest serving ocean liner in history, QE2, is retired from service."], ["2008-11-29T00:00:00", "Riots in Jos, Nigeria, kill 381, and injure at least 300."], ["2008-12-01T00:00:00", "A triangular conjunction formed by a new Moon, Venus and Jupiter is a prominent sight in the evening sky."], ["2008-12-02T00:00:00", "Political crisis in Thailand: After weeks of opposition-led protests, the Constitutional Court of Thailand dissolves the governing People's Power Party and 2 coalition member parties, and bans leaders of the parties, including Prime Minister Somchai Wongsawat, from politics for 5 years. As such, Wongsawat promptly resigns and is replaced by Deputy Prime Minister Chaovarat Chanweerakul as caretaker Prime Minister."], ["2008-12-03T00:00:00", "The Convention on Cluster Munitions opens for signature in Oslo."], ["2008-12-04T00:00:00", "Political crisis in Canada: Governor General Michaëlle Jean grants the request of Prime Minister Stephen Harper to prorogue Parliament until January 26, 2009, averting a motion of no confidence by the new opposition coalition led by the Leader of the Opposition Stéphane Dion, and the New Democratic Party leader Jack Layton, with Bloc Québécois leader Gilles Duceppe as a coalition partner."], ["2008-12-05T00:00:00", "Human remains found in 1991 are identified as Tsar Nicholas II of Russia, using DNA analysis."], ["2008-12-06T00:00:00", "Riots spread across Greece after a 15-year-old boy is shot dead by a special guard of the Greek Police."], ["2008-12-07T00:00:00", "Jamie Whincup wins the 2008 V8 Supercar Championship series for Ford and Triple 8 Racing."], ["2008-12-10T00:00:00", "The Channel Island of Sark, a British Crown dependency, holds its first fully democratic elections under a new constitutional arrangement, becoming the last European territory to abolish feudalism."], ["2008-12-11T00:00:00", "Bernard Madoff is arrested by U.S. federal authorities on charges of running a massive decades-long Ponzi scheme swindling thousands of investors - the largest financial fraud in history."], ["2008-12-12T00:00:00", "Switzerland becomes the 25th European country to join the Schengen Agreement, whereby cross-border passport checks will be abolished."], ["2008-12-12T00:00:00", "The Moon moves into its nearest point to Earth, called perigee, at the same time as its fullest phase of the lunar cycle. The Moon appears to be 14% bigger and 30% brighter than the year's other full moons. The next time these two events coincide will be in 2016."], ["2008-12-16T00:00:00", "Ruins of an ancient Wari city are discovered in northern Peru."], ["2008-12-18T00:00:00", "The International Criminal Tribunal for Rwanda convicts Théoneste Bagosora and 2 other senior Rwandan army officers of genocide, crimes against humanity and war crimes and sentences them to life imprisonment."], ["2008-12-21T00:00:00", "Gwadar Port, Pakistan, becomes fully operational."], ["2008-12-23T00:00:00", "A military coup d'état is announced in Guinea shortly after the death of long-time President Lansana Conté."], ["2008-12-27T00:00:00", "Israel initiates \"Operation Cast Lead\" in the Gaza Strip after launching an extensive wave of airstrikes against military targets, police stations and government buildings within the Gaza Strip with the stated aim of stopping rocket fire from and arms import into the territory. As a result, Hamas intensified its rocket and mortar attacks against Southern Israel, reaching the major cities of Beersheba and Ashdod for the first time."], ["2008-12-29T00:00:00", "Bangladesh holds its general elections after 2 years of political unrest over the interim government."], ["2008-12-31T00:00:00", "An extra leap second (23:59:60) is added to end the year. The last time this occurred was in 2005."]]