[["1996-01-01T00:00:00", "Fahd of Saudi Arabia temporarily gives power to Crown Prince Abdullah, his legal successor, due to illness."], ["1996-01-03T00:00:00", "Motorola introduces the Motorola StarTAC Wearable Cellular Telephone, the world's smallest and lightest mobile phone to date."], ["1996-01-04T00:00:00", "Hosni Mubarak, the president of Egypt, appoints a new government in response to accusations of corruption in the parliamentary elections in late 1995."], ["1996-01-05T00:00:00", "Hamas operative Yahya Ayyash is assassinated by an Israeli Shabak-planted, bomb-laden cell phone."], ["1996-01-07T00:00:00", "One of the worst blizzards in American history hits the eastern states, killing more than 150 people. Philadelphia receives a record 30.7 inches (78 cm) of snowfall, New York City's public schools close for the first time in 18 years and the federal government in Washington, D.C. is closed for days."], ["1996-01-08T00:00:00", "A Zairean cargo plane crashes into a crowded market in the center of the capital Kinshasa, killing 300."], ["1996-01-11T00:00:00", "Ryutaro Hashimoto, leader of the Liberal Democratic Party, becomes Prime Minister of Japan."], ["1996-01-13T00:00:00", "Italy's prime minister, Lamberto Dini, resigns after the failure of all-party talks to confirm him. New talks are initiated by president Oscar Luigi Scalfaro to form a new government."], ["1996-01-14T00:00:00", "Jorge Sampaio is elected president of Portugal."], ["1996-01-15T00:00:00", "Amber Hagerman, a 9-year old American child victim and namesake for the AMBER Alert system, is murdered in Arlington, Texas."], ["1996-01-16T00:00:00", "President of Sierra Leone Valentine Strasser is deposed by the chief of defence, Julius Maada Bio. Bio promises to restore power following elections scheduled for February."], ["1996-01-19T00:00:00", "The North Cape oil spill occurs as an engine fire forces the tugboat Scandia ashore on Moonstone Beach in South Kingstown, Rhode Island. The North Cape Barge is pulled along with it and leaks 820,000 gallons of home heating oil."], ["1996-01-19T00:00:00", "An Indonesian ferry sinks off the northern tip of Sumatra, drowning more than 100 people."], ["1996-01-20T00:00:00", "Yasser Arafat is re-elected president of the Palestinian Authority."], ["1996-01-21T00:00:00", "France undertakes its last nuclear weapon test."], ["1996-01-22T00:00:00", "Andreas Papandreou, Prime Minister of Greece, resigns due to health problems; a new government forms under Costas Simitis."], ["1996-01-24T00:00:00", "Polish Premier Józef Oleksy resigns amid charges that he spied for Moscow. He is replaced by Włodzimierz Cimoszewicz."], ["1996-01-26T00:00:00", "Whitewater scandal: U.S. First Lady Hillary Rodham Clinton testifies before a grand jury."], ["1996-01-27T00:00:00", "Colonel Ibrahim Baré Maïnassara deposes the first democratically elected president of Niger, Mahamane Ousmane, in a military coup."], ["1996-01-29T00:00:00", "President Jacques Chirac announces a \"definitive end\" to French nuclear testing."], ["1996-01-29T00:00:00", "Fire destroys La Fenice, Venice's opera house."], ["1996-01-30T00:00:00", "Irish National Liberation Army leader Gino Gallagher is killed in an internal feud."], ["1996-01-31T00:00:00", "Colombo Central Bank bombing: an explosives-filled truck rams into the gates of the Central Bank in Colombo, Sri Lanka, killing at least 86 and injuring 1,400."], ["1996-01-31T00:00:00", "An explosion in Shaoyang, China kills 122 and injures over 400 when 10 tons of dynamite in an illegal explosives warehouse underneath an apartment building detonate."], ["1996-02-04T00:00:00", "An earthquake near Lijiang in southwest China, measuring up to 7 on the Richter scale, kills 322 people, injures 14,000 and makes hundreds of thousands homeless."], ["1996-02-06T00:00:00", "Birgenair Flight 301, on an unauthorised charter flight from the Caribbean to Germany, crashes into the Atlantic Ocean off the coast of the Dominican Republic, killing all 189 passengers and crew."], ["1996-02-07T00:00:00", "René Préval succeeds Jean-Bertrand Aristide as president of Haiti, in the first peaceful handover of power since the nation achieved independence."], ["1996-02-08T00:00:00", "An IRA ceasefire ends with the Docklands bombing in London's Canary Wharf District, killing 2 and causing over £85 million worth of damage."], ["1996-02-09T00:00:00", "The element copernicium is created by fusing a 208Pb nucleus with a 70Zn nucleus, forming 278Cn. Given the placeholder name \"ununbium\", the element is not named until 2010."], ["1996-02-10T00:00:00", "Chess computer \"Deep Blue\" defeats world chess champion Garry Kasparov for the first time."], ["1996-02-10T00:00:00", "Bosnian Serbs break off contact with the Bosnian government and with representatives of Ifor, the NATO localised force, in reaction to the arrest of several Bosnian Serb war criminals."], ["1996-02-14T00:00:00", "Violent clashes erupt between Filipino soldiers and Vietnamese boat people, as the Philippines government attempts to forcibly repatriate hundreds of Vietnamese asylum seekers."], ["1996-02-15T00:00:00", "In southwest Wales, the oil tanker Sea Empress runs aground, spilling 73,000 tonnes of crude oil, killing many birds."], ["1996-02-15T00:00:00", "The U.S. Embassy in Athens, Greece, comes under mortar fire."], ["1996-02-15T00:00:00", "A Long March 3 rocket at the Xichang Satellite Launch Center in China crashes into a rural village after liftoff, killing as many as 50."], ["1996-02-15T00:00:00", "Begum Khaleda Zia is reelected as prime minister of Bangladesh. The country's second democratic election is marred by low voter turnout, due to several boycotts and pre-election violence, which result in at least 13 deaths."], ["1996-02-15T00:00:00", "The UK government publishes the Scott Report."], ["1996-02-17T00:00:00", "In Philadelphia, Garry Kasparov beats \"Deep Blue\" in a second chess match."], ["1996-02-17T00:00:00", "In Irian Jaya, an earthquake of magnitude 7.5 and associated tidal waves kills 102 people and causes widespread devastation."], ["1996-02-18T00:00:00", "An IRA briefcase bomb in a bus kills the bomber and injures 9 in the West End of London."], ["1996-02-19T00:00:00", "A wooden ferry capsizes as it enters the port of Cádiz in the Philippines, killing 54 people."], ["1996-02-21T00:00:00", "King Fahd of Saudi Arabia announces his medical recovery in the national press and assumes power again from his brother, Crown Prince Abdullah."], ["1996-02-24T00:00:00", "Cuban fighter jets shoot down 2 American aircraft belonging to the Cuban exile group, Brothers to the Rescue. Cuban officials assert that they invaded Cuban airspace."], ["1996-02-25T00:00:00", "Two suicide bombs in Israel kill 25 and injure 80; Hamas claims responsibility."], ["1996-02-27T00:00:00", "Pokémon Red and Green is released in Japan as the first game in the world famous Pokémon series."], ["1996-02-28T00:00:00", "Canadian singer Alanis Morissette wins the top honor, Album of the Year award, at the 38th Annual Grammy Awards. She is the youngest person to ever win this award, a record she will hold until 2010."], ["1996-02-29T00:00:00", "In Lumberton, North Carolina, Daniel Green is convicted of the murder of James Jordan, the father of basketball star Michael Jordan."], ["1996-02-29T00:00:00", "Faucett Flight 251 en route from Lima to Rodriguez Ballon airport crashes into a mountain near Arequipa; all 123 people on board are killed."], ["1996-02-29T00:00:00", "At least 81 people drown when a boat capsizes 120 kilometres east of Kampala, Uganda."], ["1996-02-29T00:00:00", "The Bosnian government declares the end of the Siege of Sarajevo."], ["1996-03-01T00:00:00", "Iraq disarmament crisis: Iraqi forces refuse UNSCOM inspection teams access to 5 sites designated for inspection. The teams enter the sites only after delays of up to 17 hours."], ["1996-03-02T00:00:00", "Ranabima Royal College is established in Sri Lanka."], ["1996-03-02T00:00:00", "The Australian federal election, 1996 is held; Labor's Paul Keating loses to Liberal leader John Howard."], ["1996-03-03T00:00:00", "José María Aznar, leader of the Popular Party, is elected prime minister of Spain, replacing Felipe González."], ["1996-03-06T00:00:00", "Mesut Yılmaz, of ANAP forms the new government of Turkey (53rd government)."], ["1996-03-06T00:00:00", "A boat carrying market traders capsizes outside Freetown harbour, in Sierra Leone, killing at least 86."], ["1996-03-06T00:00:00", "Chechen rebels attack the Russian government headquarters in Grozny; 70 Russian soldiers and policemen and 130 Chechen fighters are killed."], ["1996-03-08T00:00:00", "The People's Republic of China begins surface-to-surface missile testing and military exercises off Taiwanese coastal areas. The United States government condemns the act as provocation, and the Taiwanese government warns of retaliation."], ["1996-03-09T00:00:00", "Jorge Sampaio is the new Portuguese president."], ["1996-03-11T00:00:00", "John Howard is sworn in as the new Prime Minister of Australia."], ["1996-03-13T00:00:00", "Dunblane massacre: Unemployed former shopkeeper Thomas Hamilton walks into the Dunblane Primary School in Scotland and opens fire, killing 16 infant school pupils and one teacher before fatally shooting himself."], ["1996-03-14T00:00:00", "An international peace summit is held in Egypt, in response to escalating terrorist attacks in the Middle East."], ["1996-03-16T00:00:00", "Robert Mugabe is reelected president of Zimbabwe, although only 32 percent of the electorate actually voted."], ["1996-03-17T00:00:00", "Sri Lanka wins the Cricket World Cup by beating Australia in a disappointing final."], ["1996-03-18T00:00:00", "The Ozone Disco Club fire in Quezon City, Philippines kills 163."], ["1996-03-20T00:00:00", "The British Government announces that Bovine spongiform encephalopathy has been likely transmitted to people."], ["1996-03-22T00:00:00", "Sweden`s Finance Minister Göran Persson becomes his homeland`s new Prime Minister."], ["1996-03-23T00:00:00", "The Republic of China (Taiwan) holds its first direct elections for president; Lee Teng-hui is re-elected."], ["1996-03-24T00:00:00", "Islamists clash with security forces in Kashmir, killing 11."], ["1996-03-24T00:00:00", "The devastating Marcopper mining disaster on the island of Marinduque, Philippines takes place."], ["1996-03-25T00:00:00", "An 81-day-long standoff begins between antigovernment Freemen and federal officers in Jordan, Montana."], ["1996-03-25T00:00:00", "The 68th Academy Awards, hosted by Whoopi Goldberg, are held at the Dorothy Chandler Pavilion in Los Angeles with Braveheart winning Best Picture."], ["1996-03-26T00:00:00", "The International Monetary Fund approves a $10.2 billion loan to Russia for economic reform."], ["1996-03-28T00:00:00", "Fire breaks out at the Pasar Anyar shopping centre in Bogor, West Java. The first death toll estimate is 78 until rescuers notice that 68 of them are mannequins."], ["1996-03-28T00:00:00", "Three British soldiers are found guilty of the manslaughter of Danish tour guide Louise Jensen in Cyprus. Allan Ford, Justin Fowler and Geoffrey Pernell receive life sentences for the September, 1994 rape/murder."], ["1996-04-01T00:00:00", "The Halifax Regional Municipality in Nova Scotia is created."], ["1996-04-03T00:00:00", "A Boeing 737 military jet crashes into a mountain north of Dubrovnik, Croatia. All 35 people on board die, including United States Secretary of Commerce Ron Brown (see 1996 Croatia USAF CT-43 crash)."], ["1996-04-03T00:00:00", "Suspected \"Unabomber\" Theodore Kaczynski is arrested at his Montana cabin."], ["1996-04-03T00:00:00", "Massacres of Hutus by Tutsis in Burundi take place, with more than 450 killed in a few days."], ["1996-04-06T00:00:00", "Fighting breaks out in Monrovia, Liberia, between various rebel factions struggling for power in the country's interrupted civil war. Several foreign nationals leave the nation."], ["1996-04-06T00:00:00", "Major League Soccer kicks off in front of an overflow crowd of 31,683 packed in Spartan Stadium, to witness the historic first game. San Jose Clash forward Eric Wynalda scores the league's first goal in a 1-0 victory over D.C. United."], ["1996-04-06T00:00:00", "Turkish authorities begin Operation Hawk, an army offensive against rebels from the Kurdish Worker's Party in southeastern Turkey."], ["1996-04-09T00:00:00", "In a common statement, the European Union officially recognizes the Federal Republic of Yugoslavia."], ["1996-04-11T00:00:00", "The Israeli government launches Operation Grapes of Wrath, consisting of massive attacks on Lebanon, in retaliation for prior terrorist attacks, and sparking off a violent series of retaliations."], ["1996-04-11T00:00:00", "At Düsseldorf International Airport, smouldering polystyrene evolves into a major fire, killing 17 people inside the terminal building."], ["1996-04-18T00:00:00", "Qana Massacre: Over 100 Lebanese civilians are killed after Israel shells the United Nations compound in Qana."], ["1996-04-18T00:00:00", "In reaction to the Qana Massacre, an Islamist group in Egypt open fire on a hotel, killing 18 Greek tourists and injuring 17 others."], ["1996-04-21T00:00:00", "A general election in Italy proclaims a new center-left government headed by Romano Prodi, replacing Silvio Berlusconi."], ["1996-04-24T00:00:00", "At the urging of Yasser Arafat, the Palestine Liberation Organization drops its clause calling for the removal of Israel. The Israeli government responds by dropping a similar clause concerning the existence of Palestine."], ["1996-04-26T00:00:00", "A regional security treaty is signed by the \"Shanghai Five\"."], ["1996-04-28T00:00:00", "Port Arthur massacre: Martin Bryant kills 35 people at the Port Arthur, Tasmania tourist site, Australia."], ["1996-04-28T00:00:00", "A bomb explodes in Bhaiperu, Pakistan, killing more than 60 people."], ["1996-05-04T00:00:00", "A Sudanese Federal Airlines jet crashes on a domestic flight in a severe dust storm, while making an emergency landing 325 kilometres northeast of Khartoum, killing all 53 passengers and crew."], ["1996-05-08T00:00:00", "The Keck II telescope is dedicated in Hawaii."], ["1996-05-09T00:00:00", "South Africa's National Party pulls out of the 2-year-old coalition government, and the African National Congress assumes full political control."], ["1996-05-09T00:00:00", "Ugandan president Yoweri Museveni wins a landslide victory in the country's first direct presidential elections, securing 75% of the vote."], ["1996-05-10T00:00:00", "1996 Everest disaster: A sudden storm engulfs Mount Everest with several climbing teams high on the mountain, leaving 8 dead. By the end of the month, at least 4 other climbers die in the worst season of fatalities on the mountain to date."], ["1996-05-10T00:00:00", "The Australian government introduces a nationwide ban on the private possession of both automatic and semi-automatic rifles, in response to the Port Arthur massacre."], ["1996-05-10T00:00:00", "Vietnamese Vietnamese boat people in Hong Kong, facing forced repatriation due to their classification as economic migrants rather than refugees, stage a protest at the Whitehead Detention Centre."], ["1996-05-11T00:00:00", "After takeoff from Miami, a fire started by improperly handled oxygen canisters in the cargo hold of Atlanta-bound ValuJet Flight 592, causes the Douglas DC-9 to crash in the Florida Everglades, killing all 110 on board."], ["1996-05-13T00:00:00", "Severe thunderstorms and a tornado in Bangladesh kill 600."], ["1996-05-15T00:00:00", "Nine hostages held by the Free Papua Organization in Irian Jaya are rescued after an operation by the Indonesian military; 2 other hostages are later found dead."], ["1996-05-18T00:00:00", "The X Prize Foundation launches the $10 million Ansari X Prize, which is won in 2004, by Burt Rutan's SpaceShipOne."], ["1996-05-20T00:00:00", "Gay rights - Romer v. Evans: The Supreme Court of the United States rules against a law that prevents any city, town or county in the state of Colorado from taking any legislative, executive, or judicial action to protect the rights of homosexuals."], ["1996-05-21T00:00:00", "The MV Bukoba sinks in Tanzanian waters in Lake Victoria, killing nearly 1,000 in one of Africa's worst maritime disasters."], ["1996-05-21T00:00:00", "The Trappist Martyrs of Atlas are executed."], ["1996-05-23T00:00:00", "Swede Göran Kropp reaches the Mount Everest summit alone without oxygen, after having bicycled there from Sweden."], ["1996-05-23T00:00:00", "Members of the Armed Islamic Group in Algeria kill 7 French Trappist monks, after talks with French government concerning the imprisonment of several GIA sympathisers break down."], ["1996-05-27T00:00:00", "First Chechnya War: Russian President Boris Yeltsin meets with Chechnyan rebels for the first time and negotiates a cease-fire in the war."], ["1996-05-28T00:00:00", "Albania's general election of May 26 is declared unfair by international monitors, and the ruling Democratic Party under President Sali Berisha is charged by the Organization for Security and Co-operation in Europe with rigging the elections. Several hundred protestors gather in Tirana to demonstrate against the election result."], ["1996-05-30T00:00:00", "The Likud Party, led by Benjamin Netanyahu, wins a narrow victory in the Israeli general election."], ["1996-05-30T00:00:00", "The Hoover Institution releases an optimistic report that global warming will probably reduce mortality in the United States and provide Americans with valuable benefits."], ["1996-05-31T00:00:00", "FIFA decides to give the FIFA World Cup 2002, the first World Cup in Asia, to Japan and South Korea, becoming the first World Cup with co-host countries in the history of the event."], ["1996-06-04T00:00:00", "The space rocket Ariane 5 explodes 40 seconds after takeoff in French Guiana. The project costs European governments 7.5 billion US dollars over 11 years."], ["1996-06-06T00:00:00", "Leighton W. Smith, Jr. resigns as NATO commander in the face of increasing criticism."], ["1996-06-07T00:00:00", "An IRA gang kills Detective Garda Jerry McCabe during a botched armed robbery in Adare, County Limerick."], ["1996-06-08T00:00:00", "The 10th European Football Championship (UEFA Euro 96) begins in England."], ["1996-06-08T00:00:00", "Steffi Graf defeats Arantxa Sánchez Vicario in the longest ever women's final at the French Open, to win her 19th Grand Slam title."], ["1996-06-10T00:00:00", "Peace talks begin in Northern Ireland without Sinn Féin."], ["1996-06-11T00:00:00", "An explosion in a São Paulo suburban shopping centre kills 44 and injures more than 100."], ["1996-06-11T00:00:00", "A peace convoy carrying Chechen separatist leaders and international diplomats is targeted by a series of remotely controlled land mines; 8 are killed."], ["1996-06-12T00:00:00", "In Philadelphia, a panel of federal judges blocks a law against indecency on the Internet. The panel says that the 1996 Communications Decency Act would infringe upon the free speech rights of adults."], ["1996-06-13T00:00:00", "An 81-day standoff between the Montana Freemen and FBI agents ends with their surrender in Montana."], ["1996-06-15T00:00:00", "In Manchester, UK, a massive IRA bomb injures over 200 people and devastates a large part of the city centre."], ["1996-06-19T00:00:00", "Boris Yeltsin emerges as the winner in Russia's first round of presidential elections."], ["1996-06-20T00:00:00", "Thousands of Megawati Sukarnoputri supporters clash with police in Jakarta, Indonesia."], ["1996-06-23T00:00:00", "The Nintendo 64 video game system is released in Japan."], ["1996-06-23T00:00:00", "Archbishop Desmond Tutu is given an official farewell at his retirement service."], ["1996-06-25T00:00:00", "The Khobar Towers bombing in Saudi Arabia kills 19 U.S. servicemen."], ["1996-06-26T00:00:00", "Journalist Veronica Guerin is shot and killed in her car just outside Dublin."], ["1996-06-28T00:00:00", "A new government is formed in Turkey, with Necmettin Erbakan of Refah Partisi becoming prime minister of the coalition government, and deputy and foreign minister Tansu Çiller of the True Path Party succeeding him after 2 years."], ["1996-06-28T00:00:00", "The Constitution of Ukraine is signed into law."], ["1996-06-29T00:00:00", "The Prince's Trust concert is held in Hyde Park, London, and is attended by 150,000 people. The Who headlines the event in their first performance since 1989."], ["1996-06-29T00:00:00", "An explosion in a firecrackers factory in Sichuan Province, China kills at least 36 people and injures another 52."], ["1996-06-30T00:00:00", "Costas Simitis is elected President of the Panhellenic Socialist Movement of Greece."], ["1996-06-30T00:00:00", "Bosnian Serb leader Radovan Karadžić reliquishes power to his deputy, Biljana Plavšić."], ["1996-06-30T00:00:00", "Germany defeats the Czech Republic 2-1 after extra time in the final of the European Championships."], ["1996-07-01T00:00:00", "The Northern Territory in Australia legalises voluntary euthanasia."], ["1996-07-02T00:00:00", "In Los Angeles, Lyle and Erik Menendez are sentenced to life in prison without the possibility of parole."], ["1996-07-03T00:00:00", "Boris Yeltsin is reelected as President of Russia after the second round of elections."], ["1996-07-05T00:00:00", "Dolly the sheep, the first mammal to be successfully cloned from an adult cell, is born at the Roslin Institute in Midlothian, Scotland."], ["1996-07-08T00:00:00", "Martina Hingis becomes the youngest person in history (age 15 years and 282 days) to win at Wimbledon in the Ladies' Doubles event."], ["1996-07-10T00:00:00", "Harriet the Spy, the first movie made by Nickelodeon Movies premieres in theaters."], ["1996-07-11T00:00:00", "Arrest warrants are issued for Bosnian Serb war criminals Radovan Karadžić and Ratko Mladić by the Russell Tribunal in The Hague."], ["1996-07-12T00:00:00", "Hurricane Bertha: made landfall in North Carolina as a Category 2 storm, causing $270 million in damage to the United States and its possessions and many indirect deaths."], ["1996-07-13T00:00:00", "A Republican Sinn Féin bomb explodes outside of a hotel in Enniskillen, Northern Ireland, disrupting a wedding reception and injuring 17 people."], ["1996-07-16T00:00:00", "An outbreak of E. coli food poisoning in Japan results in 6,000 children being ill, including two deaths, after a group of school children eat contaminated lunches."], ["1996-07-17T00:00:00", "The Community of Portuguese Language Countries (Comunidade dos Países de Língua Portuguesa) is constituted."], ["1996-07-17T00:00:00", "Paris and Rome-bound TWA Flight 800 (Boeing 747) explodes off the coast of Long Island, New York, killing all 230 on board."], ["1996-07-17T00:00:00", "Joe Klein admits that he is \"Anonymous\", the author of Primary Colors."], ["1996-07-18T00:00:00", "Howard Hughes is sentenced to life imprisonment at Chester Crown Court for the rape and murder of 7-year-old Sophie Hook at Llandudno 12 months previously. The trial judge recommends that Hughes, 31, should never be released, however the Home Secretary set his minimum term at 50 years in 2002, meaning he is eligible for parole in 2046."], ["1996-07-19T00:00:00", "An F3 tornado 5.5 miles (8.9 km) away from the Westminster, Maryland city center injures 3 people and causes $5 million in damages."], ["1996-07-19T00:00:00", "The 1996 Summer Olympics in Atlanta, United States, begin."], ["1996-07-19T00:00:00", "Bosnian Serb President Radovan Karadžić resigns from public office in Republika Srpska after being indicted for war crimes."], ["1996-07-21T00:00:00", "The Saguenay Flood, one of Canada's most costly natural disasters, is caused by flooding on the Saguenay River in Quebec."], ["1996-07-24T00:00:00", "The Dehiwala train bombing kills 56 commuters outside Colombo."], ["1996-07-25T00:00:00", "The Tutsi-led Burundian army performs a coup and reinstalls previous president Pierre Buyoya, ousting current president Sylvestre Ntibantunganya."], ["1996-07-27T00:00:00", "The Centennial Olympic Park bombing at the 1996 Summer Olympics kills 1 and injures 111."], ["1996-07-29T00:00:00", "The child protection portion of the Communications Decency Act (1996) is struck down as too broad by a U.S. federal court."], ["1996-08-01T00:00:00", "Sarah Balabagan returns to the Philippines."], ["1996-08-01T00:00:00", "A pro-democracy demonstration supporting Megawati Sukarnoputri in Indonesia is broken up by riot police."], ["1996-08-04T00:00:00", "The 1996 Summer Olympics conclude."], ["1996-08-06T00:00:00", "NASA announces that the Allan Hills 84001 meteorite, thought to originate from Mars, may contain evidence of primitive lifeforms."], ["1996-08-06T00:00:00", "The Australian census is conducted."], ["1996-08-06T00:00:00", "The American punk rock band the Ramones play their last show."], ["1996-08-07T00:00:00", "Heavy rains kill more than 80 campers near Huesca, Spain."], ["1996-08-09T00:00:00", "Boris Yeltsin is sworn in at the Kremlin for a second term as President of Russia."], ["1996-08-11T00:00:00", "The British rock band Oasis plays the biggest free-standing concert in UK history at Knebworth, Hertfordshire."], ["1996-08-13T00:00:00", "Data sent back by the Galileo space probe indicates there may be water on one of Jupiter's moons."], ["1996-08-14T00:00:00", "A rocket ignited during a fireworks display in Arequipa, Peru knocks down a high-tension power cable into a dense crowd, electrocuting 35 people."], ["1996-08-15T00:00:00", "Bob Dole is nominated for President of the United States, and Jack Kemp for Vice President, at the Republican National Convention in San Diego, California."], ["1996-08-16T00:00:00", "Brookfield Zoo, Chicago. After a 3-year-old boy falls into the 20-foot (6.1 m) deep gorilla enclosure, Binti Jua, a female silverback gorilla sits with the injured boy until his rescue. Video of the ape's actions make her world famous."], ["1996-08-16T00:00:00", "After having spent 378 days in a Taliban prison, the crew of Russian Il-76TD manage to overpower their guards, board their aircraft and fly to freedom (see: 1995 Airstan incident)."], ["1996-08-20T00:00:00", "A thousands-large protest in Seoul, calling for reunification with North Korea, is broken up by riot police."], ["1996-08-21T00:00:00", "Former president of South Africa, F. W. de Klerk, makes an official apology for crimes committed under Apartheid to the Truth and Reconciliation Commission in Cape Town."], ["1996-08-21T00:00:00", "In Britain Queen Elizabeth II issues letters patent on divorced former wives of British princes, taking away from the ex-wives the attribute and style of Royal Highness. With that Sarah, Duchess of York as well as Diana, Princess of Wales legally cease to be Royals, but they remain as non-royal Duchess and Princess. Still they are allowed to keep these titles for their children are in line to the throne."], ["1996-08-23T00:00:00", "Osama bin Laden writes \"The Declaration of Jihad on the Americans Occupying the Country of the Two Sacred Places,\" a call for the removal of American military forces from Saudi Arabia."], ["1996-08-26T00:00:00", "Chun Doo-hwan is sentenced to death, after being found guilty of mutiny and treason."], ["1996-08-26T00:00:00", "Bill Clinton signs welfare reform into law."], ["1996-08-26T00:00:00", "Iraqi expatriates seeking refuge hijack a Sudanese airliner en route from Khartoum to Amman."], ["1996-08-28T00:00:00", "Their Royal Highnesses, the Prince and Princess of Wales, are formally divorced at the High Court of Justice in London. Her Royal Highness The Princess of Wales is restyled Diana, Princess of Wales, due to the Queen's letters patent issued a week earlier."], ["1996-08-29T00:00:00", "U.S. President Bill Clinton and Vice President Al Gore are renominated at the Democratic National Convention in Chicago."], ["1996-08-29T00:00:00", "A Russian Tupolev 154 jetliner crashes into a mountain as it approaches the airport at Spitsbergen, Norway, killing all 141 people on board."], ["1996-08-30T00:00:00", "The attempted raising of a 15-tonne section of the RMS Titanic fails, as 1,700 spectators, including survivors of the wreck, watch."], ["1996-08-31T00:00:00", "Iraq disarmament crisis: Iraqi forces launch an offensive into the northern No-Fly Zone and capture Arbil."], ["1996-08-31T00:00:00", "The Big 12 Conference is inaugurated with a football game between Kansas State University and Texas Tech University in Manhattan, Kansas."], ["1996-09-02T00:00:00", "A permanent peace agreement is signed at the Malacañan Palace between the Government of the Philippines and the Moro National Liberation Front."], ["1996-09-03T00:00:00", "The U.S. launches Operation Desert Strike against Iraq in reaction to the attack on Arbil."], ["1996-09-04T00:00:00", "The Revolutionary Armed Forces of Colombia attack a military base in Guaviare, Colombia, starting 3 weeks of guerrilla warfare that will claim the lives of at least 130 Colombians."], ["1996-09-05T00:00:00", "Hurricane Fran makes landfall near Cape Fear, North Carolina as a Category 3 storm with 115 mph sustained winds. Fran caused over $3 billion in damage and killed 27 people, mainly in North Carolina. The name \"Fran\" was retired due to the extensive damage."], ["1996-09-10T00:00:00", "Comprehensive Nuclear Test Ban Treaty (CTBT) signed (it will be ratified 180 days after ratification by 44 Annex 2 countries)."], ["1996-09-11T00:00:00", "Union Pacific finalizes its purchase of Southern Pacific that was effectively started almost a century before in 1901."], ["1996-09-12T00:00:00", "Ricardo López (stalker) sends a package, containing an acid bomb, to Icelandic singer Björk with the intention to kill or disfigure her, and then commits suicide. The package is intercepted by the Scotland Yard four days later, before doing any harm."], ["1996-09-13T00:00:00", "Alija Izetbegović is elected president of Bosnia and Herzegovina in the country's first election since the Bosnian War."], ["1996-09-18T00:00:00", "A North Korean Sang-O class submarine runs aground in South Korea. The crew are described as spies by the South Korean government and killed by the South Korean military."], ["1996-09-19T00:00:00", "The scoreboard at Buffalo's $127.5 million HSBC Arena falls to the ice just hours before a National Hockey League game; no one is injured."], ["1996-09-20T00:00:00", "Leader of Pakistani opposition party Pakistan Peoples Party Murtaza Bhutto is killed during a gun battle with police."], ["1996-09-20T00:00:00", "Tiger Cave Kiln discovered at Hangzhou in the Chinese province of Zhejiang."], ["1996-09-22T00:00:00", "The Panhellenic Socialist Movement under the leadership of Costas Simitis succeeds in the 1996 Greek legislative election."], ["1996-09-24T00:00:00", "U.S. President Bill Clinton signs the Comprehensive Nuclear-Test-Ban Treaty at the United Nations."], ["1996-09-25T00:00:00", "The last of the Magdalene asylums is closed in Ireland."], ["1996-09-27T00:00:00", "In Afghanistan, the Taliban capture the capital city of Kabul, after driving out President Burhanuddin Rabbani and executing former leader Mohammad Najibullah."], ["1996-09-30T00:00:00", "The United States Congress passes an amendment that bars anyone convicted of even misdemeanor level domestic violence from obtaining and possessing firearms."], ["1996-10-02T00:00:00", "The Electronic Freedom of Information Act Amendments are signed by U.S. President Bill Clinton."], ["1996-10-02T00:00:00", "The former prime minister of Bulgaria, Andrey Lukanov, is assassinated."], ["1996-10-02T00:00:00", "An Aeroperú Boeing 757 crashes into the Pacific Ocean when the instruments fail just after takeoff from Lima Airport, killing all 70 on board."], ["1996-10-06T00:00:00", "The government of New Zealand agrees to pay $130 million worth of compensation for the loss of land suffered by the Māori population between the years of 1844 and 1864."], ["1996-10-07T00:00:00", "News Corporation launches the Fox News Channel as a 24-hour news channel to compete against CNN"], ["1996-10-15T00:00:00", "Several large strikes begin in various industries across Belgium in protest to the dismissal of the magistrate Jean-Marc Connerotte by the Supreme Court."], ["1996-10-22T00:00:00", "A fire at La Planta prison in southwest Caracas, Venezuela, kills 30 prisoners."], ["1996-10-23T00:00:00", "The O. J. Simpson civil trial begins in Santa Monica, California."], ["1996-10-24T00:00:00", "The Marcopper Mine Disaster occurs, dumping toxic copper tailings into the Boac River."], ["1996-10-30T00:00:00", "Fighting erupts when Banyamulenga Tutsis of Laurent Kabila in Zaire seize Uvira and proceed to kill Hutu refugees."], ["1996-10-31T00:00:00", "A Brazilian TAM Fokker airliner crashes into a densely populated area of São Paulo, killing 103."], ["1996-11-05T00:00:00", "Pakistani prime minister Benazir Bhutto's government is dismissed by President Farooq Leghari after widespread allegations of corruption. - United States presidential election, 1996: Incumbent Democratic President Bill Clinton defeats his Republican challenger, Robert J. Dole."], ["1996-11-07T00:00:00", "A devastating category 4 cyclone strikes Andhra Pradesh, India. The storm surge sweeps fishing villages out to sea, over 2,000 people die. 95 percent of the crops are completely destroyed."], ["1996-11-07T00:00:00", "NASA launches the Mars Global Surveyor."], ["1996-11-08T00:00:00", "All 141 people on board a Nigerian-owned Boeing 727 die when the aircraft crashes into the Atlantic Ocean while approaching Lagos airport."], ["1996-11-12T00:00:00", "Saudi Arabian Airlines Boeing 747 collides in mid-air with Kazakhstan Airlines Il-76 in New Delhi, India, resulting in the loss of 349 lives."], ["1996-11-15T00:00:00", "State Street in Chicago is re-opened to pedestrian traffic."], ["1996-11-16T00:00:00", "Mother Teresa receives honorary U.S. citizenship."], ["1996-11-17T00:00:00", "A bomb explosion in Kaspiysk, Russia, kills 32 people."], ["1996-11-17T00:00:00", "Emil Constantinescu is elected president of Romania."], ["1996-11-18T00:00:00", "World-renowned bird expert Tony Silva is sentenced to 7 years in prison without parole, for leading an illegal parrot smuggling ring."], ["1996-11-18T00:00:00", "Frederick Chiluba is reelected president of Zambia."], ["1996-11-19T00:00:00", "Martin Bryant is sentenced to 35 consecutive sentences of life imprisonment plus 1035 years without parole for murdering 35 people in a shooting spree in Tasmania earlier this year."], ["1996-11-19T00:00:00", "Preparatory Commission for the Comprehensive Nuclear Test Ban Organization (CTBTO) established."], ["1996-11-19T00:00:00", "STS-80: Space Shuttle Columbia conducts the longest mission of the Space Shuttle program."], ["1996-11-21T00:00:00", "A propane explosion at the Humberto Vidal shoe store and office building in San Juan, Puerto Rico kills 33."], ["1996-11-21T00:00:00", "Demonstrators in Zagreb demand the survival of Radio 101."], ["1996-11-23T00:00:00", "The Republic of Angola officially joins the World Trade Organization, as Angola."], ["1996-11-23T00:00:00", "Ethiopian Airlines Flight 961 is hijacked, then crashes into the Indian Ocean off the coast of Comoros after running out of fuel, killing 125."], ["1996-11-25T00:00:00", "An ice storm strikes the U.S., killing 26 directly, hundreds more from accidents. A powerful windstorm blasts Florida; winds gust to 90 mph."], ["1996-11-25T00:00:00", "The U.S. stock market, especially the Dow Jones Industrial Average, gains at an incredibly fast pace following the 1996 Presidential election. It gains 10 days in a row during the month."], ["1996-11-25T00:00:00", "The APEC Summit opens in the Philippines."], ["1996-11-26T00:00:00", "The Sands Hotel in Las Vegas is imploded to make way for the Venetian Hotel."], ["1996-12-02T00:00:00", "U.S. President Bill Clinton signs the Electronic Freedom of Information Act Amendments."], ["1996-12-02T00:00:00", "Widespread student pro-democracy protests are broken up in Burma."], ["1996-12-05T00:00:00", "Federal Reserve Board Chairman Alan Greenspan gives a speech in which he suggests that \"irrational exuberance\" may have \"unduly escalated asset values\"."], ["1996-12-09T00:00:00", "Jerry Rawlings is reelected president of Ghana."], ["1996-12-11T00:00:00", "Tung Chee-hwa is appointed to become the new leader of Hong Kong after it reverts to Chinese rule in 1997."], ["1996-12-12T00:00:00", "Uday Hussein is seriously injured in an assassination attempt."], ["1996-12-13T00:00:00", "Kofi Annan is elected by the United Nations Security Council the next Secretary-General of the United Nations."], ["1996-12-17T00:00:00", "The Túpac Amaru Revolutionary Movement takes 72 hostages in the Japanese Embassy in Lima, Peru."], ["1996-12-18T00:00:00", "The loi Carrez, or Carrez law governing property transactions, is enacted in France"], ["1996-12-20T00:00:00", "Steve Jobs' company NeXT is bought by Apple Computer, the company co-founded by Jobs."], ["1996-12-25T00:00:00", "Six-year-old JonBenét Ramsey is murdered in the basement of her parents' home in Boulder, Colorado."], ["1996-12-26T00:00:00", "The largest strike in South Korean history begins."], ["1996-12-27T00:00:00", "Taliban forces retake the strategic Bagram Air Base, which solidifies their buffer zone around Kabul."], ["1996-12-29T00:00:00", "Guatemala and the leaders of the Guatemalan National Revolutionary Unity sign a peace accord that ends the 36-year Guatemalan Civil War."], ["1996-12-30T00:00:00", "In the Indian state of Assam, a passenger train is bombed by Bodo separatists, killing 26."], ["1996-12-30T00:00:00", "Proposed budget cuts by Benjamin Netanyahu spark protests from 250,000 workers, who shut down services across Israel."], ["1996-12-31T00:00:00", "Bill Watterson's comic Calvin and Hobbes releases its final strip, marking the end of a decade-long run with a total of 3,150 strips in total."], ["1996-12-31T00:00:00", "The Atchison, Topeka and Santa Fe Railway is merged with the Burlington Northern Railroad to form the BNSF Railway, making it one of the largest railroad mergers in U.S. history."], ["1996-12-31T00:00:00", "The Hacienda in Las Vegas is imploded to make way for the Mandalay Bay."]]