[["1995-01-01T00:00:00", "The World Trade Organization (WTO) is established to replace the General Agreement on Tariffs and Trade (GATT)."], ["1995-01-01T00:00:00", "Austria, Finland and Sweden act to join the European Union."], ["1995-01-01T00:00:00", "The Draupner wave in the North Sea in Norway is detected, confirming the existence of rogue waves."], ["1995-01-09T00:00:00", "Valeri Polyakov completes 366 days in space while aboard the Mir space station, breaking a duration record."], ["1995-01-16T00:00:00", "An avalanche hits the village Súðavík in Iceland, killing 14 people."], ["1995-01-16T00:00:00", "The fourth Star Trek TV series, Voyager, premieres on UPN in the United States."], ["1995-01-17T00:00:00", "The magnitude 6.8 \"Great Hanshin earthquake\" occurs near Kobe, Japan, causing great property damage and killing 6,434 people."], ["1995-01-17T00:00:00", "Prodigy (online service) offers access to the World Wide Web."], ["1995-01-24T00:00:00", "Opening statements in the O. J. Simpson murder case trial in Los Angeles."], ["1995-01-25T00:00:00", "Norwegian rocket incident: A rocket launched from the space exploration centre at Andøya, Norway is briefly interpreted by the Russians as an incoming attack."], ["1995-01-30T00:00:00", "John Howard becomes leader of the Liberal Party of Australia to challenge Paul Keating for the 1996 Federal Election and the position of Prime Minister of Australia."], ["1995-01-31T00:00:00", "U.S. President Bill Clinton invokes emergency powers, to extend a $20 billion loan to help Mexico avert financial collapse."], ["1995-02-01T00:00:00", "Lyricist/guitarist Richey Edwards of the Welsh alternative rock band Manic Street Preachers goes missing from a hotel in Bayswater, London on the eve of a planned tour of the United States. His car is found two weeks later at Severn View services in Aust."], ["1995-02-09T00:00:00", "STS-63: Dr. Bernard A. Harris, Jr. and Michael Foale became the second African American and Briton, respectively, to walk in space."], ["1995-02-13T00:00:00", "A United Nations tribunal on human rights violations in the Balkans charges 21 Bosnian Serb commanders with genocide and crimes against humanity."], ["1995-02-15T00:00:00", "Hacker Kevin Mitnick is arrested by the FBI and charged with penetrating some of the United States' most \"secure\" computer systems."], ["1995-02-17T00:00:00", "Colin Ferguson is convicted of 6 counts of murder for the December 1993 Long Island Rail Road shootings and later receives a 25-year sentence for each of the 6 murders."], ["1995-02-21T00:00:00", "Serkadji prison mutiny in Algeria: Four guards and 96 prisoners are killed in a day and a half."], ["1995-02-21T00:00:00", "Ibrahim Ali, a 17-year-old Comorian living in France, is murdered by 3 far-right National Front activists."], ["1995-02-21T00:00:00", "Steve Fossett lands in Leader, Saskatchewan, Canada, becoming the first person to make a solo flight across the Pacific Ocean in a balloon."], ["1995-02-23T00:00:00", "The Dow Jones Industrial Average gains 30.28 to close at 4,003.33 - the Dow's first ever close above 4,000."], ["1995-02-25T00:00:00", "Amazon Cooperation Treaty Organization (ACTO) (Organización del Tratado de Cooperación Amazónica [OTCA])."], ["1995-02-26T00:00:00", "The United Kingdom's oldest investment banking firm, Barings Bank, collapses after securities broker Nick Leeson loses $1.4 billion by speculating on the Tokyo Stock Exchange"], ["1995-02-27T00:00:00", "In Denver, Colorado, Stapleton Airport closes and is replaced by the new Denver International Airport, the largest in the United States."], ["1995-02-28T00:00:00", "Members of the group Patriot's Council are convicted in Minnesota of manufacturing ricin."], ["1995-03-01T00:00:00", "Julio María Sanguinetti is sworn in as President of Uruguay for his second term."], ["1995-03-01T00:00:00", "Polish Prime Minister Waldemar Pawlak resigns from Parliament and is replaced by ex-communist Józef Oleksy."], ["1995-03-01T00:00:00", "In Moscow, Russian anti-corruption journalist Vladislav Listyev is killed by a gunman."], ["1995-03-01T00:00:00", "The first search engine service Yahoo! is founded."], ["1995-03-02T00:00:00", "Nick Leeson is arrested for his role in the collapse of Barings Bank."], ["1995-03-03T00:00:00", "In Somalia, the United Nations peacekeeping mission ends."], ["1995-03-06T00:00:00", "On an episode of The Jenny Jones Show (\"Same-Sex Crushes\"), Scott Amedure reveals a crush on his heterosexual friend Jonathan Schmitz. Schmitz kills Amedure several days after the show."], ["1995-03-12T00:00:00", "The Gazi Quarter riots occur in Sultangazi (then Gaziosmanpaşa), Istanbul, Turkey. A few days later, riots broke out in Ümraniye, Istanbul and Kızılay, Ankara also."], ["1995-03-13T00:00:00", "David Daliberti and William Barloon, 2 Americans working for a military contractor in Kuwait, are arrested after straying into Iraq."], ["1995-03-14T00:00:00", "Astronaut Norman Thagard becomes the first American to ride into space aboard a Russian launch vehicle (the Soyuz TM-21), lifting off from the Baikonur Cosmodrome in Kazakhstan."], ["1995-03-16T00:00:00", "Mississippi ratifies the Thirteenth Amendment, becoming the last state to approve the abolition of slavery. The amendment was nationally ratified in 1865."], ["1995-03-20T00:00:00", "Sarin gas attack on the Tokyo subway: Members of the Aum Shinrikyo religious cult release sarin gas on 5 subway trains in Tokyo, killing 13 and injuring 5,510."], ["1995-03-22T00:00:00", "Cosmonaut Valeri Polyakov returns after setting a record for 438 days in outer space."], ["1995-03-24T00:00:00", "For the first time in 26 years, no British soldiers patrol the streets of Belfast, Northern Ireland."], ["1995-03-26T00:00:00", "The Schengen Agreement, easing cross-border travel, goes into effect in several European countries."], ["1995-03-30T00:00:00", "A police officer tries to assassinate Takaji Kunimatsu, chief of the National Police Agency of Japan."], ["1995-03-31T00:00:00", "Mexican American Tejano pop singer Selena is murdered at a Days Inn motel in Corpus Christi, Texas by her former employee, Yolanda Saldívar."], ["1995-03-31T00:00:00", "TAROM Flight 371 from Bucharest to Brussels crashes shortly after take off killing all 60 people on board."], ["1995-04-01T00:00:00", "Dialog Telekom launches Sri Lanka's first GSM mobile phone network."], ["1995-04-02T00:00:00", "An explosion in Gaza kills 8, including a Hamas leader."], ["1995-04-05T00:00:00", "The U.S. House of Representatives votes 246-188 to cut taxes for individuals and corporations."], ["1995-04-07T00:00:00", "First Chechen War - Samashki massacre: Russian paramilitary troops begin a massacre of at least 250 civilians in Samashki, Chechnya."], ["1995-04-07T00:00:00", "In the United States, House Republicans celebrate passage of most of the Contract with America."], ["1995-04-19T00:00:00", "Oklahoma City bombing: 168 people, including 8 Federal Marshals and 19 children, are killed at the Alfred P. Murrah Federal Building and 680 wounded by a bomb set off by Timothy McVeigh and one of his accomplices, Terry Nichols."], ["1995-04-24T00:00:00", "A Unabomber bomb kills lobbyist Gilbert Murray in Sacramento, California."], ["1995-04-28T00:00:00", "In Daegu, South Korea, a gas explosion at a subway construction site kills 101 people, mostly teenage schoolboys."], ["1995-04-30T00:00:00", "The United States government stops funding the NSFNET, making the Internet a wholly privatised system."], ["1995-05-01T00:00:00", "Jacques Chirac is elected president of France."], ["1995-05-01T00:00:00", "Croatian forces launch Operation Flash against rebel Serb forces in western Slavonia."], ["1995-05-07T00:00:00", "Finland wins the ice hockey world championship."], ["1995-05-10T00:00:00", "At Vaal Reefs gold mine in Orkney, a runaway locomotive falls into a lift shaft onto an ascending cage and causes it to plunge 1,500 feet (460 m) to the bottom of the 6,900 feet (2,100 m) deep shaft, killing 104."], ["1995-05-11T00:00:00", "More than 170 countries agree to extend the Nuclear Nonproliferation Treaty indefinitely and without conditions."], ["1995-05-13T00:00:00", "An earthquake hits the regions of Kozani and Grevena in Greece, with an intensity of 6.6 on the Richter scale."], ["1995-05-14T00:00:00", "The Dalai Lama proclaims 6-year-old Gedhun Choekyi Nyima as the 11th reincarnation of the Panchen Lama."], ["1995-05-14T00:00:00", "Team New Zealand wins the America's Cup in San Diego, beating Stars and Stripes 5-0."], ["1995-05-16T00:00:00", "Japanese police besiege the headquarters of Aum Shinrikyo near Mount Fuji and arrest cult leader Shoko Asahara."], ["1995-05-17T00:00:00", "Shawn Nelson, 35, goes on a tank rampage in San Diego."], ["1995-05-20T00:00:00", "U.S. President Bill Clinton indefinitely closes part of the street in front of the White House, Pennsylvania Avenue, to vehicular traffic in response to the Oklahoma City bombing."], ["1995-05-21T00:00:00", "Pope John Paul II canonizes John Sarkander during his visit to Olomouc, the Czech Republic."], ["1995-05-24T00:00:00", "AFC Ajax wins the UEFA Champions League in the Ernst Happel Stadium in Vienna by defeating AC Milan 0-1 by a goal of Patrick Kluivert. This was the third consecutive win of AFC Ajax over AC Milan that season, ranking AFC Ajax on the 4th place on the list of European Cup and UEFA Champions League winners."], ["1995-05-27T00:00:00", "In Culpeper, Virginia, actor Christopher Reeve is paralyzed from the neck down after falling from his horse in a riding competition."], ["1995-05-28T00:00:00", "A 7.6 magnitude earthquake in Neftegorsk, Russia kills at least 2,000."], ["1995-06-01T00:00:00", "The busiest hurricane season in 62 years begins."], ["1995-06-02T00:00:00", "Mrkonjić Grad incident: A United States Air Force F-16 piloted by Captain Scott O'Grady is shot down over Bosnia and Herzegovina while patrolling the NATO no-fly zone. O'Grady is rescued by U.S. Marines six days later."], ["1995-06-02T00:00:00", "Waffen-SS Hauptsturmführer Erich Priebke is extradited from Argentina to Italy."], ["1995-06-02T00:00:00", "The Dimmitt, Texas Tornado strikes."], ["1995-06-03T00:00:00", "Montreal Expos pitcher Pedro Martínez becomes the second Major League Baseball pitcher to pitch a \"perfect game\" leading into the 10th inning."], ["1995-06-06T00:00:00", "U.S. astronaut Norman Thagard breaks NASA's space endurance record of 14 days, 1 hour and 16 minutes, aboard the Russian space station Mir."], ["1995-06-06T00:00:00", "The Constitutional Court of South Africa abolishes capital punishment in South Africa in the case of S v Makwanyane and Another."], ["1995-06-13T00:00:00", "French President Jacques Chirac announces the resumption of nuclear tests in French Polynesia."], ["1995-06-15T00:00:00", "A powerful earthquake, registering a moment magnitude of 6.2, hits the city of Aigio, Greece, resulting in several deaths and significant damage to many buildings."], ["1995-06-16T00:00:00", "The IOC selects Salt Lake City to host the 2002 Winter Olympics."], ["1995-06-20T00:00:00", "Oil multinational Royal Dutch Shell caves in to international pressure and abandons plans to dump the Brent Spar oil rig at sea."], ["1995-06-22T00:00:00", "Japanese police rescue 365 hostages from a hijacked All Nippon Airways Flight 857 (Boeing 747-200) at Hakodate airport. The hijacker was armed with a knife and demanded the release of Shoko Asahara."], ["1995-06-24T00:00:00", "The New Jersey Devils sweep the heavily favored Detroit Red Wings to win their first Stanley Cup in the lock-out shortened season."], ["1995-06-24T00:00:00", "South Africa wins the Rugby World Cup."], ["1995-06-27T00:00:00", "Jodi Huisentruit, an Iowa television anchor, is reported missing after failing to show up for work. She is declared legally dead in 2001."], ["1995-06-29T00:00:00", "Lisa Clayton completes her 10-month solo circumnavigation from the Northern Hemisphere."], ["1995-06-29T00:00:00", "STS-71: Space Shuttle Atlantis docks with the Russian Mir space station for the first time."], ["1995-06-29T00:00:00", "The Sampoong Department Store collapses in the Seocho-gu district of Seoul, South Korea, killing 501 and injuring 937."], ["1995-06-29T00:00:00", "Iraq disarmament crisis: According to UNSCOM, the unity of the U.N. Security Council begins to fray, as a few countries, particularly France and Russia, become more interested in making financial deals with Iraq than in disarming the country."], ["1995-07-01T00:00:00", "Iraq disarmament crisis: In response to UNSCOM's evidence, Iraq admits for first time the existence of an offensive biological weapons program, but denies weaponization."], ["1995-07-04T00:00:00", "Prime Minister of the United Kingdom John Major wins his battle to remain leader of the Conservative Party."], ["1995-07-05T00:00:00", "The United States Congress passes the Child Protection and Obscenity Enforcement Act, requiring that producers of pornography keep records of all models who are filmed or photographed, and that all models be at least 18 years of age."], ["1995-07-09T00:00:00", "Sri Lankan Civil War: 125 civilians are killed in Navaly as result of bombing by the Sri Lanka Air Force."], ["1995-07-10T00:00:00", "Burmese dissident Aung San Suu Kyi is freed from house arrest."], ["1995-07-11T00:00:00", "- Srebrenica massacre: Units of the Army of Republika Srpska, under the command of General Ratko Mladić, enter Srebrenica with little resistance from Dutch peacekeepers of the United Nations Protection Force, going on to kill of thousands of Bosniak men and boys and rape many women."], ["1995-07-11T00:00:00", "- President Clinton announces the restoration of United States-Vietnam relations twenty years after the Vietnam War."], ["1995-07-11T00:00:00", "- A Cubana de Aviación Antonov An-24 crashes into the Caribbean off southeast Cuba killing 44 people."], ["1995-07-17T00:00:00", "The Nasdaq Composite index closes above the 1,000 mark for the first time."], ["1995-07-18T00:00:00", "A series of huge eruptions by the Soufrière Hills volcano sends lava flows and ash falls across a wide area of southern Montserrat."], ["1995-07-23T00:00:00", "David Daliberti and William Barloon, 2 Americans held as spies by Iraq, are released by Saddam Hussein after negotiations with U.S. Congressman Bill Richardson."], ["1995-08-02T00:00:00", "The first cold front of the White Earthquake strikes Chile; during the rest of August several communities becomes isolated due to heavy snowfall and livestock is decimated."], ["1995-08-03T00:00:00", "An Il-76TD piloted by a Russian crew is forced down by Taliban fighter planes. The crew escape with the aircraft on August 16, 1996."], ["1995-08-04T00:00:00", "Croatian forces, with the cooperation of the ARBiH, launch Operation Storm against rebel Croatian Serb forces in the Krajina, which subsequently ceases to exist as a political entity."], ["1995-08-05T00:00:00", "Croatian forces take the Croatian Serb capital, Knin, and continue their advance into the Republic of Serbian Krajina."], ["1995-08-06T00:00:00", "Hundreds in Hiroshima, Nagasaki, Washington, D.C., and Tokyo mark the 50th anniversary of the dropping of the atomic bomb."], ["1995-08-07T00:00:00", "Operation Storm ends with a UN-brokered ceasefire; remaining Croatian Serb forces start surrendering."], ["1995-08-11T00:00:00", "The Russell Hill subway accident results in 3 deaths and 30 injuries in Toronto, Ontario, Canada."], ["1995-08-14T00:00:00", "An avalanche buries Alison Hargreaves, the first woman to climb Mt. Everest without oxygen; she is reported dead."], ["1995-08-16T00:00:00", "Bermudans reject independence in a referendum."], ["1995-08-24T00:00:00", "Microsoft releases Windows 95."], ["1995-08-28T00:00:00", "A Bosnian Serb mortar bomb near a Sarajevo market square kills 37 civilians."], ["1995-08-29T00:00:00", "Eduard Shevardnadze, the Georgian head of state, survives an assassination attempt in Tbilisi."], ["1995-08-30T00:00:00", "The NATO bombing campaign against Bosnian Serb artillery positions begins in Bosnia and Herzegovina, continuing into September. At the same time, ARBiH forces begin an offensive against the Bosnian Serb Army around Sarajevo, central Bosnia, and Bosnian Krajina."], ["1995-09-03T00:00:00", "eBay is founded."], ["1995-09-03T00:00:00", "The Fourth World Conference on Women opens in Beijing with over 4,750 delegates from 181 countries in attendance."], ["1995-09-06T00:00:00", "NATO air strikes against Bosnian Serb forces continue, after repeated attempts at a solution to the Bosnian War fail."], ["1995-09-19T00:00:00", "The Washington Post and The New York Times publish the Unabomber's manifesto."], ["1995-09-22T00:00:00", "American millionaire Steve Forbes announces his candidacy for the 1996 Republican presidential nomination."], ["1995-09-23T00:00:00", "Argentine national Guillermo \"Bill\" Gaede is arrested in Phoenix, Arizona on charges of industrial espionage. His sales to Cuba, China, North Korea and Iran are believed to have involved Intel and AMD trade secrets worth US$10-20 million."], ["1995-09-26T00:00:00", "The trial against former Italian Prime Minister Giulio Andreotti, who is accused of Mafia connections, begins."], ["1995-09-28T00:00:00", "Croatian forces massacre 9 elderly Croatian Serbs in the village of Varivode, Croatia"], ["1995-09-29T00:00:00", "Madalyn Murray O'Hair and two of her family members are kidnapped and murdered by a former employee of hers named David Waters."], ["1995-10-03T00:00:00", "O. J. Simpson is found not guilty of double murder for the deaths of former wife Nicole Simpson and Ronald Goldman."], ["1995-10-04T00:00:00", "France launches a counter-coup in the Comoros with 600 soldiers. They arrest Bob Denard and his mercenaries and take Denard to France; Caabi el-Yachroutu becomes the interim president."], ["1995-10-04T00:00:00", "Hurricane Opal makes landfall at Pensacola Beach, Florida as a Category 3 hurricane with 115 mph (185 km/h) winds."], ["1995-10-05T00:00:00", "Tansu Çiller of DYP forms the new government of Turkey (51st government, a minority government which failed to receive the vote of confidence)."], ["1995-10-06T00:00:00", "Michel Mayor and Didier Queloz announce the discovery of 51 Pegasi b, the first confirmed extrasolar planet orbiting an ordinary main-sequence star."], ["1995-10-09T00:00:00", "1995 Palo Verde derailment: An Amtrak Sunset Limited train is derailed by saboteurs near Palo Verde, Arizona."], ["1995-10-15T00:00:00", "The Carolina Panthers win their first-ever regular season game by defeating the New York Jets at Clemson Memorial Stadium in South Carolina."], ["1995-10-16T00:00:00", "The Million Man March is held in Washington, D.C. The event was conceived by Nation of Islam leader Louis Farrakhan."], ["1995-10-17T00:00:00", "French woman Jeanne Calment reaches the confirmed age of 120 years and 238 days, making her the oldest person ever recorded."], ["1995-10-23T00:00:00", "In Houston, Texas, Yolanda Saldívar is convicted of first degree murder in the shooting death of Selena Quintanilla Perez, and 3 days later is sentenced to life in prison."], ["1995-10-24T00:00:00", "A total solar eclipse is visible from Iran, India, Thailand, and Southeast Asia."], ["1995-10-25T00:00:00", "A Metra commuter train slams into a school bus in Fox River Grove, Illinois, killing seven students."], ["1995-10-26T00:00:00", "An avalanche hits the village Flateyri in Iceland, killing 20 people."], ["1995-10-28T00:00:00", "A fire in Baku Metro, Azerbaijan, kills 289 passengers (the world's worst subway disaster)."], ["1995-10-30T00:00:00", "Quebec independentists narrowly lose a referendum for a mandate to negotiate independence from Canada."], ["1995-10-30T00:00:00", "Tansu Çiller of DYP forms the new government of Turkey."], ["1995-11-01T00:00:00", "NASA loses contact with the Pioneer 11 probe."], ["1995-11-01T00:00:00", "Participants in the Yugoslav Wars begin negotiations at the Wright-Patterson Air Force Base in Dayton, Ohio."], ["1995-11-01T00:00:00", "The U.S. House of Representatives votes to ban partial birth abortions by a vote of 288-139."], ["1995-11-02T00:00:00", "The Supreme Court of Argentina orders the extradition of Erich Priebke, ex-S.S. captain."], ["1995-11-03T00:00:00", "At Arlington National Cemetery, U.S. President Bill Clinton dedicates a memorial to the victims of the Pan Am Flight 103 bombing."], ["1995-11-04T00:00:00", "Israeli Prime Minister Yitzhak Rabin is assassinated at a peace rally in Tel Aviv."], ["1995-11-07T00:00:00", "Typhoon Angela leaves the Philippines and Vietnam devastated, with 882 deaths and damage of P 10,829,000,000. The typhoon was the strongest ever to strike the Philippines in 25 years, with wind speeds of 130 mph (210 km/h) and gusts of 180 mph (290 km/h)."], ["1995-11-10T00:00:00", "Iraq disarmament crisis: With help from Israel and Jordan, UNSCOM inspector Scott Ritter intercepts 240 Russian gyroscopes and accelerometers on their way to Iraq from Russia."], ["1995-11-10T00:00:00", "In Nigeria, playwright and environmental activist Ken Saro-Wiwa, along with 8 others from the Movement for the Survival of the Ogoni People, are hanged by government forces."], ["1995-11-12T00:00:00", "The Millbrook Commonwealth Action Programme, a programme to implement the Harare Declaration, is announced by the Commonwealth Heads of Government."], ["1995-11-14T00:00:00", "A budget standoff between Democrats and Republicans in the Congress of the United States, forces the federal government to temporarily close national parks and museums, and run most government offices with skeleton staff."], ["1995-11-16T00:00:00", "A United Nations tribunal charges Radovan Karadžić and Ratko Mladić with genocide during the Bosnian War."], ["1995-11-21T00:00:00", "The Dow Jones Industrial Average gains 40.46 to close at 5,023.55, its first close above 5,000. This makes 1995 the first year where the Dow surpasses two millennium marks in a single year."], ["1995-11-21T00:00:00", "The Dayton Agreement to end the Bosnian War is reached at Wright-Patterson Air Force Base near Dayton, Ohio (signed December 14)."], ["1995-11-22T00:00:00", "Rosemary West is sentenced to life for killing 10 women and girls, including her daughter and stepdaughter, after the jury returns a guilty verdict at Winchester Crown Court. The trial judge recommends that she should never be released from prison, making her only the second woman in British legal history to be subjected to a whole life tariff (the other is Myra Hindley)."], ["1995-11-22T00:00:00", "Six-year-old Elisa Izquierdo's child abuse-related death at the hands of her mother makes headlines, and instigates major reform in New York City's child welfare system."], ["1995-11-22T00:00:00", "Egypt, Eilat, Israel, and much of the North African Mediterranean is struck by the strongest earthquake (7.2 ) along the Dead Sea Transform in a century; 8 are killed."], ["1995-11-22T00:00:00", "The first-ever full length computer animated feature film, Toy Story, is released by Pixar Animation Studios and Walt Disney Pictures."], ["1995-11-28T00:00:00", "The Barcelona Treaty is signed by 27 attending nations."], ["1995-11-28T00:00:00", "U.S. President Bill Clinton signs the National Highway Designation Act, which ends the federal 55 mph (89 km/h) speed limit."], ["1995-11-30T00:00:00", "Javier Solana becomes the new NATO General Secretary; Operation Desert Storm officially ends."], ["1995-12-03T00:00:00", "Strikes paralyze France's public sector."], ["1995-12-07T00:00:00", "NASA's Galileo Probe enters Jupiter's atmosphere."], ["1995-12-08T00:00:00", "Jean-Dominique Bauby, editor-in-chief of Elle magazine, suffers a massive stroke and lapses into a coma."], ["1995-12-08T00:00:00", "6-year-old Gyaincain Norbu is enthroned as the 11th reincarnation of the Panchen Lama at Tashilhunpo Monastery."], ["1995-12-14T00:00:00", "The Dayton Agreement is signed in Paris."], ["1995-12-15T00:00:00", "The European Court of Justice rules that all EU football players have the right to a free transfer among member states at the end of their contracts."], ["1995-12-15T00:00:00", "Because of the \"quadruple-witching\" option expiration, volume on the New York Stock Exchange hits 638 million shares, the highest single-day volume since October 20, 1987, when the Dow staged a stunning recovery a day after Black Monday."], ["1995-12-16T00:00:00", "Iraq disarmament crisis: Iraqi scuba divers, under the direction of the United Nations Special Commission, dredge the Tigris near Baghdad. The divers find over 200 prohibited Russian-made missile instruments and components."], ["1995-12-20T00:00:00", "American Airlines Flight 965 (Boeing 757) crashes into a mountain near Buga, Valle del Cauca, Colombia after veering off its course en route to Cali, Colombia. Of the 164 people on board, 4 passengers are the only survivors."], ["1995-12-20T00:00:00", "HM The Queen advises \"an early divorce\" to Lady Diana Spencer and Charles, Prince of Wales. The divorce is finalized on 28 August 1996."], ["1995-12-30T00:00:00", "The lowest ever United Kingdom temperature of −27.2 °C (−17.0 °F) is recorded at Altnaharra in the Scottish Highlands. This equals the record set at Braemar, Aberdeenshire in 1895 and 1982."], ["1995-12-30T00:00:00", "The Republic of Texas group claims to have formed a provisional government in Texas."], ["1995-12-31T00:00:00", "The final original Calvin and Hobbes comic strip is published."]]