[["1967-01-01T00:00:00", "Canada begins a year-long celebration of the 100th anniversary of the British North America Act, 1867, featuring the Expo 67 World's Fair."], ["1967-01-02T00:00:00", "Ronald Reagan, past movie actor and future President of the United States, is inaugurated the new governor of California."], ["1967-01-04T00:00:00", "The Doors release their début album The Doors."], ["1967-01-05T00:00:00", "Spain and Romania sign in Paris an agreement establishing full consular and commercial relations (not diplomatic ones)."], ["1967-01-05T00:00:00", "Charlie Chaplin launches his last film, A Countess from Hong Kong, in the UK."], ["1967-01-06T00:00:00", "Vietnam War: USMC and ARVN troops launch Operation Deckhouse Five in the Mekong Delta."], ["1967-01-08T00:00:00", "Vietnam War: Operation Cedar Falls starts."], ["1967-01-10T00:00:00", "Segregationist Lester Maddox is sworn in as Governor of Georgia."], ["1967-01-12T00:00:00", "Dr. James Bedford becomes the first person to be cryonically preserved with the intent of future resuscitation."], ["1967-01-13T00:00:00", "A military coup occurs in Togo under the leadership of Étienne Eyadema."], ["1967-01-14T00:00:00", "The New York Times reports that the U.S. Army is conducting secret germ warfare experiments."], ["1967-01-14T00:00:00", "The Human Be-In takes place in Golden Gate Park, San Francisco; the event sets the stage for the Summer of Love."], ["1967-01-15T00:00:00", "Louis Leakey announces the discovery of pre-human fossils in Kenya; he names the species Kenyapithecus africanus."], ["1967-01-15T00:00:00", "The United Kingdom enters the first round of negotiations for European Economic Community membership in Rome."], ["1967-01-15T00:00:00", "American football: The Green Bay Packers defeat the Kansas City Chiefs 35-10 in the First AFL-NFL World Championship Game at the Los Angeles Memorial Coliseum."], ["1967-01-18T00:00:00", "Albert DeSalvo is convicted of numerous crimes and sentenced to life in prison."], ["1967-01-18T00:00:00", "Jeremy Thorpe becomes leader of the UK's Liberal Party."], ["1967-01-18T00:00:00", "A Fistful of Dollars, the first significant \"spaghetti Western\" film, is released in the United States."], ["1967-01-23T00:00:00", "In Munich, the trial begins of Wilhelm Harster, accused of the murder of 82,856 Jews (including Anne Frank) when he led German security police during the German occupation of the Netherlands. He is eventually sentenced to 15 years in prison."], ["1967-01-23T00:00:00", "Milton Keynes (England) is founded as a new town by Order in Council, with a planning brief to become a city of 250,000 people. Its initial designated area enclosed three existing towns and twenty one villages."], ["1967-01-26T00:00:00", "The Parliament of the United Kingdom decides to nationalize 90% of the British steel industry."], ["1967-01-27T00:00:00", "Apollo 1: U.S. astronauts Gus Grissom, Edward Higgins White, and Roger Chaffee are killed when fire breaks out in their Apollo spacecraft during a launch pad test."], ["1967-01-27T00:00:00", "The United States, Soviet Union and United Kingdom sign the Outer Space Treaty."], ["1967-01-31T00:00:00", "West Germany and Romania establish diplomatic relations."], ["1967-02-02T00:00:00", "The American Basketball Association is formed."], ["1967-02-03T00:00:00", "Ronald Ryan becomes the last man hanged in Australia, for murdering a guard while escaping from prison in December 1965."], ["1967-02-04T00:00:00", "The Soviet Union protests the demonstrations before its embassy in Beijing."], ["1967-02-05T00:00:00", "NASA launches Lunar Orbiter 3."], ["1967-02-05T00:00:00", "Italy's first guided missile cruiser, the Vittorio Veneto, is launched."], ["1967-02-05T00:00:00", "General Anastasio Somoza Debayle becomes president of Nicaragua."], ["1967-02-06T00:00:00", "Alexei Kosygin arrives in the UK for an 8-day visit. He meets The Queen on February 9."], ["1967-02-07T00:00:00", "The Chinese government announces that it can no longer guarantee the safety of Soviet diplomats outside the Soviet Embassy building."], ["1967-02-07T00:00:00", "Serious bushfires in southern Tasmania claim 62 lives, and destroys 2,642.7 square kilometres (653,025.4 acres) of land."], ["1967-02-07T00:00:00", "Mazenod College, Victoria opens in Australia."], ["1967-02-10T00:00:00", "The 25th Amendment to the United States Constitution (presidential succession and disability) is ratified."], ["1967-02-11T00:00:00", "Burgess Ice Rise, lying off the west coast of Alexander Island, Antarctica is first mapped by the British Antarctic Survey (BAS)."], ["1967-02-13T00:00:00", "American researchers discover the Madrid Codices by Leonardo da Vinci in the National Library of Spain."], ["1967-02-15T00:00:00", "The Soviet Union announces that it has sent troops near the Chinese border."], ["1967-02-18T00:00:00", "New Orleans District Attorney Jim Garrison claims he will solve the John F. Kennedy assassination, and that a conspiracy was planned in New Orleans."], ["1967-02-22T00:00:00", "Suharto takes power from Sukarno in Indonesia (see Transition to the New Order and Supersemar)."], ["1967-02-22T00:00:00", "Donald Sangster becomes the new Prime Minister of Jamaica, succeeding Alexander Bustamante."], ["1967-02-23T00:00:00", "Trinidad and Tobago is the first Commonwealth nation to join the Organization of American States."], ["1967-02-23T00:00:00", "The 25th Amendment to the United States Constitution is enacted."], ["1967-02-24T00:00:00", "Moscow forbids its satellite states to form diplomatic relations with West Germany."], ["1967-02-25T00:00:00", "The Chinese government announces that it has ordered the army to help in the spring seeding."], ["1967-02-25T00:00:00", "Britain's second Polaris missile submarine, HMS Renown, is launched."], ["1967-02-26T00:00:00", "A Soviet nuclear test is conducted at the Semipalatinsk Test Site, Eastern Kazakhstan."], ["1967-02-27T00:00:00", "The Dutch government supports British EEC membership."], ["1967-03-01T00:00:00", "The city of Hatogaya, Saitama, Japan was founded."], ["1967-03-01T00:00:00", "Brazilian police arrest Franz Stangl, ex-commander of Treblinka and Sobibór concentration camps."], ["1967-03-01T00:00:00", "The Red Guards return to schools in China."], ["1967-03-01T00:00:00", "The Queen Elizabeth Hall is opened in London."], ["1967-03-01T00:00:00", "Óscar Gestido is sworn in as President of Uruguay after 15 years of collegiate government."], ["1967-03-04T00:00:00", "The first North Sea gas is pumped ashore at Easington, East Riding of Yorkshire."], ["1967-03-04T00:00:00", "Queens Park Rangers become the first 3rd Division side to win the League Cup at Wembley Stadium, defeating West Bromwich Albion 3-2."], ["1967-03-05T00:00:00", "Mohammad Mosaddegh or Mosaddeq[a] (Persian: مُحَمَد مُصَدِق; IPA: [mohæmˈmæd(-e) mosædˈdeɣ] (listen)[b]) After fourteen years of house arrest, Died."], ["1967-03-06T00:00:00", "Mark Twain Tonight! starring Hal Holbrook as Mark Twain, premieres on CBS."], ["1967-03-07T00:00:00", "Jimmy Hoffa begins his 8-year sentence for attempting to bribe a jury."], ["1967-03-09T00:00:00", "Joseph Stalin's daughter, Svetlana Alliluyeva, defects to the United States via the U.S. Embassy in New Delhi."], ["1967-03-11T00:00:00", "The first phase of the Cambodian Civil War begins between the Kingdom of Cambodia and the Khmer Rouge."], ["1967-03-12T00:00:00", "The Indonesian State Assembly takes all presidential powers from Sukarno and names Suharto as acting president (Suharto resigned in 1998)."], ["1967-03-12T00:00:00", "The Velvet Underground's groundbreaking first album, The Velvet Underground & Nico, was released. It is initially a commercial failure but receives widespread critical and commercial acclaim in later years."], ["1967-03-13T00:00:00", "Moise Tshombe, ex-prime minister of Congo, is sentenced to death in absentia."], ["1967-03-14T00:00:00", "The body of U.S. President John F. Kennedy is moved to a permanent burial place at Arlington National Cemetery."], ["1967-03-14T00:00:00", "Nine executives of the German pharmaceutical company Grunenthal are charged for breaking German drug laws because of thalidomide."], ["1967-03-16T00:00:00", "In the Aspida case in Greece, 15 officers are sentenced to 2-18 years in prison, accused of treason and intentions of staging a coup."], ["1967-03-18T00:00:00", "The supertanker Torrey Canyon runs aground in between Land's End and the Scilly Isles."], ["1967-03-19T00:00:00", "A referendum in French Somaliland favors the connection to France."], ["1967-03-21T00:00:00", "A military coup takes place in Sierra Leone."], ["1967-03-26T00:00:00", "In New York City, 10,000 gather for the Central Park be-in."], ["1967-03-26T00:00:00", "Jim Thompson, co-founder of the Thai Silk Company, disappears from the Cameron Highlands."], ["1967-03-28T00:00:00", "Pope Paul VI issues the encyclical Populorum progressio."], ["1967-03-29T00:00:00", "A 13-day TV strike begins in the U.S."], ["1967-03-29T00:00:00", "The first French nuclear submarine, Le Redoutable, is launched."], ["1967-03-29T00:00:00", "The SEACOM telephone cable is inaugurated."], ["1967-03-29T00:00:00", "The Fleet Air Arm and Royal Air Force aircraft bomb and sink the Torrey Canyon."], ["1967-03-31T00:00:00", "U.S. President Lyndon Johnson signs the Consular Treaty."], ["1967-04-02T00:00:00", "A United Nations delegation arrives in Aden due to approaching independence. They leave April 7, accusing British authorities of lack of cooperation. The British say the delegation did not contact them."], ["1967-04-04T00:00:00", "Martin Luther King, Jr. denounces the Vietnam War during a religious service in New York City."], ["1967-04-06T00:00:00", "Georges Pompidou begins to form the next French government."], ["1967-04-07T00:00:00", "Six-Day War (approach): Israeli fighters shoot down 7 Syrian MIG-21s."], ["1967-04-08T00:00:00", "Puppet on a String by Sandie Shaw (music and lyrics by Bill Martin and Phil Coulter) wins the Eurovision Song Contest 1967 for the United Kingdom."], ["1967-04-09T00:00:00", "The first Boeing 737 (a 100 series) takes its maiden flight."], ["1967-04-10T00:00:00", "The AFTRA strike is settled just in time for the 39th Academy Awards ceremony to be held, hosted by Bob Hope. Best Picture goes to A Man for All Seasons."], ["1967-04-10T00:00:00", "Oral arguments begin in the landmark U.S. Supreme Court case Loving v. Virginia, 388 U.S. 1 (1967), challenging the State of Virginia's statutory scheme to prevent marriages between persons solely on the basis of racial classifications."], ["1967-04-12T00:00:00", "The Ahmanson Theatre opens in Los Angeles."], ["1967-04-13T00:00:00", "Conservatives win the Greater London Council elections."], ["1967-04-14T00:00:00", "In San Francisco, 10,000 march against the Vietnam War."], ["1967-04-15T00:00:00", "Large demonstrations are held against the Vietnam War in New York City and San Francisco."], ["1967-04-15T00:00:00", "Scotland defeats England 3-2 at Wembley Stadium, with goals from Law, Lennox and McCalligog, in the British Championships. This is England's first defeat since they won the World Cup, and ends a 19-game unbeaten run."], ["1967-04-20T00:00:00", "The Surveyor 3 probe lands on the Moon."], ["1967-04-20T00:00:00", "A Globe Air Bristol Britannia turboprop crashes at Nicosia, Cyprus, killing 126 people."], ["1967-04-21T00:00:00", "Greece is taken over by a military dictatorship led by George Papadopoulos; future-Prime Minister Andreas Papandreou remains a political prisoner to December 25. The dictatorship ends in 1974."], ["1967-04-21T00:00:00", "An outbreak of tornadoes strikes the upper Midwest section of the United States (in particular the Chicago area, including the suburbs of Belvidere and Oak Lawn, Illinois, where 33 people are killed and 500 injured)."], ["1967-04-23T00:00:00", "A group of young radicals are expelled from the Nicaraguan Socialist Party (PSN). This group goes on to found the Socialist Workers Party (POS)."], ["1967-04-24T00:00:00", "Soyuz 1: Vladimir Komarov becomes the first Soviet cosmonaut to die, when the parachute of his space capsule fails during re-entry."], ["1967-04-27T00:00:00", "Montreal, Quebec, Expo 67, a World's Fair to coincide with the Canadian Confederation centennial, officially opens with Prime Minister Lester B. Pearson igniting the Expo Flame in the Place des Nations."], ["1967-04-28T00:00:00", "In Houston, Texas, boxer Muhammad Ali refuses military service. He is stripped of his boxing title and not allowed to fight for three years."], ["1967-04-28T00:00:00", "Expo 67 opens to the public, with over 310,000 people attending. Al Carter from Chicago is the first visitor as noted by Expo officials."], ["1967-04-28T00:00:00", "The U.S. aerospace manufacturer McDonnell Douglas is formed through a merger of McDonnell Aircraft and Douglas Aircraft (it becomes part of The Boeing Company three decades later)."], ["1967-04-29T00:00:00", "Fidel Castro announces that all intellectual property belongs to the people and that Cuba intends to translate and publish technical literature without compensation."], ["1967-04-30T00:00:00", "Moscow's 537m-tall TV tower is finished."], ["1967-05-01T00:00:00", "Elvis Presley and Priscilla Beaulieu are married in Las Vegas."], ["1967-05-01T00:00:00", "GO Transit, Canada's first interregional public transit system, is established."], ["1967-05-02T00:00:00", "The Toronto Maple Leafs win the Stanley Cup. It is their last Stanley Cup and last finals appearance to date. It will turn out to be the last game in the Original Six era. Six more teams will be added in the fall."], ["1967-05-02T00:00:00", "Harold Wilson announces that the United Kingdom has decided to apply for EEC membership."], ["1967-05-04T00:00:00", "Lunar Orbiter 4 is launched by the United States."], ["1967-05-06T00:00:00", "Dr. Zakir Hussain is the first Muslim to become president of India."], ["1967-05-06T00:00:00", "Four hundred students seize the administration building at Cheyney State College, now Cheyney University of Pennsylvania, the oldest institute for higher education for African Americans."], ["1967-05-06T00:00:00", "Hong Kong 1967 riots: Clashes between striking workers and police kill 51 and injure 800."], ["1967-05-08T00:00:00", "The Philippine province of Davao is split into three: Davao del Norte, Davao del Sur, and Davao Oriental."], ["1967-05-10T00:00:00", "The Greek military government accuses Andreas Papandreou of treason."], ["1967-05-11T00:00:00", "The United Kingdom and Ireland apply officially for European Economic Community membership."], ["1967-05-17T00:00:00", "Syria mobilizes against Israel."], ["1967-05-17T00:00:00", "President Gamal Abdal Nasser of Egypt demands withdrawal of the peacekeeping UN Emergency Force in the Sinai. U.N. Secretary-General U Thant complies (May 18)."], ["1967-05-18T00:00:00", "Tennessee Governor Ellington repeals the \"Monkey Law\" (officially the Butler Act; see the Scopes Trial)."], ["1967-05-18T00:00:00", "In Mexico, schoolteacher Lucio Cabañas begins guerrilla warfare in Atoyac de Alvarez, west of Acapulco, in the state of Guerrero."], ["1967-05-18T00:00:00", "NASA announces the crew for the Apollo 7 space mission (first manned Apollo flight): Walter M. Schirra, Jr., Donn F. Eisele, and R. Walter Cunningham."], ["1967-05-19T00:00:00", "The Soviet Union ratifies a treaty with the United States and the United Kingdom, banning nuclear weapons from outer space."], ["1967-05-19T00:00:00", "Yuri Andropov becomes KGB chief."], ["1967-05-22T00:00:00", "The Innovation department store in the centre of Brussels, Belgium burns down. It is the most devastating fire in Belgian history, resulting in 323 dead and missing and 150 injured."], ["1967-05-23T00:00:00", "Egypt closes the Straits of Tiran to Israeli shipping, blockading Israel's southern port of Eilat, and Israel's entire Red Sea coastline."], ["1967-05-25T00:00:00", "The Celtic Football Club becomes the first British football club to win the European Cup/Champions League."], ["1967-05-25T00:00:00", "The 25th Amendment is added to the Constitution of the United States."], ["1967-05-27T00:00:00", "Naxalite Guerrilla War: Beginning with a peasant uprising in the town of Naxalbari, this Marxist/Maoist rebellion sputters on in the Indian countryside. The guerrillas operate among the impoverished peasants, fighting both the government security forces and private paramilitary groups funded by wealthy landowners. Most fighting takes place in the states of Andhra Pradesh, Maharashtra, Odisha and Madhya Pradesh."], ["1967-05-27T00:00:00", "The Australian referendum, 1967 passes with an overwhelming 90% support, removing, from the Australian Constitution, 2 discriminatory sentences referring to Indigenous Australians. It signifies Australia's first step in recognising Indigenous rights."], ["1967-05-27T00:00:00", "The folk rock band Fairport Convention plays their first gig in Golders Green, North London."], ["1967-05-30T00:00:00", "Biafra, in eastern Nigeria, announces its independence."], ["1967-06-01T00:00:00", "The Beatles release Sgt. Pepper's Lonely Hearts Club Band, nicknamed \"The Soundtrack of the Summer of Love\"; it will be number one on the albums charts throughout the summer of 1967."], ["1967-06-02T00:00:00", "Protests in West Berlin against the arrival of the Shah of Iran turn into fights, during which 27-year-old Benno Ohnesorg is killed by a police officer. His death results in the founding of the terrorist group 2 June Movement."], ["1967-06-02T00:00:00", "Luis Monge is executed in Colorado's gas chamber, in the last pre-Furman execution in the United States."], ["1967-06-04T00:00:00", "Stockport air disaster: British Midland flight G-ALHG crashes in Hopes Carr, Stockport, killing 72 passengers and crew."], ["1967-06-05T00:00:00", "Murderer Richard Speck is sentenced to death in the electric chair for killing 8 student nurses in Chicago."], ["1967-06-05T00:00:00", "Six-Day War begins: Israel occupies the West Bank, Gaza Strip, Sinai Peninsula and Golan Heights after defeating its Arab neighbours."], ["1967-06-07T00:00:00", "Two Moby Grape members are arrested for contributing to the delinquency of minors."], ["1967-06-08T00:00:00", "Six-Day War - USS Liberty incident: Israeli fighter jets and Israeli warships fire at the USS Liberty off Gaza, killing 34 and wounding 171."], ["1967-06-10T00:00:00", "Six-Day War ends: Israel and Syria agree to a United Nations-mediated cease-fire."], ["1967-06-10T00:00:00", "The Soviet Union severs diplomatic relations with Israel."], ["1967-06-10T00:00:00", "Margrethe, heir apparent to the throne of Denmark, marries French count Henri de Laborde de Monpezat."], ["1967-06-11T00:00:00", "A race riot occurs in Tampa, Florida after the shooting death of Martin Chambers by police while allegedly robbing a camera store. The unrest lasts several days."], ["1967-06-12T00:00:00", "Loving v. Virginia: The United States Supreme Court declares all U.S. state laws prohibiting interracial marriage to be unconstitutional."], ["1967-06-12T00:00:00", "Venera program: Venera 4 is launched by the Soviet Union (the first space probe to enter another planet's atmosphere and successfully return data)."], ["1967-06-13T00:00:00", "Solicitor General Thurgood Marshall is nominated as the first African American justice of the United States Supreme Court."], ["1967-06-14T00:00:00", "Mariner program: Mariner 5 is launched toward Venus."], ["1967-06-16T00:00:00", "The Monterey Pop Festival begins and is held for 3 days."], ["1967-06-17T00:00:00", "The People's Republic of China tests its first hydrogen bomb."], ["1967-06-18T00:00:00", "Eighteen British soldiers are killed in the Aden police mutiny."], ["1967-06-23T00:00:00", "Cold War: U.S. President Lyndon B. Johnson meets with Soviet Premier Alexei Kosygin in Glassboro, New Jersey, for the 3-day Glassboro Summit Conference. Johnson travels to Los Angeles for a dinner at the Century Plaza Hotel where earlier in the day thousands of war protesters clashed with L.A. police."], ["1967-06-25T00:00:00", "400 million viewers watch Our World, the first live, international, satellite television production. It features the live debut of The Beatles' song \"All You Need Is Love\"."], ["1967-06-26T00:00:00", "Pope Paul VI ordains 27 new cardinals (one of whom is the future Pope John Paul II)."], ["1967-06-26T00:00:00", "The Buffalo Race Riot begins, lasting until July 1; leads to 200 arrests."], ["1967-06-27T00:00:00", "The first automatic cash machine (voucher-based) is installed, in the office of the Barclays Bank in Enfield, England."], ["1967-06-28T00:00:00", "Israel declares the annexation of East Jerusalem."], ["1967-06-30T00:00:00", "Moise Tshombe, former President of Katanga and former prime minister of the Democratic Republic of the Congo, is kidnapped to Algeria."], ["1967-07-01T00:00:00", "Canada celebrates its first one hundred years of Confederation."], ["1967-07-01T00:00:00", "The EEC joins with the European Coal and Steel Community and the European Atomic Community, to form the European Communities (from the 1980s usually known as European Community [EC])."], ["1967-07-01T00:00:00", "Seaboard Air Line Railroad merges with Atlantic Coast Line railroad, to become Seaboard Coast Line railroad, first step to today's CSX Transportation."], ["1967-07-01T00:00:00", "The first UK colour television broadcasts begin on BBC2. The first one is from the Wimbledon tennis championships. A full colour service begins on BBC2 on December 2."], ["1967-07-01T00:00:00", "American Samoa's first constitution becomes effective."], ["1967-07-03T00:00:00", "A military rebellion led by Belgian mercenary Jean Schramme begins in Katanga, Democratic Republic of the Congo."], ["1967-07-04T00:00:00", "The British Parliament decriminalizes homosexuality."], ["1967-07-05T00:00:00", "Troops of Belgian mercenary commander Jean Schramme revolt against Mobutu Sese Seko, and try to take control of Stanleyville, Congo."], ["1967-07-06T00:00:00", "Nigerian Civil War: Nigerian forces invade the secessionist Biafra May 30."], ["1967-07-06T00:00:00", "A level crossing collision between a train loaded with children and a tanker-truck near Magdeburg, East Germany kills 94 people, mostly children."], ["1967-07-07T00:00:00", "All You Need Is Love is released in the UK."], ["1967-07-10T00:00:00", "Heavy massive rains and a landslide at Kobe and Kure, Hiroshima, Japan, kill at least 371."], ["1967-07-10T00:00:00", "New Zealand decimalises its currency from pound to dollar at £1 to $2 ($1 = 10/-)."], ["1967-07-12T00:00:00", "The Greek military regime strips 480 Greeks of their citizenship."], ["1967-07-12T00:00:00", "1967 Newark riots: After the arrest of an African-American cab driver for allegedly illegally driving around a police car and gunning it down the road, race riots break out in Newark, New Jersey, lasting 6 days and leaving 26 dead."], ["1967-07-14T00:00:00", "The Bee Gees release their first international album Bee Gees' 1st in the UK."], ["1967-07-14T00:00:00", "Near Newark, New Jersey, the Plainfield, NJ, riots also occur."], ["1967-07-16T00:00:00", "A prison riot in Jay, Florida leaves 37 dead."], ["1967-07-18T00:00:00", "The United Kingdom announces the closing of its military bases in Malaysia and Singapore. Australia and the U.S. disapprove."], ["1967-07-19T00:00:00", "A race riot breaks out in the North Side of Minneapolis on Plymouth Street during the Minneapolis Aquatennial Parade; businesses are vandalized and fires break out in the area, although the disturbance is quelled within hours. However, the next day a shooting sets off another incident in the same area that leads to 18 fires, 36 arrests, 3 shootings, 2 dozen people injured, and damages totaling 4.2 million. There will be two more such incidents in the following two weeks."], ["1967-07-19T00:00:00", "Eighty-two people are killed in a collision between Piedmont Airlines Flight 22 and a Cessna 310 near Hendersonville, North Carolina."], ["1967-07-20T00:00:00", "Chilean poet Pablo Neruda receives the first Viareggio-Versile prize."], ["1967-07-21T00:00:00", "The town of Winneconne, Wisconsin, announces secession from the United States because it is not included in the official maps and declares war. Secession is repealed the next day."], ["1967-07-23T00:00:00", "July 31 - 12th Street Riot: In Detroit, one of the worst riots in United States history begins on 12th Street in the predominantly African American inner city: 43 are killed, 342 injured and 1,400 buildings burned."], ["1967-07-24T00:00:00", "During an official state visit to Canada, French President Charles de Gaulle declares to a crowd of over 100,000 in Montreal: Vive le Québec libre! (Long live free Quebec!). The statement, interpreted as support for Quebec independence, delights many Quebecers but angers the Canadian government and many English Canadians."], ["1967-07-29T00:00:00", "An explosion and fire aboard the U.S. Navy aircraft carrier USS Forrestal in the Gulf of Tonkin leaves 134 dead."], ["1967-07-29T00:00:00", "Georges Bidault moves to Belgium where he receives political asylum."], ["1967-07-29T00:00:00", "An earthquake in Caracas, Venezuela leaves 240 dead."], ["1967-07-30T00:00:00", "The 1967 Milwaukee race riots begin, lasting through August 2 and leading to a ten-day shutdown of the city from August 1."], ["1967-08-01T00:00:00", "Race riots in the United States spread to Washington, D.C.."], ["1967-08-02T00:00:00", "The Turkish football club Trabzonspor is established in Trabzon."], ["1967-08-05T00:00:00", "Pink Floyd releases their debut album The Piper at the Gates of Dawn in the United Kingdom."], ["1967-08-06T00:00:00", "A pulsar is noted by Jocelyn Bell and Antony Hewish. The discovery is first recorded in print in 1968: \"An entirely novel kind of star came to light on Aug. 6 last year [...]\". The date of the discovery is not recorded."], ["1967-08-07T00:00:00", "Vietnam War: The People's Republic of China agrees to give North Vietnam an undisclosed amount of aid in the form of a grant."], ["1967-08-07T00:00:00", "A general strike in the old quarter of Jerusalem protests Israel's unification of the city."], ["1967-08-08T00:00:00", "The Association of Southeast Asian Nations (ASEAN) is founded in Bangkok, Thailand."], ["1967-08-09T00:00:00", "Vietnam War - Operation Cochise: United States Marines begin a new operation in the Que Son Valley."], ["1967-08-10T00:00:00", "Belgian mercenary Jean Schramme's troops take the Congolese border town of Bukavu."], ["1967-08-13T00:00:00", "The first line-up of Fleetwood Mac makes their live debut at the Windsor Jazz and Blues Festival."], ["1967-08-13T00:00:00", "Night of the Grizzlies sparks national concern over bear drama, from PBS in Montana's Glacier National Park."], ["1967-08-14T00:00:00", "Wonderful Radio London shuts down at 3:00 PM in anticipation of the Marine Broadcasting Offences Act. Many fans greet the staff upon their return to London that evening with placards reading \"Freedom died with Radio London.\""], ["1967-08-15T00:00:00", "The United Kingdom Marine Broadcasting Offences Act declares participation in offshore pirate radio illegal. Radio Caroline defies the Act and continues broadcasting."], ["1967-08-18T00:00:00", "The State of Tamil Nadu, India is established."], ["1967-08-19T00:00:00", "West Germany receives 36 East German prisoners it has \"purchased\" through the border posts of Herleshausen and Wartha."], ["1967-08-21T00:00:00", "A truce is declared in the Democratic Republic of the Congo."], ["1967-08-21T00:00:00", "The People's Republic of China announces that it has shot down United States planes violating its airspace."], ["1967-08-25T00:00:00", "American Nazi Party leader George Lincoln Rockwell is assassinated in Arlington, Virginia."], ["1967-08-27T00:00:00", "The East Coast Wrestling Association is established."], ["1967-08-27T00:00:00", "Beatles manager Brian Epstein is found dead in his locked bedroom."], ["1967-08-29T00:00:00", "The final episode of The Fugitive airs on ABC. The broadcast attracts 78 million viewers, one of the largest audiences for a single episode in U.S. television history."], ["1967-08-30T00:00:00", "Thurgood Marshall is confirmed as the first African American Justice of the United States Supreme Court."], ["1967-09-01T00:00:00", "The Khmer-Chinese Friendship Association is banned in Cambodia."], ["1967-09-01T00:00:00", "Ilse Koch, known as the \"Witch of Buchenwald\", commits suicide in the Bavarian prison of Aichach."], ["1967-09-03T00:00:00", "Nguyễn Văn Thiệu is elected President of South Vietnam."], ["1967-09-03T00:00:00", "H-Day in Sweden: At 5:00 a.m. local time, all traffic in the country switches from left-hand traffic pattern to right-hand traffic."], ["1967-09-04T00:00:00", "Vietnam War - Operation Swift: The United States Marines launch a search and destroy mission in Quảng Nam and Quảng Tín provinces. The ensuing 4-day battle in Que Son Valley kills 114 Americans and 376 North Vietnamese."], ["1967-09-05T00:00:00", "The television series The Prisoner has its world broadcast premiere on the CTV Television Network in Canada."], ["1967-09-10T00:00:00", "In a Gibraltar sovereignty referendum, only 44 out of 12,182 voters in the British Crown colony of Gibraltar support union with Spain."], ["1967-09-17T00:00:00", "A riot during a football match in Kayseri, Turkey leaves 44 dead, about 600 injured."], ["1967-09-17T00:00:00", "Jim Morrison and The Doors defy CBS censors on The Ed Sullivan Show, when Morrison sings the word \"higher\" from their #1 hit Light My Fire, despite having been asked not to."], ["1967-09-18T00:00:00", "Love Is a Many Splendored Thing debuts on U.S. daytime television and is the first soap opera to deal with an interracial relationship. CBS censors find it too controversial and ask for it to be stopped, causing show creator Irna Phillips to quit."], ["1967-09-27T00:00:00", "The RMS Queen Mary arrives in Southampton at the end of her last transatlantic crossing."], ["1967-09-30T00:00:00", "In the United Kingdom, BBC Radio completely restructures its national programming: the Light Programme is split between new national pop station Radio 1 (modelled on the successful pirate station Radio London) and Radio 2; the cultural Third Programme is rebranded as Radio 3; and the primarily-talk Home Service becomes Radio 4."], ["1967-10-03T00:00:00", "An X-15 research aircraft with test pilot William J. Knight establishes an unofficial world fixed-wing speed record of Mach 6.7."], ["1967-10-04T00:00:00", "Omar Ali Saifuddin III of Brunei abdicates in favour of his son, His Majesty Sultan Hassanal Bolkiah."], ["1967-10-04T00:00:00", "The Shag Harbour UFO incident occurs."], ["1967-10-06T00:00:00", "Southern California's Pacific Ocean Park closes down, known as the \"Disneyland By The Sea\"."], ["1967-10-08T00:00:00", "Guerrilla leader Che Guevara and his men are captured in Bolivia; they are executed the following day."], ["1967-10-12T00:00:00", "Vietnam War: U.S. Secretary of State Dean Rusk states during a news conference that proposals by the U.S. Congress for peace initiatives are futile, because of North Vietnam's opposition."], ["1967-10-12T00:00:00", "Desmond Morris publishes The Naked Ape."], ["1967-10-14T00:00:00", "Quebec Nationalism: René Lévesque leaves the Liberal Party."], ["1967-10-16T00:00:00", "Thirty-nine people, including singer-activist Joan Baez, are arrested in Oakland, California, for blocking the entrance of that city's military induction center."], ["1967-10-17T00:00:00", "The musical Hair opens off-Broadway. It moves to Broadway the following April."], ["1967-10-17T00:00:00", "Vietnam War: Battle of Ong Thanh"], ["1967-10-18T00:00:00", "Vietnam War: Students at the University of Wisconsin-Madison protest over recruitment by Dow Chemical on the University campus; 76 are injured in the resulting riot."], ["1967-10-18T00:00:00", "Walt Disney's 19th full-length animated feature The Jungle Book, the last animated film personally supervised by Disney, is released and becomes an enormous box-office and critical success. On a double bill with the film is the (now) much less well-known true-life adventure, Charlie the Lonesome Cougar."], ["1967-10-18T00:00:00", "The Venera 4 probe descends through the Venusian atmosphere."], ["1967-10-19T00:00:00", "The Mariner 5 probe flies by Venus."], ["1967-10-20T00:00:00", "Patterson-Gimlin film: Roger Patterson and Robert Gimlin's famous film of an unidentified animate cryptid, thought to be Bigfoot or Sasquatch, is recorded at Bluff Creek, California."], ["1967-10-21T00:00:00", "Tens of thousands of Vietnam War protesters march in Washington, D.C.; Allen Ginsberg symbolically chants to 'levitate' The Pentagon."], ["1967-10-21T00:00:00", "An Egyptian surface-to-surface missile sinks the Israeli destroyer Eilat, killing 47 Israeli sailors. Israel retaliates by shelling Egyptian refineries along the Suez Canal."], ["1967-10-25T00:00:00", "An abortion bill passes in the British Parliament."], ["1967-10-26T00:00:00", "Shah Mohammad Reza Pahlavi of Iran is officially crowned."], ["1967-10-26T00:00:00", "U.S. Navy pilot John McCain is shot down over North Vietnam and made a POW. His capture will be announced in the NY Times and Washington Post two days later."], ["1967-10-27T00:00:00", "Charles de Gaulle vetoes British entry into the European Economic Community again."], ["1967-10-27T00:00:00", "London criminal Jack McVitie is murdered by the Kray twins, leading to their eventual imprisonment and downfall."], ["1967-10-29T00:00:00", "Mobutu's troops launch an offensive against mercenaries in Bukavu, Congo."], ["1967-10-29T00:00:00", "The Montreal, Quebec Expo 67 closes, having received over 50 million attendees."], ["1967-10-30T00:00:00", "Hong Kong 1967 riots: British troops and Chinese demonstrators clash on the border of China and Hong Kong."], ["1967-11-02T00:00:00", "Vietnam War: U.S. President Lyndon B. Johnson holds a secret meeting with a group of the nation's most prestigious leaders (\"the Wise Men\") and asks them to suggest ways to unite the American people behind the war effort. They conclude that the American people should be given more optimistic reports on the progress of the war."], ["1967-11-03T00:00:00", "Vietnam War - Battle of Dak To: Around Đắk Tô (located about 280 miles north of Saigon near the Cambodian border), heavy casualties are suffered on both sides (the Americans narrowly win the battle on November 22)."], ["1967-11-06T00:00:00", "The Rhodesian parliament passes pro-Apartheid laws."], ["1967-11-07T00:00:00", "U.S. President Lyndon B. Johnson signs the Public Broadcasting Act of 1967, establishing the Corporation for Public Broadcasting."], ["1967-11-07T00:00:00", "Carl B. Stokes is elected mayor of Cleveland, Ohio, becoming the first African American mayor of a major United States city."], ["1967-11-07T00:00:00", "The 50th Anniversary of the Great October Socialist Revolution is celebrated in the Soviet Union."], ["1967-11-08T00:00:00", "The BBC's first local radio station (BBC Radio Leicester) is launched."], ["1967-11-09T00:00:00", "Apollo program: NASA launches the first Saturn V rocket, successfully carrying the unmanned Apollo 4 test spacecraft from Cape Kennedy into Earth orbit."], ["1967-11-11T00:00:00", "Vietnam War: In a propaganda ceremony in Phnom Penh, Cambodia, 3 United States prisoners of war are released by the Viet Cong and turned over to \"New Left\" antiwar activist Tom Hayden."], ["1967-11-14T00:00:00", "The Congress of Colombia, in commemoration of the 150-year anniversary of the death of Policarpa Salavarrieta, declares this day as the \"Day of the Colombian Woman\"."], ["1967-11-15T00:00:00", "General Grivas and his 10,000 strong Greek Army division are forced to leave Cyprus, after 24 Turkish Cypriot civilians are killed by the Greek Cypriot National Guard in the villages of Kophinou and Ayios Theodhoros; relations sour between Nicosia and Athens. Turkey flies sorties into Greek territory, and masses troops in Thrace on her border with Greece."], ["1967-11-15T00:00:00", "Test pilot Michael Adams is killed when his X-15 rocket plane tumbles out of control during atmospheric re-entry and disintegrates."], ["1967-11-17T00:00:00", "Vietnam War: Acting on optimistic reports he was given on November 13, U.S. President Lyndon B. Johnson tells his nation that, while much remains to be done, \"We are inflicting greater losses than we're taking...We are making progress.\" (2 months later the Tet Offensive by the Viet Cong makes it appear, to those watching news reports, progress is not being made.)"], ["1967-11-17T00:00:00", "French author Régis Debray is sentenced to 30 years imprisonment in Bolivia."], ["1967-11-18T00:00:00", "The UK pound is devalued from £1 = US$2.80 to £1 = US$2.40."], ["1967-11-21T00:00:00", "Vietnam War: United States General William Westmoreland tells news reporters: \"I am absolutely certain that whereas in 1965 the enemy was winning, today he is certainly losing.\""], ["1967-11-22T00:00:00", "UN Security Council Resolution 242 is adopted by the UN Security Council, establishing a set of principles aimed at guiding negotiations for an Arab-Israeli peace settlement."], ["1967-11-26T00:00:00", "Major floods hit Lisbon, Portugal, killing 462."], ["1967-11-27T00:00:00", "The Beatles release Magical Mystery Tour in the U.S. as a full album. The songs added to the original six songs on the double EP include \"All You Need Is Love\", \"Penny Lane\", \"Strawberry Fields Forever\", \"Baby, You're a Rich Man\" and \"Hello, Goodbye\". Release as a double EP will not take place in the UK until December."], ["1967-11-29T00:00:00", "Vietnam War: U.S. Secretary of Defense Robert McNamara announces his resignation to become president of the World Bank. This action is due to U.S. President Lyndon B. Johnson's outright rejection of McNamara's early November recommendations to freeze troop levels, stop bombing North Vietnam and hand over ground fighting to South Vietnam."], ["1967-11-30T00:00:00", "Zulfikar Ali Bhutto founds the Pakistan People's Party and becomes its first chairman. Today it is one of the major political parties in Pakistan (alongside the Pakistan Muslim League) that is broken into many factions, bearing the same name under different leaders, such as the Pakistan's Peoples Party Parliamentarians (PPPP)."], ["1967-11-30T00:00:00", "The People's Republic of South Yemen becomes independent of the United Kingdom."], ["1967-11-30T00:00:00", "Pro-Soviet communists in the Philippines establish Malayang Pagkakaisa ng Kabataan Pilipino as its new youth wing."], ["1967-11-30T00:00:00", "U.S. Senator Eugene McCarthy announces his candidacy for the Democratic Party presidential nomination, challenging incumbent President Lyndon B. Johnson over the Vietnam War."], ["1967-12-01T00:00:00", "The Jimi Hendrix Experience releases Axis: Bold As Love."], ["1967-12-01T00:00:00", "The RMS Queen Mary is retired. Her place is taken by the RMS Queen Elizabeth 2."], ["1967-12-03T00:00:00", "Christiaan Barnard carries out the world's first heart transplant at Groote Schuur Hospital in Cape Town."], ["1967-12-04T00:00:00", "At 6:50 PM, a volcano erupts on Deception Island in Antarctica."], ["1967-12-04T00:00:00", "Vietnam War: U.S. and South Vietnamese forces engage Viet Cong troops in the Mekong Delta (235 of the 300-strong Viet Cong battalion are killed)."], ["1967-12-05T00:00:00", "In New York City, Benjamin Spock and Allen Ginsberg are arrested for protesting against the Vietnam War."], ["1967-12-06T00:00:00", "Vice President Jorge Pacheco Areco is sworn in as President of Uruguay after President Oscar Gestido dies in office."], ["1967-12-08T00:00:00", "Magical Mystery Tour is released by The Beatles as a double EP in the U.K., whilst the only psychedelic rock album by The Rolling Stones, Their Satanic Majesties Request, is released in the U.K and in the U.S.A."], ["1967-12-09T00:00:00", "Nicolae Ceaușescu becomes the Chairman of the Romanian State Council, making him the de facto leader of Romania."], ["1967-12-09T00:00:00", "Jim Morrison is arrested on stage in New Haven, Connecticut for attempting to spark a riot in the audience during a Doors-concert."], ["1967-12-11T00:00:00", "Supersonic airliner Concorde is unveiled in Toulouse, France."], ["1967-12-12T00:00:00", "Guess Who's Coming to Dinner, one of the seminal race relations films of the 1960s, is released to theaters."], ["1967-12-13T00:00:00", "King Constantine II of Greece flees the country when his coup attempt fails."], ["1967-12-15T00:00:00", "The Silver Bridge over the Ohio River in Point Pleasant, West Virginia, collapses, killing 46 people. It has been linked to the so-called Mothman mystery."], ["1967-12-17T00:00:00", "Harold Holt, Australian prime minister, disappears when swimming at a beach 60 km from Melbourne."], ["1967-12-19T00:00:00", "Professor John Archibald Wheeler uses the term black hole for the first time."], ["1967-12-26T00:00:00", "The Beatles' film Magical Mystery Tour receives its world première on BBC Television in the UK"], ["1967-12-31T00:00:00", "The Green Bay Packers become the first team in the modern era to win their third consecutive NFL Championship, 21-17 over the Dallas Cowboys in what became known as \"The Ice Bowl\"."], ["1967-12-31T00:00:00", "Motorcycle daredevil Evel Knievel attempts to jump 141 feet over the Caesars Palace Fountains on the Las Vegas Strip. Knievel crashes on landing and the accident is caught on film."]]