[["1951-01-01T00:00:00", "First week as No. 1 single on Billboard and Cashbox charts of Patti Page hit song \"Tennessee Waltz\"."], ["1951-01-04T00:00:00", "Korean War: Third Battle of Seoul: Chinese and North Korean forces capture Seoul for the second time (they had lost Seoul in the Second Battle of Seoul in September 1950)."], ["1951-01-09T00:00:00", "The Government of the United Kingdom announces abandonment of the Tanganyika groundnut scheme for the cultivation of peanuts in the Tanganyika Territory with the writing off of £36.5M debt."], ["1951-01-15T00:00:00", "In a court in West Germany, Ilse Koch, The \"Witch of Buchenwald\", wife of the commandant of the Buchenwald concentration camp, is sentenced to life imprisonment."], ["1951-01-20T00:00:00", "Avalanches in the Alps kill 240 and bury 45,000 for a time in Switzerland, Austria and Italy."], ["1951-01-25T00:00:00", "Dutch author Anne de Vries releases the first volume of her novel Journey Through the Night (Reis door de nacht) set during World War II."], ["1951-01-27T00:00:00", "Nuclear testing at the Nevada Test Site begins with a 1-kiloton bomb dropped on Frenchman Flat, northwest of Las Vegas."], ["1951-02-01T00:00:00", "The United Nations General Assembly declares that China is an aggressor in the Korean War in United Nations General Assembly Resolution 498."], ["1951-02-06T00:00:00", "A Pennsylvania Railroad passenger train derails near Woodbridge Township, New Jersey, killing 85 people and injuring over 500, in one of the worst rail disasters in American history."], ["1951-02-12T00:00:00", "Muhammad Reza Shah marries Soraya Esfandiary-Bakhtiari."], ["1951-02-15T00:00:00", "Start of the 1951 New Zealand waterfront dispute, which lasts for 151 days."], ["1951-02-19T00:00:00", "Jean Lee becomes the last woman hanged in Australia, when Lee and her 2 pimps are hanged for the murder and torture of a 73-year-old bookmaker."], ["1951-02-27T00:00:00", "The Twenty-second Amendment to the United States Constitution, limiting Presidents to two terms, is ratified."], ["1951-03-02T00:00:00", "The first NBA All-Star game was played in the Boston Garden."], ["1951-03-06T00:00:00", "The trial of Ethel and Julius Rosenberg begins."], ["1951-03-09T00:00:00", "United Artists releases sci-fi film The Man from Planet X."], ["1951-03-12T00:00:00", "Hank Ketcham's best-selling comic strip Dennis the Menace appeared in newspapers across the U.S. for the first time."], ["1951-03-14T00:00:00", "Korean War: For the second time, United Nations troops recapture Seoul during Operation Ripper."], ["1951-03-14T00:00:00", "West Germany joins UNESCO."], ["1951-03-29T00:00:00", "Second Red Scare: Ethel and Julius Rosenberg are convicted of conspiracy to commit espionage. On April 5 they are sentenced to receive the death penalty."], ["1951-03-29T00:00:00", "Rodgers and Hammerstein's The King and I opens on Broadway and runs for three years. It is the first Rodgers & Hammerstein musical specifically written for an actress (Gertrude Lawrence). Lawrence is stricken with cancer during the run of the show and dies halfway through its run a year later. The show makes a star of Yul Brynner."], ["1951-03-29T00:00:00", "The 23rd Academy Awards ceremony is held; All About Eve wins the Best Picture award and four others."], ["1951-03-31T00:00:00", "Remington Rand delivers the first UNIVAC I computer to the United States Census Bureau."], ["1951-04-01T00:00:00", "Female suffrage begins in Greece."], ["1951-04-04T00:00:00", "George Albert Smith dies at age 81."], ["1951-04-11T00:00:00", "U.S. President Harry S. Truman relieves General Douglas MacArthur of his Far Eastern commands."], ["1951-04-11T00:00:00", "After its removal from Westminster Abbey on Christmas Day, 1950, the Stone of Scone resurfaces on the altar of Arbroath Abbey."], ["1951-04-18T00:00:00", "The Treaty of Paris (1951) is adopted, establishing the European Coal and Steel Community."], ["1951-04-21T00:00:00", "The National Olympic Committee of the Soviet Union is formed. The USSR first participates in the Olympic Games at Helsinki, Finland, in 1952."], ["1951-04-24T00:00:00", "In Yokohama, Japan, a fire on a train kills more than 100."], ["1951-04-28T00:00:00", "Robert Menzies' Liberal Party government in Australia is re-elected for a second term."], ["1951-04-29T00:00:00", "RKO releases the Howard Hawks sci-fi film, The Thing (From Another World)."], ["1951-05-01T00:00:00", "The opera house of Geneva, Switzerland is almost destroyed in a fire."], ["1951-05-03T00:00:00", "King George VI opens London's Royal Festival Hall as a patron."], ["1951-05-03T00:00:00", "The Festival of Britain opens."], ["1951-05-03T00:00:00", "The U.S. Senate Committee on Armed Services and U.S. Senate Committee on Foreign Relations begins its closed door hearings into the dismissal of General Douglas MacArthur by U.S. President Harry S Truman."], ["1951-05-09T00:00:00", "Operation Greenhouse: The first thermonuclear weapon is tested on Enewetok Atoll in the Marshall Islands, by the United States."], ["1951-05-14T00:00:00", "The first volunteer-run passenger trains run on Talyllyn Railway, Wales."], ["1951-05-15T00:00:00", "A military coup occurs in Bolivia."], ["1951-05-21T00:00:00", "The 9th Street Art Exhibition, otherwise known as the Ninth Street Show, a gathering of a number of notable artists, marks the stepping-out of the post war New York avant-garde, collectively known as the New York School."], ["1951-05-23T00:00:00", "The Tibetan government signs the Seventeen Point Agreement for the Peaceful Liberation of Tibet with the People's Republic of China."], ["1951-05-25T00:00:00", "The first atomic bomb \"boosted\" by the inclusion of thermonuclear materials, is tested in the \"Item\" test on Enewetok Atoll in the Marshall Islands by the U.S."], ["1951-05-28T00:00:00", "The Goon Show is first broadcast on BBC Home Service; the first series was entitled \"Crazy People\"."], ["1951-06-04T00:00:00", "Foley Square trial concludes review in U.S. Supreme Court as Dennis v. United States, with a ruling against the defendants (overturned by Yates v. United States in 1957)"], ["1951-06-14T00:00:00", "UNIVAC I is dedicated by the U.S. Census Bureau."], ["1951-07-01T00:00:00", "Colombo Plan operations commence."], ["1951-07-01T00:00:00", "Judy Garland opens the first of 14 concerts in Dublin, Ireland at the Theatre Royal."], ["1951-07-05T00:00:00", "William Shockley, John Bardeen, and Walter Brattain announce the invention of the junction transistor."], ["1951-07-10T00:00:00", "Korean War: Armistice negotiations begin at Kaesong."], ["1951-07-13T00:00:00", "The Great Flood of 1951 reaches its highest point in northeast Kansas, culminating in the greatest flood damage to date in the Midwestern United States."], ["1951-07-13T00:00:00", "MGM's Technicolor film version of Show Boat, starring Kathryn Grayson, Ava Gardner, and Howard Keel, premieres at Radio City Music Hall in New York City. The musical brings overnight fame to bass-baritone William Warfield (who sings Ol' Man River in the film)."], ["1951-07-14T00:00:00", "In Joplin, Missouri, the George Washington Carver National Monument becomes the first United States National Monument to honor an African American."], ["1951-07-16T00:00:00", "King Léopold III of Belgium abdicates in favour of his son Baudouin."], ["1951-07-17T00:00:00", "King Baudouin takes the oath as king of Belgium."], ["1951-07-20T00:00:00", "King Abdullah I of Jordan is assassinated by a Palestinian while attending Friday prayers in Jerusalem."], ["1951-07-26T00:00:00", "Walt Disney's 13th animated film, Alice in Wonderland, premieres in London, United Kingdom."], ["1951-07-30T00:00:00", "David Lean's Oliver Twist is finally shown in the United States, after 10 minutes of supposedly anti-Semitic references and closeups of Alec Guinness as Fagin are cut. It will not be shown uncut in the U.S. until 1970."], ["1951-08-11T00:00:00", "René Pleven becomes Prime Minister of France."], ["1951-08-12T00:00:00", "The Catcher in the Rye is first published by J. D. Salinger."], ["1951-09-01T00:00:00", "The United States, Australia and New Zealand all sign a mutual defense pact, called the ANZUS Treaty."], ["1951-09-03T00:00:00", "The American soap opera Search for Tomorrow debuts on CBS."], ["1951-09-08T00:00:00", "Treaty of San Francisco: In San Francisco, 48 representatives out of 51 attending sign a peace treaty with Japan to formally end the Pacific War; the delegations of the Soviet Union, Poland and Czechoslovakia do not sign the treaty instead favoring separate treaties."], ["1951-09-08T00:00:00", "Japan-U.S. Security Treaty, which allows United States Armed Forces being stationed in Japan after the occupation of Japan, is signed by Japan and the United States."], ["1951-09-09T00:00:00", "Chinese communist forces move into Lhasa, the capital of Tibet."], ["1951-09-10T00:00:00", "The United Kingdom begins an economic boycott of Iran."], ["1951-09-18T00:00:00", "Tennessee Williams's adaptation of A Streetcar Named Desire premieres, becoming a critical and box-office smash."], ["1951-09-20T00:00:00", "NATO accepts Greece and Turkey as members."], ["1951-09-24T00:00:00", "MGM releases the musical Show Boat."], ["1951-09-28T00:00:00", "20th Century Fox releases the Robert Wise science fiction film, The Day the Earth Stood Still."], ["1951-10-03T00:00:00", "\"Shot Heard 'Round the World\": One of the greatest moments in Major League Baseball history occurs when the New York Giants' Bobby Thomson hits a game winning home run in the bottom of the 9th inning off of Brooklyn Dodgers pitcher Ralph Branca, to win the National League pennant after being down 14 games."], ["1951-10-04T00:00:00", "MGM's Technicolor musical film, An American in Paris, starring Gene Kelly and Leslie Caron, premieres in New York. It was directed by Vincente Minnelli. It would go on to win 6 Academy Awards, including Best Picture."], ["1951-10-04T00:00:00", "Shoppers World (one of the first shopping malls in the U.S.) opens in Framingham, Massachusetts."], ["1951-10-06T00:00:00", "Malayan Emergency: Communist insurgents kill British commander Sir Henry Gurney."], ["1951-10-14T00:00:00", "Organization of Central American States (ODECA) (Organización de Estados Centroamericanos) formed."], ["1951-10-15T00:00:00", "Norethindrone, the progestin used in the oral contraceptive is synthesized by Luis E. Miramontes."], ["1951-10-15T00:00:00", "I Love Lucy makes its television debut on CBS."], ["1951-10-16T00:00:00", "Judy Garland begins a series of concerts in New York's Palace Theatre."], ["1951-10-16T00:00:00", "Prime Minister Liaquat Ali Khan of Pakistan is assassinated."], ["1951-10-16T00:00:00", "East China Normal University is founded in Shanghai, China."], ["1951-10-17T00:00:00", "CBS's Eye logo premieres on TV."], ["1951-10-19T00:00:00", "The state of war between the United States and Germany is officially ended."], ["1951-10-20T00:00:00", "The Johnny Bright incident occurs in Stillwater, Oklahoma."], ["1951-10-21T00:00:00", "A storm in southern Italy kills over 100."], ["1951-10-24T00:00:00", "U.S. President Harry Truman declares an official end to war with Germany."], ["1951-10-26T00:00:00", "Winston Churchill is re-elected Prime Minister of the United Kingdom in a general election which sees the defeat of Clement Attlee's Labour government after six years in power."], ["1951-10-27T00:00:00", "Farouk of Egypt declares himself king of Sudan, with no support."], ["1951-10-31T00:00:00", "Scrooge, starring Alastair Sim, opens in England."], ["1951-11-01T00:00:00", "The first military exercises for nuclear war, with infantry troops included, are held in the Nevada desert."], ["1951-11-10T00:00:00", "Direct dial coast-to-coast telephone service begins in the United States."], ["1951-11-11T00:00:00", "Juan Perón is re-elected president of Argentina."], ["1951-11-11T00:00:00", "Monogram Pictures releases sci-fi film Flight to Mars."], ["1951-11-12T00:00:00", "The National Ballet of Canada performs for the first time in Eaton Auditorium."], ["1951-11-20T00:00:00", "The Po River floods in northern Italy."], ["1951-11-24T00:00:00", "The Broadway play Gigi opens, starring Audrey Hepburn as the lead character."], ["1951-11-28T00:00:00", "Scrooge, starring Alastair Sim, premieres in the United States under the title of Charles Dickens's original novel, A Christmas Carol."], ["1951-12-03T00:00:00", "The Lebanese University is founded in Lebanon."], ["1951-12-05T00:00:00", "Provisional Intergovernmental Committee for the Movement of Migrants from Europe."], ["1951-12-06T00:00:00", "A state of emergency is declared in Egypt due to increasing riots."], ["1951-12-13T00:00:00", "A water storage tank collapses in Tucumcari, New Mexico, resulting in 4 deaths, and 200 buildings destroyed."], ["1951-12-16T00:00:00", "Salar Jung Museum is opened to the public by Prime Minister of India Jawaharlal Nehru."], ["1951-12-17T00:00:00", "\"We Charge Genocide\", a petition describing genocide against African Americans, is delivered to the United Nations."], ["1951-12-20T00:00:00", "EBR-1, the world's first (experimental) nuclear power plant, opens."], ["1951-12-20T00:00:00", "A chartered Curtiss C-46 Commando crash-lands in Cobourg, Ontario Canada; all on board survive."], ["1951-12-20T00:00:00", "The World Meteorological Organization becomes a specialized agency of the United Nations."], ["1951-12-22T00:00:00", "The Selangor Labour Party is founded in Selangor, Malaya."], ["1951-12-23T00:00:00", "John Huston's drama film The African Queen, starring Humphrey Bogart and Katharine Hepburn, premieres in Hollywood."], ["1951-12-24T00:00:00", "Libya becomes independent from Italy."], ["1951-12-24T00:00:00", "Gian Carlo Menotti's 45-minute opera, Amahl and the Night Visitors, premieres live on NBC, becoming the first opera written especially for television."], ["1951-12-31T00:00:00", "The Marshall Plan expires after distributing more than $13.3 billion US in foreign aid to rebuild Europe."]]