[["2013-01-11T00:00:00", "The French military begins a five-month intervention into the Northern Mali conflict, targeting the militant Islamist Ansar Dine group."], ["2013-02-12T00:00:00", "North Korea conducts its third underground nuclear test, prompting widespread condemnation and tightened economic sanctions from the international community."], ["2013-02-15T00:00:00", "A meteor explodes over the Russian city of Chelyabinsk, injuring 1,491 people and damaging over 4,300 buildings. It is the most powerful meteor to strike Earth's atmosphere in over a century. The incident, along with a coincidental flyby of a larger asteroid, prompts international concern regarding the vulnerability of the planet to meteor strikes."], ["2013-02-21T00:00:00", "American scientists use a 3D printer to create a living lab-grown ear from collagen and animal ear cell cultures. In the future, it is hoped, similar ears could be grown to order as transplants for human patients suffering from ear trauma or amputation."], ["2013-02-28T00:00:00", "Benedict XVI resigns as pope, becoming the first to do so since Gregory XII in 1415, and the first to do so voluntarily since Celestine V in 1294."], ["2013-03-13T00:00:00", "Cardinal Jorge Mario Bergoglio of Argentina is elected the 266th pope, whereupon he takes the name Francis and becomes the first Jesuit pope, the first pope from the Americas, and the first pope from the Southern Hemisphere."], ["2013-03-24T00:00:00", "2012-2013 Central African Republic conflict: Central African Republic President François Bozizé flees to the Democratic Republic of the Congo, after rebel forces capture the nation's capital, Bangui."], ["2013-03-25T00:00:00", "The European Union agrees to a €10 billion economic bailout for Cyprus. The bailout loan will be equally split between the European Financial Stabilisation Mechanism, the European Financial Stability Facility, and the International Monetary Fund. The deal precipitates a banking crisis in the island nation."], ["2013-03-27T00:00:00", "Canada becomes the first country to withdraw from the United Nations Convention to Combat Desertification."], ["2013-04-02T00:00:00", "The United Nations General Assembly adopts the Arms Trade Treaty to regulate the international trade of conventional weapons."], ["2013-04-15T00:00:00", "Two Chechen Islamist brothers explode two bombs at the Boston Marathon in Boston, Massachusetts, in the United States, killing 3 and injuring 264 others."], ["2013-04-24T00:00:00", "An eight-storey commercial building collapses in Savar Upazila near the Bangladeshi capital of Dhaka, leaving 1,129 dead and 2,500 injured. The accident is the deadliest non-terrorist structural collapse in modern times and the third-worst industrial disaster in history."], ["2013-05-15T00:00:00", "In a study published in the scientific journal Nature, researchers from Oregon Health & Science University in the United States describe the first creation of human embryonic stem cells by cloning."], ["2013-06-06T00:00:00", "American Edward Snowden discloses operations engaged in by a U.S. government mass surveillance program to news publications and flees the country, later being granted temporary asylum in Russia."], ["2013-07-01T00:00:00", "Croatia becomes the 28th member of the European Union."], ["2013-07-03T00:00:00", "Amid mass protests across Egypt, President Mohamed Morsi is deposed in a military coup d'état, leading to widespread violence."], ["2013-08-14T00:00:00", "Following the military coup in Egypt, two anti-coup camps are raided by the security forces leaving 2,600 dead. The raids were described by Human Rights Watch as \"one of the world’s largest killings of demonstrators in a single day in recent history”. "], ["2013-08-21T00:00:00", "1,429 are killed in the Ghouta chemical attack during the Syrian Civil War."], ["2013-09-21T00:00:00", "al-Shabaab Islamic militants attack the Westgate shopping mall in Nairobi, killing at least 62 civilians and wounding over 170."], ["2013-10-10T00:00:00", "Delegates from some 140 countries and territories sign the Minamata Treaty, a UNEP treaty designed to protect human health and the environment from emissions and releases of mercury and mercury compounds."], ["2013-10-18T00:00:00", "Saudi Arabia rejects a seat on the United Nations Security Council, making it the first country to reject a seat on the Security Council. Jordan takes the seat on December 6."], ["2013-11-05T00:00:00", "Mangalyaan (aka Mars Orbiter Mission) is launched by India from its launchpad in Sriharikota."], ["2013-11-08T00:00:00", "Typhoon Haiyan (\"Yolanda\"), one of the strongest tropical cyclones on record, hits the Philippines and Vietnam, causing devastation with at least 6,241 dead."], ["2013-11-12T00:00:00", "Three Studies of Lucian Freud, a series of portraits of Lucian Freud by the British painter Francis Bacon, sells for US$142.4 million in a New York City auction, setting a new world record for an auctioned work of art."], ["2013-11-21T00:00:00", "Euromaidan pro-EU demonstrations begin in Ukraine after President Viktor Yanukovych rejects an economic association agreement between the European Union and Ukraine in favor of closer ties to Russia."], ["2013-11-24T00:00:00", "Iran agrees to limit their nuclear development program in exchange for sanctions relief."], ["2013-12-07T00:00:00", "Ninth Ministerial Conference of the World Trade Organization delegates sign the Bali Package agreement aimed at loosening global trade barriers."], ["2013-12-14T00:00:00", "Chinese spacecraft Chang'e 3, carrying the Yutu rover, becomes the first spacecraft to \"soft\"-land on the Moon since 1976 and the third ever robotic rover to do so."], ["2013-12-15T00:00:00", "Fighting between ethnic Dinka and Nuer members of the presidential guard breaks out in the capital city of South Sudan and precipitates the South Sudanese political crisis."]]