[["1962-01-01T00:00:00", "Western Samoa becomes independent from New Zealand."], ["1962-01-01T00:00:00", "The United States Navy SEALs are activated. SEAL Team One is commissioned in the Pacific Fleet and SEAL Team Two in the Atlantic Fleet."], ["1962-01-01T00:00:00", "The Beatles audition for Decca Records."], ["1962-01-01T00:00:00", "NBC introduces the Laramie peacock before a midnight showing of Laramie."], ["1962-01-02T00:00:00", "NAACP Executive Secretary Roy Wilkins praises U.S. President John F. Kennedy's \"personal role\" in advancing civil rights."], ["1962-01-03T00:00:00", "Pope John XXIII excommunicates Fidel Castro."], ["1962-01-04T00:00:00", "New York City introduces a subway train that operates without a crew on board."], ["1962-01-05T00:00:00", "The first album on which The Beatles play, My Bonnie, credited to \"Tony Sheridan and the Beat Brothers\" (recorded last June in Hamburg), is released by Polydor in the U.K."], ["1962-01-08T00:00:00", "Harmelen train disaster: 93 die in the worst Dutch rail disaster."], ["1962-01-09T00:00:00", "Cuba and the Soviet Union sign a trade pact."], ["1962-01-10T00:00:00", "An avalanche on Nevado Huascarán in Peru causes 4,000 deaths."], ["1962-01-12T00:00:00", "The Indonesian Army confirms that it has begun operations in West Irian."], ["1962-01-13T00:00:00", "Albania allies itself with the People's Republic of China."], ["1962-01-15T00:00:00", "Portugal abandons the U.N. General Assembly due to the debate over Angola."], ["1962-01-16T00:00:00", "A military coup occurs in the Dominican Republic."], ["1962-01-19T00:00:00", "A counter-coup occurs in the Dominican Republic; the old government returns except for the new president Rafael Filiberto Bonnelly."], ["1962-01-22T00:00:00", "The Organization of American States suspends Cuba's membership. The suspension is lifted in 2009."], ["1962-01-24T00:00:00", "The East German government readopts conscription."], ["1962-01-24T00:00:00", "The Organisation de l'armée secrète (OAS) bombs the French Foreign Ministry."], ["1962-01-26T00:00:00", "Ranger 3 is launched to study the Moon; it later misses the Moon by 22,000 miles."], ["1962-01-27T00:00:00", "The Soviet government changes all place names honoring Molotov, Kaganovich and Georgy Malenkov."], ["1962-01-30T00:00:00", "Two of the high-wire \"Flying Wallendas\" are killed, when their famous 7-person pyramid collapses during a performance in Detroit."], ["1962-02-03T00:00:00", "The United States embargo against Cuba is announced."], ["1962-02-04T00:00:00", "The Sunday Times in the United Kingdom becomes the first paper to print a colour supplement."], ["1962-02-05T00:00:00", "French President Charles de Gaulle calls for Algeria to be granted independence."], ["1962-02-06T00:00:00", "Negotiations between U.S. Steel and the United States Department of Commerce begin."], ["1962-02-07T00:00:00", "The United States Government bans all U.S.-related Cuban imports and exports."], ["1962-02-07T00:00:00", "A coal mine explosion in Saarland, West Germany kills 299."], ["1962-02-09T00:00:00", "The Taiwan Stock Exchange Corporation opens."], ["1962-02-10T00:00:00", "Captured American spy pilot Francis Gary Powers is exchanged for captured Soviet spy Rudolf Abel in Berlin."], ["1962-02-12T00:00:00", "Six members of the Committee of 100 of the Campaign for Nuclear Disarmament are found guilty of a breach of the Official Secrets Act."], ["1962-02-14T00:00:00", "First Lady Jacqueline Kennedy takes television viewers on a tour of the White House."], ["1962-02-15T00:00:00", "Urho Kekkonen is re-elected president of Finland."], ["1962-02-16T00:00:00", "Heavy storms flood Germany's North Sea coast, mainly around Hamburg; more than 300 people die, thousands lose their homes."], ["1962-02-20T00:00:00", "Project Mercury: While aboard Friendship 7, John Glenn becomes the first American to orbit the Earth, three times in 4 hours, 55 minutes."], ["1962-02-21T00:00:00", "Margot Fonteyn and Rudolf Nureyev first dance together in a Royal Ballet performance of Giselle in London."], ["1962-03-01T00:00:00", "American Airlines Flight 1 (a Boeing 707) crashes on takeoff at New York International Airport, after a rudder malfunction causes an uncontrolled roll, resulting in the loss of control of the aircraft, with the loss of all 95 on board."], ["1962-03-01T00:00:00", "The S. S. Kresge Company opens its first Kmart discount store in Garden City, Michigan."], ["1962-03-02T00:00:00", "A military coup in Burma brings General Ne Win to power."], ["1962-03-02T00:00:00", "Wilt Chamberlain's 100-point game: Wilt Chamberlain scores 100 points in a single National Basketball Association basketball game."], ["1962-03-07T00:00:00", "Ash Wednesday Storm: A snow storm batters the Mid-Atlantic."], ["1962-03-15T00:00:00", "Katangan Prime Minister Moise Tshombe begins negotiations to rejoin the Congo."], ["1962-03-16T00:00:00", "Flying Tiger Line Flight 739, a Lockheed L-1049H Super Constellation chartered by the United States Military Air Transport Service and carrying mainly United States Army personnel bound for South Vietnam, vanishes over the western Pacific Ocean with the loss of all 107 on board. No wreckage or bodies are ever found."], ["1962-03-18T00:00:00", "Évian Accords: France and Algeria sign an agreement in Évian-les-Bains ending the Algerian War."], ["1962-03-18T00:00:00", "Un premier amour, sung by Isabelle Aubret (music by Claude-Henri Vic, text by Roland Stephane Valade), wins the Eurovision Song Contest 1962 for France."], ["1962-03-19T00:00:00", "An armistice begins in Algeria; however, the OAS continues its terrorist attacks against Algerians."], ["1962-03-19T00:00:00", "Bob Dylan releases his debut album, Bob Dylan, in the United States."], ["1962-03-21T00:00:00", "Taco Bell is founded by Glen Bell in Downey, California."], ["1962-03-23T00:00:00", "The Scandinavian States of the Nordic Council sign the Helsinki Convention on Nordic Co-operation."], ["1962-03-24T00:00:00", "OAS leader Edmond Jouhaud is arrested in Oran."], ["1962-03-26T00:00:00", "France shortens the term for military service from 26 months to 18."], ["1962-03-26T00:00:00", "Baker v. Carr: The U.S. Supreme Court rules that federal courts can order state legislatures to reapportion seats."], ["1962-04-03T00:00:00", "Jawaharlal Nehru is elected de facto Prime Minister of India."], ["1962-04-04T00:00:00", "James Hanratty is hanged in Bedford Gaol for the A6 murder; many believe he is innocent."], ["1962-04-06T00:00:00", "Belgium reestablishes diplomatic relations with the Congo."], ["1962-04-06T00:00:00", "Leonard Bernstein causes controversy with his remarks before a concert featuring Glenn Gould with the New York Philharmonic, when he (Bernstein) announces that although he disagrees with Gould's style of playing the Brahms First Piano Concerto, he finds Gould's ideas fascinating and will conduct the piece anyway. Bernstein's action receives a withering review from New York Times music critic Harold C. Schonberg."], ["1962-04-07T00:00:00", "Author Milovan Đilas is arrested in Yugoslavia."], ["1962-04-08T00:00:00", "In France, the Évian Accords are adopted in a referendum with a majority of 90%."], ["1962-04-09T00:00:00", "The 34th Academy Awards ceremony is held; West Side Story wins Best Picture."], ["1962-04-10T00:00:00", "In Los Angeles, the first MLB game is played at Dodger Stadium."], ["1962-04-13T00:00:00", "OAS leader Edmond Jouhaud is sentenced to death in France."], ["1962-04-14T00:00:00", "A Cuban military tribunal convicts 1,179 Bay of Pigs attackers."], ["1962-04-18T00:00:00", "The Commonwealth Immigration Bill in the United Kingdom removes free immigration from the citizens of member states of the Commonwealth of Nations."], ["1962-04-20T00:00:00", "OAS leader Raoul Salan is arrested in Algiers."], ["1962-04-21T00:00:00", "The Century 21 Exposition World's Fair opens in Seattle."], ["1962-04-26T00:00:00", "The Ranger 4 spacecraft crashes into the Moon."], ["1962-05-01T00:00:00", "Norwich City wins the English League Cup, beating Rochdale in the final."], ["1962-05-01T00:00:00", "Dayton Hudson Corporation opens the first of its Target discount stores in Roseville, Minnesota."], ["1962-05-02T00:00:00", "An OAS bomb explodes in Algeria - this and other attacks kill 110 and injure 147."], ["1962-05-02T00:00:00", "Benfica beats Barcelona 5-3 at Olympisch Stadion, Amsterdam and wins the 1961-62 European Cup (football)."], ["1962-05-03T00:00:00", "160 die in a triple-train disaster near Tokyo."], ["1962-05-05T00:00:00", "Twelve East Germans escape via a tunnel under the Berlin Wall."], ["1962-05-06T00:00:00", "Antonio Segni is elected President of the Italian Republic."], ["1962-05-14T00:00:00", "Juan Carlos of Spain marries the Greek Princess Sophia in Athens."], ["1962-05-14T00:00:00", "Milovan Djilas, former vice-president of Yugoslavia, is given further sentence for publishing Conversations with Stalin."], ["1962-05-22T00:00:00", "Continental Airlines Flight 11 crashes near Unionville, Missouri after the in-flight detonation of a bomb near the rear lavatory. All 45 passengers and crew aboard are killed."], ["1962-05-23T00:00:00", "Drilling for the new Montreal subway commences."], ["1962-05-23T00:00:00", "Raoul Salan, founder of the French terrorist Organisation armée secrète, is sentenced to life imprisonment in France."], ["1962-05-24T00:00:00", "Project Mercury: Scott Carpenter orbits the Earth 3 times in the Aurora 7 space capsule."], ["1962-05-25T00:00:00", "The new Coventry Cathedral is consecrated."], ["1962-05-26T00:00:00", "Acker Bilk's Stranger on the Shore becomes the first British recording to reach number one in the US Billboard Hot 100."], ["1962-05-27T00:00:00", "The Centralia mine fire is ignited."], ["1962-05-29T00:00:00", "Negotiations between the OAS and the FLA lead to a real armistice in Algeria."], ["1962-05-30T00:00:00", "The 1962 FIFA World Cup begins in Chile."], ["1962-05-31T00:00:00", "Nazi Adolf Eichmann is hanged at a prison in Ramla, Israel. His body is cremated and his ashes are spread in the Mediterranean."], ["1962-06-03T00:00:00", "Air France Flight 007 (a Boeing 707) crashes on take-off at Orly Airport in Paris; 130 of 132 people on board are killed, 2 flight attendants survive. Most victims are cultural and civic leaders of Atlanta."], ["1962-06-06T00:00:00", "President John F. Kennedy gives the commencement address at the United States Military Academy at West Point, New York."], ["1962-06-11T00:00:00", "President John F. Kennedy gives the commencement address at Yale University."], ["1962-06-11T00:00:00", "Frank Morris, John Anglin and Clarence Anglin escape from the Alcatraz Island prison; the men are never heard from again."], ["1962-06-15T00:00:00", "Students for a Democratic Society complete the Port Huron Statement."], ["1962-06-17T00:00:00", "The OAS signs a truce with the FLN in Algeria, but a day later announces that it will continue the fight on behalf of French Algerians."], ["1962-06-17T00:00:00", "Brazil beats Czechoslovakia 3-1 to win the 1962 FIFA World Cup."], ["1962-06-22T00:00:00", "An Air France Boeing 707 jet crashes into terrain during bad weather in Guadeloupe, West Indies, killing all 113 on board. It is the airline's second fatal accident in just 3 weeks, and the third fatal 707 crash of the year."], ["1962-06-25T00:00:00", "Engel v. Vitale: The United States Supreme Court rules that mandatory prayers in public schools are unconstitutional."], ["1962-06-25T00:00:00", "MANual Enterprises v. Day: The United States Supreme Court rules that photographs of nude men are not obscene, decriminalizing nude male pornographic magazines."], ["1962-06-25T00:00:00", "İsmet İnönü of CHP forms the new government of Turkey (27th government, coalition partners; YTP and CKMP)"], ["1962-06-26T00:00:00", "A 2-day steel strike begins in Italy, in support of increased wages and a 5-day working week."], ["1962-06-28T00:00:00", "The United Lutheran Church in America, Finnish Evangelical Lutheran Church of America, American Evangelical Lutheran Church, and Augustana Evangelical Lutheran Church merge to form the Lutheran Church in America."], ["1962-06-30T00:00:00", "The last soldiers of the French Foreign Legion leave Algeria."], ["1962-07-01T00:00:00", "Rwanda and Burundi gain independence."], ["1962-07-01T00:00:00", "Supporters of Algerian independence win 99% majority in a referendum."], ["1962-07-01T00:00:00", "A heavy smog develops over London."], ["1962-07-01T00:00:00", "Treaty of Nordic Cooperation of Helsinki (23 Mar 1962 signed) in force."], ["1962-07-02T00:00:00", "Charles de Gaulle accepts Algerian independence; France recognizes it the next day."], ["1962-07-02T00:00:00", "The first Walmart store, then known as Wal-Mart (which is still the corporate name), opens for business in Rogers, Arkansas."], ["1962-07-05T00:00:00", "Algeria becomes independent from France."], ["1962-07-06T00:00:00", "Irish broadcaster Gay Byrne presents his first edition of The Late Late Show. Byrne goes on to present the talk show for 37 years, making it the longest running in the world."], ["1962-07-09T00:00:00", "American artist Andy Warhol premieres his Campbell's Soup Cans exhibit in Los Angeles."], ["1962-07-10T00:00:00", "AT&T's Telstar, the world's first commercial communications satellite, is launched into orbit and activated the next day."], ["1962-07-12T00:00:00", "The Rolling Stones make their debut at London's Marquee Club, Number 165 Oxford Street, opening for Long John Baldry."], ["1962-07-13T00:00:00", "In what the press dubs \"the Night of the Long Knives\", United Kingdom Prime Minister Harold Macmillan dismisses one-third of his Cabinet."], ["1962-07-17T00:00:00", "Nuclear testing: The \"Small Boy\" test shot Little Feller I becomes the last atmospheric test detonation at the Nevada Test Site."], ["1962-07-19T00:00:00", "The first annual Swiss & Wielder Hoop and Stick Tournament is held."], ["1962-07-20T00:00:00", "France and Tunisia reestablish diplomatic relations."], ["1962-07-22T00:00:00", "Mariner program: The Mariner 1 spacecraft flies erratically several minutes after launch and has to be destroyed."], ["1962-07-23T00:00:00", "Telstar relays the first live trans-Atlantic television signal."], ["1962-07-25T00:00:00", "The first armed helicopter company of the U.S. Army is formed at Okinawa, Japan."], ["1962-07-25T00:00:00", "The International Agreement on the Neutrality of Laos is signed in Geneva, Switzerland."], ["1962-07-31T00:00:00", "Algeria proclaims independence; Ahmed Ben Bella is the first President."], ["1962-07-31T00:00:00", "A crowd assaults the rally of Sir Oswald Mosley's right-wing Union Movement in London."], ["1962-08-05T00:00:00", "Marilyn Monroe found dead from an overdose of sleeping pills and chloral hydrate, officially ruled a \"probable suicide\". However, the exact cause of her death has been disputed."], ["1962-08-05T00:00:00", "The South African government arrests Nelson Mandela in Howick, and charges him with incitement to rebellion."], ["1962-08-06T00:00:00", "Jamaica becomes independent."], ["1962-08-10T00:00:00", "Marvel Comics publishes Amazing Fantasy#15, which features the first published appearance of Spider-Man, created by Stan Lee and Steve Ditko."], ["1962-08-15T00:00:00", "The New York Agreement is signed, trading the West New Guinea colony to Indonesia."], ["1962-08-16T00:00:00", "Beatles drummer Pete Best is fired and replaced by Ringo Starr."], ["1962-08-16T00:00:00", "Algeria joins the Arab League."], ["1962-08-17T00:00:00", "East German border guards kill 18-year-old Peter Fechter, as he attempts to cross the Berlin Wall into West Berlin."], ["1962-08-22T00:00:00", "A failed assassination attempt is made against French President Charles de Gaulle."], ["1962-08-23T00:00:00", "John Lennon secretly marries Cynthia Powell."], ["1962-08-24T00:00:00", "A group of armed Cuban exile terrorists fire at a hotel in Havana from a speedboat."], ["1962-08-27T00:00:00", "NASA launches the Mariner 2 space probe."], ["1962-08-31T00:00:00", "Trinidad and Tobago becomes independent."], ["1962-09-01T00:00:00", "A referendum in Singapore supports the Malayan Federation."], ["1962-09-01T00:00:00", "Typhoon Wanda strikes Hong Kong, killing at least 130 and wounding more than 600."], ["1962-09-02T00:00:00", "The Soviet Union agrees to send arms to Cuba."], ["1962-09-08T00:00:00", "Newly independent Algeria, by referendum, adopts a constitution."], ["1962-09-12T00:00:00", "President John F. Kennedy, at a speech at Rice University, reaffirms that the U.S. will put a man on the moon by the end of the decade."], ["1962-09-19T00:00:00", "Atlantic College opens its doors for the first time, marking the birth of the pioneering UWC educational movement."], ["1962-09-21T00:00:00", "A border conflict between China and India erupts into fighting."], ["1962-09-21T00:00:00", "New Musical Express, a British music magazine, publishes a story about two 13-year-old schoolgirls, Sue and Mary, releasing a disc on Decca and adds \"A Liverpool group, The Beatles, have recorded 'Love Me Do' for Parlophone Records, set for October 5 release.\""], ["1962-09-22T00:00:00", "21-year-old Bob Dylan premiers one of his most preeminent songs, \"A Hard Rain's a-Gonna Fall\"."], ["1962-09-23T00:00:00", "The animated sitcom, The Jetsons premiers on ABC."], ["1962-09-25T00:00:00", "Sonny Liston and Floyd Patterson fight for the boxing world title."], ["1962-09-26T00:00:00", "Civil war erupts in Yemen."], ["1962-09-27T00:00:00", "A flash flood in Barcelona, Spain, kills more than 440 people."], ["1962-09-27T00:00:00", "Rachel Carson's book Silent Spring is released, giving rise to the modern environmentalist movement."], ["1962-09-28T00:00:00", "Prime Minister Ahmed Ben Bella founds the first government in Algeria."], ["1962-09-29T00:00:00", "The Canadian Alouette 1, the first satellite built outside the United States and the Soviet Union, is launched from Vandenberg AFB in California."], ["1962-09-30T00:00:00", "CBS broadcasts the final episodes of Suspense and Yours Truly, Johnny Dollar, marking the end of the Golden Age of Radio."], ["1962-10-01T00:00:00", "The first black student, James Meredith, registers at the University of Mississippi, escorted by Federal Marshals."], ["1962-10-01T00:00:00", "Johnny Carson takes over as permanent host of NBC's Tonight Show, a post he would hold for 30 years."], ["1962-10-01T00:00:00", "Lucille Ball and Vivian Vance return to television with The Lucy Show, two years after I Love Lucy ended. Vance became the first person to portray a divorcée on a weekly series."], ["1962-10-03T00:00:00", "Project Mercury: Walter Schirra orbits the Earth 6 times in the \"Sigma 7\" space capsule"], ["1962-10-05T00:00:00", "The French National Assembly censures the proposed referendum to sanction presidential elections by popular mandate; Prime Minister Georges Pompidou resigns, but President de Gaulle asks him to stay in office."], ["1962-10-05T00:00:00", "Dr. No, the first James Bond film, premieres in UK theaters."], ["1962-10-05T00:00:00", "The Beatles release their first single for EMI, Love Me Do."], ["1962-10-08T00:00:00", "The German magazine Der Spiegel publishes an article about the Bundeswehr's poor preparedness; the Spiegel scandal erupts."], ["1962-10-08T00:00:00", "Algeria is accepted into the United Nations."], ["1962-10-09T00:00:00", "Uganda becomes independent within the Commonwealth of Nations."], ["1962-10-10T00:00:00", "The Sino-Indian War, a border dispute involving two of the world's largest nations (India and the People's Republic of China), begins."], ["1962-10-11T00:00:00", "Second Vatican Council: Pope John XXIII convenes the first ecumenical council of the Roman Catholic Church in 92 years."], ["1962-10-12T00:00:00", "The infamous Columbus Day Storm strikes the U.S. Pacific Northwest with wind gusts up to 170 mph (270 km/h); 46 are killed, 11 billion board feet (26 million m³) of timber is blown down, with $230 million U.S. in damages."], ["1962-10-12T00:00:00", "Jazz bassist/composer Charles Mingus presents a disastrous concert  at Town Hall in New York City; it will become known as the worst moment of his career."], ["1962-10-13T00:00:00", "Who's Afraid of Virginia Woolf? opens on Broadway."], ["1962-10-14T00:00:00", "Cuban Missile Crisis begins: A U-2 flight over Cuba takes photos of Soviet nuclear weapons being installed. A stand-off then ensues for another 12 days after President Kennedy is told of the pictures, between the United States and the Soviet Union, threatening the world with nuclear war."], ["1962-10-19T00:00:00", "Establishment of Thái Nguyên City, under Thái Nguyên, Vietnam."], ["1962-10-22T00:00:00", "In a televised address, U.S. President John F. Kennedy announces to the nation the existence of Soviet missiles in Cuba."], ["1962-10-24T00:00:00", "Cuban Missile Crisis: First confrontation between the US Navy and a Soviet cargo vessel. The vessel changes course."], ["1962-10-26T00:00:00", "Spiegel scandal: German police occupy Der Spiegel offices in Hamburg."], ["1962-10-28T00:00:00", "Cuban Missile Crisis ends: Soviet Union leader Nikita Khrushchev announces that he has ordered the removal of Soviet missile bases in Cuba. In a secret deal between Kennedy and Khrushchev, Kennedy agrees to the withdrawal of U.S. missiles from Turkey. The fact that this deal is not made public makes it look like the Soviets have backed down."], ["1962-10-28T00:00:00", "A referendum in France favors the election of the president by universal suffrage."], ["1962-10-31T00:00:00", "The UN General Assembly asks the United Kingdom to suspend enforcement of the new constitution in Southern Rhodesia (now Zimbabwe), but the constitution comes into effect on November 1."], ["1962-11-01T00:00:00", "The Soviets begin dismantling their missiles in Cuba."], ["1962-11-01T00:00:00", "The first issue of Diabolik is published in Italy."], ["1962-11-03T00:00:00", "Earliest recorded use of the term \"personal computer\" in the report of a speech by computing pioneer John Mauchly in The New York Times."], ["1962-11-05T00:00:00", "Franz Josef Strauß, the West German defense minister, is relieved of his duties over the Spiegel scandal, due to his alleged involvement in police action against the magazine."], ["1962-11-05T00:00:00", "Saudi Arabia breaks off diplomatic relations with Egypt, following a period of unrest partly caused by the defection of several Saudi princes to Egypt."], ["1962-11-05T00:00:00", "A coal mining disaster in Ny-Ålesund kills 21 people. The Norwegian government is forced to resign in the aftermath of this accident in August 1963."], ["1962-11-06T00:00:00", "Apartheid: The United Nations General Assembly passes a resolution condemning South Africa's racist apartheid policies, and calls for all UN member states to cease military and economic relations with the nation."], ["1962-11-07T00:00:00", "Richard M. Nixon loses the California governor's race. In his concession speech, he states that this is \"Richard Nixon's last press conference\" and that \"you won't have Nixon to kick around any more\"."], ["1962-11-17T00:00:00", "In Washington, D.C., U.S. President John F. Kennedy dedicates Dulles International Airport."], ["1962-11-20T00:00:00", "Cuban missile crisis: In response to the Soviet Union agreeing to remove its missiles from Cuba, U.S. President John F. Kennedy ends the blockade of the Caribbean nation."], ["1962-11-21T00:00:00", "The Sino-Indian War ends with a Chinese ceasefire."], ["1962-11-23T00:00:00", "United Airlines Flight 297 crashes in Columbia, Maryland, killing all 17 on board."], ["1962-11-24T00:00:00", "The first episode of the groundbreaking satirical comedy program That Was the Week That Was, hosted by David Frost is broadcast on BBC Television."], ["1962-11-26T00:00:00", "Spiegel scandal: German police end their occupation of Der Spiegel's offices."], ["1962-11-26T00:00:00", "Mies Bouwman starts presenting the first live TV-marathon fundraising show (Open Het Dorp), which lasts 23 hours non-stop."], ["1962-11-27T00:00:00", "French President Charles De Gaulle orders Georges Pompidou to form a government."], ["1962-11-29T00:00:00", "An agreement is signed between Britain and France to develop the Concorde supersonic airliner."], ["1962-11-30T00:00:00", "The United Nations General Assembly elects U Thant of Burma as the new UN Secretary-General."], ["1962-12-02T00:00:00", "Vietnam War: After a trip to Vietnam at the request of U.S. President John F. Kennedy, U.S. Senate Majority Leader Mike Mansfield becomes the first American official to make a non-optimistic public comment on the war's progress."], ["1962-12-07T00:00:00", "Rainier III, Prince of Monaco revises the principality's constitution, devolving some of his formerly autocratic power to several advisory and legislative councils."], ["1962-12-08T00:00:00", "The first period of the Second Vatican Council closes."], ["1962-12-08T00:00:00", "The North Kalimantan National Army revolts in Brunei, in the first stirrings of the Indonesian Confrontation."], ["1962-12-08T00:00:00", "The 1962-63 New York City newspaper strike begins, affecting all of the city's major newspapers; It will last for 114 days."], ["1962-12-08T00:00:00", "Former Dutch queen Wilhelmina, who died on November 28, is buried at the New Church in Delft."], ["1962-12-09T00:00:00", "Tanganyika (modern-day Tanzania) becomes a republic within the Commonwealth, with Julius Nyerere as president."], ["1962-12-09T00:00:00", "MGM's The Wizard of Oz receives its last of four December telecasts on CBS. It will skip a telecast in 1963, so beginning in 1964, first on CBS, then on NBC, and finally again on CBS, it will nearly always be telecast during the early part of the year until Turner Entertainment buys the rights to the film in the 1990s."], ["1962-12-10T00:00:00", "David Lean's epic film Lawrence of Arabia, featuring Peter O'Toole, Omar Sharif, Alec Guinness, Jack Hawkins, and Anthony Quinn premieres in London. Six days later, it opens in the U.S."], ["1962-12-11T00:00:00", "In West Germany, a coalition government of Christian Democrats, Christian Socialists, and Free Democrats is formed."], ["1962-12-11T00:00:00", "The last execution by hanging in Canada takes place."], ["1962-12-14T00:00:00", "U.S. spacecraft Mariner 2 flies by Venus, becoming the first probe to transmit data successfully from another planet."], ["1962-12-14T00:00:00", "Leonardo da Vinci's early 16th-century painting the Mona Lisa is assessed for insurance purposes at US$100 million before touring the United States for several months, the highest insurance value for a painting in history. However, the Louvre, its owner, chooses to spend the money that would have been spent on the insurance premium on security instead."], ["1962-12-15T00:00:00", "Storm over the North Sea: Belgian pirate radio station Radio Uylenspiegel is knocked off the airwaves, never to operate again."], ["1962-12-19T00:00:00", "Britain acknowledges the right of Nyasaland (now Malawi) to secede from the Central African Federation."], ["1962-12-21T00:00:00", "Britain agrees to purchase Polaris missiles from the U.S."], ["1962-12-22T00:00:00", "Winter of 1962-63 in the United Kingdom: The \"Big Freeze\" begins; there are no frost-free nights until March 5, 1963."], ["1962-12-24T00:00:00", "Cuba releases the last 1,113 participants in the Bay of Pigs Invasion to the U.S., in exchange for food worth $53 million."], ["1962-12-30T00:00:00", "United Nations troops occupy the last rebel positions in Katanga; Moise Tshombe moves to South Rhodesia."], ["1962-12-30T00:00:00", "An unexpected storm buries Maine under five feet of snow, forcing the Bangor Daily News to miss a publication date for the only time in history. The same day, also the Netherlands are covered with several feet of snow."]]