[["1999-01-10T00:00:00", "Sanjeev Nanda kills 3 policemen in New Delhi with his car, an act for which he is later acquitted, resulting in a sharp drop in public confidence in the Indian legal system."], ["1999-01-10T00:00:00", "The Sopranos television series debuts on HBO."], ["1999-02-16T00:00:00", "In Uzbekistan, an apparent assassination attempt against President Islam Karimov takes place at government headquarters."], ["1999-02-16T00:00:00", "Across Europe, Kurdish rebels take over embassies and hold hostages after Turkey arrests one of their rebel leaders."], ["1999-02-23T00:00:00", "Kurdish rebel leader Abdullah Öcalan is charged with treason in Ankara, Turkey."], ["1999-02-23T00:00:00", "White supremacist John William King is found guilty of kidnapping and killing African American James Byrd Jr. by dragging him behind a truck for 2 miles (3 km)."], ["1999-02-23T00:00:00", "An avalanche destroys the village of Galtür, Austria, killing 31."], ["1999-03-01T00:00:00", "One of 4 bombs detonated in Lusaka, Zambia, destroys the Angolan Embassy."], ["1999-03-01T00:00:00", "Rwandan Hutu rebels kill and dismember 8 foreign tourists at the Buhoma homestead, Uganda."], ["1999-03-01T00:00:00", "The Convention on the Prohibition of Anti-Personnel Mines comes into force."], ["1999-03-21T00:00:00", "Bertrand Piccard and Brian Jones become the first to circumnavigate the Earth in a hot air balloon."], ["1999-03-21T00:00:00", "The 71st Academy Awards are held at the Dorothy Chandler Pavilion in Los Angeles with Shakespeare in Love winning Best Picture."], ["1999-03-24T00:00:00", "NATO launches air strikes against the Federal Republic of Yugoslavia, marking the first time NATO has attacked a sovereign country."], ["1999-03-24T00:00:00", "A fire in the Mont Blanc Tunnel kills 39 people, closing the tunnel for nearly 3 years."], ["1999-03-26T00:00:00", "The Melissa worm attacks the Internet."], ["1999-03-26T00:00:00", "A Michigan jury finds Dr. Jack Kevorkian guilty of second-degree murder for administering a lethal injection to a terminally ill man."], ["1999-04-05T00:00:00", "Two Libyans suspected of bringing down Pan Am Flight 103 in 1988 are handed over to Scottish authorities for eventual trial in the Netherlands. The United Nations suspends sanctions against Libya."], ["1999-04-05T00:00:00", "In Laramie, Wyoming, Russell Henderson pleads guilty to kidnapping and felony murder, in order to avoid a possible death penalty conviction for the apparent hate crime killing of Matthew Shepard."], ["1999-04-07T00:00:00", "Kosovo War: Kosovo's main border crossings are closed by Yugoslav forces to prevent Kosovo Albanians from leaving."], ["1999-04-07T00:00:00", "A bomb explodes at the Valley of the Fallen Church in Spain; GRAPO claims responsibility."], ["1999-04-14T00:00:00", "Kosovo War: NATO warplanes repeatedly bomb ethnic Albanian refugee convoys for 2 hours over a 12-mile stretch of road, after mistaking them for Serbian military trucks, between Đakovica and Dečani in western Kosovo, killing at least 73 refugees."], ["1999-04-26T00:00:00", "Sultan Salahuddin of Selangor, becomes the 11th Yang di-Pertuan Agong of Malaysia."], ["1999-04-26T00:00:00", "British TV presenter Jill Dando, 37, is shot dead on the doorstep of her home in Fulham, London."], ["1999-04-30T00:00:00", "Cambodia joins the Association of Southeast Asian Nations (ASEAN), bringing the total members to 10."], ["1999-04-30T00:00:00", "A third nail bomb (see April 17) explodes in The Admiral Duncan pub in Old Compton Street, Soho, London, killing a pregnant woman and two friends and injuring 70 others, including her husband. This is part of a hate campaign against ethnic minorities and gay people by David Copeland."], ["1999-05-03T00:00:00", "1999 Oklahoma tornado outbreak: A devastating tornado, rated F5 on the Fujita scale, slams into southern and eastern Oklahoma City metropolitan area, killing 36 people (+5 indirectly)."], ["1999-05-03T00:00:00", "The Dow Jones Industrial Average closes above 11,000 for the first time, at 11,014.70."], ["1999-05-07T00:00:00", "A jury finds The Jenny Jones Show and Warner Bros. liable in the shooting death of Scott Amedure, after the show deceived Jonathan Schmitz into appearing on a secret same-sex crush episode."], ["1999-05-07T00:00:00", "Kosovo War: In the Federal Republic of Yugoslavia, 3 Chinese embassy workers are killed and 20 others wounded when a NATO B-2 aircraft mistakenly bombs the Chinese Embassy in Belgrade."], ["1999-05-07T00:00:00", "In Guinea-Bissau, President João Bernardo Vieira is ousted in a military coup."], ["1999-05-26T00:00:00", "The Indian Air Force launches an attack on intruding Pakistan Army troops and mujahideen militants in Kashmir."], ["1999-05-26T00:00:00", "The first Welsh Assembly in over 600 years opens in Cardiff."], ["1999-05-26T00:00:00", "The 1999 UEFA Champions League Final takes place at the Camp Nou Stadium, Barcelona in which the English side Manchester United defeats the German side Bayern Munich 2-1."], ["1999-05-28T00:00:00", "Swedish police officers Robert Karlström (30) and Olov Borén (42) are wounded by 3 bank robbers armed with automatic weapons, and later executed with their own service pistols in Malexander, see Malexander murders."], ["1999-05-28T00:00:00", "After 22 years of restoration work, Leonardo da Vinci's The Last Supper is placed back on display in Milan, Italy."], ["1999-05-29T00:00:00", "Cathy O'Dowd, a South African mountaineer, becomes the first woman to summit Mount Everest from both the north and south sides."], ["1999-05-29T00:00:00", "Nigeria terminates military rule, and the Fourth Nigerian Republic is established with Olusegun Obasanjo as president."], ["1999-06-01T00:00:00", "Napster, a revolutionary music downloading service, debuts."], ["1999-06-01T00:00:00", "American Airlines Flight 1420 overruns the runway in Little Rock, Arkansas; 11 people are killed."], ["1999-06-10T00:00:00", "Kosovo War: NATO suspends its air strikes after Slobodan Milošević agrees to withdraw Yugoslav forces from Kosovo"], ["1999-06-10T00:00:00", "An underground pipeline leaks 237,000 gallons (897,000 liters) of gasoline before exploding at Whatcom Falls Park in Bellingham, Washington, killing 1 adult and 2 children."], ["1999-06-12T00:00:00", "Kosovo War: Operation Joint Guardian/Operation Agricola begins: NATO-led United Nations peacekeeping forces KFOR enter the province of Kosovo in the Federal Republic of Yugoslavia."], ["1999-06-12T00:00:00", "Texas Governor George W. Bush announces he will seek the Republican Party nomination for President of the United States."], ["1999-07-01T00:00:00", "The Scottish Parliament is officially opened by Elizabeth II on the day that legislative powers are officially transferred from the old Scottish Office in London to the new devolved Scottish Executive in Edinburgh."], ["1999-07-01T00:00:00", "Europol (short for European Police Office) the European Union's criminal intelligence agency becomes fully operational."], ["1999-07-20T00:00:00", "Mercury program: Liberty Bell 7 - piloted by Gus Grissom in 1961 - is raised from the Atlantic Ocean."], ["1999-07-20T00:00:00", "Falun Gong is banned in the People's Republic of China under Jiang Zemin."], ["1999-07-23T00:00:00", "NASA's Chandra X-ray Observatory is launched."], ["1999-07-23T00:00:00", "ANA Flight 61 is hijacked in Tokyo."], ["1999-07-23T00:00:00", "Mohammed VI of Morocco becomes king upon the death of his father Hassan II."], ["1999-08-10T00:00:00", "Buford O. Furrow, Jr. wounds 5 and kills 1 during the Los Angeles Jewish Community Center shooting."], ["1999-08-10T00:00:00", "The Atlantique incident occurs as an intruding Pakistan Navy plane is shot down in India. The incident sparks tensions between the 2 nations, coming just a month after the end of the Kargil War."], ["1999-08-11T00:00:00", "A total solar eclipse is seen in Europe and Asia."], ["1999-08-11T00:00:00", "Salt Lake City tornado: A very rare F2 tornado strikes Salt Lake City, killing 1."], ["1999-08-22T00:00:00", "Mandarin Airlines Flight 642 crashes in Hong Kong."], ["1999-08-22T00:00:00", "GPS Week Numbers reset to 0."], ["1999-08-26T00:00:00", "The Second Chechen War starts"], ["1999-09-07T00:00:00", "A magnitude 5.9 earthquake hits Athens, killing 143 and injuring more than 2,000."], ["1999-09-07T00:00:00", "Viacom and CBS merge."], ["1999-10-12T00:00:00", "Pakistani Prime Minister Nawaz Sharif attempts to dismiss Army Chief General Pervez Musharraf and install ISI director Ziauddin Butt in his place. Senior Army generals refuse to accept the dismissal. Musharraf, who is out of the country, attempts to return in a commercial airliner. Sharif orders the Karachi airport to not allow the plane to land. The generals lead a coup d'état, ousting Sharif's administration and taking over the airport. The plane lands with only a few minutes of fuel to spare, and Musharraf takes control of the government."], ["1999-10-12T00:00:00", "Date selected by the UN as when the world population reaches 6 billion people."], ["1999-10-31T00:00:00", "EgyptAir Flight 990, travelling from New York City to Cairo, crashes off the coast of Nantucket, Massachusetts, killing all 217 on board. When the pilot leaves the cockpit, the co-pilot causes the Boeing 767 to enter a steep dive, resulting in impact with the Atlantic Ocean."], ["1999-10-31T00:00:00", "Roman Catholic Church and Lutheran Church leaders sign the Joint Declaration on the Doctrine of Justification, ending a centuries-old doctrinal dispute over the nature of faith and salvation."], ["1999-11-30T00:00:00", "The ExxonMobil merger is completed, forming the largest corporation in the world."], ["1999-11-30T00:00:00", "WTO Protests – Protesters block delegates' entrance to WTO meetings in Seattle, United States."], ["1999-12-03T00:00:00", "Six firemen from Worcester, Massachusetts are killed in the Worcester Cold Storage and Warehouse fire."], ["1999-12-03T00:00:00", "After rowing for 81 days and 2,962 nautical miles (5486 km), Tori Murden becomes the first woman to cross the Atlantic Ocean by rowboat alone, when she reaches Guadeloupe from the Canary Islands."], ["1999-12-03T00:00:00", "NASA loses radio contact with the Mars Polar Lander, moments before the spacecraft enters the Martian atmosphere."], ["1999-12-31T00:00:00", "The U.S. turns over complete administration of the Panama Canal to the Panamanian Government, as stipulated in the Torrijos–Carter Treaties of 1977."], ["1999-12-31T00:00:00", "Boris Yeltsin resigns as President of Russia, leaving Prime Minister Vladimir Putin as the acting President."], ["1999-12-31T00:00:00", "Hijacking of Indian Airlines Flight 814 ended with the release of all but one of the crew and passengers at Kandahar Airport, Afghanistan."], ["1999-04-01T00:00:00", "Jairus Aquino, Filipino actor"], ["1999-04-06T00:00:00", "Kwesi Boakye, American actor"], ["1999-01-11T00:00:00", "Fabrizio De André, Italian singer and songwriter (b. 1940)"], ["1999-01-11T00:00:00", "Brian Moore, Irish-born writer (b. 1921)"], ["1999-02-01T00:00:00", "Paul Mellon, American philanthropist (b. 1907)"], ["1999-02-01T00:00:00", "Barış Manço, Turkish singer and television personality (b. 1943)"], ["1999-02-06T00:00:00", "Jimmy Roberts, American singer (b. 1924)"], ["1999-02-06T00:00:00", "Don Dunstan, Australian politician (b. 1926)"], ["1999-02-15T00:00:00", "Henry Way Kendall, American physicist, Nobel Prize laureate (b. 1926)"], ["1999-02-15T00:00:00", "Big L, American rapper (b. 1974)"], ["1999-02-18T00:00:00", "Andreas Feininger, French-born photographer (b. 1906)."], ["1999-02-18T00:00:00", "Noam Pitlik, American actor and director (b. 1932)"], ["1999-02-20T00:00:00", "Sarah Kane, English playwright (b. 1971)"], ["1999-02-20T00:00:00", "Gene Siskel, American film critic (b. 1946)"], ["1999-02-24T00:00:00", "Andre Dubus, American short-story writer (b. 1936)"], ["1999-02-24T00:00:00", "Virginia Foster Durr, American civil rights activist (b. 1903)"], ["1999-02-24T00:00:00", "Frank Leslie Walcott, Barbadian labour leader (b. 1916)"], ["1999-03-04T00:00:00", "Harry Blackmun, American judge (b. 1908)"], ["1999-03-04T00:00:00", "Del Close, American actor, writer, and teacher (b. 1934)"], ["1999-03-05T00:00:00", "Alfred Denning, Baron Denning, British lawyer and judge (b. 1899)"], ["1999-03-05T00:00:00", "John Figueroa, Jamaican poet (b. 1920)"], ["1999-03-05T00:00:00", "Richard Kiley, American actor (b. 1922)"], ["1999-03-07T00:00:00", "Sidney Gottlieb, American Central Intelligence Agency official (b. 1918)"], ["1999-03-07T00:00:00", "Stanley Kubrick, American film director and producer (b. 1928)"], ["1999-04-04T00:00:00", "Faith Domergue, American actress (b. 1924)"], ["1999-04-04T00:00:00", "Bob Peck, British actor (b. 1945)"], ["1999-04-14T00:00:00", "Ellen Corby, American actress (b. 1911)"], ["1999-04-14T00:00:00", "Anthony Newley, English actor, singer and songwriter (b. 1931)"], ["1999-04-20T00:00:00", "Rick Rude, American professional wrestler (b. 1958)"], ["1999-04-20T00:00:00", "Señor Wences, Spanish ventriloquist (b. 1896)"], ["1999-04-25T00:00:00", "Lord Killanin, Irish journalist and Olympic official (b. 1914)"], ["1999-04-25T00:00:00", "Herman Miller, American screenwriter and producer (b. 1919)"], ["1999-04-26T00:00:00", "Adrian Borland, British musician and producer (b. 1957) (The Sound)"], ["1999-04-26T00:00:00", "Jill Dando, British television journalist (b. 1961)"], ["1999-04-27T00:00:00", "Al Hirt, American trumpeter and bandleader (b. 1922)"], ["1999-04-27T00:00:00", "Cyril Washbrook, English cricketer (b. 1914)"], ["1999-04-28T00:00:00", "Rory Calhoun, American television and film actor (b. 1922)"], ["1999-04-28T00:00:00", "Arthur Leonard Schawlow, American physicist, Nobel Prize laureate (b. 1921)"], ["1999-04-28T00:00:00", "Sir Alf Ramsey World Cup winning football manager (b. 1920)"], ["1999-05-08T00:00:00", "Dirk Bogarde, English actor (b. 1921)"], ["1999-05-08T00:00:00", "Dana Plato, American actress (b. 1964)"], ["1999-05-10T00:00:00", "Shel Silverstein, American author and poet (b. 1930)"], ["1999-05-10T00:00:00", "Eric Willis, Australian politician, former Premier of New South Wales (b. 1922)"], ["1999-05-19T00:00:00", "Alister Williamson, Australian actor (b. 1918)"], ["1999-05-19T00:00:00", "Candy Candido, American voice actor (b. 1913)"], ["1999-05-23T00:00:00", "Owen Hart, Canadian professional wrestler (b. 1965)"], ["1999-05-23T00:00:00", "John T. Hayward, American admiral (b. 1908)"], ["1999-06-27T00:00:00", "Isaac C. Kidd, Jr., American admiral (b. 1919)"], ["1999-06-27T00:00:00", "Siegfried Lowitz, German television actor (b. 1914)"], ["1999-06-27T00:00:00", "Jorgos Papadopoulos, military ruler of Greece (b. 1919)"], ["1999-07-01T00:00:00", "Edward Dmytryk, Canadian-American film director (b. 1908)"], ["1999-07-01T00:00:00", "Guy Mitchell, American singer (b. 1927)"], ["1999-07-01T00:00:00", "Sylvia Sidney, American actress (b. 1910)"], ["1999-07-06T00:00:00", "Carl Gunter, Jr., American politician (b. 1938)"], ["1999-07-06T00:00:00", "Joaquín Rodrigo, Spanish composer (b. 1901)"], ["1999-07-29T00:00:00", "Anita Carter, American singer (b. 1933)"], ["1999-07-29T00:00:00", "Rajendra Kumar, Indian film actor, producer and director (b. 1929)"], ["1999-08-23T00:00:00", "Norman Wexler, American screenwriter (b. 1926)"], ["1999-08-23T00:00:00", "James White, Irish writer (b. 1928)"], ["1999-10-04T00:00:00", "Bernard Buffet, French painter (b. 1928)"], ["1999-10-04T00:00:00", "Art Farmer, American jazz trumpeter (b. 1928)"], ["1999-10-06T00:00:00", "Amália Rodrigues, Portuguese Fado legend (b. 1920)"], ["1999-10-06T00:00:00", "Gorilla Monsoon, American professional wrestler and announcer (b. 1937)"], ["1999-10-09T00:00:00", "Akhtar Hameed Khan, Pakistani pioneer in microcredit and microfinance (b. 1914)"], ["1999-10-09T00:00:00", "Milt Jackson, American musician (b. 1923)"], ["1999-10-19T00:00:00", "Harry Bannink, Dutch composer and musician (b. 1929)"], ["1999-10-19T00:00:00", "James C. Murray, American politician (b. 1917)"], ["1999-10-19T00:00:00", "Nathalie Sarraute, Russian-born Francophone lawyer and writer (b. 1900)"], ["1999-10-21T00:00:00", "Lars Bo, Danish artist and writer (b. 1924)"], ["1999-10-21T00:00:00", "John Bromwich, Australian tennis player (b. 1918)"], ["1999-10-26T00:00:00", "Rex Gildo, German singer (b. 1939)"], ["1999-10-26T00:00:00", "Hoyt Axton, American actor and singer-songwriter (b. 1938)"], ["1999-10-26T00:00:00", "Abraham Polonsky, American screenwriter and director (b. 1910)"], ["1999-10-27T00:00:00", "Frank De Vol, American arranger, composer, and actor (b. 1911)"], ["1999-10-27T00:00:00", "Robert Mills, American physicist (b. 1927)"], ["1999-11-11T00:00:00", "Mary Kay Bergman, American actress (b. 1961)"], ["1999-11-11T00:00:00", "Vivian Fuchs, English geologist (b. 1908)"], ["1999-11-11T00:00:00", "Jacobo Timerman, Argentine journalist and author (b. 1923)"], ["1999-11-18T00:00:00", "Paul Bowles, American novelist (b. 1910)"], ["1999-11-18T00:00:00", "Horst P. Horst, German-American photographer (b. 1906)"], ["1999-11-18T00:00:00", "Doug Sahm, American musician (b. 1941)"], ["1999-11-29T00:00:00", "Gene Rayburn, American television personality (b. 1917)"], ["1999-11-29T00:00:00", "Iwamoto Kaoru, Japanese professional Go player (b. 1902)"], ["1999-12-02T00:00:00", "Joey Adams, American comedian (b. 1911)"], ["1999-12-02T00:00:00", "Charlie Byrd, American Jazz musician and classical guitarist (b. 1925)"], ["1999-12-03T00:00:00", "Scatman John, American musician (b. 1942)"], ["1999-12-03T00:00:00", "Madeline Kahn, American actress (b. 1942)"], ["1999-12-08T00:00:00", "Péter Kuczka, Hungarian author (b. 1923)"], ["1999-12-08T00:00:00", "Pupella Maggio, Italian actress (b. 1910)"], ["1999-12-10T00:00:00", "Rick Danko, Canadian musician (b. 1943)"], ["1999-12-10T00:00:00", "Franjo Tuđman, President of Croatia (b. 1922)"], ["1999-12-12T00:00:00", "Paul Cadmus, American artist (b. 1904)"], ["1999-12-12T00:00:00", "Joseph Heller, American novelist (b. 1923)"], ["1999-12-17T00:00:00", "Rex Allen, American actor, singer, and songwriter (b. 1920)"], ["1999-12-17T00:00:00", "Grover Washington, Jr., American saxophonist (b. 1943)"], ["1999-12-19T00:00:00", "Desmond Llewelyn, Welsh actor (b. 1914)"], ["1999-12-19T00:00:00", "Robert Dougall, British newsreader (b. 1913)"], ["1999-12-20T00:00:00", "Irving Rapper, American film director (b. 1898)"], ["1999-12-20T00:00:00", "Hank Snow, Canadian musician (b. 1914)"], ["1999-12-24T00:00:00", "Tito Guízar, Mexican singer and film actor (b. 1908)"], ["1999-12-24T00:00:00", "João Figueiredo, former military President of Brazil (b. 1918)"]]