[["1978-01-01T00:00:00", "The Copyright Act of 1976 takes effect, making sweeping changes to United States copyright law."], ["1978-01-01T00:00:00", "Air India Flight 855, a Boeing 747 passenger jet, crashes into the ocean near Bombay, killing 213."], ["1978-01-01T00:00:00", "Edward M. Davis retires from the Los Angeles Police Department after 30 years on the force and more than 8 years as its police chief."], ["1978-01-04T00:00:00", "A referendum in Chile supports the policies of dictator Augusto Pinochet."], ["1978-01-05T00:00:00", "Bülent Ecevit, of CHP forms the new government of Turkey (42nd government)."], ["1978-01-06T00:00:00", "The Holy Crown of Hungary (also known as Stephen of Hungary Crown) is returned to Hungary from the United States, where it was held since World War II."], ["1978-01-10T00:00:00", "Pedro Joaquín Chamorro Cardenal, a critic of the Nicaraguan government, is assassinated; riots erupt against Somoza's government."], ["1978-01-14T00:00:00", "January 15 - The body of former U.S. Vice President Hubert Humphrey lies in state in the Capitol Rotunda, following his death from cancer."], ["1978-01-16T00:00:00", "Robert F. Rock succeeds Edward M. Davis as LAPD's interim chief."], ["1978-01-18T00:00:00", "The European Court of Human Rights finds the British government guilty of mistreating prisoners in Northern Ireland, but not guilty of torture."], ["1978-01-19T00:00:00", "Federal Appeals Court Judge William H. Webster is appointed FBI Director."], ["1978-01-22T00:00:00", "Ethiopia declares the ambassador of West Germany persona non grata."], ["1978-01-24T00:00:00", "Soviet satellite Kosmos 954 burns up in Earth's atmosphere, scattering debris over Canada's Northwest Territories."], ["1978-01-24T00:00:00", "Rose Dugdale and Eddie Gallagher become the first convicted prisoners to marry in prison in the history of the Republic of Ireland."], ["1978-01-25T00:00:00", "January 27 - The Great Blizzard of 1978 strikes the Ohio Valley and Great Lakes, killing 70."], ["1978-01-28T00:00:00", "Richard Chase, the \"Vampire of Sacramento\", is arrested."], ["1978-02-01T00:00:00", "Hollywood film director Roman Polanski skips bail and flees to France, after pleading guilty to charges of engaging in sex with a 13-year-old girl."], ["1978-02-05T00:00:00", "February 7 - The Northeastern United States blizzard of 1978 hits the New England region and the New York metropolitan area, killing about 100 and causing over US$520 million in damage."], ["1978-02-06T00:00:00", "King Dragon operation in Arakan: Burmese General Ne Win targets Muslim minorities in the village of Sakkipara."], ["1978-02-08T00:00:00", "United States Senate proceedings are broadcast on radio for the first time."], ["1978-02-11T00:00:00", "Pacific Western Airlines Flight 314, a Boeing 737-200, crashes in Cranbrook, British Columbia, killing 44 of the 50 people on board."], ["1978-02-11T00:00:00", "Sixteen Unification Church couples wed in New York City."], ["1978-02-11T00:00:00", "Somalia mobilizes its troops, due to an apparent Ethiopian attack."], ["1978-02-11T00:00:00", "The People's Republic of China lifts a ban on works by Aristotle, William Shakespeare and Charles Dickens."], ["1978-02-13T00:00:00", "Sydney Hilton Hotel bombing: A bomb explodes outside the Hilton Hotel in Sydney, Australia, killing 2 garbagemen, a policeman and injuring several others."], ["1978-02-15T00:00:00", "Rhodesia, one of only two remaining white-ruled African nations (the other being South Africa), announces that it will accept multiracial democracy within 2 years."], ["1978-02-15T00:00:00", "Serial killer Ted Bundy is captured in Pensacola, Florida."], ["1978-02-16T00:00:00", "The Hillside Strangler, a serial killer prowling Los Angeles, claims a tenth and final victim."], ["1978-02-16T00:00:00", "The first computer bulletin board system (CBBS) is created in Chicago."], ["1978-02-19T00:00:00", "Egyptian raid on Larnaca International Airport"], ["1978-02-21T00:00:00", "Electrical workers in Mexico City find the remains of the Great Pyramid of Tenochtitlan in the middle of the city."], ["1978-03-01T00:00:00", "Charlie Chaplin's remains are stolen from Cosier-sur-Vevey, Switzerland."], ["1978-03-02T00:00:00", "Soyuz 28 (Aleksei Gubarev, Vladimír Remek) is launched on a rendezvous with Salyut 6, with the first cosmonaut from a third country (besides the Soviet Union and United States) - Czechoslovak citizen Vladimír Remek."], ["1978-03-03T00:00:00", "Ethiopia admits that its troops are fighting with the aid of Cuban soldiers against Somalian troops in the Ogaden."], ["1978-03-03T00:00:00", "Rhodesia attacks Zambia."], ["1978-03-03T00:00:00", "The New York Post publishes an article about David Rorvik's book The Cloning of Man, about a supposed cloning of a human being."], ["1978-03-06T00:00:00", "American porn publisher Larry Flynt is shot and paralyzed in Lawrenceville, Georgia."], ["1978-03-10T00:00:00", "Soyuz 28 lands."], ["1978-03-11T00:00:00", "Coastal Road massacre: Palestinian terrorists kill 34 Israelis."], ["1978-03-14T00:00:00", "Operation Litani: Israeli forces invade Lebanon."], ["1978-03-15T00:00:00", "Somalia and Ethiopia sign a truce to end the Ethio-Somali War."], ["1978-03-16T00:00:00", "Former Italian Premier Aldo Moro is kidnapped by the Red Brigades; 5 bodyguards are killed."], ["1978-03-17T00:00:00", "The oil tanker Amoco Cadiz runs aground on the coast of Brittany."], ["1978-03-18T00:00:00", "Zulfikar Ali Bhutto, Prime Minister of Pakistan, is sentenced to death by hanging for ordering the assassination of a political opponent."], ["1978-03-18T00:00:00", "California Jam II is held at the Ontario Motor Speedway in Ontario, California, attracting more than 300,000 fans."], ["1978-03-22T00:00:00", "Karl Wallenda of The Flying Wallendas dies after falling off a tight-rope between two hotels in San Juan, Puerto Rico."], ["1978-03-26T00:00:00", "The control tower and some other facilities of New Tokyo International Airport, which were scheduled to open on March 31, are illegally occupied and damaged in a terrorist attack by New Left activists, forcing a rescheduling of its opening date to May 20."], ["1978-03-28T00:00:00", "San Francisco city council signs the U.S.'s most comprehensive homosexual rights bill."], ["1978-03-28T00:00:00", "Stump v. Sparkman (435 U.S. 349): The Supreme Court of the United States hands down a 5-3 decision in a controversial case involving involuntary sterilization and judicial immunity."], ["1978-03-28T00:00:00", "Daryl Gates succeeds Robert F. Rock as LAPD's chief, a role he will keep for the next 14 years."], ["1978-04-01T00:00:00", "New Zealand National Airways Corporation (the domestic airline of New Zealand) is merged with New Zealand's international airline, Air New Zealand."], ["1978-04-01T00:00:00", "Dick Smith of Dick Smith Foods tows a fake iceberg to Sydney Harbour."], ["1978-04-01T00:00:00", "The Philippine College of Commerce, through a presidential decree, is converted to the Polytechnic University of the Philippines."], ["1978-04-02T00:00:00", "Dallas debuted on CBS and gave birth to the modern day primetime soap opera."], ["1978-04-03T00:00:00", "The 50th Academy Awards are held at the Dorothy Chandler Pavilion in Los Angeles with Annie Hall winning Best Picture."], ["1978-04-07T00:00:00", "U.S. President Jimmy Carter decides to postpone production of the neutron bomb - a weapon which kills people with radiation but leaves buildings relatively intact."], ["1978-04-08T00:00:00", "Regular radio broadcasts of British Parliament proceedings start."], ["1978-04-09T00:00:00", "Somali military officers stage an unsuccessful coup against the government of Siad Barre; security forces thwart the attempt within hours, and several conspirators are arrested."], ["1978-04-10T00:00:00", "Volkswagen becomes the second (after Rolls-Royce) non-American automobile manufacturer to open a plant in the United States, commencing production of the Rabbit, the North American version of the Volkswagen Golf, at the Volkswagen Westmoreland Assembly Plant near New Stanton, Pennsylvania with a unionized (UAW) workforce (the plant closes in 1992)."], ["1978-04-14T00:00:00", "1978 Tbilisi Demonstrations: Thousands of Georgians demonstrate against an attempt by Soviet authorities to change the constitutional status of the Georgian language."], ["1978-04-18T00:00:00", "The U.S. Senate votes 68-32 to turn the Panama Canal over to Panamanian control on December 31, 1999."], ["1978-04-25T00:00:00", "St. Paul, Minnesota becomes the second U.S. city to repeal its gay rights ordinance after Anita Bryant's successful 1977 anti-gay campaign in Dade County, Florida."], ["1978-04-27T00:00:00", "Afghanistan President Daoud Khan is killed during a military coup; Nur Muhammad Taraki succeeds him beginning the Afghan Civil War which as of 2014 has not ended."], ["1978-04-30T00:00:00", "The Democratic Republic of Afghanistan is proclaimed under pro-communist leader Nur Muhammad Taraki."], ["1978-05-04T00:00:00", "The Battle of Cassinga occurs in southern Angola."], ["1978-05-04T00:00:00", "Communist activist Henri Curiel is murdered in Paris."], ["1978-05-05T00:00:00", "Pete Rose of the Cincinnati Reds gets his 3,000th major league hit."], ["1978-05-08T00:00:00", "Norway opens a natural gas field in the Polar Sea."], ["1978-05-08T00:00:00", "Reinhold Messner (Italy) and Peter Habeler (Austria) make the first ascent of Mount Everest without supplemental oxygen."], ["1978-05-09T00:00:00", "In Rome, the corpse of former Italian prime minister Aldo Moro is found in a red Renault 4."], ["1978-05-12T00:00:00", "In Zaire, rebels occupy the city of Kolwezi, the mining centre of the province of Shaba. The Zairean government asks the U.S., France and Belgium to restore order."], ["1978-05-12T00:00:00", "May 13 - A group of mercenaries led by Bob Denard oust Ali Soilih in the Comoros; 10 local soldiers are killed. Denard forms a new government."], ["1978-05-15T00:00:00", "Australia's longest serving prime minister sir Robert Menzies died"], ["1978-05-15T00:00:00", "Students of the University of Tehran riot in Tabriz; the army stops the riot."], ["1978-05-17T00:00:00", "Charlie Chaplin's coffin is found some 15 km from the cemetery from which it was stolen, near Lake Geneva."], ["1978-05-18T00:00:00", "Soviet dissident Yuri Orlov is sentenced to 7 years hard labor for distributing 'counterrevolutionary material'."], ["1978-05-18T00:00:00", "Sarajevo is selected to host the 1984 Winter Olympics and Los Angeles is selected to host the 1984 Summer Olympics."], ["1978-05-18T00:00:00", "May 19 - Belgian and French paratroopers fly to Zaire to aid the fight against the rebels."], ["1978-05-19T00:00:00", "May 20 - French Foreign Legion paratroopers land in Kolwezi, Zaire, to rescue Europeans in the middle of a civil war."], ["1978-05-20T00:00:00", "Mavis Hutchinson, 53, becomes the first woman to run across the U.S.; her trek took 69 days."], ["1978-05-22T00:00:00", "Exiled leaders Ahmed Abdallah and Muhammad Ahmad return to the Comoros."], ["1978-05-25T00:00:00", "A bomb explodes in the security section of Northwestern University, wounding a security guard (the first Unabomber attack)."], ["1978-05-26T00:00:00", "In Atlantic City, New Jersey, Resorts International, the first legal casino in the eastern United States, opens."], ["1978-05-28T00:00:00", "Indianapolis 500: Al Unser wins his third race, and the first for car owner Jim Hall."], ["1978-05-29T00:00:00", "Ali Soilih is found dead in the Comoros, allegedly shot when trying to escape."], ["1978-06-01T00:00:00", "The 1978 FIFA World Cup starts in Argentina."], ["1978-06-03T00:00:00", "The Congo Republic recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1978-06-06T00:00:00", "California voters approve Proposition 13, which slashes property taxes nearly 60%."], ["1978-06-09T00:00:00", "The Church of Jesus Christ of Latter-day Saints extends the priesthood and temple blessings to \"all worthy males\", ending a general policy of excluding \"Canaanites\" from priesthood ordination and temple ordinances."], ["1978-06-12T00:00:00", "Serial killer David Berkowitz, the \"Son of Sam,\" is sentenced to 365 years in prison."], ["1978-06-15T00:00:00", "King Hussein of Jordan marries 26-year-old Lisa Halaby, who takes the name Queen Noor."], ["1978-06-16T00:00:00", "Grease, starring John Travolta and Olivia Newton-John is released."], ["1978-06-19T00:00:00", "Cricketer Ian Botham becomes the first man in the history of the game to score a century and take 8 wickets in 1 inning of a Test match."], ["1978-06-19T00:00:00", "Garfield, which eventually becomes the world's most widely syndicated comic strip, makes its debut."], ["1978-06-20T00:00:00", "A magnitude 6.5 earthquake hits Thessaloniki, Greece's second largest city, killing 45 people, injuring hundreds and damaging some of the city's Byzantine landmarks."], ["1978-06-21T00:00:00", "A shootout between Provisional IRA members and the British Army leaves 1 civilian and 3 IRA men dead."], ["1978-06-21T00:00:00", "1978 Iranian Chinook shootdown: Iranian helicopters stray into Soviet airspace and are shot down."], ["1978-06-22T00:00:00", "Charon, a satellite of Pluto, is discovered."], ["1978-06-22T00:00:00", "São Tomé and Príncipe recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1978-06-23T00:00:00", "Panama recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1978-06-24T00:00:00", "Yemen Arab Republic President Ahmad al-Ghashmi is killed."], ["1978-06-24T00:00:00", "The Gay & Lesbian Solidarity March is held in Sydney, Australia to mark the 10th Anniversary of the Stonewall riots (which later becomes the annual Sydney Gay and Lesbian Mardi Gras; later incorporating a festival)."], ["1978-06-25T00:00:00", "Argentina defeats the Netherlands 3-1 after extra time to win the 1978 FIFA World Cup."], ["1978-06-26T00:00:00", "A bombing by Breton nationalists causes destruction in Palace of Versailles."], ["1978-06-28T00:00:00", "The U.S. scientific satellite Seasat is launched."], ["1978-06-28T00:00:00", "University of California Regents v. Bakke: The Supreme Court of the United States bars quota systems in college admissions but affirms the constitutionality of programs which give advantages to minorities."], ["1978-06-30T00:00:00", "Ethiopia begins a massive offensive in Eritrea."], ["1978-07-03T00:00:00", "The Amazon Co-operation Treaty (ACT) is signed."], ["1978-07-07T00:00:00", "The Solomon Islands become independent from the United Kingdom."], ["1978-07-11T00:00:00", "More than 200 tourists die in an explosion of a tanker-truck at a campsite in Costa Daurada, Spain."], ["1978-07-25T00:00:00", "Cerro Maravilla murders: Two Puerto Rican pro-independence activists are killed in a police ambush."], ["1978-07-25T00:00:00", "Louise Brown, the world's first test tube baby, is born in Oldham, Greater Manchester, UK."], ["1978-08-06T00:00:00", "Pope Paul VI dies in Castel Gandolfo."], ["1978-08-17T00:00:00", "Double Eagle II becomes the first balloon to successfully cross the Atlantic Ocean, flying from Presque Isle, Maine, to Miserey, France."], ["1978-08-22T00:00:00", "Sandinistas seize the Nicaraguan National Palace."], ["1978-08-26T00:00:00", "Pope John Paul I succeeds Pope Paul VI as the 263rd Pope."], ["1978-09-03T00:00:00", "Annual Urs sharif of Gulam Ghous Qadri Sadikshah baba (R. A.) Maharashtra."], ["1978-09-05T00:00:00", "Camp David Accords: Menachem Begin and Anwar Sadat begin the peace process at Camp David, Maryland."], ["1978-09-07T00:00:00", "In London, England, a poison-filled pellet, supposedly injected using an umbrella, poisons Bulgarian defector Georgi Markov, probably on orders of Bulgarian intelligence; he dies 4 days later."], ["1978-09-07T00:00:00", "In London, England, Keith Moon dies in Curzon Place, Mayfair."], ["1978-09-08T00:00:00", "Iranian Army troops open fire on rioters in Tehran, killing 122, wounding 4,000."], ["1978-09-16T00:00:00", "General Muhammad Zia-ul-Haq officially assumes the post of President of Pakistan."], ["1978-09-17T00:00:00", "The Camp David Accords are signed between Israel and Egypt."], ["1978-09-19T00:00:00", "Police in the West Midlands of England launch a massive murder hunt, when 13-year-old newspaper boy Carl Bridgewater is shot dead after disturbing a burglary."], ["1978-09-20T00:00:00", "General Rahimuddin Khan assumes the post of Martial Law Governor of Balochistan."], ["1978-09-25T00:00:00", "PSA Flight 182, a Boeing 727, collides with a small private airplane and crashes in San Diego, California; 144 are killed."], ["1978-09-25T00:00:00", "Giuseppe Verdi's opera Otello makes its first appearance on Live from the Met, in a complete production of the opera starring Jon Vickers. This is the first complete television broadcast of the opera in the U.S. since the historic 1948 one."], ["1978-09-27T00:00:00", "The last Forest Brother guerrilla movement fighter is discovered and killed in Estonia."], ["1978-09-28T00:00:00", "Pope John Paul I dies after only 33 days of papacy."], ["1978-10-01T00:00:00", "Vietnam attacks Cambodia."], ["1978-10-01T00:00:00", "Tuvalu becomes independent from the United Kingdom."], ["1978-10-07T00:00:00", "Wranslide in New South Wales: the Wran government is re-elected with an increased majority."], ["1978-10-08T00:00:00", "Australia's Ken Warby sets the current world water speed record of 317.6 mph (511.13 km/h) at Blowering Dam, Australia."], ["1978-10-10T00:00:00", "Daniel arap Moi becomes president of Kenya."], ["1978-10-10T00:00:00", "A massive short circuit in Seasat's electrical system ends the satellite's scientific mission."], ["1978-10-10T00:00:00", "United States President Jimmy Carter signs a bill that authorizes the minting of the Susan B. Anthony dollar."], ["1978-10-13T00:00:00", "The Soviet Union launches a major Russification campaign throughout all union republics."], ["1978-10-14T00:00:00", "U.S. President Jimmy Carter signs a bill into law which allows homebrewing of beer in the United States."], ["1978-10-16T00:00:00", "Pope John Paul II succeeds Pope John Paul I as the 264th pope, resulting in the first Year of Three Popes since 1605. He is the first Polish pope in history, and the first non-Italian pope since Pope Adrian VI (1522-1523). He will later die in 2005."], ["1978-10-18T00:00:00", "Thorbjörn Fälldin steps down as Prime Minister of Sweden, and is succeded by the Leader of"], ["1978-10-20T00:00:00", "The first Sydney Gay and Lesbian Mardi Gras is held as a protest march and commemoration of the Stonewall riots."], ["1978-10-27T00:00:00", "Egyptian President Anwar Sadat and Israeli Prime Minister Menachem Begin win the Nobel Peace Prize for their progress toward achieving a Middle East accord."], ["1978-11-03T00:00:00", "Dominica gains its independence from the United Kingdom."], ["1978-11-03T00:00:00", "Equatorial Guinea recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1978-11-05T00:00:00", "Rioters sack the British Embassy in Tehran."], ["1978-11-07T00:00:00", "Indira Gandhi is re-elected to the Indian parliament."], ["1978-11-07T00:00:00", "California voters defeat the Briggs Initiative that would have prohibited gay school teachers."], ["1978-11-09T00:00:00", "Tanzania recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1978-11-18T00:00:00", "Jonestown incident: In Guyana, Jim Jones leads his Peoples Temple cult in a mass murder-suicide that claims 918 lives in all, 909 of them at Jonestown itself, including over 270 children. Congressman Leo J. Ryan is assassinated by members of Peoples Temple shortly beforehand."], ["1978-11-19T00:00:00", "The first U.S. Take Back the Night march occurs in San Francisco."], ["1978-11-27T00:00:00", "In San Francisco, Mayor George Moscone and City Supervisor Harvey Milk are assassinated by former Supervisor Dan White."], ["1978-11-30T00:00:00", "Publication of The Times is suspended due to labor problems until November 13, 1979."], ["1978-12-04T00:00:00", "Dianne Feinstein succeeds the murdered George Moscone, to become the first woman mayor of San Francisco (she serves until January 8, 1988)."], ["1978-12-06T00:00:00", "The Spanish Constitution officially restores the country's democratic government."], ["1978-12-11T00:00:00", "Lufthansa heist: Six men rob a Lufthansa cargo facility in New York City's John F. Kennedy International Airport."], ["1978-12-11T00:00:00", "Two million demonstrate against the Shah in Iran."], ["1978-12-13T00:00:00", "The first Susan B. Anthony dollars were struck at the Philadelphia Mint."], ["1978-12-15T00:00:00", "Cleveland, Ohio becomes the first major American city to go into default since the Great Depression, under Mayor Dennis Kucinich."], ["1978-12-15T00:00:00", "Superman is released in cinemas in the United States."], ["1978-12-16T00:00:00", "Train 87 from Nanjing to Xining collides with train 368 from Xi'an to Xuzhou near Yangzhuang railway station in China, killing 106, injuring 218."], ["1978-12-19T00:00:00", "Former Prime Minister of India Indira Gandhi is arrested and jailed for a week for breach of privilege and contempt of parliament."], ["1978-12-22T00:00:00", "The pivotal Third Plenum of the 11th National Congress of the Communist Party of China is held in Beijing, with Deng Xiaoping reversing Mao-era policies to pursue a program for Chinese economic reform."], ["1978-12-22T00:00:00", "Chicago serial killer John Wayne Gacy, who was subsequently convicted of the murder of 33 young men, is arrested."], ["1978-12-22T00:00:00", "Argentina started the Operation Soberanía against Chile."], ["1978-12-25T00:00:00", "Vietnam launches a major offensive against the Khmer Rouge of Cambodia. - December 27 - The Constitution of Spain is approved in a referendum, officially ending 40 years of military dictatorship."], ["1978-12-27T00:00:00", "The Constitution of Spain is approved in a referendum, officially ending 40 years of military dictatorship."], ["1978-12-27T00:00:00", "The Constitution of Spain is approved in a referendum, officially ending 40 years of military dictatorship."]]