[["1960-01-01T00:00:00", "Cameroon gains its independence from French-administered U.N. trusteeship."], ["1960-01-02T00:00:00", "U.S. Senator John F. Kennedy (D-MA) announces his candidacy for the Democratic presidential nomination."], ["1960-01-06T00:00:00", "The Associations Law comes into force in Iraq, allowing registration of political parties."], ["1960-01-10T00:00:00", "British Prime Minister Harold Macmillan makes the Wind of Change speech for the first time (see February 3)."], ["1960-01-14T00:00:00", "The Reserve Bank and Commonwealth Bank are created in Australia."], ["1960-01-15T00:00:00", "The first televised anime, Three Tales, debuts on NHK."], ["1960-01-19T00:00:00", "The Treaty of Mutual Cooperation and Security between the United States and Japan is signed in Washington, D.C."], ["1960-01-21T00:00:00", "A mine collapses at Coalbrook, South Africa, killing 500 miners."], ["1960-01-22T00:00:00", "In France, President Charles de Gaulle fires Jacques Massu, the commander-in-chief of the French troops in Algeria."], ["1960-01-22T00:00:00", "Jacques Piccard and Don Walsh descend into the Mariana Trench in the bathyscaphe Trieste, reaching the depth of 10,911 meters (35,797 feet) and become the first human beings to reach the lowest spot on Earth."], ["1960-01-24T00:00:00", "A major insurrection occurs in Algiers against French colonial policy."], ["1960-01-25T00:00:00", "In Washington, D.C., the National Association of Broadcasters reacts to the payola scandal by threatening fines for any disc jockeys who accepted money for playing particular records."], ["1960-01-28T00:00:00", "The National Football League announces expansion teams for Dallas to start in the 1960 NFL season, and Minneapolis-St. Paul for the 1961 NFL season."], ["1960-01-30T00:00:00", "The African National Party is founded in Chad, through the merger of traditionalist parties."], ["1960-02-01T00:00:00", "In Greensboro, North Carolina, four black students from North Carolina Agricultural and Technical State University begin a sit-in at a segregated Woolworth's lunch counter. Although they are refused service, they are allowed to stay at the counter. The event triggers many similar non-violent protests throughout the Southern United States, and six months later the original four protesters are served lunch at the same counter."], ["1960-02-03T00:00:00", "Prime Minister of the United Kingdom Harold Macmillan makes the Wind of Change speech to the South African Parliament in Cape Town (although he had first made the speech, to little publicity, in Accra, Gold Coast — now Ghana — on January 10)."], ["1960-02-05T00:00:00", "The first CERN particle accelerator becomes operational in Geneva, Switzerland."], ["1960-02-09T00:00:00", "Joanne Woodward receives the first star on the Hollywood Walk of Fame."], ["1960-02-09T00:00:00", "Adolph Coors III, the chairman of the board of the Coors Brewing Company, is kidnapped, and his captors demand a ransom of $500,000. Coors is later found murdered, and Joseph Corbett, Jr. is indicted for the crime."], ["1960-02-10T00:00:00", "A conference about the proposed independence of the Belgian Congo begins in Brussels, Belgium."], ["1960-02-11T00:00:00", "The N-class blimp ZPG-3W of the U.S. Navy is destroyed during a storm over Massachusetts."], ["1960-02-11T00:00:00", "Twelve Indian soldiers die in clashes with Red Chinese troops along their small common border."], ["1960-02-13T00:00:00", "France tests its first atomic bomb in the Sahara Desert of Algeria."], ["1960-02-18T00:00:00", "The 1960 Winter Olympics begin at the Squaw Valley Ski Resort, in Placer County, California."], ["1960-02-26T00:00:00", "A New York-bound Alitalia airliner crashes into a cemetery at Shannon, Ireland, shortly after takeoff, killing 34 of the 52 persons on board."], ["1960-02-29T00:00:00", "The 1960 Agadir earthquake completely destroys the town of Agadir, Morocco."], ["1960-03-02T00:00:00", "Lucille Ball files for divorce from husband Desi Arnaz after 19 years of marriage. The divorce ends the I Love Lucy franchise."], ["1960-03-03T00:00:00", "Elvis Presley returns home from Germany, after being away on military duty for 2 years."], ["1960-03-05T00:00:00", "Elvis Presley receives his honorable discharge from the U.S. Army."], ["1960-03-05T00:00:00", "Alberto Korda takes his iconic photograph of Che Guevara, Guerrillero Heroico, in Havana."], ["1960-03-06T00:00:00", "Vietnam War: The United States announces that 3,500 American soldiers will be sent to Vietnam."], ["1960-03-06T00:00:00", "The Canton of Geneva in Switzerland gives women the right to vote."], ["1960-03-17T00:00:00", "Northwest Orient Airlines Flight 710 crashes near Tell City, Indiana, killing all 63 on board."], ["1960-03-21T00:00:00", "The Sharpeville massacre in South Africa results in more than 69 dead, 300 injured."], ["1960-03-22T00:00:00", "Arthur Leonard Schawlow & Charles Hard Townes receive the first patent for a laser."], ["1960-03-23T00:00:00", "Soviet premier Nikita Khrushchev meets French president Charles de Gaulle in Paris."], ["1960-03-29T00:00:00", "\"Tom Pillibi\" by Jacqueline Boyer (music by André Popp, text by Pierre Cour) wins the Eurovision Song Contest 1960 for France."], ["1960-04-01T00:00:00", "Tuanku Abdul Rahman ibni Almarhum Tuanku Muhammad, 1st Yang di-Pertuan Agong of Malaysia, dies in office. He is replaced by Hisamuddin Alam Shah ibni Almarhum Sultan Alaeddin Sulaiman Shah, Sultan of Selangor."], ["1960-04-01T00:00:00", "The United States launches the first weather satellite, TIROS-1."], ["1960-04-01T00:00:00", "The 1960 United States Census begins. There are 179,323,175 U.S. residents on this day. All people from Latin America are listed as white, including blacks from the Dominican Republic, European whites from Argentina and Mexicans who resemble Native Americans."], ["1960-04-04T00:00:00", "At the 32nd Academy Awards ceremony, Ben-Hur wins a record number of Oscars, including Best Picture."], ["1960-04-04T00:00:00", "Elvis Presley's song \"Are You Lonesome Tonight?\" is recorded for the first time."], ["1960-04-09T00:00:00", "Gunman David Pratt shoots South African Prime Minister Hendrik Verwoerd in Johannesburg, wounding him seriously."], ["1960-04-12T00:00:00", "Eric Peugeot, the youngest son of the founder of the Peugeot Corporation, is kidnapped in Paris. Then, he is released on April 15 in exchange for $300,000 in ransom."], ["1960-04-13T00:00:00", "United States launches navigation satellite Transit I-b."], ["1960-04-13T00:00:00", "The proposed mass-production of the Blue Streak missile is cancelled."], ["1960-04-19T00:00:00", "April Revolution: South Korean students hold a nationwide pro-democracy protest against President Syngman Rhee, eventually leading him to resign from that office."], ["1960-04-21T00:00:00", "In Brazil, the country's capital (Federal District) is relocated from the city of Rio de Janeiro to the new city, Brasília, in the highlands. The actual city of Rio de Janeiro becomes the State of Guanabara."], ["1960-04-27T00:00:00", "Togo gains independence from France, with the French-administered United Nations Trust Territory being terminated."], ["1960-05-01T00:00:00", "Several Soviet surface-to-air missiles shoot down an American Lockheed U-2 spy plane. Its pilot, Francis Gary Powers of the Central Intelligence Agency, is captured."], ["1960-05-01T00:00:00", "In India, May 2 is declared as 'Maharashtra Divas', i.e., Maharashtra Day (also celebrated as 'Kaamgaar Divas', i.e., Workers Day)."], ["1960-05-03T00:00:00", "The European Free Trade Association (EFTA) is established."], ["1960-05-03T00:00:00", "The Fantasticks, the world's longest-running musical, opens at New York City's Sullivan Street Playhouse, where it will play for 42 years."], ["1960-05-04T00:00:00", "West German refugee minister Theodor Oberländer is fired because of his past with Nazi Germany."], ["1960-05-04T00:00:00", "A. J. Liebling promulgates Liebling's Law in The New Yorker magazine: \"Freedom of the press is guaranteed only to those who own one.\""], ["1960-05-06T00:00:00", "United States President Dwight D. Eisenhower signs the Civil Rights Act of 1960 into law."], ["1960-05-09T00:00:00", "The U.S. Food and Drug Administration announces that it will approve birth control as an additional indication for Searle's Enovid, making it the world's first approved oral contraceptive pill."], ["1960-05-10T00:00:00", "The U.S. nuclear-powered submarine USS Triton, under the command of Captain Edward L. Beach Jr., completes the first underwater circumnavigation of the Earth (codenamed Operation Sandblast)."], ["1960-05-11T00:00:00", "In Buenos Aires, four Mossad agents abduct the fugitive Nazi criminal against humanity, Adolf Eichmann, in order that he can be taken to Israel and put on trial. (Eichmann is later convicted and executed)."], ["1960-05-13T00:00:00", "A joint Swiss & Austrian expedition makes the first ascent of the Asian mountain, Dhaulagiri, the world's 7th highest mountain."], ["1960-05-14T00:00:00", "The Kenyan African National Congress Party is founded in Kenya, when 3 political parties join forces."], ["1960-05-15T00:00:00", "The satellite Sputnik 4 is launched into orbit by the Soviet Union."], ["1960-05-16T00:00:00", "Soviet premier Nikita Khrushchev demands an apology from President Dwight D. Eisenhower for the U-2 reconnaissance plane flights over the Soviet Union, thus aborting the summit meeting scheduled for Paris in 1960."], ["1960-05-16T00:00:00", "Theodore Maiman operates the first laser."], ["1960-05-18T00:00:00", "Real Madrid beats Eintracht Frankfurt 7-3 at Hampden Park, Glasgow and wins the 1959-60 European Cup (football)."], ["1960-05-20T00:00:00", "In Japan, police carry away socialist members of the Diet of Japan. The Diet next approves a mutual security treaty with the United States."], ["1960-05-22T00:00:00", "The Great Chilean Earthquake: Chile's subduction fault ruptures from Talcahuano to Taitao Peninsula, causing the most powerful earthquake on record (with a magnitude of 9.5) and a tsunami. Because of its power, the seismographs in the city of Valdivia are overloaded and malfunction through the entire earthquake."], ["1960-05-23T00:00:00", "Prime Minister of Israel David Ben-Gurion announces that Nazi war criminal Adolf Eichmann has been captured."], ["1960-05-27T00:00:00", "In Turkey, a bloodless military coup d'état removes President Celâl Bayar and installs General Cemal Gürsel the as head of state."], ["1960-05-30T00:00:00", "Cemal Gürsel forms the new government of Turkey (its 24th government, composed mostly of so-called \"technocrats\")."], ["1960-06-01T00:00:00", "New Zealand's first television station begins broadcasting in the city of Auckland."], ["1960-06-05T00:00:00", "The Lake Bodom murders occur in Finland."], ["1960-06-07T00:00:00", "U.S. Senator John F. Kennedy wins the California Democratic primary."], ["1960-06-09T00:00:00", "Typhoon Mary kills 1,600 people in China."], ["1960-06-10T00:00:00", "Domino's Pizza is founded."], ["1960-06-15T00:00:00", "Violent demonstrations at Tokyo University result in 182 arrests, 589 injuries."], ["1960-06-15T00:00:00", "The BC Ferries company, later to become the second-largest ferry operator in the world, commences service between Tsawwassen and Swartz Bay, British Columbia, Canada."], ["1960-06-19T00:00:00", "The Associated Broadcasting Company (now TV5) is founded in the Philippines."], ["1960-06-20T00:00:00", "The short-lived Mali Federation, consisting of the Sudanese Republic (now the Republic of Mali) and Senegal, gains independence from France."], ["1960-06-23T00:00:00", "Japanese prime minister Nobusuke Kishi announces his resignation."], ["1960-06-24T00:00:00", "Joseph Kasa-Vubu is elected as the first President of the independent Congo."], ["1960-06-26T00:00:00", "The State of Somaliland (the former British Somaliland protectorate) receives its independence from the United Kingdom. Five days later, it unites as scheduled with the Trust Territory of Somalia (the former Italian Somaliland) to form the Somali Republic."], ["1960-06-26T00:00:00", "The Malagasy Republic, now Madagascar, becomes independent from France."], ["1960-06-30T00:00:00", "The Belgian Congo receives its independence from Belgium as the Republic of the Congo (Léopoldville). A civil war follows closely on the heels of this."], ["1960-06-30T00:00:00", "Public demonstrations by democratic and left forces, against Italian government support of the post-fascist Italian Social Movement, are heavily suppressed by police."], ["1960-07-01T00:00:00", "Ghana becomes a republic and Kwame Nkrumah becomes its first President."], ["1960-07-01T00:00:00", "Cold War: A Soviet Air Force MiG-19 fighter plane flying north of Murmansk, Russia, over the Barents Sea shoots down a six-man RB-47 Stratojet reconnaissance plane of the U.S. Air Force. Four of the U.S. Air Force officers are killed, and the two survivors are held prisoner in the Soviet Union."], ["1960-07-01T00:00:00", "The Trust Territory of Somalia (the former Italian Somaliland) gains its independence from Italy. Concurrently, it unites as scheduled with the five-day-old State of Somaliland (the former British Somaliland) to form the Somali Republic."], ["1960-07-04T00:00:00", "Following the admission of the State of Hawaii as the 50th state in August 1959, the new 50-star Flag of the United States is first officially flown over Philadelphia."], ["1960-07-10T00:00:00", "The Soviet Union national football team defeats the Yugoslavian national football team 2-1 in Paris to win the first European Soccer Championship."], ["1960-07-11T00:00:00", "Congo Crisis: Moise Tshombe declares the Congolese province of Katanga independent. He requests and receives help from Belgium."], ["1960-07-11T00:00:00", "Harper Lee publishes her novel To Kill a Mockingbird, which later wins the Pulitzer Prize for the best American novel of 1960."], ["1960-07-12T00:00:00", "Chin Peng is exiled from Malaysia to Thailand and the Malayan state of emergency is lifted."], ["1960-07-13T00:00:00", "U.S. Senator John F. Kennedy is nominated for President of the United States at the 1960 Democratic National Convention in Los Angeles."], ["1960-07-14T00:00:00", "The United Nations Security Council decides to send troops to Katanga to oversee the withdrawal of Belgian troops."], ["1960-07-20T00:00:00", "Ceylon elects Mrs. Sirimavo Bandaranaike as its Prime Minister, the world's first elected female head of government. She takes office the following day."], ["1960-07-21T00:00:00", "Francis Chichester, English navigator and yachtsman, arrives at New York City aboard his yacht, Gypsy Moth II, crossing the Atlantic Ocean solo in a new record of just forty days."], ["1960-07-25T00:00:00", "The Woolworth Company's lunch counter in Greensboro, North Carolina, the location of a sit-in that had sparked demonstrations by Negroes across the Southern United States, serves a meal to its first black customer."], ["1960-08-01T00:00:00", "Dahomey, now known as Benin, becomes independent from France."], ["1960-08-03T00:00:00", "Niger becomes independent from France."], ["1960-08-05T00:00:00", "Upper Volta, now known as Burkina Faso, becomes independent from France."], ["1960-08-06T00:00:00", "Cuban Revolution: In response to a United States embargo against Cuba, Fidel Castro nationalizes all American and foreign-owned property in Cuba."], ["1960-08-06T00:00:00", "In the Republic of the Congo (Léopoldville), now the Democratic Republic of the Congo, Albert Kalonji declares the independence of the \"Autonomous State of South Kasai\"."], ["1960-08-07T00:00:00", "The Côte d'Ivoire (the Ivory Coast) becomes independent from France."], ["1960-08-07T00:00:00", "The world's first standard gauge passenger preserved railway, The Bluebell Railway, opens to the public."], ["1960-08-11T00:00:00", "Chad becomes independent from France."], ["1960-08-13T00:00:00", "Ubangi-Shari becomes independent from France, as the \"Central African Republic\". It later becomes the \"Central African Empire\" for some years."], ["1960-08-15T00:00:00", "Middle Congo becomes independent from France, as Republic of Congo (Congo-Brazzaville)."], ["1960-08-16T00:00:00", "Joseph Kittinger parachutes from a balloon over New Mexico at an aititude of about 102,800 feet (31,333 meters). Kittinger sets world records for: high-altitude jump; free-fall by falling 16.0 miles (25.7 kilometers) before opening his parachute; and the fastest speed attained by a human being without mechanical or chemical assistance, about 982 k.p.h (614 m.p.h.). (Kittinger survives more or less uninjured, and he is still alive in Florida as of 2013. Felix Baumgartner breaks his record in 2012.)"], ["1960-08-16T00:00:00", "The Mediterranean island of Cyprus receives its independence from the United Kingdom."], ["1960-08-17T00:00:00", "The newly named Beatles begin a 48-night residency at the Indra club in Hamburg, West Germany."], ["1960-08-17T00:00:00", "Gabon becomes independent from France."], ["1960-08-17T00:00:00", "The trial of the American U-2 pilot Francis Gary Powers begins in Moscow."], ["1960-08-19T00:00:00", "Cold War: In Moscow, American U-2 pilot Francis Gary Powers is sentenced to 10 years in prison for espionage."], ["1960-08-19T00:00:00", "Sputnik program: The Soviet Union launches the satellite Sputnik 5, with the dogs Belka and Strelka (the Russian for \"Squirrel\" and \"Little Arrow\"), 40 mice, two rats and a variety of plants. This satellite returns to earth the next day and all animals are recovered safely."], ["1960-08-20T00:00:00", "Senegal breaks away from the Mali Federation, declaring its independence."], ["1960-08-25T00:00:00", "The 1960 Summer Olympic Games begin in Rome."], ["1960-08-25T00:00:00", "The American nuclear submarine USS Seadragon (SSN-584) surfaces through the arctic ice cap at the North Pole, the first submarine ever to do so."], ["1960-08-29T00:00:00", "Hurricane Donna kills 50 people in Florida and New England."], ["1960-09-01T00:00:00", "Sultan Hisamuddin Alam Shah, Sultan of Selangor and 2nd Yang di-Pertuan Agong of Malaysia, dies in office. He is replaced by Tuanku Syed Putra, Raja of Perlis."], ["1960-09-01T00:00:00", "Disgruntled railroad workers effectively halt operations of the Pennsylvania Railroad, marking the first shutdown in the company's history (the event lasts two days)."], ["1960-09-02T00:00:00", "The first elections of the Parliament of the Central Tibetan Administration are held. The Tibetan community observes this date as Democracy Day."], ["1960-09-05T00:00:00", "1960 Summer Olympic Games: Muhammad Ali (then Cassius Clay) wins the gold medal in light-heavyweight boxing."], ["1960-09-05T00:00:00", "The Congolese president, Joseph Kasa-Vubu, fires Patrice Lumumba's entire government, and also places Lumumba under house arrest."], ["1960-09-06T00:00:00", "William Hamilton Martin and Bernon F. Mitchell, two American cryptologists, announce their defection to the Soviet Union at a press conference in Moscow."], ["1960-09-08T00:00:00", "In Huntsville, Alabama, U.S. President Dwight D. Eisenhower formally dedicates the Marshall Space Flight Center (which had been activated by NASA on July 1)."], ["1960-09-14T00:00:00", "Colonel Joseph Mobutu takes power in Republic of the Congo via a military coup."], ["1960-09-14T00:00:00", "The countries of Iran, Iraq, Kuwait, Saudi Arabia, and Venezuela form OPEC."], ["1960-09-22T00:00:00", "Mali, the sole remaining member of the \"Mali Federation\" following the withdrawal of Senegal one month earlier, declares its full independence as the Republic of Mali."], ["1960-09-26T00:00:00", "The leading candidates for President of the United States, Richard Nixon and John F. Kennedy, make the first televised debate."], ["1960-09-30T00:00:00", "The television animated sitcom, The Flintstones premiers on ABC."], ["1960-10-01T00:00:00", "Nigeria becomes independent from United Kingdom, and Nnamdi Azikiwe becomes its first native-born Governor General."], ["1960-10-01T00:00:00", "Cameroon declares independence from United Kingdom."], ["1960-10-03T00:00:00", "Jânio Quadros is elected President of Brazil for a five-year term."], ["1960-10-05T00:00:00", "White South Africans vote to make the country a republic."], ["1960-10-07T00:00:00", "Nigeria becomes the 99th member of the United Nations."], ["1960-10-12T00:00:00", "Cold War: Soviet premier Nikita Khrushchev pounds his shoe on a table at a meeting of the United Nations General Assembly, his way of protesting the discussion of the Soviet Union's policies toward Eastern Europe."], ["1960-10-12T00:00:00", "Otoya Yamaguchi assassinates Inejiro Asanuma, the chairman of the Japanese Socialist Party."], ["1960-10-13T00:00:00", "The third John F. Kennedy - Richard M. Nixon Presidential Debate takes place."], ["1960-10-13T00:00:00", "The Pittsburgh Pirates defeat the New York Yankees in the seventh game of the World Series on Bill Mazeroski's series-clinching home run."], ["1960-10-14T00:00:00", "Presidential candidate John F. Kennedy first suggests the idea for the Peace Corps of the United States."], ["1960-10-14T00:00:00", "The Premier of New South Wales officially opens Warragamba Dam, one of the world's largest domestic water supply dams."], ["1960-10-24T00:00:00", "A large rocket explodes on the launch pad at the Baikonur Cosmodrome, killing at least 90 people of the Soviet space program."], ["1960-10-26T00:00:00", "Robert F. Kennedy telephones Coretta Scott King, the wife of Dr. Martin Luther King Jr., and he also secures King's release from jail regarding a traffic violation in Atlanta."], ["1960-10-29T00:00:00", "In Louisville, Kentucky, Cassius Clay (later Muhammad Ali) wins his first professional boxing match."], ["1960-10-30T00:00:00", "Dr. Michael Woodruff carries out the first successful kidney transplant in the United Kingdom, at the Edinburgh Royal Infirmary."], ["1960-11-02T00:00:00", "Penguin Books is found not guilty of obscenity, in the case of D. H. Lawrence's novel Lady Chatterley's Lover."], ["1960-11-08T00:00:00", "United States presidential election, 1960: In a close race, Democratic U. S. Senator John F. Kennedy is elected over Republican U. S. Vice President Richard Nixon, to become (at 43) the second youngest man to serve as President of the United States, and the youngest man elected to this position."], ["1960-11-13T00:00:00", "Sammy Davis Jr., marries Swedish actress May Britt."], ["1960-11-14T00:00:00", "Belgium threatens to leave the United Nations over criticism of its policy concerning the Republic of the Congo."], ["1960-11-14T00:00:00", "A collision between two trains in Pardubice, Czechoslovakia, kills 117 people."], ["1960-11-15T00:00:00", "A Polaris missile is test-launched from Cape Canaveral, Florida"], ["1960-11-22T00:00:00", "The United Nations supports the government of Joseph Kasavubu and Joseph Mobutu in the Republic of the Congo."], ["1960-11-24T00:00:00", "The professional basketball player Wilt Chamberlain of the Philadelphia 76ers gets 55 rebounds in an NBA game versus the Boston Celtics."], ["1960-11-28T00:00:00", "Mauritania becomes independent of France."], ["1960-12-01T00:00:00", "Patrice Lumumba, deposed premier of the Republic of the Congo, is arrested by the troops of Colonel Joseph Mobutu."], ["1960-12-01T00:00:00", "A Soviet satellite containing live animals and plants is launched into orbit. Due to a malfunction it burns up during re-entry."], ["1960-12-02T00:00:00", "The Archbishop of Canterbury, the Most Rev. Geoffrey Francis Fisher, talks with Pope John XXIII for about one hour in Vatican City. This is the first time that any chief of the Anglican Church had ever visited the Pope."], ["1960-12-02T00:00:00", "U.S. President Dwight D. Eisenhower authorizes the use of $1.0 million for the relief and resettlement of Cuban refugees, who had been arriving in Florida at the rate of about 1,000 per week."], ["1960-12-04T00:00:00", "The admission of Mauritania to the United Nations is vetoed by the Soviet Union."], ["1960-12-05T00:00:00", "Pierre Lagaillarde, who led the insurrections in 1958 and 1960 in Algeria, fails to appear in court in Paris, France. He had reportedly fled with his four fellow defendants to Spain en route to Algeria."], ["1960-12-05T00:00:00", "Boynton v. Virginia: The Supreme Court of the United States declares that segregation in public transportation is illegal in the United States."], ["1960-12-07T00:00:00", "The United Nations Security Council is called into session by the Soviet Union in order to consider Soviet demands for the Security Council to seek the immediate release of former Congolese Premier Patrice Lumumba."], ["1960-12-08T00:00:00", "For the first time, Mary Martin's Peter Pan is presented as a stand-alone two-hour special on NBC instead of as part of an anthology series. This version, rather than being presented live, is shown on videotape, enabling NBC to repeat it as often as they wish without having to restage it. Although nearly all of the adult actors repeat their original Broadway roles, all of the original children have, ironically, outgrown their roles and are replaced by new actors."], ["1960-12-09T00:00:00", "French President Charles de Gaulle's visit to Algeria is bloodied by European and Muslim rioters in Algeria's largest cities. These riots cause 127 deaths."], ["1960-12-09T00:00:00", "The classic British TV series Coronation Street premieres. Planned as a 13-part drama, it becomes such a success among viewers it continues to be shown five times per week through 2012."], ["1960-12-11T00:00:00", "MGM's The Wizard of Oz is rerun on CBS only a year after its previous telecast, thus beginning the tradition of annual telecasts of the film."], ["1960-12-12T00:00:00", "The Supreme Court of the United States upholds a lower Federal Court ruling that the State of Louisiana's racial segregation laws are unconstitutional, and overturns them."], ["1960-12-13T00:00:00", "While Emperor Haile Selassie I of Ethiopia visits Brazil, his Imperial Bodyguard leads a military coup against his rule, proclaiming that the emperor's son, Crown Prince Asfa Wossen, is the new emperor."], ["1960-12-13T00:00:00", "The countries of El Salvador, Guatemala, Honduras, and Nicaragua announce the formation of the Central American Common Market."], ["1960-12-13T00:00:00", "The U.S. Navy's Commander Leroy Heath (pilot) and Lieutenant Larry Monroe (bombardier/navigator) establish a world flight-altitude record of 91,450 feet (27,874 m), with payload, in an A-5 Vigilante bomber carrying 1,000 kg (2,200 lb), and better the previous world record by over four miles (6 km)."], ["1960-12-14T00:00:00", "Antoine Gizenga proclaims in the Democratic Republic of the Congo that he has taken over as the country's premier."], ["1960-12-14T00:00:00", "First tied Test by the West Indian cricket team in Australia in Brisbane."], ["1960-12-15T00:00:00", "King Mahendra of Nepal deposes the democratic government in his country and takes direct control himself."], ["1960-12-15T00:00:00", "King Baudouin of Belgium marries Doña Fabiola de Mora y Aragón."], ["1960-12-16T00:00:00", "Secretary of State Christian Herter announces that the United States will commit five nuclear submarines and eighty Polaris missiles to the defense of the NATO countries by the end of 1963."], ["1960-12-16T00:00:00", "New York mid-air collision: A United Airlines DC-8 collides in mid-air with a TWA Lockheed Constellation over Staten Island in New York City. All 128 passengers and crewmembers on the two airliners, and six people on the ground, are killed."], ["1960-12-17T00:00:00", "Troops loyal to Emperor Haile Selassie in Ethiopia overcome the coup that began on December 13, returning the reins to the Emperor upon his return from a trip to Brazil. The Emperor absolves his own son of any guilt."], ["1960-12-19T00:00:00", "Fire sweeps through the USS Constellation, to become the U.S. Navy's largest aircraft carrier, while she is under construction at the Brooklyn Navy Yard; killing 50 workers and injuring 150."], ["1960-12-27T00:00:00", "France sets off its third A-bomb test at its nuclear weapons testing range near Reggane, Algeria."], ["1960-12-31T00:00:00", "Last day on which the farthing, a coin first minted in England in the 13th century, is legal tender in the United Kingdom."]]