[["1913-01-01T00:00:00", "The British Board of Film Censors receives the authority to classify and censor films."], ["1913-01-13T00:00:00", "Edward Carson founds the (first) Ulster Volunteer Force by unifying several existing loyalist militias to resist home rule for Ireland."], ["1913-01-23T00:00:00", "General election in Tasmania."], ["1913-01-23T00:00:00", "In the 1913 Ottoman coup d'état, Ismail Enver comes to power."], ["1913-01-30T00:00:00", "The British House of Lords rejects an Irish Home Rule Bill"], ["1913-02-01T00:00:00", "New York City's Grand Central Terminal, having been rebuilt, reopens as the world's largest railroad station."], ["1913-02-03T00:00:00", "The 16th Amendment to the United States Constitution is ratified, authorizing the Federal government to impose and collect income taxes."], ["1913-02-09T00:00:00", "Mexican Revolution: Beginning of \"La Decena Trágica\", the rebellion of some military chiefs against the President Francisco I. Madero."], ["1913-02-18T00:00:00", "Mexican Revolution: President Francisco I. Madero and Vice President José María Pino Suárez are forced to resign. Pedro Lascuráin serves as President for less than an hour before General Victoriano Huerta, leader of the coup, takes office"], ["1913-02-22T00:00:00", "Mexican Revolution: Assassination of Francisco I. Madero and José María Pino Suárez."], ["1913-03-03T00:00:00", "The Woman Suffrage Parade of 1913 takes place in Washington, D.C. led by Inez Milholland on horseback."], ["1913-03-04T00:00:00", "Woodrow Wilson succeeds William Howard Taft as President of the United States."], ["1913-03-04T00:00:00", "The U.S. Department of Commerce and U.S. Department of Labor are established by splitting the duties of the 10-year-old Department of Commerce and Labor. The Census Bureau, U.S. Bureau of Fisheries and U.S. Coast and Geodetic Survey form part of the Department of Commerce."], ["1913-03-07T00:00:00", "The British freighter Alum Chine, carrying 343 tons of dynamite, explodes in Baltimore harbour."], ["1913-03-12T00:00:00", "Australia begins building the new federal capital of Canberra."], ["1913-03-13T00:00:00", "Mexican Revolution: Pancho Villa returns to Mexico from his self-imposed exile in the United States."], ["1913-03-17T00:00:00", "The Military Aviation Academy (Escuela de Aviación Militar) is founded in Uruguay, to become the Military Air Force (Fuerza Aérea Militar) on 4 December 1952. The Uruguayan Air Force (FAU) would grow from this foundation."], ["1913-03-18T00:00:00", "George I of Greece is assassinated after 50 years on the throne. He is succeeded by his son Constantine."], ["1913-03-20T00:00:00", "Sung Chiao-jen, a founder of the Chinese nationalist party (Kuomintang), is wounded in an assassination attempt and dies two days later."], ["1913-03-23T00:00:00", "Supporters of Phan Xích Long begin an attempt to revolt against colonial rule in French Indochina."], ["1913-03-25T00:00:00", "Great Dayton Flood after four days of rain in the Miami Valley kills over 360 and destroys 20,000 homes, chiefly in Dayton."], ["1913-03-26T00:00:00", "Mexican Revolution: Venustiano Carranza announces his Plan of Guadalupe and begins his rebellion against Victoriano Huerta's government as head of the Constitutionals."], ["1913-03-26T00:00:00", "Balkan Wars: Siege of Adrianople ends when Bulgarian forces take Adrianople from the Ottomans."], ["1913-04-05T00:00:00", "The United States Soccer Federation is formed."], ["1913-04-08T00:00:00", "The Seventeenth Amendment to the United States Constitution is passed, dictating the direct election of senators."], ["1913-04-21T00:00:00", "Cunard ocean liner RMS Aquitania, built by John Brown & Company, is launched on the River Clyde."], ["1913-04-24T00:00:00", "The Woolworth Building opens in New York City. Designed by Cass Gilbert, it is the tallest building in the world at this date and for more than a decade after."], ["1913-05-03T00:00:00", "Raja Harishchandra, the first full-length Indian feature film is released, marking the beginning of the Indian film industry."], ["1913-05-14T00:00:00", "New York Governor William Sulzer approves the charter for the Rockefeller Foundation, which begins operations with a $100,000,000 donation from John D. Rockefeller."], ["1913-05-24T00:00:00", "Princess Victoria Louise of Prussia marries Prince Ernest Augustus of Hanover in Berlin, ending the decades-long rift between the Houses of Hohenzollern and Hanover and becoming the last great gathering of European sovereigns."], ["1913-05-29T00:00:00", "The ballet The Rite of Spring, with music by Igor Stravinsky conducted by Pierre Monteux, choreography by Vaslav Nijinsky and design by Nicholas Roerich, is premièred by Sergei Diaghilev's Ballets Russes at the Théâtre des Champs-Élysées in Paris; its modernism provokes one of the most famous classical music riots in history."], ["1913-05-30T00:00:00", "First Balkan War: The Treaty of London is signed, ending the war. Greece is granted those parts of southern Epirus which it does not already control and the independence of Albania is recognised."], ["1913-06-01T00:00:00", "The Greek-Serbian Treaty of Alliance is signed, paving the way for the Second Balkan War."], ["1913-06-04T00:00:00", "Emily Davison, a British suffragette, runs out in front of the King's horse, Anmer, at the Epsom Derby. She is trampled and dies four days later in hospital, never having regained consciousness."], ["1913-06-08T00:00:00", "The Deutsches Stadion in Berlin is dedicated with the release of 10,000 pigeons in front of an audience of 60,000 people. It had been constructed in anticipation of the 1916 Summer Olympics, later to be cancelled the result of World War I."], ["1913-06-11T00:00:00", "Women's suffrage is enacted in Norway."], ["1913-06-11T00:00:00", "Battle of Bud Bagsak: Armed with guns and heavy artillery, U.S. and Philippine troops under General John J. \"Black Jack\" Pershing fight a four-day battle against 500 Moro rebels who are armed mostly with kampilan swords. The rebels are killed in a final desperate charge on June 15."], ["1913-06-18T00:00:00", "The Arab Congress of 1913 opens, during which Arab nationalists meet to discuss desired reforms under the Ottoman Empire."], ["1913-06-19T00:00:00", "The Parliament of South Africa passes the Natives Land Act, limiting land ownership for blacks to black territories."], ["1913-06-24T00:00:00", "Joseph Cook becomes the 6th Prime Minister of Australia."], ["1913-06-29T00:00:00", "The Second Balkan War begins."], ["1913-07-10T00:00:00", "Romania declares war on Bulgaria."], ["1913-07-10T00:00:00", "Death Valley, California hits 134 °F (~56.7 °C), the highest temperature recorded in the world (as of 2013)."], ["1913-07-27T00:00:00", "Foundation of the town of San Javier, Uruguay, by Russian settlers."], ["1913-08-04T00:00:00", "Republic of China: the province of Chungking (Chongqing) declares independence; Republican forces crush the rebellion in a couple of weeks."], ["1913-08-10T00:00:00", "Second Balkan War: The Treaty of Bucharest is signed, ending the war. Macedonia is divided and Northern Epirus is assigned to Albania."], ["1913-08-13T00:00:00", "Harry Brearley invents stainless steel in Sheffield."], ["1913-08-20T00:00:00", "After his airplane fails at an altitude of 900 feet (270 m), aviator Adolphe Pégoud becomes the first person to bail out to safety from an airplane and land safely."], ["1913-08-23T00:00:00", "The statue The Little Mermaid in Copenhagen, Denmark, is finished."], ["1913-08-26T00:00:00", "Dublin Lock-out in Ireland: Members of James Larkin's Irish Transport and General Workers' Union employed by the Dublin United Tramways Company begin strike action in defiance of the dismissal of trade union members by its chairman."], ["1913-08-31T00:00:00", "Dublin Lock-out: \"Bloody Sunday\": The dispute escalates when the Dublin Metropolitan Police kill one demonstrator and injure 400 in dispersing a demonstration."], ["1913-09-09T00:00:00", "In Germany, BASF starts the world's first plant for the production of fertilizer based on the Haber-Bosch process, feeding today about a third of the world's population."], ["1913-09-17T00:00:00", "In Chicago, the Anti-Defamation League of B'nai B'rith is founded, with Sigmund Livingston as its first president."], ["1913-09-23T00:00:00", "French aviator Roland Garros crosses the Mediterranean in an airplane flying from Fréjus, France to Bizerte, Tunisia."], ["1913-09-29T00:00:00", "Second Balkan War: The Treaty of Constantinople is signed in Istanbul between the Ottoman Empire and the Kingdom of Bulgaria."], ["1913-10-01T00:00:00", "Mexican Revolution: Pancho Villa's troops take Torreón after a 3-day battle, when government troops retreat."], ["1913-10-10T00:00:00", "U.S. President Woodrow Wilson triggers the explosion of the Gamboa Dike, ending construction on the Panama Canal."], ["1913-10-10T00:00:00", "Yuan Shikai elected as President of the Republic of China."], ["1913-10-14T00:00:00", "Senghenydd Colliery Disaster: An explosion at the Universal Colliery, Senghenydd in South Wales kills 439 miners, the worst mining accident in the United Kingdom."], ["1913-10-16T00:00:00", "HMS Queen Elizabeth is launched at Portsmouth Dockyard as the first oil-fired battleship."], ["1913-10-18T00:00:00", "The Monument to the Battle of the Nations at Leipzig in Germany is finished."], ["1913-10-19T00:00:00", "The DLRG (German Life-Saving Society) is founded."], ["1913-10-26T00:00:00", "Victoriano Huerta elected president of Mexico."], ["1913-10-31T00:00:00", "The Lincoln Highway, the first automobile road across the United States, is dedicated."], ["1913-11-05T00:00:00", "The King Otto of Bavaria is deposed by his cousin, Prince Regent Ludwig, who assumes the title Ludwig III."], ["1913-11-06T00:00:00", "Mohandas Gandhi is arrested while leading a march of Indian miners in South Africa."], ["1913-12-01T00:00:00", "The Ford Motor Company introduces the first moving assembly line, reducing chassis assembly time from 12½ hours in October to 2 hours, 40 minutes. Although Ford is not the first to use an assembly line, his successful adoption of one sparks an era of mass production."], ["1913-12-01T00:00:00", "Crete, having obtained self rule from Turkey after the First Balkan War, is annexed by Greece."], ["1913-12-12T00:00:00", "Vincenzo Peruggia tries to sell the Mona Lisa in Florence and is arrested."], ["1913-12-23T00:00:00", "The Federal Reserve System is created as the central banking system of the United States by Woodrow Wilson's signature of the Federal Reserve Act."], ["1913-12-30T00:00:00", "Italy returns the Mona Lisa to France."]]