[["1933-01-05T00:00:00", "Construction of the Golden Gate Bridge begins in San Francisco Bay."], ["1933-01-11T00:00:00", "Sir Charles Kingsford Smith makes the first commercial flight between Australia and New Zealand."], ["1933-01-15T00:00:00", "Political violence causes almost 100 deaths in Spain."], ["1933-01-17T00:00:00", "The United States Congress votes favorably for Philippines independence, against the view of U.S. President Herbert Hoover."], ["1933-01-23T00:00:00", "The Twentieth Amendment to the United States Constitution is ratified, changing Inauguration Day from March 4 to January 20 starting in 1937."], ["1933-01-28T00:00:00", "Pakistan Declaration: Choudhry Rahmat Ali publishes (in Cambridge, England) a pamphlet entitled Now or Never; Are We to Live or Perish Forever? in which he calls for the creation of a Muslim state in northwest India that he calls \"Pakstan\" which is influential on the Pakistan Movement."], ["1933-01-30T00:00:00", "Édouard Daladier forms a government in France."], ["1933-01-30T00:00:00", "Nazi leader Adolf Hitler is appointed Chancellor of Germany by President of Germany Paul von Hindenburg."], ["1933-01-30T00:00:00", "The Lone Ranger debuts on American radio."], ["1933-02-01T00:00:00", "Adolf Hitler gives his \"Proclamation to the German People\" in Berlin."], ["1933-02-02T00:00:00", "A second international conference on disarmament ends without results. It tries to limit the army sizes of the major powers, while Germany is entitled to 200,000; Germany leaves the conference because a plan postpones the limitations for 4 years."], ["1933-02-05T00:00:00", "A mutiny starts on the Royal Netherlands Navy coastal defence ship De Zeven Provinciën in the Dutch East Indies. After 6 days, she is bombed by a Dutch aircraft, killing 23, and the remaining mutineers surrender."], ["1933-02-06T00:00:00", "The Twentieth Amendment to the United States Constitution goes into effect."], ["1933-02-09T00:00:00", "The King and Country debate: The Oxford Union student debating society in England passes a resolution stating, \"That this House will in no circumstances fight for its King and country.\""], ["1933-02-10T00:00:00", "The New York City-based Postal Telegraph Company introduces the first singing telegram."], ["1933-02-15T00:00:00", "In Miami, Giuseppe Zangara attempts to assassinate President-elect Franklin D. Roosevelt, but instead fatally wounds the Mayor of Chicago, Anton Cermak."], ["1933-02-17T00:00:00", "Newsweek magazine is published for the first time in the United States."], ["1933-02-17T00:00:00", "The Blaine Act passes the United States Senate, submitting the proposed Twenty-first Amendment to the Constitution to the states for ratification. The amendment is ratified on December 5, ending prohibition in the United States."], ["1933-02-27T00:00:00", "Reichstag fire: Germany's parliament building in Berlin, the Reichstag building, is set on fire under controversial circumstances."], ["1933-02-28T00:00:00", "The Reichstag Fire Decree is passed in response to the Reichstag fire, nullifying many German civil liberties."], ["1933-03-02T00:00:00", "The original film version of King Kong, starring Fay Wray, premieres at Radio City Music Hall and the RKO Roxy Theatre in New York City."], ["1933-03-03T00:00:00", "Ching Yun University is established."], ["1933-03-03T00:00:00", "Mount Rushmore National Memorial is dedicated."], ["1933-03-03T00:00:00", "A powerful earthquake and tsunami hit Honshū, Japan, killing approximately 3,000 people."], ["1933-03-04T00:00:00", "U.S. President Herbert Hoover is succeeded by Franklin D. Roosevelt (FDR), who in reference to the Great Depression, proclaims \"The only thing we have to fear, is fear itself\" in his inauguration speech. FDR is sworn in by Chief Justice Charles Evans Hughes. It is also the last time Inauguration Day in the United States occurs on March 4."], ["1933-03-04T00:00:00", "Frances Perkins becomes United States Secretary of Labor, and the first female member of the United States Cabinet."], ["1933-03-04T00:00:00", "The Parliament of Austria is suspended because of a quibble over procedure; Chancellor Engelbert Dollfuss initiates authoritarian rule by decree (see Austrofascism)."], ["1933-03-05T00:00:00", "The Great Depression: President Franklin D. Roosevelt declares a \"Bank holiday\", closing all United States banks and freezing all financial transactions (the 'holiday' ends on March 13)."], ["1933-03-05T00:00:00", "German election, 1933: National Socialists gain 43.9% of the votes."], ["1933-03-06T00:00:00", "Mayor Anton Cermak of Chicago dies of the wound he received on February 15."], ["1933-03-09T00:00:00", "Great Depression: The United States Congress begins its first 100 days of enacting New Deal legislation."], ["1933-03-10T00:00:00", "An earthquake in Long Beach, California kills 117 people."], ["1933-03-12T00:00:00", "Great Depression: Franklin Delano Roosevelt addresses the nation for the first time as President of the United States, in the first of his \"Fireside chats\"."], ["1933-03-15T00:00:00", "The Dow Jones Industrial Average rises from 53.84 to 62.10. The day's gain of 15.34%, achieved during the depths of the Great Depression, remains to date as the largest 1-day percentage gain for the index."], ["1933-03-15T00:00:00", "Austrian Chancellor Engelbert Dollfuss keeps members of the National Council from convening, starting the Austrofascist dictatorship."], ["1933-03-20T00:00:00", "Dachau, the first Nazi concentration camp, is completed (it opens March 22)."], ["1933-03-22T00:00:00", "President Franklin Roosevelt signs an amendment to the Volstead Act known as the Cullen-Harrison Act, allowing the manufacture and sale of \"3.2 beer\" (3.2% alcohol by weight, approximately 4% alcohol by volume) and light wines."], ["1933-03-23T00:00:00", "The Reichstag passes the Enabling Act, making Adolf Hitler dictator of Germany."], ["1933-03-24T00:00:00", "Jewish protesters in New York City call for a boycott of German goods in response to the persecution of German Jews by the Nazis."], ["1933-03-27T00:00:00", "Japan leaves the League of Nations."], ["1933-03-31T00:00:00", "The Civilian Conservation Corps is established with the mission of relieving rampant unemployment in the United States."], ["1933-04-01T00:00:00", "The recently elected Nazis under Julius Streicher organize a one-day boycott of all Jewish-owned businesses in Germany."], ["1933-04-02T00:00:00", "In a cricket test match against New Zealand, England batsman Wally Hammond scores a record 336 runs."], ["1933-04-03T00:00:00", "An anti-monarchist rebellion occurs in Siam (Thailand)."], ["1933-04-03T00:00:00", "First flight over Mount Everest, a British expedition, led by the Marquis of Clydesdale, and funded by Lucy, Lady Houston."], ["1933-04-04T00:00:00", "The American airship Akron crashes off the coast of New Jersey, killing 73 of its 76 crewmen. It is the worst aviation accident in history up to this date and until 1950."], ["1933-04-05T00:00:00", "The International Court of Justice in The Hague decides that Greenland belongs to Denmark and condemns Norwegian landings on eastern Greenland. Norway submits to the decision."], ["1933-04-05T00:00:00", "President of the United States Franklin D. Roosevelt declares a national emergency and issues Executive Order 6102, making it illegal for U.S. citizens to own substantial amounts of monetary gold or bullion."], ["1933-04-07T00:00:00", "Sale of some beer is legalized in the United States under the Cullen-Harrison Act of March 22, eight months before the full repeal of Prohibition in December."], ["1933-04-07T00:00:00", "The Law for the Restoration of the Professional Civil Service is passed in Germany, the first law of the new regime directed against Jews (as well as political opponents)."], ["1933-04-11T00:00:00", "Aviator Bill Lancaster takes off in England, in an attempt to make a speed record to the Cape of Good Hope, but vanishes (his body is not found in the Sahara Desert until 1962)."], ["1933-04-13T00:00:00", "The Children and Young Persons Act is passed in the United Kingdom."], ["1933-04-19T00:00:00", "The United States officially goes off the gold standard."], ["1933-04-21T00:00:00", "Nazi Germany outlaws the kosher ritual shechita."], ["1933-04-24T00:00:00", "Persecution of Jehovah's Witnesses in Nazi Germany begins with seizure of the Bible Students' office in Magdeburg."], ["1933-04-24T00:00:00", "Jewish physicians in Nazi Germany are excluded from official insurance schemes, forcing many to give up their practices."], ["1933-04-26T00:00:00", "The Gestapo secret police are established in Nazi Germany by Hermann Göring."], ["1933-04-26T00:00:00", "Editors of the Harvard Lampoon steal the Sacred Cod of Massachusetts from the State House (it is returned two days later)."], ["1933-04-27T00:00:00", "The Jessop & Son department store in Nottingham, England is acquired by John Lewis Partnership (its first store outside of London)."], ["1933-04-27T00:00:00", "The Stahlhelm organization joins the Nazi party."], ["1933-05-02T00:00:00", "The first alleged modern sighting of the Loch Ness Monster occurs."], ["1933-05-02T00:00:00", "Gleichschaltung: Adolf Hitler prohibits trade unions."], ["1933-05-03T00:00:00", "In the Irish Free State, Dáil Éireann abolishes the oath of allegiance to the British Crown."], ["1933-05-03T00:00:00", "Nellie Tayloe Ross becomes the first woman to be named director of the United States Mint."], ["1933-05-05T00:00:00", "The detection by Karl Jansky of radio waves from the center of the Milky Way Galaxy is reported in the New York Times. The discovery leads to the birth of radio astronomy."], ["1933-05-08T00:00:00", "Mohandas Gandhi begins a 3-week hunger strike because of the mistreatment of the lower castes."], ["1933-05-10T00:00:00", "In Germany, the Nazis stage massive public book burnings."], ["1933-05-10T00:00:00", "Paraguay declares war on Bolivia."], ["1933-05-12T00:00:00", "Agricultural Adjustment Act is enacted in the USA."], ["1933-05-17T00:00:00", "Vidkun Quisling and Johan Bernhard Hjort form The Nasjonal Samling (the National-Socialist Party) of Norway."], ["1933-05-18T00:00:00", "New Deal: President Franklin Delano Roosevelt signs an act creating the Tennessee Valley Authority."], ["1933-05-26T00:00:00", "The Nazi Party in Germany introduces a law to legalize eugenic sterilization."], ["1933-05-27T00:00:00", "New Deal: The Federal Securities Act is signed into law, requiring the registration of securities with the Federal Trade Commission."], ["1933-05-27T00:00:00", "The Century of Progress World's Fair opens in Chicago."], ["1933-05-27T00:00:00", "Walt Disney's classic Silly Symphony cartoon The Three Little Pigs is first released by United Artists."], ["1933-06-05T00:00:00", "The U.S. Congress abrogates the United States' use of the gold standard by enacting a joint resolution nullifying the right of creditors to demand payment in gold."], ["1933-06-06T00:00:00", "The first drive-in movie theater opens in Pennsauken Township, near Camden, New Jersey."], ["1933-06-12T00:00:00", "The London Economic Conference is held."], ["1933-06-17T00:00:00", "Union Station massacre: In Kansas City, Missouri, Pretty Boy Floyd kills an FBI agent, 3 local police, and the person they intended to rescue, captured bank robber Frank Nash."], ["1933-06-21T00:00:00", "All non-Nazi parties are forbidden in Germany."], ["1933-06-25T00:00:00", "Wilmersdorfer Tennishallen delegates convene in Berlin to protest against the persecution of Jehovah's Witnesses in Nazi Germany."], ["1933-06-26T00:00:00", "The American Totalisator Company unveils its first electronic pari-mutuel betting machine at the Arlington Park race track near Chicago."], ["1933-07-01T00:00:00", "The London Passenger Transport Board is founded."], ["1933-07-04T00:00:00", "Gandhi is sentenced to prison in India."], ["1933-07-06T00:00:00", "The first Major League Baseball All-Star Game is played at Comiskey Park in Chicago."], ["1933-07-08T00:00:00", "The first rugby union test match is played between the Wallabies of Australia and the Springboks of South Africa at Newlands in Cape Town."], ["1933-07-14T00:00:00", "In Nazi Germany: - Formation of new political parties is forbidden."], ["1933-07-14T00:00:00", "In Nazi Germany: - The Law for the Prevention of Hereditarily Diseased Offspring is enacted, allowing compulsory sterilization of citizens suffering from a list of alleged genetic disorders."], ["1933-07-15T00:00:00", "Signing of the Four-Power Pact by Britain, France, Germany and Italy."], ["1933-07-15T00:00:00", "International Left Opposition (ILO) is renamed International Communist League (ICL)."], ["1933-07-20T00:00:00", "Reichskonkordat: Vatican state secretary Eugenio Pacelli (later Pope Pius XII) signs an accord with Hitler."], ["1933-07-22T00:00:00", "Wiley Post becomes the first person to fly solo around the world, landing at Floyd Bennett Field in Brooklyn, New York, after traveling eastabout 15,596 mi (25,099 km) in 7 days 18 hours 45 minutes."], ["1933-07-22T00:00:00", "\"Machine Gun Kelly\" and Albert Bates kidnap Charles Urschel, an Oklahoma oilman, and demand $200,000 ransom."], ["1933-07-24T00:00:00", "Several members of the Barrow Gang are injured or captured during a running battle with local police near Dexter, Iowa."], ["1933-08-01T00:00:00", "The Blue Eagle emblem of the National Recovery Administration is displayed publicly for the first time."], ["1933-08-02T00:00:00", "Opening of the Stalin White Sea-Baltic Sea Canal, a 227 km navigable waterway constructed using forced labour in the Soviet Union connecting the White Sea with Lake Onega and the Baltic."], ["1933-08-07T00:00:00", "Simele massacre: More than 3,000 Assyrian Iraqis are killed by Iraq government troops."], ["1933-08-12T00:00:00", "Winston Churchill makes his first public speech warning of the dangers of German rearmament."], ["1933-08-14T00:00:00", "Loggers cause a forest fire in the Coast Range of Oregon, later known as the first forest fire of the Tillamook Burn. It is extinguished on September 5, after destroying 240,000 acres (970 km2)."], ["1933-08-25T00:00:00", "The Diexi earthquake shakes Mao County, Sichuan, China and kills 9,000 people."], ["1933-08-30T00:00:00", "German Jewish philosopher Theodor Lessing is assassinated in Marienbad (Mariánské Lázně), Czechoslovakia, dying the following day."], ["1933-09-03T00:00:00", "Alejandro Lerroux forms a new government in Spain."], ["1933-09-12T00:00:00", "Leó Szilárd, waiting for a red light on Southampton Row in Bloomsbury, conceives the idea of the nuclear chain reaction."], ["1933-09-26T00:00:00", "A tornado destroys the town of Tampico, Mexico."], ["1933-10-01T00:00:00", "A failed assassination attempt against Engelbert Dollfuss, leader of the Fatherland's Front in Austria, seriously injures him."], ["1933-10-07T00:00:00", "Air France is formed by the merger of five French airline companies, beginning operations with 250 planes."], ["1933-10-10T00:00:00", "1933 United Airlines Boeing 247 mid-air explosion: A bomb destroys a United Airlines Boeing 247 on a transcontinental flight in mid-air near Chesterton, Indiana, killing all 7 on board, in the first proven case of sabotage in civil aviation, although no suspect is ever identified."], ["1933-10-12T00:00:00", "The United States Army Disciplinary Barracks on Alcatraz is acquired by the United States Department of Justice, which plans to incorporate the island into its Federal Bureau of Prisons as a federal penitentiary."], ["1933-10-13T00:00:00", "The British Interplanetary Society is founded."], ["1933-10-14T00:00:00", "Germany announces its withdrawal from the League of Nations and the World Disarmament Conference, after the U.S., the U.K. and France deny its request to increase its defense armaments under the Versailles Treaty."], ["1933-10-17T00:00:00", "Scientist Albert Einstein arrives in the United States where he settles permanently as a refugee from Nazi Germany and takes up a position at the Institute for Advanced Study, Princeton, New Jersey."], ["1933-11-05T00:00:00", "Spanish Basque people vote for autonomy."], ["1933-11-08T00:00:00", "New Deal: U.S. President Franklin D. Roosevelt unveils the Civil Works Administration, an organization designed to create jobs for more than 4 million of the unemployed."], ["1933-11-11T00:00:00", "Dust Bowl: In South Dakota, a very strong dust storm, (\"the great black blizzard\"), strips topsoil from desiccated farmlands (one of a series of disastrous dust storms that year)."], ["1933-11-16T00:00:00", "The United States and the Soviet Union establish formal diplomatic relations."], ["1933-11-17T00:00:00", "The Marx Brothers' anarchic comedy film Duck Soup is released in the U.S."], ["1933-11-19T00:00:00", "Second Spanish Republic: General elections result in victory by the right-wing parties."], ["1933-11-22T00:00:00", "The Fujian People's Government is declared in Fujian Province, China."], ["1933-12-05T00:00:00", "The 21st Amendment to the United States Constitution is passed, repealing Prohibition."], ["1933-12-15T00:00:00", "The US 21st Amendment officially goes into effect, alcohol becomes legal in the US."], ["1933-12-21T00:00:00", "Newfoundland returns to Crown colony status following financial collapse."], ["1933-12-21T00:00:00", "The British Plastics Federation (the oldest in the world) is founded."], ["1933-12-24T00:00:00", "A train crash in Lagny, France kills over 200."], ["1933-12-26T00:00:00", "The Nissan Motor Company is organized in Tokyo, Japan."], ["1933-12-26T00:00:00", "FM radio is patented."], ["1933-12-29T00:00:00", "Members of the Iron Guard assassinate Ion Gheorghe Duca, prime minister of Romania."]]