[["1983-01-01T00:00:00", "The migration of the ARPANET to TCP/IP is officially completed (this is considered to be the beginning of the true Internet)."], ["1983-01-03T00:00:00", "Kīlauea begins slowly erupting on the Big Island of Hawaii and is still flowing as of 2015."], ["1983-01-10T00:00:00", "Canada, the United Kingdom and the United States launch Fraggle Rock, a worldwide program advocating peace."], ["1983-01-19T00:00:00", "High-ranking Nazi war criminal Klaus Barbie is arrested in Bolivia."], ["1983-01-24T00:00:00", "Twenty-five members of the Red Brigades are sentenced to life imprisonment for the 1978 murder of Aldo Moro."], ["1983-01-25T00:00:00", "IRAS is launched from Vandenberg AFB, to conduct the world's first all-sky infrared survey from space."], ["1983-01-26T00:00:00", "Lotus 1-2-3 is released for IBM PC compatible computers."], ["1983-01-31T00:00:00", "Seatbelt use for drivers and front seat passengers becomes mandatory in the United Kingdom."], ["1983-02-02T00:00:00", "Giovanni Vigliotto goes on trial for multiple counts of bigamy involving 105 women."], ["1983-02-03T00:00:00", "Australian Prime Minister Malcolm Fraser is granted a double dissolution of both houses of parliament, for elections the next day."], ["1983-02-03T00:00:00", "Bob Hawke replaces Bill Hayden as leader of the Australian Labor Party."], ["1983-02-06T00:00:00", "Klaus Barbie is officially charged with war crimes."], ["1983-02-12T00:00:00", "100 women protest in Lahore, Pakistan, against military dictator Zia-ul-Haq's proposed Law of Evidence. The women were tear-gassed, baton-charged and thrown into lock-up. The women were successful in repealing the law."], ["1983-02-13T00:00:00", "A cinema fire in Turin, Italy, kills 64 people."], ["1983-02-16T00:00:00", "The Ash Wednesday bushfires in Victoria and South Australia claim the lives of 75 people, in one of Australia's worst bushfire disasters."], ["1983-02-18T00:00:00", "The Venezuelan bolívar is devaluated and exchange controls are established in an event now referred to as Black Friday by many Venezuelans (the Bolívar had been the most stable and internationally accepted currency)."], ["1983-02-18T00:00:00", "Nellie massacre: Over 2,000 people, mostly Bangladeshi Muslims, are massacred in Assam, India, during the Assam agitation."], ["1983-02-18T00:00:00", "Wah Mee massacre: 13 people are killed in an attempted robbery in Seattle, Washington."], ["1983-02-23T00:00:00", "The United States Environmental Protection Agency announces its intention to buy out and evacuate the dioxin-contaminated community of Times Beach, Missouri."], ["1983-02-23T00:00:00", "The automatic shut-down fails at Salem Nuclear Power Plant, New Jersey, USA."], ["1983-02-24T00:00:00", "A special commission of the Congress of the United States releases a report critical of the practice of Japanese internment during World War II."], ["1983-02-24T00:00:00", "Bermondsey by-election, 1983 (U.K.): Simon Hughes's defeat of Peter Tatchell is criticised for alleged homophobia."], ["1983-02-28T00:00:00", "The final episode of M*A*S*H is aired and the record of most watched episode is broken."], ["1983-03-01T00:00:00", "The Balearic Islands and Madrid become Autonomous communities of Spain."], ["1983-03-05T00:00:00", "Bob Hawke is elected Prime Minister of Australia."], ["1983-03-08T00:00:00", "IBM releases the IBM PC XT."], ["1983-03-09T00:00:00", "Anne Burford resigns as head of the United States Environmental Protection Agency amid scandal."], ["1983-03-11T00:00:00", "Australia's First Hawke Ministry is sworn in; Andrew Peacock becomes Federal Opposition leader."], ["1983-03-16T00:00:00", "The Ismaning radio transmitter (last wooden radio tower in Germany) is demolished."], ["1983-03-23T00:00:00", "Strategic Defense Initiative: U.S. President Ronald Reagan makes his initial proposal to develop technology to intercept enemy missiles. The media dub this plan \"Star Wars\"."], ["1983-03-25T00:00:00", "Motown celebrates its 25th anniversary with the television special Motown 25, during which Michael Jackson performs \"Billie Jean\" and introduces the moonwalk."], ["1983-04-04T00:00:00", "First flight of the Space Shuttle Challenger."], ["1983-04-13T00:00:00", "California's largest retailer Target Corporation expands into California, opening 11 stores."], ["1983-04-15T00:00:00", "Tokyo Disneyland opens."], ["1983-04-18T00:00:00", "The 1983 United States embassy bombing in Beirut kills 63 people."], ["1983-04-18T00:00:00", "Channel broadcasting is founded by Disney (the Disney Channel)."], ["1983-04-22T00:00:00", "A reactor shut-down due to failure of fuel rods occurs at Kursk Nuclear Power Plant, Russia."], ["1983-04-25T00:00:00", "Manchester, Maine, US, schoolgirl Samantha Smith is invited to visit the Soviet Union by its leader Yuri Andropov, after he read her letter in which she expressed fears about nuclear war."], ["1983-05-06T00:00:00", "Stern magazine publishes the \"Hitler Diaries\" (which are later found to be forgeries)."], ["1983-05-11T00:00:00", "Aberdeen F.C. beat Real Madrid 2-1 (after extra time) to win the European Cup Winners' Cup in 1983 and become only the third Scottish side to win a European trophy."], ["1983-05-14T00:00:00", "Dundee United F.C. are crowned Champions of Scotland for the first time in their history by winning the Scottish Premier League, on the final day of the league season at the home of their city rivals Dundee F.C. at Dens Park."], ["1983-05-16T00:00:00", "NSW Premier Neville Wran steps down, in response to allegations raised by the ABC program Four Corners, that he attempted to influence the NSW Magistracy."], ["1983-05-17T00:00:00", "Lebanon, Israel, and the United States sign an agreement on Israeli withdrawal from Lebanon."], ["1983-05-25T00:00:00", "Return of the Jedi opens in theatres."], ["1983-05-26T00:00:00", "A powerful earthquake and tsunami in northern Honshū, Japan kills 104 and injures 163."], ["1983-05-27T00:00:00", "Benton fireworks disaster, an explosion at an unlicensed fireworks operation near Benton, Tennessee kills eleven, injures one, and causes damage within a radius of five miles."], ["1983-05-28T00:00:00", "The 9th G7 summit begins at Williamsburg, Virginia."], ["1983-05-29T00:00:00", "Tom Sneva wins the Indianapolis 500"], ["1983-05-31T00:00:00", "The Philadelphia 76ers defeat the LA Lakers for the NBA championship."], ["1983-06-09T00:00:00", "Britain's Conservative government, led by Margaret Thatcher, is re-elected by a landslide majority."], ["1983-06-13T00:00:00", "Pioneer 10 passes the orbit of Neptune, becoming the first man-made object to leave the vicinity of the major planets of the Solar System."], ["1983-06-16T00:00:00", "Cork Graham is caught off the Vietnamese island of Phú Quốc looking for treasure buried by Captain Kidd. He is convicted and imprisoned until 1984 for illegal entry."], ["1983-06-18T00:00:00", "Sally Ride becomes the first American woman in space aboard Space Shuttle Challenger on the STS-7 mission."], ["1983-06-18T00:00:00", "Iranian teenager Mona Mahmudnizhad and nine other women are hanged because of their membership of the Bahá'í Faith."], ["1983-06-25T00:00:00", "India wins the Cricket World Cup by defeating the West Indies by 43 runs."], ["1983-06-30T00:00:00", "A total loss of coolant occurs at the Embalse Nuclear Power Station, Argentina. It is classified as an \"Accident With Local Consequences\" - level 4 on the International Nuclear Event Scale."], ["1983-07-01T00:00:00", "A North Korean Ilyushin Il-62M jet, en route to Conakry Airport in Guinea, crashes into the Fouta Djall Mountains in Guinea-Bissau, killing all 23 people on board."], ["1983-07-01T00:00:00", "The High Court of Australia blocks construction of the Franklin Dam in Tasmania."], ["1983-07-01T00:00:00", "A technical failure causes the release of iodine-131 from the Philippsburg Nuclear Power Plant, Germany."], ["1983-07-15T00:00:00", "Nintendo's Family Computer, also known as the Famicom, goes on sale in Japan."], ["1983-07-15T00:00:00", "The Orly Airport attack in Paris leaves 8 dead and 55 injured."], ["1983-07-16T00:00:00", "Sikorsky S-61 disaster: A helicopter crashes off the Isles of Scilly, causing 20 fatalities."], ["1983-07-20T00:00:00", "The government of Poland announces the end of martial law and amnesty for political prisoners."], ["1983-07-21T00:00:00", "The lowest temperature on Earth is recorded in Vostok Station, Antarctica with −89.2 °C (−128.6 °F)."], ["1983-07-22T00:00:00", "Australian Dick Smith completes his solo circumnavigation in a helicopter."], ["1983-07-23T00:00:00", "Gimli Glider: Out of fuel, Air Canada Flight 143 glides in to land in Gimli, Manitoba."], ["1983-07-23T00:00:00", "13 Sri Lanka Army soldiers are killed after a deadly ambush by the militant Liberation Tigers of Tamil Eelam, starting the Sri Lankan Civil War which continues until 2009."], ["1983-07-23T00:00:00", "Heavy massive rain and mudslides at western Shimane Prefecture, Japan, kill 117."], ["1983-07-24T00:00:00", "The Black July anti-Tamil riots begin in Sri Lanka, killing between 400 and 3,000. Black July is generally regarded as the beginning of the Sri Lankan Civil War."], ["1983-07-28T00:00:00", "New South Wales premier Neville Wran is exonerated by the Street Royal Commission, over claims raised by the ABC (Australian Broadcasting Corporation) programme Four Corners, that he attempted to influence the NSW magistracy."], ["1983-08-01T00:00:00", "America West Airlines begins operations out of Phoenix, Arizona and Las Vegas, Nevada."], ["1983-08-04T00:00:00", "Thomas Sankara becomes President of Upper Volta."], ["1983-08-16T00:00:00", "The Bill first airs as Woodentop."], ["1983-08-18T00:00:00", "Hurricane Alicia hits the Texas coast, killing 22 and causing over US$3.8 billion (2005 dollars) in damage."], ["1983-08-18T00:00:00", "Five people are killed and 18 others injured when a road train is deliberately driven into a motel at Ayers Rock, NT (the driver, Douglas Edward Crabbe, is convicted in March 1984)."], ["1983-08-21T00:00:00", "Benigno Aquino, Jr., Philippines opposition leader, is assassinated in Manila just as he returns from exile."], ["1983-08-24T00:00:00", "The Old Philadelphia Arena is destroyed by arson."], ["1983-08-26T00:00:00", "Heavy rain triggers flooding at Bilbao, Spain, and surrounding areas, killing 45 people and causing millions in damages."], ["1983-08-30T00:00:00", "Guion Bluford becomes the first African-American in space aboard Space Shuttle Challenger on the STS-8 mission."], ["1983-09-01T00:00:00", "Cold War: Korean Air Lines Flight 007 is shot down by Soviet Union Air Force Su-15 Flagon pilot Major Gennadi Osipovich near Moneron Island when the commercial aircraft enters Soviet airspace. All 269 on board are killed including U.S. Congressman Larry McDonald."], ["1983-09-04T00:00:00", "Six men walk underwater across Sydney Harbour - 82.9 km in 48 hours."], ["1983-09-06T00:00:00", "The Soviet Union admits to shooting down Korean Air Lines Flight 007, stating that the pilots did not know it was a civilian aircraft when it violated Soviet airspace."], ["1983-09-06T00:00:00", "Children's TV show Rocky Hollow released in the U.K"], ["1983-09-09T00:00:00", "Iraqi club Al-Shorta wins the 1983 President's Gold Cup by defeating Malaysia 2-0 in the final."], ["1983-09-16T00:00:00", "Ronald Reagan announces that the Global Positioning System (GPS) will be made available for civilian use."], ["1983-09-17T00:00:00", "Vanessa L. Williams becomes the first African American to be crowned Miss America, in Atlantic City, New Jersey."], ["1983-09-18T00:00:00", "U.S. heavy metal band Kiss officially appears in public without makeup for the first time on MTV."], ["1983-09-19T00:00:00", "Saint Kitts and Nevis becomes an independent state."], ["1983-09-19T00:00:00", "Wheel of Fortune begins its syndicated version, which still churns out new episodes to this very day."], ["1983-09-23T00:00:00", "Gulf Air Flight 771 crashes in the United Arab Emirates after a bomb explodes in the baggage compartment, killing 117."], ["1983-09-23T00:00:00", "Violence erupts in New Caledonia between native Kanaks and French expatriates. The French government withdraws the promise of independence."], ["1983-09-24T00:00:00", "U.S. rock group the Red Hot Chili Peppers launch their first self-titled album."], ["1983-09-25T00:00:00", "Maze Prison escape: 38 Provisional Irish Republican Army prisoners, armed with 6 handguns, hijack a prison lorry and smash their way out of HM Prison Maze in Northern Ireland, in the largest prison escape since World War II and in British history."], ["1983-09-26T00:00:00", "1983 Soviet nuclear false alarm incident: Soviet military officer Stanislav Petrov averts a worldwide nuclear war by correctly identifying a warning of attack by U.S. missiles as a false alarm."], ["1983-09-26T00:00:00", "The Soyuz T-10-1 mission ends in a pad abort at the Baikonur Cosmodrome, when a pad fire occurs at the base of the Soyuz U rocket during the launch countdown. The escape tower system, attached to the top of the capsule containing the crew and Soyuz spacecraft, fires immediately, pulling the crew safe from the vehicle a few seconds before the rocket explodes, destroying the launch complex."], ["1983-09-26T00:00:00", "The Australian yacht Australia II wins the America's Cup, the first successful challenge to the New York Yacht Club's 132-year defence of the sailing trophy."], ["1983-09-27T00:00:00", "The GNU Project is announced publicly on the net.unix-wizards and net.usoft newsgroups."], ["1983-10-02T00:00:00", "Neil Kinnock is elected leader of the British Labour Party."], ["1983-10-04T00:00:00", "British entrepreneur Richard Noble sets a new land speed record of 633.468 mph (1,019.468 km/h), driving Thrust2 at the Black Rock Desert, Nevada."], ["1983-10-07T00:00:00", "A plan to abolish the Greater London Council is announced."], ["1983-10-09T00:00:00", "The Rangoon bombing kills South Korea's Foreign Minister, Lee Bum Suk, and 21 others."], ["1983-10-12T00:00:00", "Japan's former Prime Minister Kakuei Tanaka is found guilty of taking a $2 million bribe from Lockheed, and sentenced to 4 years in jail."], ["1983-10-19T00:00:00", "Maurice Bishop, Prime Minister of Grenada, and 40 others are assassinated in a military coup."], ["1983-10-21T00:00:00", "At the 17th General Conference on Weights and Measures, the metre is defined in terms of the speed of light as the distance light travels in a vacuum in 1/299,792,458 of a second."], ["1983-10-22T00:00:00", "In Bonn, West Germany, people demonstrate for nuclear disarmament."], ["1983-10-23T00:00:00", "Beirut barracks bombing: Simultaneous suicide truck-bombings destroy both the French Army and United States Marine Corps barracks in Beirut, killing 241 U.S. servicemen, 58 French paratroopers and 6 Lebanese civilians."], ["1983-10-25T00:00:00", "Invasion of Grenada by United States troops at the behest of Eugenia Charles of Dominica, a member of the Organization of American States."], ["1983-10-30T00:00:00", "Argentine general election: The first democratic elections in Argentina after 7 years of military rule are held."], ["1983-11-02T00:00:00", "Martin Luther King, Jr. Day: At the White House Rose Garden, U.S. President Ronald Reagan signs a bill creating a federal holiday on the third Monday of every January to honor American civil rights leader Martin Luther King Jr. It is first observed in 1986."], ["1983-11-02T00:00:00", "Able Archer 83: Many Soviet officials misinterpret this NATO exercise as a nuclear first strike, causing the last nuclear scare of the Cold War."], ["1983-11-02T00:00:00", "South Africa approves a new constitution granting limited political rights to Coloureds and Asians as part of a series of reforms to apartheid."], ["1983-11-02T00:00:00", "Chrysler introduces the Dodge Caravan, the first \"minivan\"."], ["1983-11-03T00:00:00", "The Reverend Jesse Jackson announces his candidacy for the 1984 United States' Democratic Party presidential nomination."], ["1983-11-05T00:00:00", "Byford Dolphin rig diving bell accident: Off the coast of Norway, 5 divers are killed and one severely wounded in an explosive decompression accident."], ["1983-11-10T00:00:00", "The anticancer drug etoposide is approved by the FDA, leading to a curative treatment regime in the field of combination chemotherapy of testicular carcinoma."], ["1983-11-11T00:00:00", "Ronald Reagan becomes the first U.S. President to address the National Diet, Japan's national legislature."], ["1983-11-13T00:00:00", "The first United States cruise missiles arrive at RAF Greenham Common in England amid protests from peace campaigners."], ["1983-11-14T00:00:00", "The immunosuppressant cyclosporine is approved by the FDA, leading to a revolution in the field of transplantation."], ["1983-11-14T00:00:00", "Ecuador recognizes the Sahrawi Arab Democratic Republic (SADR)."], ["1983-11-15T00:00:00", "The Turkish part of Cyprus declares independence."], ["1983-11-16T00:00:00", "A jury in Gretna, Louisiana, US acquits Ginny Foat of the murder of Argentine businessman Moses Chaiyo."], ["1983-11-17T00:00:00", "The Zapatista Army of National Liberation is founded in Mexico."], ["1983-11-19T00:00:00", "An attempted hijacking of Aeroflot Flight 6833 in Soviet Georgia results in several dead and wounded."], ["1983-11-20T00:00:00", "The Day After broadcasts on ABC. It is seen by more than 100 million people."], ["1983-11-24T00:00:00", "Lynda Mann, 15, is found raped and strangled in the village of Narborough, England (Colin Pitchfork is sentenced to life imprisonment in 1988)."], ["1983-11-26T00:00:00", "Brink's-MAT robbery: In London, 6,800 gold bars worth nearly UK£26 million are taken from the Brink's-MAT vault at Heathrow Airport. Only a fraction of the gold is ever recovered, and only 2 men are convicted of the crime."], ["1983-11-27T00:00:00", "Colombian Avianca Flight 11 crashes near Barajas Airport in Madrid, Spain, killing 181 of the 192 on board."], ["1983-12-04T00:00:00", "United States Navy aviator Lt's. Mark Lange and Bobby Goodman are shot down in an A-6 Intruder over Lebanon and captured by Syrians; Lt. Lange dies of his injuries; Lt. Goodman is released 30 days later after the intervention of the Reverend Jesse Jackson."], ["1983-12-04T00:00:00", "General elections are celebrated in Venezuela in which the opposition party, Democratic Action, wins a majority in both chambers of the Venezuelan Congress and the presidency for the 1984-1989 period under Jaime Lusinchi. Voter turn out is 87.3% and Lusinchi obtains 58.4% of the votes."], ["1983-12-04T00:00:00", "Solar eclipse of December 4, 1983."], ["1983-12-05T00:00:00", "ICIMOD is established and inaugurated with its headquarters in Kathmandu, Nepal, and legitimised through an Act of Parliament in Nepal this same year."], ["1983-12-07T00:00:00", "Two Spanish passenger planes collide on the foggy runway at a Madrid airport, killing 90."], ["1983-12-09T00:00:00", "The Australian dollar is floated, by Federal treasurer Paul Keating. Under the old flexible peg system, the Reserve Bank bought and sold all Australian dollars and cleared the market at the end of the day. This initiative is taken by the government of Bob Hawke."], ["1983-12-10T00:00:00", "Military rule ends and democracy is restored in Argentina, with the beginning of Raúl Alfonsín's first term as President of Argentina"], ["1983-12-13T00:00:00", "Turgut Özal, of ANAP forms the new government of Turkey (45th government); beginning of a new civilian regime"], ["1983-12-17T00:00:00", "A discotheque fire in Madrid, Spain, kills 83 people."], ["1983-12-17T00:00:00", "A Provisional IRA car bomb kills 6 Christmas shoppers and injures 90 outside Harrods in London."], ["1983-12-19T00:00:00", "The Jules Rimet Trophy is stolen from the Brazilian Soccer Confideration building in Rio de Janeiro."], ["1983-12-27T00:00:00", "A propane explosion in Buffalo, New York, US kills 5 firefighters and 2 civilians."], ["1983-12-27T00:00:00", "Pope John Paul II visits Rebibbia prison to forgive his would-be assassin Mehmet Ali Ağca."], ["1983-12-29T00:00:00", "The Reverend Jesse Jackson travels to Syria to secure the release of U.S. Navy Lieutenant Robert Goodman, who has been in Syrian captivity since being shot down over Lebanon during a bombing mission."], ["1983-12-31T00:00:00", "Brunei gains independence from the United Kingdom."], ["1983-12-31T00:00:00", "Two bombs explode in France; one on the Paris train kills 3 and injures 19. The other at Marseille station kills 2 and injures 34."]]