[["1911-01-03T00:00:00", "1911 Kebin earthquake: An earthquake of 7.7 moment magnitude strikes near Almaty in Russian Turkestan, killing 450 or more people."], ["1911-01-05T00:00:00", "Kappa Alpha Psi Fraternity was founded at Indiana University in Bloomington, Indiana"], ["1911-01-18T00:00:00", "Eugene B. Ely lands on the deck of the USS Pennsylvania stationed in San Francisco harbor, marking the first time an aircraft lands on a ship."], ["1911-01-26T00:00:00", "The United States and Canada announced the successful negotiation of their first reciprocal trade agreement."], ["1911-02-05T00:00:00", "The Missouri State Capitol building in Jefferson City, Missouri is entirely destroyed by fire after a bolt of lightning strikes the dome."], ["1911-02-05T00:00:00", "The revolution in Haiti was suppressed after the leader, General Montreuil Guillaume, was captured by government troops and shot. General Millionard was executed two days later."], ["1911-02-11T00:00:00", "The Lincoln Memorial Commission is established to find an ideal site for the proposed Lincoln Memorial."], ["1911-02-13T00:00:00", "HNK Hajduk Split, a Croatian football club is founded."], ["1911-02-17T00:00:00", "The first \"quasi-official\" airmail flight occurs when Fred Wiseman carries three letters between Petaluma and Santa Rosa, California."], ["1911-02-18T00:00:00", "The first official air mail flight, second overall, takes place from Allahabad, India to Naini, India, when Henri Pequet carries 6,500 letters a distance of 13 km."], ["1911-03-18T00:00:00", "International Women's Day is celebrated for the first time."], ["1911-03-25T00:00:00", "The Triangle Shirtwaist Factory fire in New York City kills 146."], ["1911-03-29T00:00:00", "The United States Army adopts a new service pistol, the M1911 designed by John Browning. It remains the US service pistol for 74 years."], ["1911-04-03T00:00:00", "Jean Sibelius leads his Fourth Symphony premiere in Helsinki"], ["1911-04-08T00:00:00", "Heike Kamerlingh Onnes discovers Superconductivity. He presented his findings on April 28, 1911."], ["1911-04-13T00:00:00", "Mexican Revolution: Rebels take Agua Prieta on the Sonora-Arizona border; government troops take the town back April 17 when the rebel leader \"Red\" López is drunk."], ["1911-04-19T00:00:00", "Mexican Revolution: Francisco I. Madero's troops besiege Ciudad Juárez but General Juan J. Navarro refuses his surrender demand."], ["1911-04-26T00:00:00", "HŠK Građanski Zagreb (today GNK Dinamo), a Croatian football club is founded in Zagreb."], ["1911-04-27T00:00:00", "Huanghuagang Uprising takes place in China. This was an insurrection where rebels in China took five Chinese villages in an attempt to create a power base to fight Imperial rule. Those who died are remembered as \"The 72 Martyrs.\" It is also called the Second Guangzhou Uprising and the Yellow Flower Mound Revolt."], ["1911-05-08T00:00:00", "Mexican Revolution: Pancho Villa launches an attack against government troops in Ciudad Juárez without Madero's permission; the government troops surrender on May 10."], ["1911-05-17T00:00:00", "Mexican Revolution: Porfirio Díaz is convinced to resign but does not do so yet."], ["1911-05-21T00:00:00", "Mexican Revolution: A peace treaty is signed between Madero' rebels and government troops in Ciudad Juárez."], ["1911-05-24T00:00:00", "Mexican Revolution: Government troops fire at anti-Diaz demonstrators in Mexico City, killing about 200 (officials claim only 40)."], ["1911-05-25T00:00:00", "Mexican Revolution: Porfirio Díaz signs his resignation and leaves for Veracruz; on May 31 he leaves for exile in France."], ["1911-05-30T00:00:00", "The very first Indianapolis 500 is held, won by Ray Harroun at an average speed of 74.59 miles per hour."], ["1911-05-31T00:00:00", "The hull of the RMS Titanic is launched in Belfast."], ["1911-06-07T00:00:00", "Mexican Revolution: Francisco Madero arrives in Mexico City just after a local earthquake."], ["1911-06-22T00:00:00", "George V is crowned King of the United Kingdom and the British Dominions."], ["1911-07-01T00:00:00", "The presence of the German warship Panther in the Moroccan port of Agadir triggers the Agadir Crisis."], ["1911-07-24T00:00:00", "Hiram Bingham rediscovers Machu Picchu in Peru."], ["1911-08-21T00:00:00", "Leonardo da Vinci's Mona Lisa is stolen from the Louvre museum in Paris by Vincenzo Peruggia; the theft is discovered the following day."], ["1911-09-25T00:00:00", "The French Navy ship Liberté explodes at anchor in Toulon, France, killing around 300 on both ship and the neighbouring area."], ["1911-09-29T00:00:00", "Italy declares war on Ottoman Empire."], ["1911-10-07T00:00:00", "The liberal leader Karl Staaff returns as Prime Minister of Sweden, after an Riksdag election victory based on the promises of defence cuts and social reforms."], ["1911-10-10T00:00:00", "The Wuchang Uprising starts the Xinhai Revolution that leads to the founding of the Republic of China."], ["1911-10-16T00:00:00", "Mexican Revolution: Felix Diaz, nephew of Porfirio Díaz, occupies the port of Veracruz as a sign of rebellion against Madero."], ["1911-11-01T00:00:00", "World's first combat aerial bombing mission takes place in Libya during the Italo-Turkish War. Second Lieutenant Giulio Gavotti of Italy drops several small bombs."], ["1911-11-04T00:00:00", "Treaty of Berlin brings the Agadir Crisis to a close. This treaty led Morocco to be split between France (as a protectorate) and Spain (as the colony of Spanish Sahara) with Germany forfeiting all claims to Morocco. In return, France gave Germany a portion of the French Congo (as Kamerun) and Germany ceded some of German Kamerun to France (as Chad)."], ["1911-11-05T00:00:00", "Italy annexes Tripoli and Cyrenaica (this act is confirmed by an act of the Italian Parliament on February 25, 1912)."], ["1911-12-14T00:00:00", "Roald Amundsen's expedition reaches the South Pole."], ["1911-12-18T00:00:00", "Opening of first exhibition by Der Blaue Reiter group of painters, in Munich."], ["1911-12-29T00:00:00", "Sun Yat-sen is elected the Provisional President of the Republic of China."]]