[["1955-01-02T00:00:00", "José Antonio Remón Cantera, president of Panama, is assassinated at a race track in Panama City."], ["1955-01-03T00:00:00", "José Ramón Guizado becomes president of Panama."], ["1955-01-07T00:00:00", "Marian Anderson is the first African-American singer to perform at the Metropolitan Opera in New York City."], ["1955-01-17T00:00:00", "USS Nautilus, the first nuclear-powered submarine, puts to sea for the first time, from Groton, Connecticut."], ["1955-01-19T00:00:00", "The game Scrabble debuts in Australia."], ["1955-01-22T00:00:00", "The Pentagon announces a plan to develop ICBMs (intercontinental ballistic missiles) armed with nuclear weapons."], ["1955-01-23T00:00:00", "Sutton Coldfield rail crash kills 17 near Birmingham, England."], ["1955-01-25T00:00:00", "Presidium of the Supreme Soviet of the Soviet Union announces the end of the war between the USSR and Germany, which began during World War II in 1941."], ["1955-01-28T00:00:00", "United States Congress authorizes President Dwight D. Eisenhower to use force to protect Formosa from the People's Republic of China."], ["1955-02-04T00:00:00", "Pact of Mutual Cooperation \"Baghdad Pact\" signed."], ["1955-02-10T00:00:00", "The United States Seventh Fleet helps the Republic of China evacuate Chinese Nationalist army and residents from the Tachen Islands to Taiwan."], ["1955-02-12T00:00:00", "U.S. President Dwight D. Eisenhower sends the first U.S. advisors to South Vietnam."], ["1955-02-16T00:00:00", "Nearly 100 die in a fire at a home for the elderly in Yokohama, Japan."], ["1955-02-19T00:00:00", "Southeast Asia Treaty Organization established."], ["1955-02-22T00:00:00", "In Chicago's Democratic primary, Mayor Martin H. Kennelly loses to the head of the Cook County Democratic Party, Richard J. Daley, 364,839 to 264,77."], ["1955-03-02T00:00:00", "Claudette Colvin (a fifteen-year-old African-American girl) refuses to give up her seat on a bus in Montgomery, Alabama, to a white woman after the driver demands it. She is carried off the bus backwards while being kicked and handcuffed and harassed on the way to the police station."], ["1955-03-05T00:00:00", "WBBJ-TV signs on the air in the Jackson, Tennessee, with WDXI as its initial call-letters, to expanded American commercial television in mostly-rural areas."], ["1955-03-05T00:00:00", "Elvis Presley makes his television debut on \"Louisiana Hayride\" carried by KSLA-TV Shreveport (although audio recordings exists, there is no known video footage of this appearance)."], ["1955-03-07T00:00:00", "The Broadway musical version of Peter Pan, which had opened in 1954 starring Mary Martin, is presented on television for the first time by NBC-TV with its original cast, as an installment of Producers' Showcase. It is also the first time that a stage musical is presented in its entirety on TV almost exactly as it was performed on stage. This program gains the largest viewership of a TV special up to this time, and it becomes one of the first great TV family musical classics."], ["1955-03-17T00:00:00", "Richard Riot in Montreal: 6,000 people protest the suspension of French Canadian ice hockey star Maurice Richard of the Montreal Canadiens by the National Hockey League following a violent incident during a match."], ["1955-03-19T00:00:00", "KXTV signs on the air in Sacramento, California."], ["1955-03-20T00:00:00", "The movie adaptation of Evan Hunter's novel Blackboard Jungle premieres in the United States, featuring the famous single \"Rock Around the Clock\" by Bill Haley & His Comets. Teenagers jump from their seats to dance to the song."], ["1955-04-01T00:00:00", "EOKA A starts a terrorist campaign against British rule in the Crown colony of Cyprus."], ["1955-04-05T00:00:00", "Winston Churchill resigns as Prime Minister of the United Kingdom due to ill-health at the age of 80."], ["1955-04-05T00:00:00", "Richard J. Daley defeats Robert Merrian to become Mayor of Chicago by a vote of 708,222 to 581,555."], ["1955-04-06T00:00:00", "Anthony Eden becomes Prime Minister of the United Kingdom."], ["1955-04-11T00:00:00", "The Taiwanese Kuomintang put a time-bomb on the airplane Kashmir Princess, killing 16 but failing to assassinate the People's Republic of China leader, Zhou Enlai."], ["1955-04-12T00:00:00", "The Salk polio vaccine, having passed large-scale trials earlier in the United States, receives full approval by the Food and Drug Administration."], ["1955-04-14T00:00:00", "The Detroit Red Wings win the Stanley Cup for the 7th time in franchise history, but will not win again until 1997."], ["1955-04-15T00:00:00", "Middle East Treaty Organization (MENTO)."], ["1955-04-15T00:00:00", "Ray Kroc opens his first McDonald's in Des Plaines, Illinois."], ["1955-04-16T00:00:00", "Burma-Japanese peace treaty, signed in Rangoon on November 5, 1954, comes into effect, formally ending a state of war between the two countries that has not existed for a long time."], ["1955-04-17T00:00:00", "Imre Nagy, the communist Premier of Hungary, is ousted for being too moderate."], ["1955-05-01T00:00:00", "Warsaw Treaty on Friendship, Cooperation and Mutual Assistance signed (Warsaw Treaty Organization) (effective June 6)."], ["1955-05-05T00:00:00", "West Germany becomes a sovereign country recognized by important Western foreign countries, such as France, the United Kingdom, Canada, and the United States."], ["1955-05-06T00:00:00", "WEU charter effective."], ["1955-05-09T00:00:00", "West Germany joins the North Atlantic Treaty Organization (NATO)."], ["1955-05-11T00:00:00", "Japanese National Railways' ferry Shiun Maru sinks after collision with sister ship Uko Maru in thick fog off Takamatsu, Shikoku, in the Seto Inland Sea of Japan; 166 passengers (many children) and two crew are killed. This event is influential in plans to construct the Akashi Kaikyō Bridge (built 1986-98)."], ["1955-05-14T00:00:00", "Eight Communist Bloc countries, including the Soviet Union, sign a mutual defence treaty in Warsaw, Poland, that is called the Warsaw Pact. It is later dissolved in 1991."], ["1955-05-15T00:00:00", "Austrian State Treaty, which restores Austria's national sovereignty, is concluded between the four occupying powers following World War II (the United Kingdom, the United States, the Soviet Union, and France) and Austria, setting it up as a neutral country."], ["1955-05-25T00:00:00", "Joe Brown and George Band are the first to attain the summit of Kangchenjunga in the Himalayas, as part of a British team led by Charles Evans."], ["1955-06-07T00:00:00", "The television quiz program The $64,000 Question premieres on CBS-TV in the United States, with Hal March as the host."], ["1955-06-11T00:00:00", "Le Mans disaster: Eighty-three people are killed and at least 100 are injured after two race cars collide in the 1955 24 Hours of Le Mans."], ["1955-06-13T00:00:00", "Mir mine, the first diamond mine in the Soviet Union, is discovered."], ["1955-06-16T00:00:00", "Lady and the Tramp, the Walt Disney company's 15th animated film, premieres in Chicago."], ["1955-07-07T00:00:00", "The New Zealand Special Air Service is formed."], ["1955-07-13T00:00:00", "Ruth Ellis (born 1926) is hanged for murder in London, becoming the last woman ever to be executed in the United Kingdom."], ["1955-07-17T00:00:00", "The American Broadcasting Company broadcasts a sneak preview of Disneyland in Anaheim, California."], ["1955-07-18T00:00:00", "Disneyland opens to the public in Anaheim, California."], ["1955-07-18T00:00:00", "The first nuclear-generated electrical power is sold commercially, partially powering the town of Arco, Idaho."], ["1955-07-18T00:00:00", "The Illinois Governor, William Stratton, signs the \"Loyalty Oath Act\", passed by the State Legislature, which mandates all public employees take a loyalty oath to Illinois and the United States, or lose their jobs."], ["1955-07-18T00:00:00", "The first Geneva Summit meeting between the United States, the Soviet Union, the United Kingdom, and France begins. It ends on July 23."], ["1955-07-27T00:00:00", "El Al Flight 402 from Vienna, Austria to Tel Aviv via Istanbul is shot down over Bulgaria. All 58 passengers and crewmen aboard the Lockheed Constellation airplane are killed."], ["1955-07-28T00:00:00", "The first Interlingua Congress in Tours, France, leading to foundation of the Union Mundial pro Interlingua."], ["1955-08-18T00:00:00", "The First Sudanese Civil War begins."], ["1955-08-19T00:00:00", "Hurricane Diane hits the northeastern United States, killing over 200 people, and causing over $1.0 billion in damage."], ["1955-08-20T00:00:00", "Hundreds of people are killed in anti-French rioting in Morocco and Algeria."], ["1955-08-22T00:00:00", "Eleven schoolchildren are killed when their school bus is hit by a freight train in Spring City, Tennessee."], ["1955-08-25T00:00:00", "The last Soviet Army occupation forces leave Austria."], ["1955-08-26T00:00:00", "Release in India of Satyajit Ray's film Pather Panchali."], ["1955-08-27T00:00:00", "First edition of the Guinness Book of Records is published, in London."], ["1955-09-02T00:00:00", "Under the guidance of Dr. Humphry Osmond, Christopher Mayhew ingests 400 mg of mescaline hydrochloride and allows himself to be filmed as part of a Panorama special for BBC TV that was never broadcast."], ["1955-09-06T00:00:00", "Istanbul pogrom: Istanbul's Greek minority is the target of a government-sponsored pogrom."], ["1955-09-10T00:00:00", "The long-running program Gunsmoke debuts on the CBS-TV network."], ["1955-09-14T00:00:00", "Pope Pius XII elevates many of the Apostolic vicariates in Africa to Metropolitan Archdioceses"], ["1955-09-15T00:00:00", "Vladimir Nabokov's controversial novel Lolita is published in Paris by Olympia Press."], ["1955-09-18T00:00:00", "The United Kingdom formally annexed the island of Rockall."], ["1955-09-19T00:00:00", "Hurricane Hilda kills about 200 people in Mexico."], ["1955-09-22T00:00:00", "Independent Commercial Television (ITV) begins broadcasting in the United Kingdom."], ["1955-09-24T00:00:00", "Dwight D. Eisenhower, President of the United States suffers a coronary thrombosis while on vacation in Denver, Colorado. Vice President Nixon serves as Acting President while Eisenhower recovers."], ["1955-09-30T00:00:00", "Actor James Dean is killed when his automobile collides with another car at a highway junction near Cholame, California. Dean is just 24 years old."], ["1955-10-02T00:00:00", "Alfred Hitchcock Presents debuts on the CBS TV network in the United States."], ["1955-10-03T00:00:00", "The Mickey Mouse Club debuts on the ABC-TV network in the United States."], ["1955-10-04T00:00:00", "The Reverend Sun Myung Moon is released from prison in Seoul, South Korea."], ["1955-10-05T00:00:00", "Disneyland Hotel opens to the public in Anaheim, California."], ["1955-10-11T00:00:00", "70-mm film for projection is introduced with the theatrical release of Rodgers and Hammerstein's musical film, Oklahoma!"], ["1955-10-14T00:00:00", "ODECA secretariat inaugurated."], ["1955-10-20T00:00:00", "The first footage of Elvis Presley is filmed as part of a film short about the Cleveland, Ohio, disc jockey Bill Randle."], ["1955-10-26T00:00:00", "After the last Allied troops have left the country and following the provisions of the Austrian Independence Treaty, Austria declares its permanent neutrality."], ["1955-10-26T00:00:00", "Ngô Đình Diệm proclaims Vietnam to be a republic with himself as its President (following the State of Vietnam referendum on October 23) and forms the Army of the Republic of Vietnam."], ["1955-10-27T00:00:00", "Rebel Without a Cause is released."], ["1955-10-29T00:00:00", "Soviet battleship Novorossiysk explodes at moorings in Sevastopol Bay, killing 608, the Soviet Union's worst naval disaster."], ["1955-11-01T00:00:00", "The Vietnam War begins between the South Vietnam Army and the North Vietnam Army in which the latter is allied with the Viet Cong."], ["1955-11-01T00:00:00", "A time bomb explodes in the cargo hold of United Airlines Flight 629, a Douglas DC-6B airliner flying above Longmont, Colorado, killing all 39 passengers and 5 crew members on board."], ["1955-11-03T00:00:00", "The Rimutaka Tunnel opens on the New Zealand Railways, at 5.46 mi (8.79 km) the longest in the Southern Hemisphere at this time."], ["1955-11-05T00:00:00", "Racial segregation is outlawed on trains and buses in interstate commerce in the United States."], ["1955-11-19T00:00:00", "C. Northcote Parkinson first propounds 'Parkinson's law', in The Economist."], ["1955-11-20T00:00:00", "Bo Diddley makes his television debut on Ed Sullivan's Toast Of The Town show for the CBS-TV network."], ["1955-11-23T00:00:00", "The Cocos Islands in the Indian Ocean are transferred from British to Australian control."], ["1955-11-26T00:00:00", "The British Governor of Cyprus declares a state of emergency on the island."], ["1955-12-01T00:00:00", "In Montgomery, Alabama, Rosa Parks refuses to obey bus driver James F. Blake's order that she give up her seat to make room for a white passenger and is arrested, leading to the Montgomery Bus Boycott."], ["1955-12-04T00:00:00", "The International Federation of Blood Donor Organizations was founded in Luxembourg."], ["1955-12-05T00:00:00", "The American Federation of Labor and the Congress of Industrial Organizations merge to become the AFL-CIO."], ["1955-12-05T00:00:00", "The Montgomery Improvement Association is formed in Montgomery, Alabama, by Dr. Martin Luther King, Jr., and other Black ministers to coordinate a Black people's boycott of all city buses."], ["1955-12-09T00:00:00", "Adnan Menderes of DP forms the new government of Turkey (22nd government)"], ["1955-12-14T00:00:00", "The Tappan Zee Bridge in New York opens to traffic."], ["1955-12-14T00:00:00", "Albania, Austria, Bulgaria, Cambodia, Finland, Hungary, Ireland, Italy, Jordan, Laos, Libya, Nepal, Portugal, Romania, Spain, and Sri Lanka join the United Nations simultaneously, after several years of moratorium on admitting new members that began during the Korean War."], ["1955-12-20T00:00:00", "Cardiff is declared by the British Government as the capital of Wales."], ["1955-12-22T00:00:00", "American cytogeneticist Joe Hin Tjio discovers the correct number of human chromosomes, forty-six."], ["1955-12-31T00:00:00", "General Motors becomes the first American corporation to make a profit of over one billion dollars in one year."]]