[["1971-01-02T00:00:00", "Ibrox disaster: A stairway crush at the Rangers vs. Celtic football match in Glasgow, Scotland kills 66."], ["1971-01-02T00:00:00", "A ban on radio and television cigarette advertisements goes into effect in the United States."], ["1971-01-25T00:00:00", "In Uganda, Idi Amin deposes Milton Obote in a coup, and becomes president."], ["1971-01-25T00:00:00", "In Los Angeles, Charles Manson and 3 female \"Family\" members are found guilty of the 1969 Tate–LaBianca murders."], ["1971-01-25T00:00:00", "Himachal Pradesh becomes the 18th Indian state."], ["1971-01-25T00:00:00", "Intelsat IV (F2) is launched; it enters commercial service over the Atlantic Ocean March 26."], ["1971-02-07T00:00:00", "An earthquake in the city of Tuscania, Italy kills 31."], ["1971-02-07T00:00:00", "Switzerland gives women voting rights in state elections, but not in all canton-specific ones."], ["1971-02-07T00:00:00", "Władysław Gomułka is expelled from the Central Council of the Polish Communist Party."], ["1971-02-09T00:00:00", "The Sylmar earthquake (6.4 on the Richter scale) hits the San Fernando Valley area of California."], ["1971-02-09T00:00:00", "Satchel Paige becomes the first Negro League player to become voted into the Baseball Hall of Fame from the Negro League (Jackie Robinson was inducted July 23, 1962.)"], ["1971-02-09T00:00:00", "Apollo program: Apollo 14 returns to Earth after the third manned Moon landing."], ["1971-02-15T00:00:00", "Decimal Day: – The United Kingdom and Ireland both switch to decimal currency (see also decimalisation)."], ["1971-02-15T00:00:00", "Protesting Belgian farmers bring 3 live cows to crash the EEC meeting in Brussels."], ["1971-02-20T00:00:00", "Fifty tornadoes rage in Mississippi, killing 74 people."], ["1971-02-20T00:00:00", "The U.S. Emergency Broadcast System sends an erroneous warning, meant to be a standard weekly test conducted by NORAD in Cheyenne Mountain in Colorado; many radio stations just ignore it. The most notorious warning was of WOWO (AM) in Fort Wayne, Indiana."], ["1971-03-01T00:00:00", "A bomb explodes in the men's room at the United States Capitol; the Weather Underground claims responsibility."], ["1971-03-01T00:00:00", "Pakistani President Agha Muhammad Yahya Khan indefinitely postpones the pending National Assembly session, precipitating massive civil disobedience in East Pakistan."], ["1971-03-01T00:00:00", "Canadian John Robarts ends his term of office as the 17th Premier of Ontario."], ["1971-03-07T00:00:00", "The British postal workers' strike, led by UPW General Secretary Tom Jackson, ends after 47 days."], ["1971-03-07T00:00:00", "Sheikh Mujibur Rahman, political leader of then East Pakistan (present day-Bangladesh), delivers his famous speech in the Racecourse Field in Dhaka, calling on the masses to be prepared to fight for national independence."], ["1971-03-08T00:00:00", "The Citizens' Commission to Investigate the FBI breaks into the Media, Pennsylvania offices of the Federal Bureau of Investigation and removes all the files."], ["1971-03-08T00:00:00", "'Fight of the Century': Boxer Joe Frazier defeats Muhammad Ali at Madison Square Garden."], ["1971-03-26T00:00:00", "East Pakistan (now Bangladesh) independence is declared by Ziaur Rahman on behalf of Sheikh Mujibur Rahman, from Kalurghat Radio Station in Chittagong."], ["1971-03-26T00:00:00", "Nihat Erim (a former CHP member) forms the new government of Turkey (33rd government,composed mostly of technocrats)."], ["1971-03-29T00:00:00", "U.S. Army Lieutenant William Calley is found guilty of 22 murders in the My Lai Massacre and sentenced to life in prison (he is later pardoned)."], ["1971-03-29T00:00:00", "A Los Angeles jury recommends the death penalty for Charles Manson and 3 female followers."], ["1971-04-05T00:00:00", "In Ceylon, a group calling themselves the People’s Liberation Front begins a rebellion against the Bandaranaike government."], ["1971-04-05T00:00:00", "Chile and East Germany establish diplomatic relations."], ["1971-04-05T00:00:00", "Mount Etna erupts in Sicily."], ["1971-04-17T00:00:00", "The People's Republic of Bangladesh forms, under Sheikh Mujibur Rahman, at Mujibnagor."], ["1971-04-17T00:00:00", "Libya, Syria and Egypt sign an agreement to form a confederation."], ["1971-04-19T00:00:00", "The government of Bangladesh flees to India."], ["1971-04-19T00:00:00", "Sierra Leone becomes a republic."], ["1971-04-19T00:00:00", "The Soviet Union launches Salyut 1."], ["1971-04-19T00:00:00", "Followers of Charles Manson, the Manson Family, are sentenced to the gas chamber."], ["1971-04-20T00:00:00", "Swann v. Charlotte-Mecklenburg Board of Education: The Supreme Court of the United States rules unanimously that busing of students may be ordered to achieve racial desegregation."], ["1971-04-20T00:00:00", "Cambodian Prime Minister Lon Nol resigns, but remains effectively in power until the next elections."], ["1971-04-21T00:00:00", "Siaka Stevens is elected the first president of Sierra Leone."], ["1971-04-21T00:00:00", "François Duvalier, president of Haiti, dies; his son Jean-Claude Duvalier follows him as president-for-life."], ["1971-04-24T00:00:00", "Soyuz 10 docks with Salyut 1."], ["1971-04-24T00:00:00", "Five hundred thousand people in Washington, D.C. and 125,000 in San Francisco march in protest against the Vietnam War."], ["1971-04-24T00:00:00", "A tsunami 85 m high rises over the Ryukyu Islands in Japan. It throws a 750-ton block of coral 2.5 km inland."], ["1971-04-25T00:00:00", "Todor Zhivkov is re-elected as the leader of the Bulgarian Communist Party."], ["1971-04-25T00:00:00", "Franz Jonas is re-elected as president of Austria."], ["1971-05-01T00:00:00", "Amtrak begins inter-city rail passenger service in the United States."], ["1971-05-01T00:00:00", "The Ceylonese government promises amnesty for those guerillas who surrender before April 5."], ["1971-05-03T00:00:00", "Arsenal F.C. wins the English Division 1 football league championship at the home of their bitter rivals, Tottenham Hotspur, with Ray Kennedy scoring the winner. (Arsenal FC will go on to win the league and cup 'double' 6 days later by defeating Liverpool in the FA Cup final)."], ["1971-05-03T00:00:00", "The Harris Poll claims that 60% of Americans are against the Vietnam War."], ["1971-05-03T00:00:00", "East German leader Walter Ulbricht resigns as Communist Party leader but retains the position of head of state."], ["1971-05-03T00:00:00", "1971 May Day Protests: Anti-war militants attempt to disrupt government business in Washington, D.C.; police and military units arrest as many as 12,000, most of whom are later released."], ["1971-05-09T00:00:00", "Arsenal FC beats Liverpool F.C. 2-1 to win the English FA Cup, thus completing the league and cup 'double'."], ["1971-05-09T00:00:00", "Mariner 8 fails to launch."], ["1971-05-18T00:00:00", "The U.S. Congress formally votes to end funding for the American Supersonic Transport program."], ["1971-05-18T00:00:00", "The Montréal Canadiens win the Stanley Cup against the Chicago Blackhawks. The Canadiens became only the second team in NHL history to win the Cup in game 7 on the road. This also marked the last NHL game that the late Jean Béliveau played."], ["1971-05-26T00:00:00", "Austria and the People's Republic of China establish diplomatic relations."], ["1971-05-26T00:00:00", "Qantas agrees to pay $500,000 to bomb hoaxer-extortionist Mr. Brown (Peter Macari), who is later arrested."], ["1971-05-27T00:00:00", "Six armed passengers hijack a Romanian passenger plane and force it to fly to Vienna."], ["1971-05-27T00:00:00", "Christie's auctions a diamond known as Deepdene; it is later found to be artificially colored."], ["1971-06-06T00:00:00", "Soyuz program: Soyuz 11 (Vladislav Volkov, Georgi Dobrovolski, Viktor Patsayev) is launched."], ["1971-06-06T00:00:00", "A midair collision between Hughes Airwest Flight 706 Douglas DC-9 jetliner and a U.S. Marine Corps McDonnell Douglas F-4 Phantom jet fighter near Duarte, California, claims 50 lives."], ["1971-06-10T00:00:00", "The U.S. ends its trade embargo of China."], ["1971-06-10T00:00:00", "Corpus Thursday: A student rally on the streets of Mexico City is roughly dispersed."], ["1971-06-13T00:00:00", "Vietnam War: The New York Times begins to publish the Pentagon Papers. [1]."], ["1971-06-13T00:00:00", "Gijs van Lennep (The Netherlands) and co-driver Helmut Marko (Austria) win the 24 Hours of Le Mans in the Martini Racing Porsche 917K."], ["1971-06-17T00:00:00", "Representatives of Japan and the United States sign the Okinawa Reversion Agreement, whereby the U.S. will return control of Okinawa."], ["1971-06-17T00:00:00", "President Richard Nixon declares the U.S. War on Drugs."], ["1971-06-30T00:00:00", "After a successful mission aboard Salyut 1, the world's first manned space station, the crew of the Soyuz 11 spacecraft are killed when their air supply leaks out through a faulty valve."], ["1971-06-30T00:00:00", "New York Times Co. v. United States: The U.S. Supreme Court rules that the Pentagon Papers may be published, rejecting government injunctions as unconstitutional prior restraint."], ["1971-07-13T00:00:00", "Ólafur Jóhannesson forms a government in Iceland."], ["1971-07-13T00:00:00", "Jordanian army troops launch an offensive against Palestinian guerillas in Jordan."], ["1971-07-13T00:00:00", "The Yugoslavian government begins allowing foreign companies to take their profits from the country."], ["1971-07-13T00:00:00", "Paced by a prodigious home run by Reggie Jackson, which hits a transformer on the roof of Tiger Stadium, the American League defeats the National League 6-4 in the Major League Baseball All-Star Game in Detroit."], ["1971-08-09T00:00:00", "India signs a 20-year treaty of friendship and cooperation with the Soviet Union."], ["1971-08-09T00:00:00", "Internment in Northern Ireland: British security forces arrest hundreds of nationalists and detain them without trial in Long Kesh prison; 20 people die in the riots that follow."], ["1971-08-12T00:00:00", "Three thousand people from Belfast and Derry flee to the Republic of Ireland because of the violence."], ["1971-08-12T00:00:00", "Syria severs diplomatic relations with Jordan because of border clashes."], ["1971-08-14T00:00:00", "British troops are stationed on the Ireland border to stop arms smuggling."], ["1971-08-14T00:00:00", "Bahrain declares independence as the State of Bahrain (Kingdom of Bahrain as of February 2002)."], ["1971-08-15T00:00:00", "Jackie Stewart becomes Formula One World Drivers' Champion in the Tyrrell 003-Cosworth."], ["1971-08-15T00:00:00", "The number of British troops in Northern Ireland is raised to 12,500."], ["1971-08-15T00:00:00", "President Richard Nixon announces that the United States will no longer convert dollars to gold at a fixed value, effectively ending the Bretton Woods system. He also imposes a 90-day freeze on wages, prices and rents."], ["1971-08-18T00:00:00", "Vietnam War: Australia and New Zealand decide to withdraw their troops from Vietnam."], ["1971-08-18T00:00:00", "British troops are engaged in a firefight with the IRA in Derry, Northern Ireland."], ["1971-08-20T00:00:00", "International Telecommunications Satellite Organization (Intelsat) (effective 12 February 1973)."], ["1971-08-20T00:00:00", "The USS Manatee (AO-58) spills 1,000 US gallons (3,800 L) of fuel oil on President Nixon's Western White House beach in San Clemente, California."], ["1971-08-25T00:00:00", "Border clashes occur between Tanzania and Uganda."], ["1971-08-25T00:00:00", "Bangladesh and eastern Bengal are flooded; thousands flee the area."], ["1971-09-03T00:00:00", "Qatar gains independence from the United Kingdom. Unlike most nearby emirates, Qatar declines to become part of either the United Arab Emirates or Saudi Arabia."], ["1971-09-03T00:00:00", "Manlio Brosio resigns as NATO Secretary General."], ["1971-10-21T00:00:00", "U.S. President Richard Nixon nominates Lewis Franklin Powell, Jr. and William H. Rehnquist to the U.S. Supreme Court."], ["1971-10-21T00:00:00", "The Clarkston explosion in Scotland kills 22 people."], ["1971-10-28T00:00:00", "The British House of Commons votes 356–244 in favour of joining the European Economic Community."], ["1971-10-28T00:00:00", "The United Kingdom becomes the 6th nation to launch a satellite into orbit, the Prospero X-3, using a Black Arrow carrier rocket."], ["1971-10-28T00:00:00", "The Egyptian Opera House (Khedivial Opera House) burns down in Cairo."], ["1971-11-15T00:00:00", "Intel releases the world's first microprocessor, the Intel 4004."], ["1971-11-15T00:00:00", "International Organization and System of Space Communications (Intersputnik) (effective 12 July 1972)."], ["1971-11-24T00:00:00", "During a severe storm over Washington State, a man calling himself D. B. Cooper parachutes from the Northwest Orient Airlines plane he'd just hijacked, with US$200,000 in ransom money, and is never seen again (as of March 2008, this case remains the only unsolved skyjacking in history)."], ["1971-11-24T00:00:00", "A Brussels court sentences pretender Alexis Brimeyer to 18 months in jail for falsely using a noble title; Brimeyer has already fled to Greece."], ["1971-12-04T00:00:00", "The Montreux Casino burns down during a Frank Zappa concert (the event is memorialized in the Deep Purple song \"Smoke on the Water\"). The casino is rebuilt in 1975."], ["1971-12-04T00:00:00", "The McGurk's Bar bombing by the UVF in Belfast kills 15."], ["1971-12-18T00:00:00", "The U.S. dollar is devalued for the second time in history."], ["1971-12-18T00:00:00", "The world's largest hydroelectric plant in Krasnoyarsk, Soviet Union, begins operations."], ["1971-12-19T00:00:00", "The Clube Atlético Mineiro wins the Brazil Football Championship."], ["1971-12-19T00:00:00", "Intelsat IV (F3) is launched; it enters commercial service over the Atlantic Ocean February 18, 1972."], ["1971-12-24T00:00:00", "Giovanni Leone is elected President of the Italian Republic."], ["1971-12-24T00:00:00", "Juliane Koepcke survives a fall of 10,000 feet following disintegration of LANSA Flight 508."], ["1971-12-25T00:00:00", "In the longest game in NFL history, the Miami Dolphins beat the Kansas City Chiefs."], ["1971-12-25T00:00:00", "A fire at a 22-story hotel in Seoul, South Korea kills 158 people."], ["1971-01-01T00:00:00", "Sammie Henson, American wrestler, Olympic silver medalist"], ["1971-01-01T00:00:00", "Bridget Pettis, American basketball player"], ["1971-01-02T00:00:00", "Lisa Harrison, American basketball player"], ["1971-01-02T00:00:00", "Taye Diggs, African-American actor"], ["1971-01-18T00:00:00", "Pep Guardiola, Spanish football manager"], ["1971-01-18T00:00:00", "Fabian Ribauw, Nauruan politician"], ["1971-01-27T00:00:00", "Fann Wong, Singaporean Chinese actress, model, and singer"], ["1971-01-27T00:00:00", "Lil Jon, American rapper and producer"], ["1971-01-31T00:00:00", "Patrick \"Pat\" Kielty, Northern Irish comedian and television presenter"], ["1971-01-31T00:00:00", "Patricia Velásquez, Venezuelan actress and model"], ["1971-02-14T00:00:00", "Kris Aquino, Filipina actress"], ["1971-02-14T00:00:00", "Tommy Dreamer, American professional wrestler"], ["1971-02-14T00:00:00", "Nelson Frazier, Jr., American professional wrestler (d. 2014)"], ["1971-02-20T00:00:00", "Calpernia Addams, American actress"], ["1971-02-20T00:00:00", "Jari Litmanen, Finnish footballer"], ["1971-02-24T00:00:00", "Pedro de la Rosa, Spanish Formula One driver"], ["1971-02-24T00:00:00", "Gillian Flynn, American author, comic book writer, and screenwriter"], ["1971-02-25T00:00:00", "Sean Astin, American actor"], ["1971-02-25T00:00:00", "Daniel Powter, Canadian singer"], ["1971-03-02T00:00:00", "Method Man, African-American rapper, record producer, and actor"], ["1971-03-02T00:00:00", "Manami Toyota, Japanese professional wrestler"], ["1971-03-04T00:00:00", "Iain Baird, Canadian soccer player"], ["1971-03-04T00:00:00", "Shavar Ross, American actor and filmmaker"], ["1971-03-23T00:00:00", "Karen McDougal, American model"], ["1971-03-23T00:00:00", "Alexander Selivanov, Russian ice hockey player"], ["1971-03-27T00:00:00", "David Coulthard, Scottish racing driver"], ["1971-03-27T00:00:00", "Nathan Fillion, Canadian actor"], ["1971-03-29T00:00:00", "Attila Csihar, Hungarian vocalist"], ["1971-03-29T00:00:00", "Robert Gibbs, White House Press Secretary"], ["1971-03-31T00:00:00", "Pavel Bure, Russian ice hockey player"], ["1971-03-31T00:00:00", "Craig McCracken, American animator"], ["1971-03-31T00:00:00", "Ewan McGregor, Scottish actor"], ["1971-04-02T00:00:00", "Todd Woodbridge, Australian tennis player"], ["1971-04-02T00:00:00", "Zeebra, Japanese rapper"], ["1971-04-16T00:00:00", "Moses Chan, Hong Kong actor"], ["1971-04-16T00:00:00", "Selena Quintanilla-Pérez, Mexican-American singer (d. 1995)"], ["1971-04-19T00:00:00", "Scott McCord, Canadian voice actor"], ["1971-04-19T00:00:00", "Wendy Powell, American voice actress"], ["1971-04-20T00:00:00", "Carla Geurts, Dutch swimmer"], ["1971-04-20T00:00:00", "Allan Houston, American basketball player"], ["1971-04-22T00:00:00", "Daisuke Enomoto, first Japanese space tourist"], ["1971-04-29T00:00:00", "Tamara Johnson-George, African-American singer (SWV)"], ["1971-04-29T00:00:00", "Siniša Vuco, Croatian musician"], ["1971-05-01T00:00:00", "Stuart Appleby, Australian golfer"], ["1971-05-01T00:00:00", "Ajith Kumar, Indian film actor"], ["1971-05-17T00:00:00", "Vernie Bennett, English singer (Eternal)"], ["1971-05-17T00:00:00", "Queen Máxima of the Netherlands"], ["1971-05-27T00:00:00", "Mathew Batsiua, Nauruan politician"], ["1971-05-27T00:00:00", "Paul Bettany, British actor"], ["1971-05-27T00:00:00", "Wayne Carey, Australian rules footballer"], ["1971-05-27T00:00:00", "Lisa Lopes, African-American rapper (TLC) (d. 2002)"], ["1971-06-04T00:00:00", "Joseph Kabila, President of the Democratic Republic of the Congo"], ["1971-06-04T00:00:00", "Noah Wyle, American actor"], ["1971-06-05T00:00:00", "Susan Lynch, Northern Irish actress"], ["1971-06-05T00:00:00", "Mark Wahlberg, American actor and singer"], ["1971-06-08T00:00:00", "Jeff Douglas, Canadian actor"], ["1971-06-08T00:00:00", "Troy Vincent, American football player"], ["1971-06-10T00:00:00", "Bobby Jindal, American Governor of Louisiana"], ["1971-06-10T00:00:00", "Kyle Sandilands, Australian DJ, Australian Idol judge and TV presenter"], ["1971-06-12T00:00:00", "Arman Alizad, Finnish tailor, columnist and TV personality"], ["1971-06-12T00:00:00", "Mark Henry, American professional wrestler, former Olympian"], ["1971-06-25T00:00:00", "Neil Lennon, Northern Irish footballer"], ["1971-06-25T00:00:00", "Scott Maslen, English actor"], ["1971-06-27T00:00:00", "King Dipendra of Nepal (d. 2001)"], ["1971-06-27T00:00:00", "Kieren Keke, Nauruan politician"], ["1971-06-28T00:00:00", "Abu Bakr al-Baghdadi, Iraqi Islamic extremist leader"], ["1971-06-28T00:00:00", "Fabien Barthez, French football player"], ["1971-06-28T00:00:00", "Norika Fujiwara, Japanese actress and television personality"], ["1971-06-28T00:00:00", "Akiko Kimura, Japanese voice actress"], ["1971-06-28T00:00:00", "Aileen Quinn, American actress"], ["1971-06-28T00:00:00", "Elon Musk, South African-born, Canadian-American entrepreneur, engineer, inventor and investor."], ["1971-06-29T00:00:00", "Matthew Good, Canadian musician"], ["1971-06-29T00:00:00", "Junko Noda, Japanese voice actress"], ["1971-07-01T00:00:00", "Amira Casar, French actress"], ["1971-07-01T00:00:00", "Missy \"Misdemeanor\" Elliott, African-American rapper, singer, and songwriter"], ["1971-07-09T00:00:00", "Marc Andreessen, American software developer"], ["1971-07-09T00:00:00", "Scott Grimes, American actor"], ["1971-07-12T00:00:00", "Robert Allenby, Australian golfer"], ["1971-07-12T00:00:00", "Kristi Yamaguchi, American figure skater"], ["1971-07-14T00:00:00", "Alison Bartlett-O'Reilly, American actress"], ["1971-07-14T00:00:00", "Mark LoMonaco, American professional wrestler"], ["1971-07-14T00:00:00", "Joey Styles, American professional wrestling announcer"], ["1971-07-14T00:00:00", "Howard Webb, English referee"], ["1971-07-21T00:00:00", "Charlotte Gainsbourg, French actress and singer-songwriter"], ["1971-07-21T00:00:00", "Nuno Markl, Portuguese comedian and radio host"], ["1971-07-23T00:00:00", "Ahmed Ezz, Egyptian actor"], ["1971-07-23T00:00:00", "Alison Krauss, American country singer"], ["1971-07-23T00:00:00", "Scott Krippayne, American Christian musician"], ["1971-08-04T00:00:00", "Jeff Gordon, American race car driver"], ["1971-08-04T00:00:00", "Yo-Yo, African-American rapper"], ["1971-08-10T00:00:00", "Roy Keane, Irish footballer"], ["1971-08-10T00:00:00", "Mario César Kindelán Mesa, Cuban amateur boxer"], ["1971-08-12T00:00:00", "Patrick Carpentier, Canadian race car driver"], ["1971-08-12T00:00:00", "Pete Sampras, American tennis player"], ["1971-08-12T00:00:00", "Phil Western, Canadian musician"], ["1971-08-17T00:00:00", "Anthony Kearns, Irish tenor"], ["1971-08-17T00:00:00", "Jorge Posada, Puerto Rican baseball player"], ["1971-08-26T00:00:00", "Gaynor Faye, British actress"], ["1971-08-26T00:00:00", "Thalía, Mexican actress and singer"], ["1971-08-31T00:00:00", "Pádraig Harrington, Irish golfer"], ["1971-08-31T00:00:00", "Chris Tucker, American actor and comedian"], ["1971-09-02T00:00:00", "Kjetil André Aamodt, Norwegian alpine skier"], ["1971-09-02T00:00:00", "Arnold Arre, Filipino graphic novelist"], ["1971-09-02T00:00:00", "Tommy Maddox, American football player"], ["1971-09-02T00:00:00", "Shauna Sand, American model and actress"], ["1971-09-08T00:00:00", "David Arquette, American actor"], ["1971-09-08T00:00:00", "Brooke Burke-Charvet, American model"], ["1971-09-08T00:00:00", "Martin Freeman, English actor"], ["1971-09-09T00:00:00", "Eric Stonestreet, American actor"], ["1971-09-09T00:00:00", "Henry Thomas, American actor"], ["1971-09-18T00:00:00", "Lance Armstrong, American cyclist"], ["1971-09-18T00:00:00", "Anna Netrebko, Russian operatic soprano"], ["1971-09-18T00:00:00", "Jada Pinkett Smith, African-American actress"], ["1971-09-25T00:00:00", "Jessie Wallace, English actress"], ["1971-09-30T00:00:00", "Jenna Elfman, American actress"], ["1971-09-30T00:00:00", "Jeff Whitty, American playwright"], ["1971-10-10T00:00:00", "Tiffany Mynx, American porn actress and director"], ["1971-10-10T00:00:00", "Evgeny Kissin, Russian pianist"], ["1971-10-13T00:00:00", "Sacha Baron Cohen, English comedian and actor"], ["1971-10-13T00:00:00", "Pyrros Dimas, Greek weightlifter"], ["1971-10-14T00:00:00", "Andy Cole, English Footballer"], ["1971-10-14T00:00:00", "Jorge Costa, Portuguese footballer"], ["1971-10-20T00:00:00", "Snoop Dogg, African-American rapper"], ["1971-10-20T00:00:00", "Dannii Minogue, Australian singer"], ["1971-10-25T00:00:00", "Athena Chu, Hong Kong actress and singer"], ["1971-10-25T00:00:00", "Midori Gotō, Japanese violinist"], ["1971-10-25T00:00:00", "Pedro Martínez, Dominican baseball player"], ["1971-11-10T00:00:00", "Big Pun, American/Latin rapper (d. 2000)"], ["1971-11-10T00:00:00", "Niki Karimi, Iranian actress and movie director"], ["1971-11-14T00:00:00", "Adam Gilchrist, Australian cricketer"], ["1971-11-14T00:00:00", "Marco Leonardi, Italian actor"], ["1971-11-25T00:00:00", "Christina Applegate, American actress"], ["1971-11-25T00:00:00", "Magnus Arvedson, Swedish hockey player"], ["1971-11-30T00:00:00", "Iván \"Pudge\" Rodríguez, Puerto Rican baseball player and actor"], ["1971-11-30T00:00:00", "Jessalyn Gilsig, Canadian actress"], ["1971-12-06T00:00:00", "Helena Bulaja, Croatian multimedia artist"], ["1971-12-06T00:00:00", "Richard Krajicek, Dutch tennis player"], ["1971-12-07T00:00:00", "Vladimir Akopian, Armenian chess player"], ["1971-12-07T00:00:00", "Larisa Alexandrovna, Ukrainian-American feminist"], ["1971-12-17T00:00:00", "Antoine Rigaudeau, French basketball player"], ["1971-12-17T00:00:00", "Alan Khan, South African radio DJ"], ["1971-12-17T00:00:00", "Sinan Akkuş, Turkish-German actor"], ["1971-12-23T00:00:00", "Corey Haim, Canadian actor (d. 2010)"], ["1971-12-23T00:00:00", "Tara Palmer-Tomkinson, British socialite"], ["1971-12-24T00:00:00", "Giorgos Alkaios, Greek recording artist"], ["1971-12-24T00:00:00", "Christopher Daniels, American professional wrestler"], ["1971-12-24T00:00:00", "Ricky Martin, Puerto Rican singer"], ["1971-12-25T00:00:00", "Dido, English singer"], ["1971-12-25T00:00:00", "Justin Trudeau, Canadian politician"], ["1971-01-24T00:00:00", "St. John Greer Ervine, Northern Irish dramatist and author (b. 1883)"], ["1971-01-24T00:00:00", "Bill W. (William Griffith Wilson), co-founder Alcoholics Anonymous (b. 1895)"], ["1971-01-25T00:00:00", "Barry III, Guinean politician (b. 1923)"], ["1971-01-25T00:00:00", "Hermann Hoth, German general (b. 1885)"], ["1971-01-25T00:00:00", "Isobel Lennart, American screenwriter (b. 1915)"], ["1971-03-08T00:00:00", "Borden Chase, American screenwriter (b. 1900)"], ["1971-03-08T00:00:00", "Harold Lloyd, American actor and filmmaker (b. 1893)"], ["1971-03-08T00:00:00", "James Tait Plowden-Wardlaw, Vicar of St Clement’s Cambridge and a barrister (b. 1873)"], ["1971-03-16T00:00:00", "Bebe Daniels, American actress (b. 1901)"], ["1971-03-16T00:00:00", "Thomas E. Dewey, Governor of New York; American presidential candidate (b. 1902)"], ["1971-03-24T00:00:00", "Arne Jacobsen, Danish architect and designer (b. 1902)"], ["1971-03-24T00:00:00", "Arthur Metcalfe, Australian public servant (b. 1895)"], ["1971-04-06T00:00:00", "Igor Stravinsky, Russian composer (b. 1882)"], ["1971-04-06T00:00:00", "Margaret Newton, Canadian plant pathologist and mycologist (b. 1887)"], ["1971-04-21T00:00:00", "Papa Doc Duvalier, President of Haiti (b. 1907)"], ["1971-04-21T00:00:00", "Edmund Lowe, American actor (b. 1890)"], ["1971-05-01T00:00:00", "Glenda Farrell, American actress (b. 1904)"], ["1971-05-01T00:00:00", "Cheridah de Beauvoir Stocks, the second British woman to gain a Royal Aero Club aviator licence, in 1911 (b. 1887)"], ["1971-05-12T00:00:00", "Harold Lea Fetherstonhaugh, Canadian architect from Montreal, Quebec (b. 1887)"], ["1971-05-12T00:00:00", "Tor Johnson, Swedish wrestler and actor (b. 1903)"], ["1971-05-12T00:00:00", "Heinie Manush, American baseball player (b. 1901)"], ["1971-05-15T00:00:00", "Goose Goslin, American baseball player (b. 1900)"], ["1971-05-15T00:00:00", "Sir Tyrone Guthrie, English film director, producer, and writer (b. 1900)"], ["1971-05-18T00:00:00", "G. Owen Bonawit, stained glass artist (b. 1891)"], ["1971-05-18T00:00:00", "Bruno Villabruna, Italian lawyer and politician (b. 1884)"], ["1971-05-19T00:00:00", "Ogden Nash, American poet (b. 1902)"], ["1971-05-19T00:00:00", "Bernard Wagenaar, Dutch/American composer, conductor and violinist (b. 1894)"], ["1971-05-28T00:00:00", "Eduardo Blanco Acevedo, Uruguayan political figure and physician (b. 1884)"], ["1971-05-28T00:00:00", "Garnet Kearney, Canadian doctor, teacher, and pioneer (b. 1884)"], ["1971-05-28T00:00:00", "Kim Il-yeop, Korean writer, journalist, feminist activist, Buddhist nun (b. 1896)"], ["1971-05-28T00:00:00", "Thomas McLaughlin, Irish engineer (b. 1896)"], ["1971-05-28T00:00:00", "Audie Murphy, American World War II hero and actor (b. 1924)"], ["1971-05-28T00:00:00", "Alfred Rose (bishop), the sixth Bishop of Dover in the modern era (b. 1884)"], ["1971-05-28T00:00:00", "Miriam Soljak, New Zealand feminist and communist (b. 1879)"], ["1971-05-28T00:00:00", "Jean Vilar, French stage actor (b. 1912)"], ["1971-06-10T00:00:00", "Virginia True Boardman, American actress (b. 1889)"], ["1971-06-10T00:00:00", "Michael Rennie, English actor (b. 1909)"], ["1971-06-15T00:00:00", "Herbert Gundelach, German general during the Second World War (b. 1899)"], ["1971-06-15T00:00:00", "Arthur Kaufmann (artist), German painter, (b. 1888)"], ["1971-06-15T00:00:00", "Wendell Meredith Stanley, American chemist, Nobel Prize laureate (b. 1904)"], ["1971-06-18T00:00:00", "Thomas Gomez, American actor (b. 1905)"], ["1971-06-18T00:00:00", "Libby Holman, American singer and actress (b. 1904)"], ["1971-06-18T00:00:00", "Paul Karrer, Swiss chemist, Nobel Prize laureate (b. 1889)"], ["1971-06-18T00:00:00", "Prajnalok Mahasthavir, scholar, writer and orator (b. 1879)"], ["1971-06-18T00:00:00", "Mildred Veitch, last member of the Veitch family of horticulturists (b. 1889)"], ["1971-06-30T00:00:00", "Herbert Biberman, Jewish-American screenwriter and film director (b. 1900)"], ["1971-06-30T00:00:00", "Alexander Curt Brade, German botanist (b. 1881)"], ["1971-06-30T00:00:00", "Crew of Soyuz 11:\nGeorgy Dobrovolsky (b. 1928)\nViktor Patsayev (b. 1933)\nVladislav Volkov (b. 1935)\n"], ["1971-06-30T00:00:00", "Georgy Dobrovolsky (b. 1928)"], ["1971-06-30T00:00:00", "Viktor Patsayev (b. 1933)"], ["1971-06-30T00:00:00", "Vladislav Volkov (b. 1935)"], ["1971-06-30T00:00:00", "Gaston Balande, French painter and illustrator (b. 1880)"], ["1971-07-01T00:00:00", "William Lawrence Bragg, English physicist, Nobel Prize laureate (b. 1890)"], ["1971-07-01T00:00:00", "Learie Constantine, Baron Constantine, Trinidadian cricketer (b. 1901)"], ["1971-07-04T00:00:00", "Maurice Bowra, British critic (b. 1898)"], ["1971-07-04T00:00:00", "August Derleth, American author and anthologist (b. 1909)"], ["1971-07-04T00:00:00", "Thomas C. Hart, American admiral and politician (b. 1877)"], ["1971-07-07T00:00:00", "Claude Gauvreau, Canadian writer (b. 1925)"], ["1971-07-07T00:00:00", "Ub Iwerks, American animator (b. 1901)"], ["1971-07-19T00:00:00", "John Jacob Astor, 1st Baron Astor of Hever, British businessman (b. 1886)"], ["1971-07-19T00:00:00", "Norman Reilly Raine, American screenwriter (b. 1894)"], ["1971-07-19T00:00:00", "Arsène Roux, French Arabist (b. 1893)"], ["1971-07-24T00:00:00", "Christl Mardayn, German actress (b. 1896)"], ["1971-07-24T00:00:00", "Alan Rawsthorne, British Composer (b. 1905)"], ["1971-08-02T00:00:00", "Satyananda Giri, Indian monk and Yukteswar Giri’s chief in Dubai,India (b. 1896)"], ["1971-08-02T00:00:00", "John McDermott, American golfer (b. 1891)"], ["1971-08-15T00:00:00", "Albrecht Goetze, German-American Hittitologist (b. 1897)"], ["1971-08-15T00:00:00", "Paul Lukas, Hungarian-born American actor (b. 1895)"], ["1971-08-27T00:00:00", "Margaret Bourke-White, American photographer (b. 1904)"], ["1971-08-27T00:00:00", "Bennett Cerf, American publisher and television personality (b. 1898)"], ["1971-08-28T00:00:00", "Geoffrey Lawrence, 1st Baron Oaksey, British Judge during the Nuremberg trials after World War II (b. 1880)"], ["1971-08-28T00:00:00", "Reuvein Margolies, Austrian-Hungarian-born Israeli author and Talmudic scholar (b. 1889)"], ["1971-09-11T00:00:00", "Bella Darvi, Polish-born actress (b. 1928)"], ["1971-09-11T00:00:00", "Percy Helton, American film and television actor (b. 1894)"], ["1971-09-11T00:00:00", "Nikita Khrushchev, Soviet leader (b. 1894)"], ["1971-09-23T00:00:00", "James Waddell Alexander II, mathematician and topologist (b. 1888)"], ["1971-09-23T00:00:00", "Billy Gilbert, American actor (b. 1894)"], ["1971-10-12T00:00:00", "Dean Acheson, United States Secretary of State (b. 1893)"], ["1971-10-12T00:00:00", "Gene Vincent, American singer (b. 1935)"], ["1971-10-13T00:00:00", "Benito Canónico, Venezuelan composer (b. 1894)"], ["1971-10-13T00:00:00", "Hans Ledersteger, Austrian art director (b. 1898)"], ["1971-10-16T00:00:00", "Richard Thomas Alexander, American educator and influential education theorist.(b. 1887)"], ["1971-10-16T00:00:00", "Robin Boyd, Australian architect (b. 1919)"], ["1971-10-29T00:00:00", "Duane Allman, American rock guitarist (b. 1946)"], ["1971-10-29T00:00:00", "Arne Tiselius, Swedish chemist, Nobel Prize laureate (b. 1902)"], ["1971-11-16T00:00:00", "Lucien Chopard, French entomologist (b. 1885)"], ["1971-11-16T00:00:00", "Edie Sedgwick, American actress and model (b. 1943)"], ["1971-11-17T00:00:00", "Debaki Bose, Indian actor, director and writer (b. 1898)"], ["1971-11-17T00:00:00", "Dame Gladys Cooper, English actress (b. 1888)"], ["1971-12-12T00:00:00", "Torrance \"Torry\" Gillick, Scottish footballer (b. 1915)"], ["1971-12-12T00:00:00", "Nikolai Kudryavtsev, Soviet Russian petroleum geologist (b. 1893)"], ["1971-12-12T00:00:00", "Yechezkel Kutscher, Israeli philologist and Hebrew linguist (b. 1909)"], ["1971-12-12T00:00:00", "Alan Morton, Scottish footballer (b. 1893)"], ["1971-12-12T00:00:00", "David Sarnoff, Radio and television pioneer (b. 1891)"], ["1971-12-18T00:00:00", "Bobby Jones, American golfer (b. 1902)"], ["1971-12-18T00:00:00", "Diana Lynn, American actress (b. 1926)"], ["1971-12-20T00:00:00", "Gustavo Bacarisas, Gibraltarian painter (b. 1873)"], ["1971-12-20T00:00:00", "Roy O. Disney, American studio executive (b. 1893)"], ["1971-12-24T00:00:00", "Dora Altmann, German actress (b. 1881)"], ["1971-12-24T00:00:00", "Maria Koepcke, German ornithologist (b. 1924)"], ["1971-12-31T00:00:00", "Pete Duel, American actor (Alias Smith and Jones) (b. 1940)"], ["1971-12-31T00:00:00", "Eduardo Zamacois, Spanish novelist (b. 1873)"]]