[["1956-01-01T00:00:00", "The Anglo-Egyptian Condominium ends in Sudan."], ["1956-01-03T00:00:00", "By popular demand, Peter Pan, starring Mary Martin, is restaged live by Producers' Showcase on NBC-TV."], ["1956-01-03T00:00:00", "Columbia Records first releases Glenn Gould's solo piano recording of Bach's Goldberg Variations."], ["1956-01-08T00:00:00", "Operation Auca: Five U.S. missionaries Nate Saint, Roger Youderian, Ed McCully, Jim Elliot and Pete Fleming are killed for trespassing by the Waodani of Ecuador shortly after making contact with them."], ["1956-01-16T00:00:00", "Egyptian leader Gamal Abdel Nasser vows to reconquer Palestine."], ["1956-01-26T00:00:00", "The 1956 Winter Olympic Games open in Cortina d'Ampezzo, Italy."], ["1956-02-11T00:00:00", "British spies Guy Burgess and Donald Maclean resurface in the Soviet Union after being missing for 5 years."], ["1956-02-16T00:00:00", "Only a little more than four months after the release of the 70mm version of Oklahoma!, the film version of Rodgers and Hammerstein's Carousel, starring Gordon MacRae and Shirley Jones, is released in CinemaScope 55. MacRae and Jones had previously starred in Oklahoma! Carousel, intended for showing in 55mm, ends up being shown only in 35mm."], ["1956-02-22T00:00:00", "Elvis Presley enters the United States music charts for the first time, with \"Heartbreak Hotel\"."], ["1956-02-23T00:00:00", "Norma Jean Mortenson legally changes her name to Marilyn Monroe."], ["1956-02-24T00:00:00", "Doris Day records her most famous song: Que Sera, Sera (Whatever Will Be, Will Be). It is from Alfred Hitchcock's The Man Who Knew Too Much, in which Day co-stars with James Stewart."], ["1956-02-25T00:00:00", "Nikita Khrushchev attacks the veneration of Joseph Stalin as a \"cult of personality\"."], ["1956-03-01T00:00:00", "The International Air Transport Association finalizes a draft of the radiotelephony spelling alphabet for the International Civil Aviation Organization."], ["1956-03-02T00:00:00", "Morocco declares its independence from France."], ["1956-03-09T00:00:00", "The British deport Archbishop Makarios from Cyprus to the Seychelles."], ["1956-03-09T00:00:00", "Soviet Armed Forces suppresses mass demonstrations in the Georgian Soviet Socialist Republic, reacting to Nikita Khrushchev's de-Stalinization policy."], ["1956-03-11T00:00:00", "After having opened in London the previous year, Laurence Olivier's film, Richard III, adapted from Shakespeare's play, has its U.S. premiere in theatres and on NBC Television on the same day. On TV it is not shown in prime time, but as an afternoon matinée, in a slightly cut version. It is one of the first such experiments of its kind. Olivier is later nominated for an Oscar for his performance."], ["1956-03-12T00:00:00", "96 U.S. Congressmen sign the Southern Manifesto, a protest against the 1954 Supreme Court ruling (Brown v. Board of Education) that desegregated public education."], ["1956-03-12T00:00:00", "The Dow Jones Industrial Average closes above 500 for the first time rising 2.40 points, or 0.48%, to 500.24."], ["1956-03-13T00:00:00", "Elvis Presley releases his first Gold Album titled Elvis Presley."], ["1956-03-15T00:00:00", "The Broadway musical My Fair Lady opens in New York City."], ["1956-03-19T00:00:00", "At age 48, Dutch boxer Bep van Klaveren contests his last match in Rotterdam."], ["1956-03-20T00:00:00", "Tunisia gains independence from France."], ["1956-03-21T00:00:00", "The 28th Academy Awards ceremony is held."], ["1956-03-23T00:00:00", "Pakistan becomes the first Islamic republic, and a national holiday is observed in the country including the former East Pakistan state."], ["1956-04-02T00:00:00", "The first episode of As the World Turns is broadcast on the CBS television network in the United States."], ["1956-04-07T00:00:00", "Spain relinquishes its protectorate in Morocco."], ["1956-04-09T00:00:00", "Habib Bourguiba is elected President of the National Constituent Assembly of the Kingdom of Tunisia; on April 15 he becomes Prime Minister."], ["1956-04-14T00:00:00", "Videotape is first demonstrated at the 1956 NARTB (now NAB) convention in Chicago by Ampex. It is the demonstration of the first practical and commercially successful videotape format known as 2\" Quadruplex."], ["1956-04-17T00:00:00", "Queen Elizabeth II inaugurates the 4.9 km² Chew Valley Lake in Somerset, England, as a reservoir for the Bristol area."], ["1956-04-18T00:00:00", "Maria Desylla-Kapodistria is elected mayor of Corfu and becomes the first female mayor in Greece."], ["1956-04-19T00:00:00", "British diver Lionel Crabb (working for MI6) dives into Portsmouth harbour to investigate a visiting Soviet cruiser and vanishes."], ["1956-04-19T00:00:00", "American actress Grace Kelly marries Rainier III, Prince of Monaco."], ["1956-04-21T00:00:00", "Former U.S. First Daughter Margaret Truman marries Clifton Daniel."], ["1956-04-27T00:00:00", "Heavyweight boxing champion Rocky Marciano retires without losing a professional boxing match."], ["1956-05-02T00:00:00", "The United Methodist Church in America decides at its General Conference to grant women full ordained clergy status. It also calls for an end to racial segregation in the denomination."], ["1956-05-08T00:00:00", "Austria and Israel form diplomatic relations. Confirmation needed"], ["1956-05-08T00:00:00", "The constitutional union between Indonesia and the Netherlands is dissolved."], ["1956-05-08T00:00:00", "John Osborne's Look Back in Anger opens at the Royal Court Theatre, London, changing the scope of theatrical and other forms of drama in the UK."], ["1956-05-09T00:00:00", "Manaslu, eighth highest mountain in the world, is first ascended."], ["1956-05-18T00:00:00", "Lhotse (main), the fourth highest mountain, is first ascended."], ["1956-05-23T00:00:00", "French minister Pierre Mendès France resigns due to his government's policy on Algeria."], ["1956-05-24T00:00:00", "The first Eurovision Song Contest is broadcast from Lugano, Switzerland. The winning song is the host country's Refrain by Lys Assia (music by Géo Voumard, text by Émile Gardaz)."], ["1956-05-25T00:00:00", "India announces the institution of diplomatic relations with Spain (still under Franco's rule)"], ["1956-06-01T00:00:00", "Vyacheslav Molotov resigns as foreign minister of the Soviet Union; he later becomes ambassador in Mongolia."], ["1956-06-03T00:00:00", "British Rail renames 'Third Class' passenger facilities as 'Second Class' (Second Class facilities had been abolished in 1875, leaving just First Class and Third Class)."], ["1956-06-05T00:00:00", "Elvis Presley performs \"Hound Dog\", on The Milton Berle Show, scandalizing the audience with his suggestive hip movements."], ["1956-06-06T00:00:00", "In Singapore, chief minister David Marshall resigns after the breakdown of talks about internal self-government in London."], ["1956-06-08T00:00:00", "General Electric/Telechron introduces model 7H241 \"The Snooz Alarm\", first snooze alarm clock ever."], ["1956-06-10T00:00:00", "1956 Summer Olympics: Equestrian events open in Stockholm, Sweden (all other events are held in November in Melbourne, Australia)."], ["1956-06-13T00:00:00", "International Criminal Police Organization (ICPO)."], ["1956-06-13T00:00:00", "Real Madrid beats Stade Reims 4-3 at Parc des Princes, Paris and wins the 1955-56 European Cup (football)."], ["1956-06-14T00:00:00", "The Flag of the United States Army is formally dedicated."], ["1956-06-15T00:00:00", "Eindhoven University of Technology is founded in Eindhoven, The Netherlands."], ["1956-06-18T00:00:00", "The last foreign troops leave Egypt."], ["1956-06-21T00:00:00", "Playwright Arthur Miller appears before the House UnAmerican Activities Committee."], ["1956-06-23T00:00:00", "Gamal Abdel Nasser becomes the 2nd president of Egypt."], ["1956-06-28T00:00:00", "MP Sydney Silverman's bill for the abolition of the death penalty in the UK passes the British House of Commons."], ["1956-06-28T00:00:00", "Labour riots in Poznań, Poland, are crushed with heavy loss of life. Soviet troops fire at a crowd protesting high prices, killing 53 people."], ["1956-06-28T00:00:00", "The film version of Rodgers and Hammerstein's The King and I, starring Deborah Kerr and Yul Brynner, is released only a few months after the film version of R&H's Carousel. It becomes the most financially successful film version of a Rodgers and Hammerstein musical up to that time, and the only one to win an acting Oscar (Yul Brynner wins Best Actor for his performance as the King of Siam). It is also one of two Rodgers and Hammerstein films to be nominated for Best Picture (which it does not win)."], ["1956-06-29T00:00:00", "Actress Marilyn Monroe marries playwright Arthur Miller."], ["1956-06-29T00:00:00", "President Dwight D. Eisenhower signs the Federal Aid Highway Act, creating the Interstate Highway System."], ["1956-06-30T00:00:00", "A TWA Lockheed Constellation and United Airlines Douglas DC-7 collide in mid-air over the Grand Canyon in Arizona, killing all 128 people aboard both aircraft in the deadliest civil aviation disaster to date; the accident leads to sweeping changes in the regulation of cross-country flight and air traffic control over the United States."], ["1956-07-02T00:00:00", "A lab experiment involving scrap thorium at Sylvania Electric Products in Bayside, New York, results in an explosion."], ["1956-07-04T00:00:00", "The first Lockheed U-2 spy plane flight over the Soviet Union."], ["1956-07-08T00:00:00", "The mountain Gasherbrum II, on the border of Pakistan and China, is first ascended by an Austrian expedition."], ["1956-07-10T00:00:00", "The British House of Lords defeats the abolition of the death penalty."], ["1956-07-16T00:00:00", "With the closing of its \"Big Tent\" show in Pittsburgh, Ringling Bros. and Barnum & Bailey Circus announces all subsequent circuses will be \"arena shows\" due to changing economics."], ["1956-07-24T00:00:00", "At New York City's Copacabana nightclub, Dean Martin and Jerry Lewis perform their last comedy show together (their act started on July 25, 1946)."], ["1956-07-25T00:00:00", "The Italian ocean liner SS Andrea Doria sinks after colliding with the Swedish ship SS Stockholm in heavy fog 72 kilometers (45 mi) south of Nantucket Island, killing 51."], ["1956-07-26T00:00:00", "Egyptian leader Gamal Abdel Nasser nationalizes the Suez Canal sparking international condemnation."], ["1956-07-30T00:00:00", "A joint resolution of Congress is signed by President Dwight D. Eisenhower, authorizing \"In God we trust\" as the U.S. national motto."], ["1956-07-31T00:00:00", "Cricket: Jim Laker sets an extraordinary record at Old Trafford in the fourth Test between England and Australia, taking 19 wickets in a first class match (the previous best was 17)."], ["1956-08-06T00:00:00", "After going bankrupt in 1955, the American broadcaster DuMont Television Network airs its final broadcast, an episode of its sports series Boxing from St. Nicholas Arena."], ["1956-08-08T00:00:00", "262 miners die in a fire in a coal mine in Marcinelle, Belgium."], ["1956-08-09T00:00:00", "The exhibition This Is Tomorrow opens at Whitechapel Art Gallery in London."], ["1956-08-12T00:00:00", "Around 5,000 members of the Romanian Greek-Catholic Church hold a mass outside Cluj-Napoca Piarists' Church to demonstrate that their church, proscribed by the government in 1948, has not ceased to exist as the regime claims."], ["1956-08-17T00:00:00", "West Germany bans the Communist Party of Germany."], ["1956-09-09T00:00:00", "Elvis Presley appears on The Ed Sullivan Show for the first time."], ["1956-09-13T00:00:00", "The hard disk drive is invented by an IBM team led by Reynold B. Johnson."], ["1956-09-16T00:00:00", "Television broadcasting commences in Australia."], ["1956-09-21T00:00:00", "Nicaraguan dictator Anastasio Somoza García is assassinated."], ["1956-09-25T00:00:00", "The submarine transatlantic telephone cable opens."], ["1956-09-27T00:00:00", "The Bell X-2 becomes the first manned aircraft to reach Mach 3."], ["1956-10-05T00:00:00", "Cecil B. DeMille's epic film The Ten Commandments, starring Charlton Heston as Moses, is released in the United States. It will be in the top ten of the worldwide list of highest-grossing films of all time adjusted for inflation."], ["1956-10-08T00:00:00", "Baseball pitcher Don Larsen of the New York Yankees throws the only perfect game in World Series history in Game 5 of the 1956 World Series against the Brooklyn Dodgers. Yogi Berra catches the game. Dale Mitchell is the final out. The New York Yankees win the series. Larsen is named series MVP."], ["1956-10-10T00:00:00", "Finland joins UNESCO."], ["1956-10-10T00:00:00", "The prototype Lockheed L-1649 Starliner, the final Lockheed Constellation model, makes its first flight."], ["1956-10-14T00:00:00", "Indira Kala Sangeet University, Khairagarh is inaugurated by Prime Minister of India Indira Gandhi."], ["1956-10-14T00:00:00", "Dalit Buddhist movement: Dr. B. R. Ambedkar, Indian Dalit leader, converts to Buddhism along with 385,000 followers."], ["1956-10-15T00:00:00", "The British Royal Air Force retires its last Avro Lancaster bomber."], ["1956-10-17T00:00:00", "The world's first commercial nuclear power plant is opened at Calder Hall in England."], ["1956-10-17T00:00:00", "The Game of the Century (chess): 13-year-old Bobby Fischer beats grandmaster Donald Byrne in the Rosenwald Memorial Tournament in New York City."], ["1956-10-22T00:00:00", "Suez Crisis: The United Kingdom, France, and Israel secretly meet in and make plans to invade Egypt."], ["1956-10-23T00:00:00", "Hungarian Revolution breaks out against the pro-Soviet government, originating as a student demonstration in Budapest. Hungary attempts to leave the Warsaw Pact."], ["1956-10-26T00:00:00", "Red Army troops invade Hungary."], ["1956-10-29T00:00:00", "Suez Crisis: Israel invades the Sinai Peninsula and pushes Egyptian forces back toward the Suez Canal."], ["1956-10-29T00:00:00", "Tangier Protocol: The international city Tangier is reintegrated into Morocco."], ["1956-10-29T00:00:00", "The Huntley-Brinkley Report debuts on NBC-TV in the United States."], ["1956-10-31T00:00:00", "Suez Crisis: The United Kingdom and France begin bombing Egypt to force the reopening of the Suez Canal."], ["1956-10-31T00:00:00", "A United States Navy team becomes the third group to reach the South Pole (arriving by air) and commences construction of the first permanent Amundsen-Scott South Pole Station."], ["1956-11-01T00:00:00", "The States Reorganisation Act of India reforms the boundaries and names of Indian states. Two new states Kerala and Karnataka were formed."], ["1956-11-01T00:00:00", "City Lights Books publishes Howl and Other Poems by Allen Ginsberg."], ["1956-11-01T00:00:00", "The film Oklahoma! (1955), previously released to select cities in Todd-AO, now receives a national release in CinemaScope, since not all theatres are yet equipped for Todd-AO. To accomplish this, the film had to be actually shot twice, rather than printing one version in two different film processes as is done today."], ["1956-11-03T00:00:00", "MGM's film The Wizard of Oz is the first major Hollywood film running more than ninety minutes to be televised uncut in one evening."], ["1956-11-04T00:00:00", "1956 Hungarian Revolution: More Soviet troops invade Hungary to crush a revolt that started on October 23. Thousands are killed, more are wounded, and nearly a quarter million leave the country."], ["1956-11-06T00:00:00", "United States presidential election, 1956: Republican incumbent Dwight D. Eisenhower defeats Democrat challenger Adlai E. Stevenson in a rematch of their contest 4 years earlier."], ["1956-11-07T00:00:00", "Suez Crisis: The United Nations General Assembly adopts a resolution calling for the United Kingdom, France, and Israel to withdraw their troops from Arab lands immediately."], ["1956-11-13T00:00:00", "The United States Supreme Court declares illegal the state and municipal laws requiring segregated buses in Montgomery, Alabama, thus ending the Montgomery Bus Boycott."], ["1956-11-14T00:00:00", "Fighting ends in Hungary. Confirmation needed"], ["1956-11-15T00:00:00", "Middle East Technical University is founded in Ankara, Turkey."], ["1956-11-18T00:00:00", "At the reception of the Polish embassy in Moscow Nikita Khrushchev uttered his famous phrase \"We will bury you\"."], ["1956-11-20T00:00:00", "In Yugoslavia, former prime minister Milovan Djilas is arrested after he criticizes Josip Broz Tito."], ["1956-11-22T00:00:00", "The 1956 Summer Olympics begin in Melbourne, Australia."], ["1956-11-23T00:00:00", "The Suez Crisis causes petrol rationing in Britain."], ["1956-11-28T00:00:00", "Roger Vadim's drama film And God Created Woman, released in France as Et Dieu . . . créa la femme, propels Brigitte Bardot into the public spotlight as a \"sex kitten\"."], ["1956-11-30T00:00:00", "Floyd Patterson wins the world heavyweight boxing championship that was vacant after the retirement of Rocky Marciano."], ["1956-12-02T00:00:00", "Fidel Castro and his followers land in Cuba in the boat Granma."], ["1956-12-02T00:00:00", "A pipe bomb planted by George Metesky explodes at the Paramount Theater in Brooklyn, injuring 6 people."], ["1956-12-04T00:00:00", "The Million Dollar Quartet (Elvis Presley, Jerry Lee Lewis, Carl Perkins, and Johnny Cash) get together at Sun Studios for the first and last time in history."], ["1956-12-05T00:00:00", "Rose Heilbron becomes Britain's first female judge."], ["1956-12-09T00:00:00", "Trans-Canada Air Lines Flight 810 crashes into a mountain in British Columbia. All 62 people on board are killed."], ["1956-12-12T00:00:00", "Japan becomes a member of the United Nations."], ["1956-12-18T00:00:00", "To Tell the Truth debuts on CBS-TV."], ["1956-12-19T00:00:00", "John Bodkin Adams is arrested for the murder of 2 patients in Eastbourne, Great Britain."], ["1956-12-23T00:00:00", "British and French troops leave the Suez Canal region."], ["1956-12-31T00:00:00", "Bob Barker makes his TV debut as host of the game show Truth or Consequences."]]