[["1999-01-01T00:00:00", "The euro is established."], ["1999-01-04T00:00:00", "Gunmen open fire on Shia Muslims worshiping in a mosque in Islamabad, Pakistan, killing 16 and injuring 25."], ["1999-01-10T00:00:00", "Sanjeev Nanda kills 3 policemen in New Delhi with his car, an act for which he is later acquitted, resulting in a sharp drop in public confidence in the Indian legal system."], ["1999-01-10T00:00:00", "The Sopranos television series debuts on HBO."], ["1999-01-20T00:00:00", "The China News Service announces new government restrictions on Internet use aimed especially at Internet cafés."], ["1999-01-21T00:00:00", "In one of the largest drug busts in American history, the United States Coast Guard intercepts a ship with over 9,500 pounds (4.75 tons) of cocaine aboard headed for Houston."], ["1999-01-25T00:00:00", "A 6.1 Richter scale earthquake hits western Colombia, killing at least 1,000."], ["1999-01-31T00:00:00", "The popular, yet controversial, Family Guy debuts on Fox."], ["1999-02-04T00:00:00", "Unarmed Guinean immigrant Amadou Diallo is shot dead by New York City police officers on an unrelated stake-out, inflaming race relations in the city."], ["1999-02-07T00:00:00", "King Hussein of Jordan dies from cancer, and his son Abdullah II inherits the throne."], ["1999-02-11T00:00:00", "Pluto moves along its eccentric orbit further from the Sun than Neptune. It had been nearer than Neptune since 1979, and will become again in 2231."], ["1999-02-12T00:00:00", "U.S. President Bill Clinton is acquitted in impeachment proceedings in the United States Senate."], ["1999-02-16T00:00:00", "In Uzbekistan, an apparent assassination attempt against President Islam Karimov takes place at government headquarters."], ["1999-02-16T00:00:00", "Across Europe, Kurdish rebels take over embassies and hold hostages after Turkey arrests one of their rebel leaders."], ["1999-02-21T00:00:00", "Sanna Sillanpää shoots 4 men, killing 3 at a shooting range in Finland."], ["1999-02-22T00:00:00", "Moderate Iraqi Shiite cleric Mohammad Mohammad Sadeq al-Sadr is assassinated."], ["1999-02-23T00:00:00", "Kurdish rebel leader Abdullah Öcalan is charged with treason in Ankara, Turkey."], ["1999-02-23T00:00:00", "White supremacist John William King is found guilty of kidnapping and killing African American James Byrd Jr. by dragging him behind a truck for 2 miles (3 km)."], ["1999-02-23T00:00:00", "An avalanche destroys the village of Galtür, Austria, killing 31."], ["1999-02-24T00:00:00", "LaGrand case: The State of Arizona executes Karl LaGrand, a German national involved in an armed robbery in 1982 that led to a death. Karl's brother Walter is executed a week later, in spite of Germany's legal action in the International Court of Justice to attempt to save him."], ["1999-02-27T00:00:00", "While trying to circumnavigate the world in a hot air balloon, Colin Prescot and Andy Elson set a new endurance record after being aloft for 233 hours and 55 minutes."], ["1999-03-01T00:00:00", "One of 4 bombs detonated in Lusaka, Zambia, destroys the Angolan Embassy."], ["1999-03-01T00:00:00", "Rwandan Hutu rebels kill and dismember 8 foreign tourists at the Buhoma homestead, Uganda."], ["1999-03-01T00:00:00", "The Convention on the Prohibition of Anti-Personnel Mines comes into force."], ["1999-03-02T00:00:00", "The brand new Mandalay Bay hotel and casino opens in Las Vegas."], ["1999-03-03T00:00:00", "Walter LaGrand is executed in the gas chamber in Arizona."], ["1999-03-04T00:00:00", "In a military court, United States Marine Corps Captain Richard J. Ashby is acquitted of the charge of reckless flying which resulted in the deaths of 20 skiers in the Italian Alps, when his low-flying jet hit a gondola cable."], ["1999-03-12T00:00:00", "Former Warsaw Pact members Hungary, Poland and the Czech Republic join NATO."], ["1999-03-15T00:00:00", "In Brussels, Belgium, the Santer Commission resigns over allegations of corruption."], ["1999-03-21T00:00:00", "Bertrand Piccard and Brian Jones become the first to circumnavigate the Earth in a hot air balloon."], ["1999-03-21T00:00:00", "The 71st Academy Awards are held at the Dorothy Chandler Pavilion in Los Angeles with Shakespeare in Love winning Best Picture."], ["1999-03-23T00:00:00", "Gunmen assassinate Paraguay's Vice President Luis María Argaña."], ["1999-03-24T00:00:00", "NATO launches air strikes against the Federal Republic of Yugoslavia, marking the first time NATO has attacked a sovereign country."], ["1999-03-24T00:00:00", "A fire in the Mont Blanc Tunnel kills 39 people, closing the tunnel for nearly 3 years."], ["1999-03-25T00:00:00", "Enron energy traders allegedly route 2,900 megawatts of electricity destined for California to the town of Silver Peak, Nevada, population 200."], ["1999-03-26T00:00:00", "The Melissa worm attacks the Internet."], ["1999-03-26T00:00:00", "A Michigan jury finds Dr. Jack Kevorkian guilty of second-degree murder for administering a lethal injection to a terminally ill man."], ["1999-03-27T00:00:00", "Kosovo War: A U.S. F-117 Nighthawk is shot down by Serbian forces."], ["1999-03-29T00:00:00", "For the first time, the Dow Jones Industrial Average closes above the 10,000 mark, at 10,006.78."], ["1999-04-01T00:00:00", "Nunavut, an Inuit homeland, is created from the eastern portion of the Northwest Territories to become Canada's third territory."], ["1999-04-05T00:00:00", "Two Libyans suspected of bringing down Pan Am Flight 103 in 1988 are handed over to Scottish authorities for eventual trial in the Netherlands. The United Nations suspends sanctions against Libya."], ["1999-04-05T00:00:00", "In Laramie, Wyoming, Russell Henderson pleads guilty to kidnapping and felony murder, in order to avoid a possible death penalty conviction for the apparent hate crime killing of Matthew Shepard."], ["1999-04-07T00:00:00", "Kosovo War: Kosovo's main border crossings are closed by Yugoslav forces to prevent Kosovo Albanians from leaving."], ["1999-04-07T00:00:00", "A bomb explodes at the Valley of the Fallen Church in Spain; GRAPO claims responsibility."], ["1999-04-08T00:00:00", "Bill Gates' personal fortune makes him the wealthiest individual in the world due to the increased value of Microsoft stock."], ["1999-04-09T00:00:00", "Ibrahim Baré Maïnassara, president of Niger, is assassinated."], ["1999-04-13T00:00:00", "Tercentenary celebrations of the creation of the Sikh Khalsa are held."], ["1999-04-14T00:00:00", "Kosovo War: NATO warplanes repeatedly bomb ethnic Albanian refugee convoys for 2 hours over a 12-mile stretch of road, after mistaking them for Serbian military trucks, between Đakovica and Dečani in western Kosovo, killing at least 73 refugees."], ["1999-04-17T00:00:00", "A nail bomb, planted by David Copeland, explodes in the middle of a busy market in Brixton, South London."], ["1999-04-18T00:00:00", "Wayne Gretzky retires as a player from the National Hockey League"], ["1999-04-20T00:00:00", "Columbine High School massacre: Two Littleton, Colorado teenagers, Eric Harris and Dylan Klebold, open fire on their teachers and classmates, killing 12 students and 1 teacher, and then themselves."], ["1999-04-25T00:00:00", "The term of Tuanku Jaafar ibni Almarhum Tuanku Abdul Rahman as the 10th Yang di-Pertuan Agong of Malaysia ends."], ["1999-04-26T00:00:00", "Sultan Salahuddin of Selangor, becomes the 11th Yang di-Pertuan Agong of Malaysia."], ["1999-04-26T00:00:00", "British TV presenter Jill Dando, 37, is shot dead on the doorstep of her home in Fulham, London."], ["1999-04-30T00:00:00", "Cambodia joins the Association of Southeast Asian Nations (ASEAN), bringing the total members to 10."], ["1999-04-30T00:00:00", "A third nail bomb (see April 17) explodes in The Admiral Duncan pub in Old Compton Street, Soho, London, killing a pregnant woman and two friends and injuring 70 others, including her husband. This is part of a hate campaign against ethnic minorities and gay people by David Copeland."], ["1999-05-01T00:00:00", "The first episode of SpongeBob SquarePants, Help Wanted debuts on Nickelodeon."], ["1999-05-02T00:00:00", "Norman J. Sirnic and Karen Sirnic are murdered by serial killer Ángel Maturino Reséndiz in Weimar, Texas."], ["1999-05-03T00:00:00", "1999 Oklahoma tornado outbreak: A devastating tornado, rated F5 on the Fujita scale, slams into southern and eastern Oklahoma City metropolitan area, killing 36 people (+5 indirectly)."], ["1999-05-03T00:00:00", "The Dow Jones Industrial Average closes above 11,000 for the first time, at 11,014.70."], ["1999-05-05T00:00:00", "Microsoft releases Windows 98 (Second Edition), from 1998."], ["1999-05-06T00:00:00", "Elections are held in Scotland and Wales for the new Scottish Parliament and National Assembly for Wales."], ["1999-05-07T00:00:00", "A jury finds The Jenny Jones Show and Warner Bros. liable in the shooting death of Scott Amedure, after the show deceived Jonathan Schmitz into appearing on a secret same-sex crush episode."], ["1999-05-07T00:00:00", "Kosovo War: In the Federal Republic of Yugoslavia, 3 Chinese embassy workers are killed and 20 others wounded when a NATO B-2 aircraft mistakenly bombs the Chinese Embassy in Belgrade."], ["1999-05-07T00:00:00", "In Guinea-Bissau, President João Bernardo Vieira is ousted in a military coup."], ["1999-05-08T00:00:00", "Nancy Mace becomes the first female cadet to graduate from The Military College of South Carolina."], ["1999-05-12T00:00:00", "David Steel becomes the first Presiding Officer (Speaker) of the modern Scottish Parliament."], ["1999-05-13T00:00:00", "Carlo Azeglio Ciampi is elected President of Italy."], ["1999-05-17T00:00:00", "Ehud Barak is elected prime minister of Israel."], ["1999-05-19T00:00:00", "Star Wars Episode I: The Phantom Menace is released in theaters. It becomes the highest grossing Star Wars film."], ["1999-05-26T00:00:00", "The Indian Air Force launches an attack on intruding Pakistan Army troops and mujahideen militants in Kashmir."], ["1999-05-26T00:00:00", "The first Welsh Assembly in over 600 years opens in Cardiff."], ["1999-05-26T00:00:00", "The 1999 UEFA Champions League Final takes place at the Camp Nou Stadium, Barcelona in which the English side Manchester United defeats the German side Bayern Munich 2-1."], ["1999-05-27T00:00:00", "The International Criminal Tribunal for the former Yugoslavia in The Hague, Netherlands indicts Slobodan Milošević and four others for war crimes and crimes against humanity committed in Kosovo."], ["1999-05-28T00:00:00", "Swedish police officers Robert Karlström (30) and Olov Borén (42) are wounded by 3 bank robbers armed with automatic weapons, and later executed with their own service pistols in Malexander, see Malexander murders."], ["1999-05-28T00:00:00", "After 22 years of restoration work, Leonardo da Vinci's The Last Supper is placed back on display in Milan, Italy."], ["1999-05-29T00:00:00", "Cathy O'Dowd, a South African mountaineer, becomes the first woman to summit Mount Everest from both the north and south sides."], ["1999-05-29T00:00:00", "Nigeria terminates military rule, and the Fourth Nigerian Republic is established with Olusegun Obasanjo as president."], ["1999-05-30T00:00:00", "Travel Midland Metro enters public service."], ["1999-06-01T00:00:00", "Napster, a revolutionary music downloading service, debuts."], ["1999-06-01T00:00:00", "American Airlines Flight 1420 overruns the runway in Little Rock, Arkansas; 11 people are killed."], ["1999-06-02T00:00:00", "After decades of fighting off outside technological influences like television, the King of Bhutan allows television transmissions to commence in the Kingdom for the first time, coinciding with the King's Silver Jubilee (see Bhutan Broadcasting Service)."], ["1999-06-05T00:00:00", "The Islamic Salvation Army, the armed wing of the Islamic Salvation Front, agrees in principle to disband in Algeria."], ["1999-06-06T00:00:00", "In Brazil, 345 prisoners escape from Putim prison through the front gate."], ["1999-06-08T00:00:00", "The government of Colombia announces it will include the estimated value of the country's illegal drug crops, exceeding half a billion US dollars, in its gross national product."], ["1999-06-09T00:00:00", "Kosovo War: The Federal Republic of Yugoslavia and NATO sign a peace treaty."], ["1999-06-10T00:00:00", "Kosovo War: NATO suspends its air strikes after Slobodan Milošević agrees to withdraw Yugoslav forces from Kosovo"], ["1999-06-10T00:00:00", "An underground pipeline leaks 237,000 gallons (897,000 liters) of gasoline before exploding at Whatcom Falls Park in Bellingham, Washington, killing 1 adult and 2 children."], ["1999-06-12T00:00:00", "Kosovo War: Operation Joint Guardian/Operation Agricola begins: NATO-led United Nations peacekeeping forces KFOR enter the province of Kosovo in the Federal Republic of Yugoslavia."], ["1999-06-12T00:00:00", "Texas Governor George W. Bush announces he will seek the Republican Party nomination for President of the United States."], ["1999-06-14T00:00:00", "Thabo Mbeki is elected President of South Africa."], ["1999-06-18T00:00:00", "The J18 international anti-globalization protests are organized in dozens of cities around the world, some of which lead to riots."], ["1999-06-19T00:00:00", "Turin, Italy, is awarded the 2006 Winter Olympics."], ["1999-06-30T00:00:00", "Twenty-three people die when fire consumes the Sealand Youth Training Center in South Korea."], ["1999-07-01T00:00:00", "The Scottish Parliament is officially opened by Elizabeth II on the day that legislative powers are officially transferred from the old Scottish Office in London to the new devolved Scottish Executive in Edinburgh."], ["1999-07-01T00:00:00", "Europol (short for European Police Office) the European Union's criminal intelligence agency becomes fully operational."], ["1999-07-02T00:00:00", "Benjamin Nathaniel Smith begins a 3-day killing spree targeting racial and ethnic minorities in Illinois and Indiana."], ["1999-07-05T00:00:00", "U.S. Army Pfc. Barry Winchell is bludgeoned in his sleep at Fort Campbell, Kentucky by fellow soldiers; he dies the next day from his injuries."], ["1999-07-07T00:00:00", "In Rome, Hicham El Guerrouj runs the fastest mile ever recorded, at 3:43.13."], ["1999-07-08T00:00:00", "A major flash flood in Las Vegas swamps hundreds of cars, smashes mobile homes and kills 2 people."], ["1999-07-10T00:00:00", "American soccer player Brandi Chastain scores the game winning penalty kick against China in the FIFA Women's World Cup."], ["1999-07-11T00:00:00", "India recaptures Kargil, forcing the Pakistan Army to retreat. India announces victory, ending the 2-month conflict."], ["1999-07-16T00:00:00", "Off the coast of Martha's Vineyard, a plane crashes piloted by John F. Kennedy Jr., killing him, his wife Carolyn Bessette-Kennedy, and her sister Lauren Bessette."], ["1999-07-20T00:00:00", "Mercury program: Liberty Bell 7 - piloted by Gus Grissom in 1961 - is raised from the Atlantic Ocean."], ["1999-07-20T00:00:00", "Falun Gong is banned in the People's Republic of China under Jiang Zemin."], ["1999-07-22T00:00:00", "The first version of MSN Messenger is released by Microsoft."], ["1999-07-23T00:00:00", "NASA's Chandra X-ray Observatory is launched."], ["1999-07-23T00:00:00", "ANA Flight 61 is hijacked in Tokyo."], ["1999-07-23T00:00:00", "Mohammed VI of Morocco becomes king upon the death of his father Hassan II."], ["1999-07-23T00:00:00", "14 Kosovo Serb villagers are killed by ethnic Albanian gunmen in the village of Staro Gračko."], ["1999-07-26T00:00:00", "The last Checker taxi cab is retired in New York City and auctioned off for approximately $135,000."], ["1999-07-27T00:00:00", "Twenty-one people die in a canyoning disaster near Interlaken, Switzerland."], ["1999-07-31T00:00:00", "NASA intentionally crashes the Lunar Prospector spacecraft into the Moon, thus ending its mission to detect frozen water on the lunar surface."], ["1999-08-07T00:00:00", "Hundreds of Chechen guerrillas invade the Russian republic of Dagestan, triggering a short war."], ["1999-08-08T00:00:00", "The first Callatis Festival, the largest music & culture festival in Romania, is held."], ["1999-08-09T00:00:00", "Russian President Boris Yeltsin fires his Prime Minister, Sergei Stepashin, and for the fourth time fires his entire cabinet."], ["1999-08-10T00:00:00", "Buford O. Furrow, Jr. wounds 5 and kills 1 during the Los Angeles Jewish Community Center shooting."], ["1999-08-10T00:00:00", "The Atlantique incident occurs as an intruding Pakistan Navy plane is shot down in India. The incident sparks tensions between the 2 nations, coming just a month after the end of the Kargil War."], ["1999-08-11T00:00:00", "A total solar eclipse is seen in Europe and Asia."], ["1999-08-11T00:00:00", "Salt Lake City tornado: A very rare F2 tornado strikes Salt Lake City, killing 1."], ["1999-08-17T00:00:00", "1999 İzmit earthquake: A 7.6-magnitude earthquake strikes İzmit and levels much of northwestern Turkey, killing more than 17,000 and injuring 44,000. This is the first of a long series of unrelated but frequent earthquakes throughout the world during the years 1999 and 2000."], ["1999-08-19T00:00:00", "In Belgrade, tens of thousands of Serbians rally to demand the resignation of Yugoslav President Slobodan Milošević."], ["1999-08-22T00:00:00", "Mandarin Airlines Flight 642 crashes in Hong Kong."], ["1999-08-22T00:00:00", "GPS Week Numbers reset to 0."], ["1999-08-26T00:00:00", "The Second Chechen War starts"], ["1999-08-30T00:00:00", "East Timor votes for independence from Indonesia in a referendum."], ["1999-08-31T00:00:00", "Apple Computer releases the Power Macintosh G4."], ["1999-09-07T00:00:00", "A magnitude 5.9 earthquake hits Athens, killing 143 and injuring more than 2,000."], ["1999-09-07T00:00:00", "Viacom and CBS merge."], ["1999-09-08T00:00:00", "The first of a series of Russian apartment bombings occurs. Subsequent bombings occur on September 13 and 16, while a bombing on September 22 fails."], ["1999-09-09T00:00:00", "Sega Dreamcast is released in North America as well as Sonic Adventure."], ["1999-09-12T00:00:00", "Under international pressure to allow an international peacekeeping force, Indonesian president BJ Habibie announces that he will do so."], ["1999-09-14T00:00:00", "Kiribati, Nauru and Tonga join the United Nations."], ["1999-09-21T00:00:00", "The 921 earthquake, also known as the Jiji earthquake (magnitude 7.6 on the Richter scale), kills about 2,400 people in Taiwan."], ["1999-10-01T00:00:00", "Shanghai Pudong International Airport opens in China, taking over all international flights to Hongqiao."], ["1999-10-05T00:00:00", "Thirty-one people die in the Ladbroke Grove rail crash, west of London, England."], ["1999-10-12T00:00:00", "Pakistani Prime Minister Nawaz Sharif attempts to dismiss Army Chief General Pervez Musharraf and install ISI director Ziauddin Butt in his place. Senior Army generals refuse to accept the dismissal. Musharraf, who is out of the country, attempts to return in a commercial airliner. Sharif orders the Karachi airport to not allow the plane to land. The generals lead a coup d'état, ousting Sharif's administration and taking over the airport. The plane lands with only a few minutes of fuel to spare, and Musharraf takes control of the government."], ["1999-10-12T00:00:00", "Date selected by the UN as when the world population reaches 6 billion people."], ["1999-10-13T00:00:00", "The United States Senate rejects ratification of the Comprehensive Test Ban Treaty (CTBT)."], ["1999-10-15T00:00:00", "A National Geographic Society press conference reveals the fossil of Archaeoraptor (which is later found to be a forgery)."], ["1999-10-22T00:00:00", "Grand Theft Auto 2 is released on PlayStation"], ["1999-10-29T00:00:00", "a super cyclonic storm impacts Orissa, India, killing approximately 10,000 people."]]