[["1946-01-06T00:00:00", "A revised and streamlined revival of Kern and Hammerstein's Show Boat opens on Broadway at the Ziegfeld Theatre."], ["1946-01-07T00:00:00", "The Allies recognize the Austrian republic with 1937 borders, and divide the country into four occupation zones."], ["1946-01-10T00:00:00", "The first meeting of the United Nations is held at Methodist Central Hall Westminster in London."], ["1946-01-10T00:00:00", "Project Diana bounces radar waves off the Moon, measuring the exact distance between the Earth and the Moon, and proves that communication is possible between Earth and outer space, effectively opening the Space Age."], ["1946-01-11T00:00:00", "Enver Hoxha declares the People's Republic of Albania, with himself as prime minister."], ["1946-01-11T00:00:00", "Porfirio Barba-Jacob's ashes go back to Colombia."], ["1946-01-16T00:00:00", "Charles de Gaulle resigns as a head of a French provisional government."], ["1946-01-17T00:00:00", "The United Nations Security Council holds its first session at Church House, Westminster in London."], ["1946-01-17T00:00:00", "Senator Dennis Chávez (D-NM) calls for a vote on an FEPC bill which calls for an end to discrimination in the workplace. A filibuster prevents it from passing."], ["1946-01-19T00:00:00", "The Bell XS-1 is test flown for the first time (unpowered), with Bell's chief test pilot Jack Woolams at the controls."], ["1946-01-20T00:00:00", "Charles de Gaulle resigns as president of France."], ["1946-01-22T00:00:00", "Iran: Qazi Muhammad declares the independent people's Republic of Mahabad at the Chahar Cheragh Square in the Kurdish city of Mahabad. He is the new president, Haji Baba Sheikh is the prime minister."], ["1946-01-25T00:00:00", "The United Mine Workers rejoins the American Federation of Labor."], ["1946-01-28T00:00:00", "The Canadian schooner Bluenose founders on a Haitian reef."], ["1946-01-29T00:00:00", "The Central Intelligence Group is established (the CIA in 1947)."], ["1946-01-31T00:00:00", "The last session of the Permanent Court of International Justice occurs."], ["1946-01-31T00:00:00", "Yugoslavia's new constitution, modeling the Soviet Union, establishes 6 constituent republics (Bosnia and Herzegovina, Croatia, Macedonia, Montenegro, Serbia and Slovenia)."], ["1946-02-01T00:00:00", "Trygve Lie of Norway is selected as the first United Nations Secretary-General."], ["1946-02-01T00:00:00", "The Kingdom of Hungary becomes a republic, heavily influenced by the Soviet Union."], ["1946-02-14T00:00:00", "The Bank of England is nationalized."], ["1946-02-14T00:00:00", "ENIAC (for \"Electronic Numerical Integrator and Computer\"), an early general-purpose electronic computer, is unveiled at the University of Pennsylvania."], ["1946-02-15T00:00:00", "Canada indicts 22 communist agents."], ["1946-02-20T00:00:00", "An explosion kills more than 400 coal miners in West Germany."], ["1946-02-24T00:00:00", "Juan Perón is elected president of Argentina."], ["1946-02-28T00:00:00", "In Philadelphia, General Electric strikers and police clash."], ["1946-03-02T00:00:00", "British troops withdraw from Iran according to treaty; the Soviets do not."], ["1946-03-02T00:00:00", "Ho Chi Minh is elected President of North Vietnam."], ["1946-03-04T00:00:00", "C. G. E. Mannerheim resigns as president of Finland."], ["1946-03-05T00:00:00", "In his speech at Westminster College, in Fulton, Missouri, Winston Churchill talks about the Iron Curtain."], ["1946-03-06T00:00:00", "Vietnam War: Ho Chi Minh signs an agreement with France which recognizes Vietnam as an autonomous state in the Indochinese Federation and the French Union."], ["1946-03-07T00:00:00", "The 18th Academy Awards ceremony is held. Best Picture goes to The Lost Weekend."], ["1946-03-09T00:00:00", "Juho Kusti Paasikivi becomes president of Finland."], ["1946-03-09T00:00:00", "Bolton Wanderers stadium disaster at Burnden Park, Bolton, England, 33 killed and hundreds amongst the injured"], ["1946-03-10T00:00:00", "British troops begin withdrawing from Lebanon."], ["1946-03-15T00:00:00", "Clement Attlee promises independence to India as soon as they can agree on a constitution."], ["1946-03-19T00:00:00", "The Soviet Union and Switzerland resume diplomatic relations."], ["1946-03-19T00:00:00", "French Guiana, Guadeloupe, Martinique and Réunion become overseas départements of France."], ["1946-03-22T00:00:00", "The United Kingdom grants Transjordan, as it is then known, its independence; 3 years later the country changes its name to Jordan."], ["1946-03-29T00:00:00", "The Gold Coast has an African majority in its parliament."], ["1946-04-01T00:00:00", "A 14-meter high tsunami strikes Hilo and Laupāhoehoe on the Big Island of Hawaii; 173 are killed, thousands injured."], ["1946-04-01T00:00:00", "The Malayan Union is formed."], ["1946-04-01T00:00:00", "Singapore becomes a Crown colony."], ["1946-04-03T00:00:00", "Japanese Lt. General Masaharu Homma is executed outside Manila, the Philippines for leading the Bataan Death March."], ["1946-04-10T00:00:00", "In Japan, women vote for the first time, during elections for the House of Representatives of the 90th Imperial Diet."], ["1946-04-17T00:00:00", "Syria's independence from France is officially recognized."], ["1946-04-18T00:00:00", "The inaugural session of the International Court of Justice (ICJ) occurs."], ["1946-04-18T00:00:00", "The United States recognizes Josip Broz Tito's government in Yugoslavia."], ["1946-04-18T00:00:00", "The League of Nations, in its last meeting, transfers its mission to the United Nations and disbands itself."], ["1946-04-23T00:00:00", "The Eastern Pennsylvania Basketball League (Which is now the CBA) is founded."], ["1946-04-27T00:00:00", "FA Cup: Derby County beat Charlton Athletic in the first FA Cup final since 1939."], ["1946-04-28T00:00:00", "Pestalozzi Children’s Village (Kinderdorf Pestalozzi) established at Trogen in Switzerland to accommodate and educate orphans of World War II according to Pestalozzian principles."], ["1946-04-29T00:00:00", "Trial against war criminals begin in Tokyo; the accused include Hideki Tōjō, Shigenori Tōgō and Hiroshi Ōshima."], ["1946-05-01T00:00:00", "At least 800 Indigenous Australian pastoral workers walk off the job in Northwest Western Australia, starting one of the longest industrial strikes in Australia."], ["1946-05-02T00:00:00", "Six inmates unsuccessfully try to escape from Alcatraz Prison. A riot occurs, the \"Battle of Alcatraz\"."], ["1946-05-07T00:00:00", "Tokyo Telecommunications Engineering (later renamed Sony) is founded with about 20 employees."], ["1946-05-09T00:00:00", "King Victor Emmanuel III of Italy abdicates, and is succeeded by his son Umberto II."], ["1946-05-10T00:00:00", "Jawaharlal Nehru is elected leader of the Congress Party in India."], ["1946-05-10T00:00:00", "The first V-2 rocket is successfully launched at the White Sands Missile Range."], ["1946-05-20T00:00:00", "The British House of Commons decides to nationalize mines."], ["1946-05-21T00:00:00", "At the Los Alamos Laboratory, Dr. Louis Slotin saves his coworkers but receives a fatal dose of ionizing radiation (the incident is initially classified)."], ["1946-05-22T00:00:00", "The Hashemite Kingdom of Transjordan is founded."], ["1946-05-25T00:00:00", "The parliament of Transjordan makes emir Abdullah their king."], ["1946-05-26T00:00:00", "Czechoslovak parliamentary election, with Communist victory (38%), last before communists take power."], ["1946-05-31T00:00:00", "A Greek referendum supports the return of the monarchy."], ["1946-06-01T00:00:00", "Ion Antonescu, prime minister and \"Conducator\" (Leader) of Romania during World War II is executed; he was found guilty of betraying the Romanian people for benefits of Germany and sentenced to death by the Bucharest People's Tribunal."], ["1946-06-01T00:00:00", "D'Argenlieu, French High Commissioner for Indo-China recognizes an autonomous \"Republic of Cochin-China\" in violation of the March 6 Ho-Sainteny agreement, opening the way for conflict between the Viet Minh and France."], ["1946-06-02T00:00:00", "In a referendum, Italians decide to turn Italy from a monarchy into a republic. Women vote for the first time."], ["1946-06-03T00:00:00", "The Interpol organization re-founded, telegraphic address “Interpol” adopted."], ["1946-06-06T00:00:00", "The Basketball Association of America is formed in New York City."], ["1946-06-08T00:00:00", "In Indonesia, Sukarno incites his supporters to fight Dutch colonial occupation."], ["1946-06-09T00:00:00", "In Thailand, King Bhumibol Adulyadej (Rama IX) accedes the throne after the mysterious death of his brother, King Ananda Mahidol (Rama VIII)."], ["1946-06-10T00:00:00", "Italy is declared a republic."], ["1946-06-13T00:00:00", "Umberto II of Italy leaves the country and goes into exile in Portugal; Alcide De Gasperi becomes head of state."], ["1946-06-14T00:00:00", "The Baruch Plan is proposed to the United Nations"], ["1946-06-17T00:00:00", "A tornado on the Detroit River kills 17."], ["1946-06-17T00:00:00", "Laurence Olivier's Henry V opens in the United States nearly 2 years after its release in England. It is the first Shakespeare film in color, and critics hail it as the finest film of a Shakespeare play ever made."], ["1946-06-23T00:00:00", "1946 Vancouver Island earthquake."], ["1946-06-23T00:00:00", "The National Democratic Front wins a landslide victory in the municipal elections in French India."], ["1946-06-25T00:00:00", "International Bank for Reconstruction and Development (IBRD) (World Bank) begins operations."], ["1946-06-30T00:00:00", "The War Relocation Authority is abolished."], ["1946-07-01T00:00:00", "Nuclear testing: Operation Crossroads, a series of nuclear weapon tests conducted by the United States at Bikini Atoll in Micronesia, is initiated by detonation of Able at an altitude of 520 feet (158 m).\n"], ["1946-07-04T00:00:00", "Ankara University is founded in Turkey."], ["1946-07-04T00:00:00", "After more than 380 years of Western dominance, the Philippines attains full independence."], ["1946-07-05T00:00:00", "Bikinis go on sale in Paris."], ["1946-07-07T00:00:00", "Mother Frances Xavier Cabrini becomes the first American saint to be canonized."], ["1946-07-07T00:00:00", "Howard Hughes nearly dies in a test flight of the Hughes XF-11, which crashes in a Beverly Hills neighborhood due to a propeller malfunction."], ["1946-07-16T00:00:00", "Bureau of Land Management (BLM) within Department of the Interior (formed by merger of Grazing Service and General Land Office)."], ["1946-07-21T00:00:00", "An Irgun bomb explodes in Jerusalem due to secretive talks between Jews and Britain to consolidate the state of Israel."], ["1946-07-22T00:00:00", "King David Hotel bombing: The Irgun bombs the King David Hotel (headquarters of the British civil and military administration) in Jerusalem, killing 90."], ["1946-07-25T00:00:00", "Nuclear testing: In the first underwater test of the atomic bomb, the surplus USS Saratoga is sunk near Bikini Atoll in the Pacific Ocean, when the United States detonates the Baker device during Operation Crossroads."], ["1946-07-25T00:00:00", "At Club 500 in Atlantic City, New Jersey, Dean Martin and Jerry Lewis stage their first show as a comedy team."], ["1946-07-25T00:00:00", "In the last mass lynching in the United States, a mob of white men shoot and kill two African-American couples near Moore's Ford Bridge in Georgia."], ["1946-08-01T00:00:00", "The United States Atomic Energy Commission is established."], ["1946-08-01T00:00:00", "The Fulbright Program, a system of U.S. international educational exchange scholarships, is established."], ["1946-08-01T00:00:00", "The Hungarian forint is introduced in Hungary by the government, ending the world's biggest hyperinflation in the country."], ["1946-08-01T00:00:00", "The Scandinavian Airlines System is founded as a consortium of the flag carriers of Sweden, Denmark and Norway."], ["1946-08-03T00:00:00", "Holiday World, originally called Santa Claus Land, opens to the public at Santa Claus, Indiana. It becomes the first themed park, preceding Disneyland by 9 years."], ["1946-08-04T00:00:00", "The 1946 Dominican Republic earthquake (magnitude 8.0) hits the northern Dominican Republic, killing 100 and leaving 20,000 homeless."], ["1946-08-16T00:00:00", "Direct Action Day: Violence between Muslims and Hindus in Calcutta begins \"The Week of the Long Knives\" which leaves 3,000 dead."], ["1946-08-16T00:00:00", "The All Hyderabad Trade Union Congress is founded in Secunderabad."], ["1946-08-16T00:00:00", "The Kurdistan Democratic Party is founded in South Kurdistan."], ["1946-08-18T00:00:00", "The Vergarola explosion in Croatia kills 70."], ["1946-08-25T00:00:00", "American golfer Ben Hogan wins the PGA Championship."], ["1946-09-02T00:00:00", "The Interim Government of India takes charge, with Jawaharlal Nehru as Vice President, as part of the transition from the British Raj to full independence for India and Pakistan."], ["1946-09-04T00:00:00", "Street violence between Muslims and Hindus erupts in Bombay."], ["1946-09-08T00:00:00", "Bulgaria is declared a People's Republic after a referendum; King Simeon II leaves."], ["1946-09-24T00:00:00", "Cathay Pacific Airways is founded in Hong Kong by American Roy Farrell and Australian Sydney de Kantzow."], ["1946-09-28T00:00:00", "George II of Greece returns to Athens."], ["1946-10-01T00:00:00", "Mensa, an international organization for people with a high intelligence quotient (IQ), is founded by Roland Berrill, an Australian-born lawyer, and Dr Lancelot Ware, an English biochemist and lawyer, in Oxford."], ["1946-10-02T00:00:00", "Communists take over in Bulgaria."], ["1946-10-06T00:00:00", "Sweden's Prime Minister Per Albin Hansson dies in office of a heart attack."], ["1946-10-10T00:00:00", "Commencement of the Noakhali genocide of Hindus in Bengal at the hands of Muslim mobs."], ["1946-10-11T00:00:00", "After a few days of vacancy, the Swedish premiership is taken over by Tage Erlander ."], ["1946-10-13T00:00:00", "France adopts the constitution of the Fourth Republic."], ["1946-10-14T00:00:00", "International Organization for Standardization (ISO) founded."], ["1946-10-15T00:00:00", "Nuremberg trials: Hermann Göring, founder of the Gestapo and recently convicted Nazi war criminal, poisons himself two hours before his scheduled execution."], ["1946-10-16T00:00:00", "The remaining ten Nazi war criminals sentenced to death at the Nuremberg trials are executed by hanging in a gymnasium in the Nuremberg Palace of Justice."], ["1946-10-16T00:00:00", "The United Nations' first meeting in Long Island is held."], ["1946-11-01T00:00:00", "In the first Basketball Association of America game, the New York Knicks defeat the Toronto Huskies 68-66 at Toronto's Maple Leaf Gardens.\n"], ["1946-11-04T00:00:00", "UNESCO established as a specialized agency of the United Nations."], ["1946-11-05T00:00:00", "Senate and House elections in the United States both give majorities to the Republicans."], ["1946-11-10T00:00:00", "At least 1,400 people are killed in an earthquake measuring 7.4 on the Richter scale, in the Ancash Region and Quiches District in Peru."], ["1946-11-10T00:00:00", "The Slimbridge Wetland Reserve opens in England."], ["1946-11-12T00:00:00", "A truce is declared between Indonesian nationalist troops and the Dutch army in Indonesia."], ["1946-11-12T00:00:00", "In Chicago, a branch of the Exchange National Bank (now part of the LaSalle Bank) opens the first 10 drive-up teller windows."], ["1946-11-15T00:00:00", "The Netherlands recognizes the Republic of Indonesia."], ["1946-11-17T00:00:00", "Eight British servicemen are killed in Jerusalem by Jewish nationalists."], ["1946-11-19T00:00:00", "Afghanistan, Iceland and Sweden join the United Nations."], ["1946-11-19T00:00:00", "Romanian general election, 1946: The Romanian Communist Party wins 79.86% of the vote through widespread intimidation tactics and electoral fraud."], ["1946-11-22T00:00:00", "Tony Benn is elected as Treasurer of the Oxford Union."], ["1946-11-23T00:00:00", "Vietnamese riot in Haiphong and clash with French troops. The French cruiser Suffren opens fire, killing 6,000 Vietnamese."], ["1946-11-23T00:00:00", "The Workers' Party of South Korea is founded."], ["1946-11-27T00:00:00", "Cold War: Indian Prime Minister Jawaharlal Nehru appeals to the United States and the Soviet Union to end nuclear testing and to start nuclear disarmament, stating that such an action would \"save humanity from the ultimate disaster.\""], ["1946-11-29T00:00:00", "The All Indonesia Centre of Labour Organizations (SOBSI) is founded in Jakarta."], ["1946-12-01T00:00:00", "Miguel Alemán Valdés takes office as President of Mexico."], ["1946-12-07T00:00:00", "A fire at the Winecoff Hotel in Atlanta, United States kills 119."], ["1946-12-11T00:00:00", "UNICEF (the United Nations Children's Emergency Fund) is founded."], ["1946-12-12T00:00:00", "The United Nations severs relations with Franco's Spain and recommends that member countries sever diplomatic relations."], ["1946-12-12T00:00:00", "Léon Blum founds a government of socialist parties in France."], ["1946-12-12T00:00:00", "Iranian troops recapture the Azerbaijan province and the Kurdish Republic of Mahabad, both of which had seceded earlier in the year."], ["1946-12-14T00:00:00", "The International Labour Organization becomes a specialized agency of the United Nations."], ["1946-12-15T00:00:00", "The first election to the Representative Assembly of French India was held."], ["1946-12-16T00:00:00", "Siam joins the United Nations (changes name to Thailand in 1949)."], ["1946-12-19T00:00:00", "Viet Minh forces begin a war against French occupying forces in Vietnam, succeeding in 1954 with France's surrender at the Battle of Dien Bien Phu."], ["1946-12-20T00:00:00", "Frank Capra's It's a Wonderful Life, featuring James Stewart, Donna Reed, Lionel Barrymore, Henry Travers, and Thomas Mitchell, is released in New York."], ["1946-12-20T00:00:00", "At least 1,362 people are killed in an earthquake and associated tsunami in Japan."], ["1946-12-22T00:00:00", "The Havana Conference begins between U.S. organized crime bosses in Havana, Cuba."], ["1946-12-24T00:00:00", "France's Fourth Republic is founded."], ["1946-12-25T00:00:00", "The first artificial, self-sustaining nuclear chain reaction in Europe was initiated within the Soviet (Russian) nuclear reactor F-1."], ["1946-12-26T00:00:00", "The Flamingo Hotel opens on the Las Vegas Strip."], ["1946-12-26T00:00:00", "David Lean's Great Expectations, based on the Charles Dickens novel, and featuring John Mills, Valerie Hobson, Martita Hunt, Alec Guinness, Francis L. Sullivan, Jean Simmons, and Finlay Currie, is released to great acclaim in the UK."], ["1946-12-31T00:00:00", "President Harry S. Truman delivers Proclamation 2714, which officially ends hostilities in World War II."]]