[["1961-01-03T00:00:00", "President Dwight D. Eisenhower announces that the United States has severed diplomatic and consular relations with Cuba. Relations are later restored in 2014."], ["1961-01-03T00:00:00", "At the National Reactor Testing Station near Idaho Falls, atomic reactor SL-1 explodes, killing 3 military technicians."], ["1961-01-03T00:00:00", "Aero Flight 311 (Koivulahti air disaster): Douglas DC-3C OH-LCC of Finnish airline Aero crashes near Kvevlax (Koivulahti) on approach to Vaasa Airport in Finland killing all 25 on board, due to pilot error: an investigation finds that the captain and first officer were both exhausted for lack of sleep and had taken excessive alcohol at the time of the crash. It remains the deadliest air disaster to occur in the country."], ["1961-01-05T00:00:00", "Italian sculptor Alfredo Fioravanti marches into the U.S. Consulate in Rome, and confesses that he was part of the team that forged the Etruscan terracotta warriors in the Metropolitan Museum of Art."], ["1961-01-05T00:00:00", "Cemal Gürsel forms the new government of Turkey (25th government)."], ["1961-01-07T00:00:00", "Following a 4-day conference in Casablanca, 5 African chiefs of state announce plans for a NATO-type African organization to ensure common defense. The Charter of Casablanca involves the Casablanca Group: Morocco, the United Arab Republic, Ghana, Guinea, and Mali."], ["1961-01-08T00:00:00", "In France, a referendum supports Charles de Gaulle's policies on independence for Algeria."], ["1961-01-09T00:00:00", "British authorities announce that they have discovered a large Soviet spy ring in London."], ["1961-01-17T00:00:00", "President Dwight Eisenhower gives his final State of the Union Address to Congress. In a Farewell Address the same day, he warns of the increasing power of a \"military-industrial complex.\""], ["1961-01-17T00:00:00", "Patrice Lumumba of Republic of Congo is assassinated."], ["1961-01-20T00:00:00", "John F. Kennedy succeeds Dwight Eisenhower as the 35th President of the United States of America."], ["1961-01-24T00:00:00", "A B-52 Stratofortress, with two nuclear bombs, crashes near Goldsboro, North Carolina."], ["1961-01-25T00:00:00", "In Washington, D.C., President John F. Kennedy delivers the first live presidential news conference. In it, he announces that the Soviet Union has freed the 2 surviving crewmen of a USAF RB-47 reconnaissance plane shot down by Soviet flyers over the Barents Sea July 1, 1960 (see RB-47H shot down)."], ["1961-01-25T00:00:00", "Acting to halt 'leftist excesses', a junta composed of 2 army officers and 4 civilians takes over El Salvador, ousting another junta that had ruled for 3 months."], ["1961-01-25T00:00:00", "Jânio Quadros is elected president of Brazil. He later resigns on August 25."], ["1961-01-26T00:00:00", "President John F. Kennedy appoints Janet G. Travell to be his physician, the first woman to hold this appointment."], ["1961-01-30T00:00:00", "President John F. Kennedy delivers his first State of the Union Address."], ["1961-01-31T00:00:00", "Ham the Chimp, a 37-pound (17-kg) male, is rocketed into space aboard Mercury-Redstone 2, in a test of the Project Mercury capsule, designed to carry United States astronauts into space."], ["1961-02-01T00:00:00", "The United States tests its first Minuteman I intercontinental ballistic missile."], ["1961-02-03T00:00:00", "China buys grain from Canada for $60 million."], ["1961-02-04T00:00:00", "The Portuguese Colonial War begins in Angola."], ["1961-02-05T00:00:00", "February 9 - In Congo, President Joseph Kasa-Vubu names Joseph Iléo as the new Prime Minister."], ["1961-02-09T00:00:00", "The Beatles perform for the first time at The Cavern Club."], ["1961-02-12T00:00:00", "The USSR launches Venera 1 towards Venus."], ["1961-02-13T00:00:00", "The Congo government announces that villagers have killed Patrice Lumumba."], ["1961-02-14T00:00:00", "Discovery of the chemical elements: Element 103, Lawrencium, is first synthesized in Berkeley, California."], ["1961-02-15T00:00:00", "President Kennedy warns the Soviet Union to avoid interfering with the United Nations pacification of the Congo."], ["1961-02-15T00:00:00", "A Sabena Boeing 707 crashes near Brussels, Belgium, killing 73, including the entire United States figure skating team and several coaches."], ["1961-02-15T00:00:00", "A total solar eclipse occurs in the southern part of Europe."], ["1961-02-25T00:00:00", "The last public trams in Sydney, Australia, cease operation, bringing to an end the Southern Hemisphere's largest tramway network."], ["1961-02-26T00:00:00", "Hassan II is pronounced King of Morocco."], ["1961-03-01T00:00:00", "United States President John F. Kennedy establishes the Peace Corps."], ["1961-03-03T00:00:00", "Hassan II is crowned King of Morocco."], ["1961-03-08T00:00:00", "Max Conrad circumnavigates the earth in 8 days, 18 hours and 49 minutes, setting a new world record."], ["1961-03-08T00:00:00", "The first U.S. Polaris submarines arrive at Holy Loch."], ["1961-03-13T00:00:00", "Black and white £5 notes cease to be legal tender in the UK."], ["1961-03-13T00:00:00", "A dam bursts in Kiev, USSR, killing 145."], ["1961-03-13T00:00:00", "United States delegate to the United Nations Security Council Adlai Stevenson votes against Portuguese policies in Africa."], ["1961-03-13T00:00:00", "United States President John F. Kennedy proposes a long-term \"Alliance for Progress\" between the United States and Latin America."], ["1961-03-13T00:00:00", "Cyprus joins the Commonwealth of Nations, becoming the first small country in the Commonwealth."], ["1961-03-13T00:00:00", "Monash University in Melbourne, Australia, takes in its first students."], ["1961-03-13T00:00:00", "A second B-52 crashes near Yuba City, California after cabin pressure is lost and the fuel runs out. Two nuclear weapons are found unexploded."], ["1961-03-15T00:00:00", "South Africa withdraws from the Commonwealth of Nations. The nation rejoins the organization in 1994."], ["1961-03-15T00:00:00", "The Union of Peoples of Angola, led by Holden Roberto, attacks strategic locations in the north of Angola. These events result in the beginning of the colonial war with Portugal."], ["1961-03-18T00:00:00", "A ceasefire takes effect in the Algerian War of Independence."], ["1961-03-18T00:00:00", "Nous les amoureux by Jean-Claude Pascal (music by Jacques Datin, text by Maurice Vidalin) wins the Eurovision Song Contest 1961 for Luxembourg."], ["1961-03-29T00:00:00", "The Twenty-third Amendment to the United States Constitution is ratified, allowing residents of Washington, D.C. to vote in presidential elections."], ["1961-03-30T00:00:00", "The Single Convention on Narcotic Drugs is signed at New York."], ["1961-04-05T00:00:00", "The New Guinea Council of Western Papua is installed."], ["1961-04-08T00:00:00", "The British passenger ship Dara blows up and sinks off Dubai; 238 passengers and crew are killed."], ["1961-04-11T00:00:00", "The trial of Nazi Adolf Eichmann begins in Jerusalem."], ["1961-04-12T00:00:00", "Vostok 1: Soviet cosmonaut Yuri Gagarin becomes the first human in space, orbiting the Earth once."], ["1961-04-12T00:00:00", "Albert Kalonji takes the title Emperor Albert I Kalonji of South Kasai."], ["1961-04-13T00:00:00", "In Portugal, a coup attempt against António de Oliveira Salazar fails."], ["1961-04-17T00:00:00", "The Bay of Pigs Invasion of Cuba begins; it fails by April 19."], ["1961-04-17T00:00:00", "The 33rd Academy Awards ceremony is held."], ["1961-04-18T00:00:00", "Portugal sends to Angola its first military reinforcement."], ["1961-04-20T00:00:00", "Fidel Castro announces that the Bay of Pigs Invasion has been defeated."], ["1961-04-22T00:00:00", "Algiers putsch: Four French generals who oppose de Gaulle's policies in Algeria fail in a coup attempt."], ["1961-04-23T00:00:00", "Judy Garland performs in a legendary comeback concert at Carnegie Hall in New York City."], ["1961-04-24T00:00:00", "The Swedish ship Vasa is removed from the water after being sunk 333 years earlier."], ["1961-04-27T00:00:00", "President Kennedy urges newspapers to consider national interest in times of struggle against \"a monolithic and ruthless conspiracy\" in an address before the American Newspaper Publishers Association."], ["1961-04-27T00:00:00", "Sierra Leone becomes independent from the United Kingdom."], ["1961-05-04T00:00:00", "U.S. Freedom Riders begin interstate bus rides to test the new U.S. Supreme Court integration decision."], ["1961-05-05T00:00:00", "Mercury program: Alan Shepard becomes the first American in space aboard Mercury-Redstone 3."], ["1961-05-06T00:00:00", "Tottenham Hotspur F.C. becomes the first team in the 20th century to win the English league and cup double. This being the last time Tottenham won the English League."], ["1961-05-08T00:00:00", "Briton George Blake is sentenced to 42 years imprisonment for spying."], ["1961-05-09T00:00:00", "In a speech on \"Television and the Public Interest\" to the National Association of Broadcasters, FCC chairman Newton N. Minow describes commercial television programming as a \"vast wasteland\"."], ["1961-05-14T00:00:00", "African-American Civil Rights Movement: A Freedom Riders bus is fire-bombed near Anniston, Alabama and the civil rights protestors are beaten by an angry mob of Ku Klux Klan members."], ["1961-05-15T00:00:00", "J. Heinrich Matthaei alone performs the Poly-U-Experiment and is the first person to recognize and understand the genetic code. This is the birthdate of modern genetics."], ["1961-05-16T00:00:00", "Park Chung-hee takes over in a military coup in South Korea."], ["1961-05-19T00:00:00", "Venera 1 becomes the first man-made object to fly-by another planet by passing Venus (however, the probe had lost contact with Earth a month earlier and does not send back any data)."], ["1961-05-21T00:00:00", "African-American Civil Rights Movement: Alabama Governor John Patterson declares martial law in an attempt to restore order after race riots break out."], ["1961-05-22T00:00:00", "An Earthquake rocks New South Wales."], ["1961-05-24T00:00:00", "African-American Civil Rights Movement: Freedom Riders are arrested in Jackson, Mississippi for \"disturbing the peace\" after disembarking from their bus."], ["1961-05-25T00:00:00", "Apollo program: President Kennedy announces before a special joint session of Congress his goal to put a man on the Moon before the end of the decade."], ["1961-05-27T00:00:00", "Tunku Abdul Rahman, Prime Minister of Malaya, holds a press conference in Singapore, announcing his idea to form the Federation of Malaysia, comprising Malaya, Singapore, Sarawak, Brunei and North Borneo (Sabah)."], ["1961-05-28T00:00:00", "Peter Benenson's article \"The Forgotten Prisoners\" is published in several internationally read newspapers. This is later considered the founding of the human rights organization Amnesty International."], ["1961-05-30T00:00:00", "Rafael Leónidas Trujillo, totalitarian despot of the Dominican Republic since 1930, is killed in an ambush, putting an end to the second longest-running dictatorship in Latin American history."], ["1961-05-31T00:00:00", "In France, rebel generals Maurice Challe and Andre Zelelr are sentenced to 15 years in prison."], ["1961-05-31T00:00:00", "South Africa officially leaves the Commonwealth of Nations."], ["1961-05-31T00:00:00", "President John F. Kennedy and Charles de Gaulle meet in Paris."], ["1961-05-31T00:00:00", "Benfica beats Barcelona 3-2 at Wankdorf Stadium, Bern and wins the 1960-61 European Cup (football)."], ["1961-06-01T00:00:00", "Ethiopia experiences its most devastating earthquake of the 20th century, with a magnitude of 6.7. The town of Majete is destroyed, 45% of the houses in Karakore collapse, 17 kilometers (11 mi) of the main road north of Karakore are damaged by landslides and fissures, and 5,000 inhabitants in the area are left homeless."], ["1961-06-04T00:00:00", "Vienna summit: John F. Kennedy and Nikita Khrushchev meet during 2 days in Vienna. They discuss nuclear tests, disarmament and Germany."], ["1961-06-16T00:00:00", "Russian ballet dancer Rudolf Nureyev requests asylum in France while in Paris with the Kirov Ballet."], ["1961-06-17T00:00:00", "A Paris-to-Strasbourg train derails near Vitry-le-François; 24 are killed, 109 injured."], ["1961-06-17T00:00:00", "The New Democratic Party of Canada is founded with the merger of the Cooperative Commonwealth Federation (CCF) and the Canadian Labour Congress."], ["1961-06-19T00:00:00", "The British protectorate ends in Kuwait and it becomes an emirate."], ["1961-06-22T00:00:00", "Moise Tshombe is released for lack of evidence of connection to the murder of Patrice Lumumba."], ["1961-06-23T00:00:00", "The Antarctic Treaty comes into effect."], ["1961-06-25T00:00:00", "Iraqi president Abd al-Karim Qasim announces he is going to annex Kuwait (such an annexation of Kuwait would occur in 1990)."], ["1961-06-27T00:00:00", "Kuwait requests British help; the United Kingdom sends in troops."], ["1961-07-04T00:00:00", "The Soviet submarine K-19 reactor leak occurs in the North Atlantic."], ["1961-07-05T00:00:00", "The first Israeli rocket, Shavit 2, is launched."], ["1961-07-08T00:00:00", "A mine explosion in Czechoslovakia leaves 108 dead."], ["1961-07-12T00:00:00", "A Czechoslovakian Ilyushin Il-18 crashes while attempting to land at Casablanca, Morocco, killing all 72 persons on board."], ["1961-07-21T00:00:00", "Mercury program: Gus Grissom, piloting the Mercury-Redstone 4 capsule Liberty Bell 7, becomes the second American to go into space (sub-orbital). Upon splashdown, the hatch prematurely opens, and the capsule sinks (it is recovered in 1999)."], ["1961-07-25T00:00:00", "U.S. President John F. Kennedy gives a widely watched TV speech on the Berlin crisis, warning \"we will not be driven out of Berlin.\" Kennedy urges Americans to build fallout shelters, setting off a four-month debate on civil defense."], ["1961-07-31T00:00:00", "At Fenway Park in Boston, the first Major League Baseball All-Star Game tie occurs, when the game is stopped in the 9th inning due to rain (the only tie until 2002)."], ["1961-07-31T00:00:00", "Ireland submits the first ever application to join the then European Economic Community."], ["1961-08-01T00:00:00", "The Six Flags Over Texas theme park officially opens to the public."], ["1961-08-06T00:00:00", "Vostok 2: Soviet cosmonaut Gherman Titov becomes the second human to orbit the Earth, and the first to be in outer space for more than one day."], ["1961-08-07T00:00:00", "Vostok 2 (with Titov on board) lands in the Soviet Union."], ["1961-08-10T00:00:00", "Britain applies for membership in the European Economic Community."], ["1961-08-13T00:00:00", "Construction of the Berlin Wall begins, restricting movement between East Berlin and West Berlin and forming a clear boundary between West Germany and East Germany, Western Europe and Eastern Europe."], ["1961-08-21T00:00:00", "Jomo Kenyatta is released from prison in Kenya."], ["1961-08-25T00:00:00", "João Goulart replaces Jânio Quadros as President of Brazil. He is later ousted in 1964."], ["1961-09-01T00:00:00", "The Eritrean War of Independence officially begins with the shooting of the Ethiopian police by Hamid Idris Awate."], ["1961-09-01T00:00:00", "The first meeting is held of the Non-Aligned Movement. The Soviet Union resumes nuclear testing, escalating fears over the ongoing Berlin crisis."], ["1961-09-07T00:00:00", "Tom and Jerry make a return with their first episode since 1957, Switchin' Kitten. The new creator, Gene Deitch, makes 12 more Tom and Jerry episodes until 1962."], ["1961-09-10T00:00:00", "During the F1 Italian Grand Prix on the circuit of Monza, German Wolfgang von Trips, driving a Ferrari, crashes into a stand, killing 14 spectators and himself."], ["1961-09-14T00:00:00", "The new military government of Turkey sentences 15 members of the previous government to death."], ["1961-09-14T00:00:00", "The Focolare Movement opens its first North American center in New York."], ["1961-09-17T00:00:00", "Military rulers in Turkey hang former prime minister Adnan Menderes."], ["1961-09-18T00:00:00", "United Nations Secretary-General Dag Hammarskjöld dies in an air crash en route to Katanga, Congo."], ["1961-09-21T00:00:00", "In France, the OAS slips an anti-de Gaulle message into TV programming."], ["1961-09-24T00:00:00", "The old Deutsche Opernhaus in the Berlin neighborhood of Charlottenburg is returned to its newly rebuilt house as the Deutsche Oper Berlin."], ["1961-09-24T00:00:00", "In the U.S., the Walt Disney anthology television series, renamed Walt Disney's Wonderful World of Color, moves from ABC to NBC after seven years on the air, and begins telecasting its programs in color for the first time. Years later, after Disney's death, the still-on-the-air program will be renamed The Wonderful World of Disney."], ["1961-09-28T00:00:00", "A military coup in Damascus, Syria effectively ends the United Arab Republic, the union between Egypt and Syria."], ["1961-09-30T00:00:00", "The Organisation for Economic Co-operation and Development (OECD) is formed to replace the Organisation for European Economic Co-operation (OEEC)."], ["1961-10-01T00:00:00", "Baseball player Roger Maris of the New York Yankees hits his 61st home run in the last game of the season, against the Boston Red Sox, beating the 34-year-old record held by Babe Ruth."], ["1961-10-10T00:00:00", "A volcanic eruption on Tristan da Cunha causes the whole population to be evacuated."], ["1961-10-12T00:00:00", "The death penalty is abolished in New Zealand."], ["1961-10-17T00:00:00", "Paris massacre of 1961: French police in Paris attack about 30,000 protesting a curfew applied solely to Algerians. The official death toll is 3, but human rights groups claim 240 dead."], ["1961-10-18T00:00:00", "West Side Story is released as a film."], ["1961-10-19T00:00:00", "The Arab League takes over protecting Kuwait; the last British troops leave."], ["1961-10-25T00:00:00", "The first edition of Private Eye, the British satirical magazine, is published."], ["1961-10-26T00:00:00", "Cemal Gürsel becomes the fourth president of Turkey. (His former title was head of state and government. By constitution referendum, he is elected as president.)"], ["1961-10-27T00:00:00", "An armistice begins in Katanga, Congo."], ["1961-10-27T00:00:00", "Mongolia and Mauritania join the United Nations."], ["1961-10-27T00:00:00", "Confrontation at Checkpoint Charlie: A standoff between Soviet and American tanks in Berlin, Germany heightens Cold War tensions."], ["1961-10-27T00:00:00", "Fahrettin Özdilek becomes the acting prime minister of Turkey."], ["1961-10-29T00:00:00", "DZBB-TV Channel 7, the Philippines' third TV station, is launched."], ["1961-10-29T00:00:00", "Devrim has been released. The project was completed only in 130 days almost from scratch and this period includes decision of the project, research, design, development and production of four cars."], ["1961-10-30T00:00:00", "Nuclear weapons testing: The Soviet Union detonates a 58-megaton yield hydrogen bomb known as Tsar Bomba over Novaya Zemlya. It remains the largest ever man-made explosion."], ["1961-10-30T00:00:00", "The Note Crisis: The Soviet Union issues a diplomatic note to Finland proposing military co-operation."], ["1961-10-31T00:00:00", "Hurricane Hattie devastates Belize City, Belize killing over 270. After the hurricane, the capital moves to the inland city of Belmopan."], ["1961-10-31T00:00:00", "Joseph Stalin's body is removed from the Lenin Mausoleum."], ["1961-11-01T00:00:00", "The Hungry generation Movement is launched in Calcutta, India."], ["1961-11-01T00:00:00", "The Interstate Commerce Commission's federal order banning segregation at all interstate public facilities officially comes into effect."], ["1961-11-01T00:00:00", "The Madame Alexander Doll Club is founded by Margaret Doris Winson of Sweet Springs MO."], ["1961-11-02T00:00:00", "Kean opens at Broadway Theater in New York City for 92 performances."], ["1961-11-03T00:00:00", "The United Nations General Assembly unanimously elects U Thant to the position of acting Secretary-General."], ["1961-11-06T00:00:00", "The U.S. government issues a stamp honoring the 100th birthday of James Naismith."], ["1961-11-08T00:00:00", "Imperial Airlines Flight 201/8 crashes while attempting to land at Richmond, Virginia, killing 77 persons on board."], ["1961-11-09T00:00:00", "Neil Armstrong records a world record speed in a rocket plane of 6,587 km/h flying a X-15."], ["1961-11-10T00:00:00", "Catch-22 is first published by Joseph Heller."], ["1961-11-11T00:00:00", "Congolese soldiers murder 13 Italian United Nations pilots."], ["1961-11-11T00:00:00", "Stalingrad is renamed Volgograd."], ["1961-11-17T00:00:00", "Michael Rockefeller, son of New York Governor and later Vice President Nelson Rockefeller, disappears in the jungles of New Guinea."], ["1961-11-18T00:00:00", "U.S. President John F. Kennedy sends 18,000 military advisors to South Vietnam."], ["1961-11-20T00:00:00", "The funeral of longtime House Speaker Sam Rayburn is held in Washington, D.C. Two former Presidents (Truman, Eisenhower) and one future one (Lyndon B. Johnson) join President Kennedy in paying their respects."], ["1961-11-20T00:00:00", "İsmet İnönü of CHP forms the new government of Turkey (26th government, first coalition in Turkey, partner AP)"], ["1961-11-24T00:00:00", "The World Food Programme (WFP) is formed as a temporary United Nations program."], ["1961-11-30T00:00:00", "The Soviet Union vetoes Kuwait's application for United Nations membership."], ["1961-12-01T00:00:00", "Netherlands New Guinea raises the new Morning Star flag and changes its name to West Papua."], ["1961-12-02T00:00:00", "Cold War: In a nationally broadcast speech, Cuban leader Fidel Castro announces he is a Marxist-Leninist, and that Cuba will adopt socialism."], ["1961-12-05T00:00:00", "U.S. President John F. Kennedy gives support to the Volta Dam project in Ghana."], ["1961-12-09T00:00:00", "Tanganyika gains independence and declares itself a republic, with Julius Nyerere as its first President."], ["1961-12-09T00:00:00", "The Australian government of Robert Menzies is re-elected for a sixth term."], ["1961-12-10T00:00:00", "The Soviet Union severs diplomatic relations with Albania."], ["1961-12-11T00:00:00", "The American involvement in the Vietnam War officially begins, as the first American helicopters arrive in Saigon along with 400 U.S. personnel."], ["1961-12-11T00:00:00", "Adolf Eichmann is pronounced guilty of crimes against humanity by a panel of 3 Israeli judges."], ["1961-12-14T00:00:00", "Walt Disney's first live-action Technicolor musical, Babes in Toyland, a remake of the famous Victor Herbert operetta, is released, but flops at the box office."], ["1961-12-15T00:00:00", "An Israeli war crimes tribunal sentences Adolf Eichmann to die for his part in The Holocaust."], ["1961-12-17T00:00:00", "A circus tent fire in Niterói, Brazil kills 323."], ["1961-12-18T00:00:00", "India opens hostilities in its annexation of Portuguese India, the colonies of Goa, Damao and Diu."], ["1961-12-19T00:00:00", "The Portuguese surrender Goa to India after 400 years of Portuguese rule."], ["1961-12-19T00:00:00", "Indonesian president Sukarno announces that he will take West Irian by force if necessary."], ["1961-12-21T00:00:00", "In Congo, Katangan prime minister Moise Tshombe recognizes the Congolese constitution."], ["1961-12-23T00:00:00", "Luxembourg's national holiday, the Grand Duke's Official Birthday, is set on June 23 by Grand Ducal decree."], ["1961-12-30T00:00:00", "Congolese troops capture Albert Kalonji of South Kasai (who soon escapes)."], ["1961-12-31T00:00:00", "Ireland's first national television station, Telefís Éireann (later RTÉ), begins broadcasting."]]