[["1966-01-01T00:00:00", "In a coup, Colonel Jean-Bédel Bokassa takes over as military ruler of the Central African Republic, ousting President David Dacko."], ["1966-01-02T00:00:00", "A strike of public transportation workers in New York City begins (it would end January 13)."], ["1966-01-03T00:00:00", "The first Acid Test is conducted at the Fillmore, San Jose."], ["1966-01-04T00:00:00", "A military coup occurs in Upper Volta (later Burkina Faso)."], ["1966-01-04T00:00:00", "The prime ministers of India and Pakistan meet in Moscow."], ["1966-01-04T00:00:00", "A gas leak fire at the Feyzin oil refinery near Lyon, France, kills 18 and injures 84."], ["1966-01-10T00:00:00", "Pakistani-Indian peace negotiations end successfully in Tashkent. Indian prime minister Lal Bahadur Shastri dies the next day."], ["1966-01-10T00:00:00", "The French paper L'Express publishes a story of Georges Figon, who took part in the kidnapping of Mehdi Ben Barka."], ["1966-01-10T00:00:00", "Georgia House of Representatives refuses to seat Julian Bond."], ["1966-01-10T00:00:00", "Home of civil rights activist Vernon Dahmer in Hattiesburg, Mississippi, is firebombed. Dahmer's family escapes but he dies the next day from severe burns. (White Knights of the Ku Klux Klan Imperial Wizard Samuel Bowers will be unsuccessfully tried for this murder on four occasions, and then convicted in 1998.)"], ["1966-01-10T00:00:00", "Commonwealth Prime Ministers' Conference convenes in Lagos, Nigeria."], ["1966-01-11T00:00:00", "A conference on Rhodesia begins in Lagos, Nigeria."], ["1966-01-11T00:00:00", "The first SR-71 Blackbird spy plane goes into service at Beale AFB."], ["1966-01-12T00:00:00", "United States President Lyndon Johnson states that the United States should stay in South Vietnam until Communist aggression there is ended."], ["1966-01-13T00:00:00", "Robert C. Weaver becomes the first African American Cabinet member, by being appointed United States Secretary of Housing and Urban Development."], ["1966-01-15T00:00:00", "A bloody military coup is staged in Nigeria, deposing the civilian government."], ["1966-01-17T00:00:00", "The Nigerian coup is overturned by another faction of the military, leaving a military government in power. This is the beginning of a long period of military rule."], ["1966-01-17T00:00:00", "A B-52 bomber collides with a KC-135 Stratotanker over Spain, dropping three 70-kiloton hydrogen bombs near the town of Palomares, and one into the sea, in the 1966 Palomares B-52 crash."], ["1966-01-17T00:00:00", "Carl Brashear, the first African American United States Navy diver, is involved in an accident during the recovery of a lost H-bomb which results in the amputation of his leg."], ["1966-01-18T00:00:00", "French police announce that Georges Figon has committed suicide, prior to his arrest for the kidnapping of Mehdi Ben Barka."], ["1966-01-18T00:00:00", "About 8,000 U.S. soldiers land in South Vietnam; U.S. troops now total 190,000."], ["1966-01-19T00:00:00", "Indira Gandhi is elected Prime Minister of India; she is sworn in January 24."], ["1966-01-20T00:00:00", "Demonstrations occur against high food prices in Hungary."], ["1966-01-21T00:00:00", "Italian Prime Minister Aldo Moro resigns due to a power struggle in his party."], ["1966-01-22T00:00:00", "The military government of Nigeria announces that ex-prime minister Abubakar Tafawa Balewa was killed during the coup."], ["1966-01-22T00:00:00", "The Chadian Muslim insurgent group FROLINAT is founded in Sudan, starting the Chadian Civil War."], ["1966-01-24T00:00:00", "Air India Flight 101 crashes into Mont Blanc, killing all 117 persons on board, including Dr. Homi J. Bhabha, chairman of the Indian Atomic Energy Commission."], ["1966-01-26T00:00:00", "Harold Holt becomes Prime Minister of Australia when Robert Menzies retires."], ["1966-01-26T00:00:00", "Beaumont children disappearance: Three children disappear on their way to Glenelg, South Australia, never to be seen again."], ["1966-01-27T00:00:00", "The British government promises the U.S. that British troops in Malaysia will stay until more peaceful conditions occur in the region."], ["1966-01-27T00:00:00", "Britain's Labour Party unexpectedly retains the parliamentary seat of Hull North in a by-election, with a swing of 4.5% to their candidate from the opposition Conservatives, and a majority up from 1,181 at the 1964 General Election to 5,351."], ["1966-01-29T00:00:00", "The first of 608 performances of Sweet Charity opens at the Palace Theatre in New York City."], ["1966-01-31T00:00:00", "The United Kingdom ceases all trade with Rhodesia."], ["1966-02-01T00:00:00", "West Germany procures some 2,600 political prisoners from East Germany."], ["1966-02-03T00:00:00", "The unmanned Soviet Luna 9 spacecraft makes the first controlled rocket-assisted landing on the Moon."], ["1966-02-04T00:00:00", "All Nippon Airways Flight 60 plunges into Tokyo Bay; 133 are killed."], ["1966-02-06T00:00:00", "The TV series Mister Ed airs its final episode (ran 1961-66)."], ["1966-02-07T00:00:00", "Lyndon Johnson of the United States and Nguyễn Cao Kỳ of South Vietnam convene with other officials in Honolulu, Hawaii to discuss the course of the Vietnam War."], ["1966-02-08T00:00:00", "The National Hockey League announces it will expand to 12 teams for the 1967 season."], ["1966-02-10T00:00:00", "Soviet writers Yuli Daniel and Andrei Sinyavsky are sentenced to 5 and 7 years, respectively, for 'anti-Soviet' writings."], ["1966-02-12T00:00:00", "Vietnam War: The Tây Vinh Massacre occurs."], ["1966-02-14T00:00:00", "The Australian dollar is introduced at a rate of 2 dollars per pound, or 10 shillings per dollar."], ["1966-02-19T00:00:00", "The naval minister of the United Kingdom, Christopher Mayhew, resigns."], ["1966-02-20T00:00:00", "While Soviet author and translator Valery Tarsis is abroad, the Soviet Union negates his citizenship."], ["1966-02-23T00:00:00", "An intra-party military coup d'état in Syria replaces the previous government of Amin al-Hafiz by one led by Salah Jadid."], ["1966-02-24T00:00:00", "A coup d'état led by the police and military of Ghana raises the National Liberation Council to power while president Kwame Nkrumah is abroad."], ["1966-02-26T00:00:00", "Gò Dài massacre: Vietnam War."], ["1966-02-26T00:00:00", "A curfew is declared in Jakarta, Indonesia."], ["1966-02-28T00:00:00", "British Prime Minister Harold Wilson calls a General Election in the United Kingdom, to be held on 31 March."], ["1966-02-28T00:00:00", "U.S. astronauts Charles Bassett and Elliot See are killed in an aircraft accident in St. Louis, Missouri."], ["1966-03-01T00:00:00", "The British Government announces plans for the decimalisation of the pound sterling (hitherto denominated in 20 shillings and 240 pence to the £), to come into force in February 1971 (Decimal Day)."], ["1966-03-01T00:00:00", "Soviet space probe Venera 3 crashes on Venus, becoming the first spacecraft to land on another planet's surface."], ["1966-03-01T00:00:00", "The Ba'ath Party takes power in Syria."], ["1966-03-01T00:00:00", "The Frost Report, which launched the television careers of John Cleese, Ronnie Barker and Ronnie Corbett and also the careers of other writers and performers, is first broadcast on BBC."], ["1966-03-02T00:00:00", "Kwame Nkrumah arrives in Guinea and is granted asylum."], ["1966-03-04T00:00:00", "Canadian Pacific Air Lines Flight 402 crashes during a night landing in poor visibility at Tokyo International Airport in Japan, killing 64 of 72 persons on board."], ["1966-03-04T00:00:00", "In an interview with London Evening Standard reporter Maureen Cleave, John Lennon of The Beatles states that they are \"more popular than Jesus now\"."], ["1966-03-05T00:00:00", "BOAC Flight 911 crashes in severe clear-air turbulence over Mount Fuji soon after taking off from Tokyo International Airport in Japan, killing all 124 on board."], ["1966-03-05T00:00:00", "A massive theft of nuclear materials is revealed in Brazil."], ["1966-03-05T00:00:00", "Merci Chérie by Udo Jürgens (music by Udo Jürgens, lyrics by Udo Jürgens and Thomas Hörbiger) wins the Eurovision Song Contest 1966 for Austria."], ["1966-03-07T00:00:00", "Charles de Gaulle asks U.S. President Lyndon B. Johnson for negotiations about the state of NATO equipment in France."], ["1966-03-08T00:00:00", "Anti-communist demonstrations occur at the Indonesian Foreign Ministry."], ["1966-03-08T00:00:00", "Vietnam War: The U.S. announces it will substantially increase the number of its troops in Vietnam."], ["1966-03-08T00:00:00", "Nelson's Pillar in O'Connell Street, Dublin, is clandestinely blown up by former Irish Republican Army volunteers marking this year's 50th anniversary of the Easter Rising."], ["1966-03-09T00:00:00", "Ronnie, one of the Kray twins, shoots George Cornell (an associate of rivals The Richardson Gang) dead at The Blind Beggar pub in Whitechapel, east London, a crime for which he is finally convicted in 1969."], ["1966-03-10T00:00:00", "Crown Princess Beatrix of the Netherlands marries Claus von Amsberg. Some spectators demonstrate against the groom because he is German."], ["1966-03-11T00:00:00", "Transition to the New Order in Indonesia: President Sukarno gives all executive powers to General Suharto by signing the 'Supersemar' order."], ["1966-03-11T00:00:00", "French President Charles de Gaulle states that French troops will be taken out of NATO and that all French NATO bases and HQ's must be closed within a year."], ["1966-03-12T00:00:00", "Bobby Hull of the Chicago Blackhawks sets the National Hockey League single season scoring record against the New York Rangers with his 51st goal."], ["1966-03-16T00:00:00", "NASA spacecraft Gemini 8 (David Scott, Neil Armstrong) conducts the first docking in space, with an Agena target vehicle."], ["1966-03-17T00:00:00", "More anti-communist demonstrations occur in Indonesia."], ["1966-03-17T00:00:00", "Off the Mediterranean coast of Spain, the United States Navy submersible DSV Alvin finds a missing U.S. hydrogen bomb."], ["1966-03-19T00:00:00", "The Texas Western Miners defeat the Kentucky Wildcats with five African-American starters, ushering in desegregation in athletic recruiting."], ["1966-03-20T00:00:00", "Football's Jules Rimet Trophy is stolen whilst on exhibition in London; it is found 7 days later by a mongrel dog named \"Pickles\" and his owner David Corbett, wrapped in newspaper in a south London garden."], ["1966-03-22T00:00:00", "In Washington, D.C., General Motors President James M. Roche appears before a Senate subcommittee, and apologizes to consumer advocate Ralph Nader for the company's intimidation and harassment campaign against him."], ["1966-03-23T00:00:00", "Pope Paul VI and Michael Ramsey, the Archbishop of Canterbury, meet in Rome."], ["1966-03-26T00:00:00", "Demonstrations are held across the United States against the Vietnam War."], ["1966-03-27T00:00:00", "In South Vietnam, 20,000 Buddhists march in demonstrations against the policies of the military government."], ["1966-03-28T00:00:00", "Cevdet Sunay becomes the fifth president of Turkey."], ["1966-03-28T00:00:00", "Indira Gandhi visits Washington, D.C."], ["1966-03-29T00:00:00", "The 23rd Communist Party Conference is held in the Soviet Union; Leonid Brezhnev demands that U.S. troops leave Vietnam, and announces that Chinese-Soviet relations are not satisfactory."], ["1966-03-31T00:00:00", "The British Labour Party led by Harold Wilson wins the United Kingdom General Election, gaining a 96-seat majority (compared with a single seat majority when the election was called on 28 February)."], ["1966-03-31T00:00:00", "The Soviet Union launches Luna 10, which later becomes the first space probe to enter orbit around the Moon."], ["1966-04-02T00:00:00", "The Indonesian army demands that the country rejoin the United Nations."], ["1966-04-03T00:00:00", "Luna 10 is the first manmade object to enter lunar orbit."], ["1966-04-07T00:00:00", "The United Kingdom asks the United Nations Security Council for authority to use force to stop oil tankers that violate the embargo against Rhodesia (authority is given April 10)."], ["1966-04-08T00:00:00", "Buddhists in South Vietnam protest against the fact that the new government has not set a date for free elections."], ["1966-04-08T00:00:00", "Leonid Brezhnev becomes General Secretary of the Soviet Union, as well as Leader of the Communist Party of the U.S.S.R."], ["1966-04-08T00:00:00", "Time magazine cover story asks \"Is God Dead?\"."], ["1966-04-09T00:00:00", "The captain of English football league club Norwich City F.C., Barry Butler, is killed in a car accident."], ["1966-04-13T00:00:00", "United States' magazine Time's cover story is ‘London: The Swinging City’"], ["1966-04-13T00:00:00", "United States president Lyndon Johnson signs the 1966 Uniform Time Act, dealing with daylight saving time."], ["1966-04-14T00:00:00", "Kenyan Vice President Oginga Odinga resigns, saying \"invisible government\" representing foreign interests now runs the country. Will head a new party, the Kenya People's Union."], ["1966-04-14T00:00:00", "The South Vietnamese government promises free elections in 3-5 months."], ["1966-04-15T00:00:00", "An anti-Nasser conspiracy is exposed in Egypt."], ["1966-04-18T00:00:00", "China declares that it will stop economic aid to Indonesia."], ["1966-04-18T00:00:00", "The 38th Academy Awards ceremony is held."], ["1966-04-19T00:00:00", "Bobbi Gibb becomes the first woman to run the Boston Marathon."], ["1966-04-21T00:00:00", "An artificial heart is installed in the chest of Marcel DeRudder in a Houston, Texas hospital."], ["1966-04-21T00:00:00", "The opening of the Parliament of the United Kingdom is televised for the first time."], ["1966-04-21T00:00:00", "Haile Selassie visits Jamaica for the first time, meeting with Rasta leaders."], ["1966-04-21T00:00:00", "Ian Brady and Myra Hindley go on trial at Chester Crown Court, for the murders of 3 children who vanished between November 1963 and October 1965."], ["1966-04-24T00:00:00", "Uniform daylight saving time is first observed in most parts of North America."], ["1966-04-26T00:00:00", "A new government is formed in the Republic of the Congo, led by Ambroise Noumazalaye."], ["1966-04-26T00:00:00", "Tashkent, the largest city in Soviet Central Asia is mostly destroyed by a huge earthquake"], ["1966-04-27T00:00:00", "Pope Paul VI and Soviet Foreign Minister Andrei Gromyko meet in the Vatican (the first meeting between leaders of the Roman Catholic Church and the Soviet Union)."], ["1966-04-28T00:00:00", "In Rhodesia, security forces kill 7 ZANLA men in combat; Chimurenga, the ZANU rebellion, begins."], ["1966-04-29T00:00:00", "U.S. troops in Vietnam total 250,000."], ["1966-04-30T00:00:00", "Regular hovercraft service begins over the English Channel (discontinued in 2000 due to the Channel Tunnel)."], ["1966-04-30T00:00:00", "The Church of Satan is formed by Anton Szandor LaVey in San Francisco."], ["1966-05-01T00:00:00", "Floods occur on the Finnish coast."], ["1966-05-03T00:00:00", "Swinging Radio England and Britain Radio commence broadcasting on AM, with a combined potential 100,000 watts, from the same ship anchored off the south coast of England in international waters."], ["1966-05-04T00:00:00", "Fiat signs a contract with the Soviet government to build a car factory in the Soviet Union."], ["1966-05-05T00:00:00", "The Montreal Canadiens defeat the Detroit Red Wings to win the Stanley Cup."], ["1966-05-06T00:00:00", "The Moors murders trial ends with Ian Brady being found guilty on all 3 counts of murder and sentenced to 3 concurrent terms of life imprisonment. Myra Hindley is convicted on 2 counts of murder and of being an accessory in the third murder committed by Brady, and receives 2 concurrent terms of life imprisonment and a 7-year fixed term for being an accessory."], ["1966-05-07T00:00:00", "Irish bank workers go on strike."], ["1966-05-12T00:00:00", "African members of the UN Security Council say that the British army should blockade Rhodesia."], ["1966-05-12T00:00:00", "The Busch Memorial Stadium opens in St Louis, Missouri."], ["1966-05-12T00:00:00", "Radio Peking claims that U.S. planes have shot down a Chinese plane over Yunnan (the U.S. denies the story the next day)."], ["1966-05-14T00:00:00", "Turkey and Greece intend to start negotiations about the situation in Cyprus."], ["1966-05-15T00:00:00", "Indonesia asks Malaysia for peace negotiations."], ["1966-05-15T00:00:00", "The South Vietnamese army besieges Da Nang."], ["1966-05-15T00:00:00", "Tens of thousands of anti-war demonstrators again picket the White House, then rally at the Washington Monument."], ["1966-05-16T00:00:00", "The Communist Party of China issues the 'May 16 Notice', marking the beginning of the Cultural Revolution."], ["1966-05-16T00:00:00", "A seamen's strike is called in Britain."], ["1966-05-16T00:00:00", "The legendary album Pet Sounds by The Beach Boys is released."], ["1966-05-16T00:00:00", "Bob Dylan's seminal album, Blonde on Blonde is released in the U.S."], ["1966-05-16T00:00:00", "In New York City, Dr. Martin Luther King Jr. makes his first public speech on the Vietnam War."], ["1966-05-19T00:00:00", "Gertrude Baniszewski is found guilty of murdering and torturing Sylvia Likens and is sentenced to life in prison (she is released on parole in December 1985)."], ["1966-05-24T00:00:00", "Battle of Mengo Hill: Ugandan army troops arrest Mutesa II of Buganda and occupy his palace."], ["1966-05-24T00:00:00", "The Nigerian government forbids all political activity in the country until January 17, 1969."], ["1966-05-25T00:00:00", "Explorer program: - No. 9 Squadron RAAF becomes part of the 4,500 strong Australian Task Force assigned to duties in Vietnam, leaving for Southeast Asia aboard the aircraft carrier HMAS Sydney."], ["1966-05-26T00:00:00", "Guyana achieves independence."], ["1966-05-28T00:00:00", "It's a Small World opens at Disneyland."], ["1966-05-28T00:00:00", "Fidel Castro declares martial law in Cuba because of a possible U.S. attack."], ["1966-05-28T00:00:00", "The Indonesian and Malaysian governments declare that the Indonesia-Malaysia confrontation is over (a treaty is signed on August 11)."], ["1966-05-31T00:00:00", "The Philippines reestablishes diplomatic relations with Malaysia."], ["1966-06-01T00:00:00", "The final new episode of The Dick Van Dyke Show airs (the first episode aired on October 3, 1961)."], ["1966-06-01T00:00:00", "White House Conference on Civil Rights"], ["1966-06-02T00:00:00", "Éamon de Valera is re-elected as Irish president."], ["1966-06-02T00:00:00", "Surveyor program: Surveyor 1 lands in Oceanus Procellarum on the Moon, becoming the first U.S. spacecraft to soft-land on another world."], ["1966-06-02T00:00:00", "Four former cabinet ministers including Évariste Kimba are executed in the Democratic Republic of the Congo, for alleged involvement in a plot to kill Mobutu Sese Seko."], ["1966-06-03T00:00:00", "Joaquín Balaguer is elected president of the Dominican Republic."], ["1966-06-05T00:00:00", "Gemini 9: Gene Cernan completes the second U.S. spacewalk (2 hours, 7 minutes)."], ["1966-06-06T00:00:00", "Civil rights activist James Meredith is shot while traversing Mississippi in the March Against Fear."], ["1966-06-08T00:00:00", "An XB-70 Valkyrie prototype is destroyed in a mid-air collision with a F-104 Starfighter chase plane during a photo shoot. NASA pilot Joseph A. Walker and USAF test pilot Carl Cross are both killed."], ["1966-06-08T00:00:00", "Topeka, Kansas is devastated by a tornado that registers as an \"F5\" on the Fujita scale, the first to exceed US $100 million in damages. Sixteen people are killed, hundreds more injured, and thousands of homes damaged or destroyed, and the campus of Washburn University suffers catastrophic damage."], ["1966-06-12T00:00:00", "Chicago's Division Street riots begin, in response to police shooting of a young Puerto Rican man."], ["1966-06-13T00:00:00", "Miranda v. Arizona: The Supreme Court of the United States rules that the police must inform suspects of their rights before questioning them."], ["1966-06-14T00:00:00", "The Vatican abolishes the Index Librorum Prohibitorum (index of banned books)."], ["1966-06-17T00:00:00", "An Air France personnel strike begins."], ["1966-06-18T00:00:00", "CIA chief William Raborn resigns; Richard Helms becomes his successor."], ["1966-06-20T00:00:00", "French President Charles de Gaulle starts his visit to the Soviet Union."], ["1966-06-21T00:00:00", "Opposition leader Arthur Calwell is shot after attending a political meeting in Mosman, Sydney, Australia."], ["1966-06-27T00:00:00", "Frank Zappa and The Mothers of Invention's debut album, Freak Out!, is released. It is an initial failure, but gains a massive cult following in subsequent years."], ["1966-06-27T00:00:00", "The gothic soap opera Dark Shadows premieres on ABC."], ["1966-06-28T00:00:00", "In Argentina, a junta calling itself Revolución Argentina deposes president Arturo Umberto Illia in a coup, and appoints General Juan Carlos Onganía to lead."], ["1966-06-29T00:00:00", "Juan Carlos Onganía comes to power in \"Argentine Revolution\" coup d'état."], ["1966-06-29T00:00:00", "A sailors' strike, organised by the National Union of Seamen, ends in the United Kingdom."], ["1966-06-29T00:00:00", "Vietnam War: U.S. planes begin bombing Hanoi and Haiphong."], ["1966-06-30T00:00:00", "France formally leaves NATO."], ["1966-06-30T00:00:00", "The National Organization for Women (NOW) is founded in Washington, D.C."], ["1966-07-01T00:00:00", "Joaquín Balaguer becomes president of the Dominican Republic."], ["1966-07-03T00:00:00", "31 people are arrested when a demonstration by approximately 4,000 anti-Vietnam War protesters in front of the U.S. Embassy in London's Grosvenor Square turns violent"], ["1966-07-03T00:00:00", "René Barrientos is elected president of Bolivia."], ["1966-07-04T00:00:00", "North Vietnam declares general mobilization."], ["1966-07-04T00:00:00", "American President Lyndon B. Johnson signs the Freedom of Information Act, which goes into effect the following year."], ["1966-07-04T00:00:00", "Congress of Racial Equality (CORE) endorses goal of black power at well-attended convention in Baltimore. Martin Luther King, Jr., and Roy Wilkins criticize this declaration."], ["1966-07-06T00:00:00", "Malawi becomes a republic."], ["1966-07-07T00:00:00", "A Warsaw Pact conference ends with a promise to support North Vietnam."], ["1966-07-08T00:00:00", "King Mwambutsa IV Bangiriceng of Burundi is deposed by his son Ntare V, who is in turn deposed by prime minister Michel Micombero."], ["1966-07-11T00:00:00", "The 1966 FIFA World Cup begins in England."], ["1966-07-11T00:00:00", "British Motor Corporation and Jaguar Cars announce plans to merge as British Motor Holdings."], ["1966-07-12T00:00:00", "Indira Gandhi visits Moscow."], ["1966-07-12T00:00:00", "Zambia threatens to leave the Commonwealth of Nations because of British peace overtures to Rhodesia."], ["1966-07-13T00:00:00", "The International Society for Krishna Consciousness is founded in New York City by A. C. Bhaktivedanta Swami Prabhupada."], ["1966-07-14T00:00:00", "Israeli and Syrian jet fighters clash over the Jordan River."], ["1966-07-14T00:00:00", "Richard Speck murders 8 student nurses in their Chicago dormitory. He is arrested on July 17."], ["1966-07-14T00:00:00", "Gwynfor Evans, President of Plaid Cymru, becomes Member of the United Kingdom Parliament for Carmarthen, taking the previously Labour-held Welsh seat at a by-election with a majority of 2,435 on an 18% swing, and giving Plaid Cymru its first representation at Westminster in its forty-one year history."], ["1966-07-16T00:00:00", "British Prime Minister Harold Wilson flies to Moscow to try to start peace negotiations about the Vietnam War (the Soviet government rejects his ideas)."], ["1966-07-18T00:00:00", "Gemini 10 (John Young, Michael Collins) is launched. After docking with an Agena target vehicle, the astronauts then set a world altitude record of 474 miles (763 km)."], ["1966-07-18T00:00:00", "The Hough Riots break out in Cleveland, Ohio, the city's first race riot."], ["1966-07-18T00:00:00", "Australian children's television series Play School airs for the first time, going on to become the longest-running children's show in Australia, and the second longest running children's show in the world."], ["1966-07-22T00:00:00", "The Chinese government declares Dutch delegate G. J. Jongejans persona non grata, but tells him not to leave the country before a group of Chinese engineers has left the Netherlands."], ["1966-07-23T00:00:00", "Katangese troops in Stanleyville, Congo, revolt for several weeks in support of the exiled minister Moise Tshombe."], ["1966-07-24T00:00:00", "U.N. Secretary General U Thant visits Moscow."], ["1966-07-26T00:00:00", "Lord Gardiner issues the Practice Statement in the House of Lords, stating that the House is not bound to follow its own previous precedent."], ["1966-07-28T00:00:00", "The U.S. announces that a Lockheed U-2 reconnaissance plane has disappeared over Cuba."], ["1966-07-29T00:00:00", "A military counter-coup in Nigeria: army officers from the north of the country execute head of state General Aguiyi-Ironsi an install Yakubu Gowon."], ["1966-07-29T00:00:00", "La Noche de los Bastones Largos: Junta takes over Argentine universities."], ["1966-07-29T00:00:00", "Bob Dylan is injured in a motorcycle accident near his home in Woodstock, New York. He is not seen in public for over a year."], ["1966-07-30T00:00:00", "England beats West Germany 4-2 to win the 1966 FIFA World Cup at Wembley after extra time."], ["1966-08-01T00:00:00", "Sniper Charles Whitman kills 14 people and wounds 32 from atop the University of Texas at Austin Main Building tower, after earlier killing his wife and mother."], ["1966-08-01T00:00:00", "British Colonial Office merges with Commonwealth Relations Office to form new Commonwealth Office."], ["1966-08-02T00:00:00", "The Spanish government forbids overflights of British military aircraft."], ["1966-08-05T00:00:00", "Groundbreaking takes place for the World Trade Center."], ["1966-08-05T00:00:00", "Martin Luther King Jr. leads a civil rights march in Chicago, during which he is struck by a rock thrown from an angry white mob."], ["1966-08-05T00:00:00", "The Caesars Palace hotel and casino opens in Las Vegas."], ["1966-08-05T00:00:00", "The Beatles' Revolver LP is released in the United Kingdom."], ["1966-08-06T00:00:00", "Braniff Flight 250 crashes in Falls City, Nebraska, killing all 42 on board."], ["1966-08-06T00:00:00", "René Barrientos takes office as the president of Bolivia."], ["1966-08-06T00:00:00", "The Salazar Bridge (now the 25 de Abril Bridge) opens in Lisbon, Portugal."], ["1966-08-07T00:00:00", "Race riots occur in Lansing, Michigan."], ["1966-08-10T00:00:00", "An East German court sentences Günter Laudahn to life imprisonment for spying for the United States."], ["1966-08-10T00:00:00", "Lunar Orbiter 1, the first U.S. spacecraft to orbit the moon, is launched."], ["1966-08-11T00:00:00", "- Indonesia and Malaysia issue joint peace declaration, formally ending the Indonesia-Malaysia confrontation which began in 1963."], ["1966-08-11T00:00:00", "- The Beatles hold a press conference in Chicago, during which John Lennon apologizes for his \"more popular than Jesus\" remark, saying, \"I didn't mean it as a lousy anti-religious thing.\""], ["1966-08-12T00:00:00", "Massacre of Braybrook Street: Harry Roberts, John Duddy and Jack Witney shoot dead 3 plainclothes policemen in London; they are later sentenced to life imprisonment."], ["1966-08-13T00:00:00", "In the People's Republic of China, Mao Zedong begins the Cultural Revolution to purge and reorganize China's Communist Party."], ["1966-08-13T00:00:00", "An earthquake in Varto town, Turkey, kills 2,394 and injures 10,000."], ["1966-08-15T00:00:00", "Syrian and Israeli troops clash over Lake Kinneret (also known as the Sea of Galilee) for 3 hours."], ["1966-08-15T00:00:00", "It is announced that the New York Herald Tribune will not resume publication."], ["1966-08-16T00:00:00", "Vietnam War: The House Un-American Activities Committee starts investigating Americans who have aided the Viet Cong, with the intent to make these activities illegal. Anti-war demonstrators disrupt the meeting and 50 are arrested."], ["1966-08-17T00:00:00", "Saudi Arabia and the United Arab Republic begin negotiations in Kuwait to end the war in Yemen."], ["1966-08-18T00:00:00", "Vietnam War - Battle of Long Tan: D Company, 6th Battalion of the Royal Australian Regiment, meets and defeats a Viet Cong force estimated to be four times larger, in Phuoc Tuy Province, Republic of Vietnam."], ["1966-08-19T00:00:00", "An earthquake in eastern Turkey destroys whole cities."], ["1966-08-21T00:00:00", "Seven men are sentenced to death in Egypt, for anti-Nasser agitation."], ["1966-08-22T00:00:00", "The Asian Development Bank (ADB) established."], ["1966-08-22T00:00:00", "The United Farm Workers Organizing Committee (UFWOC), predecessor of the United Farm Workers of America (UFW), is formed."], ["1966-08-24T00:00:00", "The Doors record their self-titled debut LP."], ["1966-08-26T00:00:00", "Riots occur in French Somaliland."], ["1966-08-26T00:00:00", "The first battle of the South African Air Force and the South African Police with PLAN, the armed wing of the South West Africa People's Organization (SWAPO), takes place at Ongulumbashe in Northern South West Africa during Operation Blue Wildebeest. This battle starts the South African Border War which continues until 1989."], ["1966-08-29T00:00:00", "The Beatles end their US tour with a concert at Candlestick Park in San Francisco. It is their last-ever live performance, except for the short \"rooftop concert\" at the Apple Corps offices in January 1969."], ["1966-08-30T00:00:00", "France offers independence to French Somaliland (later Djibouti in 1977)."], ["1966-09-01T00:00:00", "United Nations Secretary-General U Thant declares that he will not seek re-election, because U.N. efforts in Vietnam have failed."], ["1966-09-01T00:00:00", "98 British tourists die in an air crash in Ljubljana, Yugoslavia."], ["1966-09-01T00:00:00", "While waiting at a bus stop Ralph Baer, an inventor with Sanders Associates, writes a four-page document which lays out the basic principles for creating a video game to be played on a television: the beginning of a multi billion dollar industry."], ["1966-09-06T00:00:00", "In Cape Town, South Africa, the architect of Apartheid, Prime Minister Hendrik Verwoerd, is stabbed to death by Dimitri Tsafendas during a parliamentary meeting."], ["1966-09-07T00:00:00", "The ocean liner SS Hanseatic catches fire and burns in New York Harbor."], ["1966-09-08T00:00:00", "Star Trek, the science fiction television series, debuts on NBC-TV in the United States with its first episode, titled \"The Man Trap\"."], ["1966-09-09T00:00:00", "NATO decides to move SHAPE headquarters to Belgium."], ["1966-09-12T00:00:00", "Gemini 11 (Richard F. Gordon, Jr., Pete Conrad) docks with an Agena target vehicle."], ["1966-09-12T00:00:00", "B. J. Vorster becomes the new Prime Minister of South Africa."], ["1966-09-13T00:00:00", "Clashes between the Chinese Communist Party and the Red Guards are reported by TASS in the Soviet Union."], ["1966-09-16T00:00:00", "In South Vietnam, Thích Trí Quang ends a 100-day hunger strike."], ["1966-09-16T00:00:00", "The Metropolitan Opera House opens at Lincoln Center in New York City with the world premiere of Samuel Barber's opera Antony and Cleopatra."], ["1966-09-18T00:00:00", "Valerie Percy, 21-year-old daughter of U.S. Senate candidate Charles H. Percy, is stabbed and bludgeoned to death in the family mansion on Chicago's North Shore."], ["1966-09-19T00:00:00", "Scotland Yard arrests Buster Edwards, suspected of involvement in the Great Train Robbery."], ["1966-09-19T00:00:00", "Timothy Leary forms the spiritual group League for Spiritual Discovery."], ["1966-09-19T00:00:00", "Indonesian military commander (later President) Suharto annoucs the resumption of Indonesian participation in the United Nations."], ["1966-09-29T00:00:00", "Hurricane Inez strikes Hispaniola, leaving thousands dead and tens of thousands homeless in the Dominican Republic and Haiti."], ["1966-09-30T00:00:00", "The Bechuanaland Protectorate in Africa achieves independence from the United Kingdom as Botswana, with Seretse Khama as its first President."], ["1966-09-30T00:00:00", "Baldur von Schirach and Albert Speer are released from Spandau Prison."], ["1966-10-01T00:00:00", "West Coast Airlines Flight 956 crashes with 18 fatal injuries and no survivors 5.5 miles (8.9 km) south of Wemme, Oregon. This accident marks the first loss of a DC-9."], ["1966-10-03T00:00:00", "Tunisia severs diplomatic relations with the United Arab Republic."], ["1966-10-04T00:00:00", "Israel applies for membership in the EEC."], ["1966-10-04T00:00:00", "Basutoland becomes independent and takes the name Lesotho."], ["1966-10-05T00:00:00", "UNESCO signs the Recommendation Concerning the Status of Teachers. This event is now celebrated as World Teachers' Day."], ["1966-10-05T00:00:00", "An experimental Reactor at the Enrico Fermi Nuclear Generating Station suffers a partial meltdown when its cooling system fails."], ["1966-10-06T00:00:00", "LSD is made illegal in the United States and controlled so strictly that not only are possession and recreational use criminalized, but all legal scientific research programs on the drug in the US are shut down as well."], ["1966-10-06T00:00:00", "The Love Pageant Rally takes place in the Panhandle of Golden Gate Park, a narrower section that projects into San Francisco's Haight-Ashbury district."], ["1966-10-07T00:00:00", "The Soviet Union declares that all Chinese students must leave the country before the end of October."], ["1966-10-09T00:00:00", "Vietnam War: Binh Tai Massacre."], ["1966-10-09T00:00:00", "Vietnam War: Diên Niên - Phước Bình massacre."], ["1966-10-11T00:00:00", "France and the Soviet Union sign a treaty for cooperation in nuclear research."], ["1966-10-14T00:00:00", "Closure of Intra Bank begins crisis of Lebanese banking system."], ["1966-10-14T00:00:00", "The city of Montreal inaugurates its metro system (see Montreal Metro)."], ["1966-10-15T00:00:00", "U.S. President Lyndon B. Johnson signs a bill creating the United States Department of Transportation."], ["1966-10-15T00:00:00", "The U.S. Congress passes a bill for the creation of Pictured Rocks National Lakeshore."], ["1966-10-15T00:00:00", "ABC-TV telecasts a highly acclaimed 90-minute television adaptation of the musical Brigadoon, starring Robert Goulet, Peter Falk, and Sally Ann Howes. It wins many Emmy Awards and inaugurates a short-lived series of special television adaptations of famous Broadway musicals on ABC. Goulet stars in all but one of these specials."], ["1966-10-16T00:00:00", "Grace Slick performs live for the first time with Jefferson Airplane."], ["1966-10-17T00:00:00", "Lesotho and Botswana are admitted to the United Nations."], ["1966-10-21T00:00:00", "The Aberfan disaster occurs in South Wales, United Kingdom."], ["1966-10-21T00:00:00", "The AFL-NFL merger is approved by the U.S. Congress."], ["1966-10-22T00:00:00", "British spy George Blake escapes from Wormwood Scrubs prison; he is next seen in Moscow."], ["1966-10-22T00:00:00", "Spain demands that the United Kingdom stop military flights to Gibraltar; Britain refuses the next day."], ["1966-10-24T00:00:00", "Negotiations about the Vietnam War begin in Manila, Philippines."], ["1966-10-25T00:00:00", "A military court in Jakarta sentences ex-foreign minister Subandrio to death."], ["1966-10-25T00:00:00", "Spain closes its Gibraltar border to non-pedestrian traffic."], ["1966-10-26T00:00:00", "NATO moves its HQ from Paris to Brussels."], ["1966-10-26T00:00:00", "A fire aboard the aircraft carrier USS Oriskany in the Gulf of Tonkin kills 44 crewmen."], ["1966-10-27T00:00:00", "The United Nations takes Namibia from South Africa."], ["1966-10-29T00:00:00", "The first ever regeneration in Doctor Who of the Doctor: William Hartnell's face transforms into that of Patrick Troughton."], ["1966-10-29T00:00:00", "The Guinean delegation to the OAU meeting in Ethiopia, become hostages of the Ghanaian government in Accra."], ["1966-11-02T00:00:00", "The Cuban Adjustment Act comes into force, allowing 123,000 Cubans the opportunity to apply for permanent residence in the United States."], ["1966-11-04T00:00:00", "In Italy, a flood of the Arno River hits Florence, flooding it to a maximum depth of 6.7 m (22 ft), leaving thousands homeless and destroying millions of masterpieces of art and rare books. In addition, a severe tidal flood hits Venice."], ["1966-11-05T00:00:00", "Thirty-eight African states demand that the United Kingdom use force against the Rhodesian government."], ["1966-11-06T00:00:00", "Lunar Orbiter 2 is launched."], ["1966-11-08T00:00:00", "Former Massachusetts Attorney General Edward Brooke becomes the first African American elected to the United States Senate since Reconstruction."], ["1966-11-08T00:00:00", "Actor Ronald Reagan is elected Governor of California."], ["1966-11-09T00:00:00", "John Lennon meets Yoko Ono at the Indica Gallery."], ["1966-11-10T00:00:00", "Seán Lemass retires as Taoiseach of the Republic of Ireland to be replaced in the role by fellow Fianna Fáil member Jack Lynch."], ["1966-11-11T00:00:00", "A mine kills 3 Israeli paratroopers on the West Bank border."], ["1966-11-11T00:00:00", "Spain declares general amnesty for crimes committed during the Spanish Civil War (effective only for the Falangists' side)."], ["1966-11-14T00:00:00", "Jack L. Warner sells Warner Bros. Pictures to Seven Arts Productions, which eventually becomes Warner Bros.-Seven Arts."], ["1966-11-15T00:00:00", "Gemini 12 (James A. Lovell, Buzz Aldrin), splashes down safely in the Atlantic Ocean, 600 km east of the Bahamas."], ["1966-11-15T00:00:00", "Harry Maurice Roberts, who killed 3 policemen in August, is caught near London."], ["1966-11-15T00:00:00", "A Boeing 727 carrying Pan Am Flight 708 crashes near Berlin, Germany, killing all three people on board."], ["1966-11-15T00:00:00", "Two young couples in Point Pleasant, West Virginia reportedly see a strange moth-like creature better known as the Mothman."], ["1966-11-16T00:00:00", "U.S. doctor Sam Sheppard is acquitted in his second trial for the murder of his pregnant wife in 1954."], ["1966-11-17T00:00:00", "The U.N. General Assembly decides to found the United Nations Industrial Development Organization."], ["1966-11-17T00:00:00", "A spectacular Leonid meteor shower passes over Arizona, at the rate of 2,300 a minute for 20 minutes."], ["1966-11-21T00:00:00", "In Togo, the army crushes an attempted coup."], ["1966-11-24T00:00:00", "The Beatles begin recording sessions for their Sgt. Pepper's Lonely Hearts Club Band L.P."], ["1966-11-24T00:00:00", "Bulgarian TABSO Flight 101 crashes near Bratislava, Czechoslovakia, killing all 82 people on board."], ["1966-11-26T00:00:00", "In Vancouver, the Saskatchewan Roughriders defeat the Ottawa Rough Riders to win the 54th Grey Cup."], ["1966-11-27T00:00:00", "The Washington Redskins defeat the New York Giants 72-41 in the highest scoring game in NFL history."], ["1966-11-28T00:00:00", "Truman Capote's Black and White Ball ('The Party of the Century') is held in New York City."], ["1966-11-29T00:00:00", "The SS Daniel J. Morrell sinks in a storm on Lake Huron, killing 28 of its 29 crewmen."], ["1966-11-30T00:00:00", "Barbados achieves independence."], ["1966-12-01T00:00:00", "Kurt Georg Kiesinger is elected Chancellor of West Germany."], ["1966-12-01T00:00:00", "British Prime Minister Harold Wilson and Rhodesian Prime minister Ian Smith negotiate on the HMS Tiger in the Mediterranean."], ["1966-12-02T00:00:00", "U Thant agrees to serve a second term as U.N. Secretary General."], ["1966-12-03T00:00:00", "Anti-Portuguese demonstrations occur in Macau; a curfew is declared the next day."], ["1966-12-05T00:00:00", "U.S. Supreme Court rules in Bond v. Floyd that the Georgia House of Representatives must seat Julian Bond, having violated his First and Fourteenth Amendment rights."], ["1966-12-06T00:00:00", "Bình Hòa massacre: Vietnam War."], ["1966-12-07T00:00:00", "Syria offers weapons to rebels in Jordan."], ["1966-12-07T00:00:00", "Barbados is admitted to the United Nations."], ["1966-12-08T00:00:00", "The Typaldos Line's ferry SS Heraklion sinks in rough seas, in the Aegean Sea near Crete, leaving 217 dead."], ["1966-12-15T00:00:00", "Walt Disney dies while producing The Jungle Book, the last animated feature under his personal supervision."], ["1966-12-16T00:00:00", "The U.N. Security Council approves an oil embargo against Rhodesia."], ["1966-12-16T00:00:00", "The International Covenant on Economic, Social and Cultural Rights and the International Covenant on Civil and Political Rights are adopted by the General Assembly, as Resolution 2200 A (XXI)."], ["1966-12-17T00:00:00", "South Africa does not join the trade embargo against Rhodesia."], ["1966-12-18T00:00:00", "How the Grinch Stole Christmas, narrated by Boris Karloff, is shown for the first time on CBS, beginning an annual Christmas tradition in the USA."], ["1966-12-19T00:00:00", "The Asian Development Bank begins operations."], ["1966-12-20T00:00:00", "Harold Wilson withdraws all his previous offers to the Rhodesian government, and announces that he will agree to independence only after the founding of a Black majority government."], ["1966-12-22T00:00:00", "Prime Minister Ian Smith declares that Rhodesia is already a republic."], ["1966-12-26T00:00:00", "The first Kwanzaa is celebrated by Maulana Karenga, founder of Organization US (a black nationalist group) and later chair of Black Studies at California State University, Long Beach, from 1989 to 2002."], ["1966-12-31T00:00:00", "East German Premier Walter Ulbricht discusses negotiations about German reunification."], ["1966-12-31T00:00:00", "Thieves steal millions' worth of paintings from the Dulwich Art Gallery in London."], ["1966-12-31T00:00:00", "The Congolese government takes over the Union Minière du Haut Katanga."]]