[["1939-01-01T00:00:00", "Hewlett-Packard is founded as an electronics company in Palo Alto, California."], ["1939-01-05T00:00:00", "Amelia Earhart is officially declared dead after her disappearance"], ["1939-01-06T00:00:00", "Naturwissenschaften publishes evidence that nuclear fission has been achieved by Otto Hahn."], ["1939-01-13T00:00:00", "Black Friday: 71 people die across Victoria in one of Australia's worst ever bushfires."], ["1939-01-23T00:00:00", "\"Dutch War Scare\": Admiral Wilhelm Canaris of the Abwehr leaks misinformation to the effect that Germany plans to invade the Netherlands in February, with the aim of using Dutch air-fields to launch a strategic bombing offensive against Britain. The \"Dutch War Scare\" leads to a major change in British policies towards Europe."], ["1939-01-24T00:00:00", "An earthquake kills 30,000 in Chile, and razes about 50,000 sq mi (130,000 km2)."], ["1939-01-25T00:00:00", "Refik Saydam forms the new government of Turkey. (11th government)"], ["1939-01-26T00:00:00", "Spanish Civil War: Spanish Nationalist troops, aided by Italy, take Barcelona."], ["1939-01-26T00:00:00", "In Paris, French Foreign Minister Georges Bonnet, in response to rumours (which are true) that he is seeking to end the French alliance system in Eastern Europe, gives a speech highlighting his government's commitment to the cordon sanitaire."], ["1939-01-27T00:00:00", "Adolf Hitler orders Plan Z, a 5-year naval expansion programme intended to provide for a huge German fleet capable of crushing the Royal Navy by 1944. The Kriegsmarine is given the first priority on the allotment of German economic resources."], ["1939-01-30T00:00:00", "Hitler gives a speech before the Reichstag calling for an \"export battle\" to increase German foreign exchange holdings. The same speech also sees Hitler's \"prophecy\" where he warns that if \"Jewish financers\" start a war against Germany, the...result will be the annihilation of the Jewish race in Europe\"."], ["1939-02-02T00:00:00", "Hungary joins the Anti-Comintern Pact."], ["1939-02-06T00:00:00", "British Prime Minister Neville Chamberlain states in the House of Commons that any German attack on France will be automatically considered an attack on Britain."], ["1939-02-06T00:00:00", "In a response to Georges Bonnet's speech of January 26, German Foreign Minister Joachim von Ribbentrop, referring to Bonnet's alleged statement of December 6, 1938 accepting Eastern Europe as being in Germany's exclusive sphere of influence, protests that all French security commitments in that region are \"now off limits\"."], ["1939-02-10T00:00:00", "Spanish Nationalists complete their offensive in Catalonia."], ["1939-02-15T00:00:00", "Stagecoach premieres in New York City and Los Angeles."], ["1939-02-18T00:00:00", "The Golden Gate International Exposition opens in San Francisco."], ["1939-02-27T00:00:00", "The United Kingdom and France recognize Franco's government."], ["1939-02-27T00:00:00", "Borley Rectory in England is destroyed by fire."], ["1939-02-27T00:00:00", "Sit-down strikes are outlawed by the Supreme Court of the United States."], ["1939-03-01T00:00:00", "A Imperial Japanese Army ammunition dump explosion on the outskirts of Osaka kills 94."], ["1939-03-02T00:00:00", "Pope Pius XII (Cardinal Pacelli) succeeds Pope Pius XI as the 260th pope."], ["1939-03-03T00:00:00", "In Bombay, Mohandas Gandhi begins a fast protesting against British rule in India."], ["1939-03-03T00:00:00", "Students at Harvard University demonstrate the new tradition of swallowing goldfish to reporters."], ["1939-03-03T00:00:00", "In Durban, South Africa the Timeless Test begins between England and South Africa, the longest game of cricket ever played. It is abandoned twelve days later when the English team has to catch the last ferry home."], ["1939-03-13T00:00:00", "Adolf Hitler advises Jozef Tiso to declare Slovakia's independence in order to prevent its partition by Hungary and Poland."], ["1939-03-13T00:00:00", "Irish writer Flann O'Brien's comic metafiction At Swim-Two-Birds is published in London but attracts little attention at this time."], ["1939-03-14T00:00:00", "The Slovak provincial assembly proclaims independence; priest Jozef Tiso becomes the president of the independent Slovak government."], ["1939-03-15T00:00:00", "German troops occupy the remaining part of Bohemia and Moravia; Czechoslovakia ceases to exist. The Ruthenian region of Czechoslovakia declares independence as Carpatho-Ukraine."], ["1939-03-16T00:00:00", "Princess Fawzia Fuad of Egypt marries Shah Mohammad Reza Pahlavi of Iran."], ["1939-03-16T00:00:00", "Hungary invades Carpatho-Ukraine; final resistance ends on March 18."], ["1939-03-17T00:00:00", "British Prime Minister Neville Chamberlain gives a speech in Birmingham, stating that Britain will oppose any effort at world domination on the part of Germany."], ["1939-03-18T00:00:00", "\"Romanian War Scare\": Virgil Tilea, the Romanian Minister in London, spreads false rumours that Romania is on the verge of a German attack."], ["1939-03-19T00:00:00", "Hitler sends a registered letter to the government of Lithuania stating that Germany intends to annex the port of Memel."], ["1939-03-20T00:00:00", "At an emergency meeting in London to deal with the Romanian crisis, French Foreign Minister Georges Bonnet suggests to Lord Halifax that the ideal state for saving Romania from a German attack is Poland."], ["1939-03-21T00:00:00", "In London: the Ordo Templi Orientis publish Aleister Crowley's Eight Lectures on Yoga."], ["1939-03-22T00:00:00", "After an ultimatum of March 20, Nazi Germany takes Memelland from Lithuania."], ["1939-03-22T00:00:00", "In the U.S., undefeated LIU tops undefeated Loyola of Chicago in the championship game of the second annual National Invitation Tournament, 44-32. LIU's 24-0 final record is the first perfect season of college basketball's postseason tournament era."], ["1939-03-23T00:00:00", "The Slovak-Hungarian War begins."], ["1939-03-24T00:00:00", "Marks the seventh successive year of the world wide boycott of all German exports initiated by front page declarations in Britain and the U.S. 'Judea declares war on Germany'"], ["1939-03-27T00:00:00", "The University of Oregon defeats Ohio State University 46-33 in Evanston, Illinois, to win the championship of the first NCAA men's basketball tournament."], ["1939-03-28T00:00:00", "Dictator Francisco Franco assumes power in Madrid, remaining in power until 1975."], ["1939-03-28T00:00:00", "American adventurer Richard Halliburton delivers a last message from a Chinese junk, before he disappears on a voyage across the Pacific Ocean."], ["1939-03-31T00:00:00", "Neville Chamberlain gives a speech in the House of Commons offering the British \"guarantee\" of the independence of Poland."], ["1939-04-01T00:00:00", "The Spanish Civil War comes to an end when the last of the Republican forces surrender."], ["1939-04-01T00:00:00", "The rumor that Hitler is dead sweeps the United States as millions of CBS radio listeners hear the Führer cut off in mid-speech during a shortwave relay of his address at the Christening of the Tirpitz in Wilhelmshaven. (The story is recounted by William L. Shirer in The Rise and Fall of the Third Reich.)"], ["1939-04-03T00:00:00", "Adolf Hitler orders the German military to start planning for Fall Weiss, the codename for the invasion of Poland."], ["1939-04-03T00:00:00", "Refik Saydam forms the new government in Turkey. (12 th government; Refik Saydam had served twice as a prime minister )"], ["1939-04-04T00:00:00", "Faisal II becomes King of Iraq."], ["1939-04-04T00:00:00", "The Slovak-Hungarian War ends with Slovakia ceding eastern territories to Hungary."], ["1939-04-04T00:00:00", "Polish Foreign Minister Colonel Józef Beck, in London, signs a treaty designed to bilateralize Neville Chamberlain's \"Polish Guarantee\" of March 31."], ["1939-04-07T00:00:00", "Italy invades Albania; King Zog flees."], ["1939-04-09T00:00:00", "African-American singer Marian Anderson performs before 75,000 people at the Lincoln Memorial in Washington, D.C., after having been denied the use both of Constitution Hall by the Daughters of the American Revolution, and of a public high school by the federally controlled District of Columbia."], ["1939-04-11T00:00:00", "Hungary leaves the League of Nations."], ["1939-04-13T00:00:00", "Britain offers a \"guarantee\" to Romania and Greece."], ["1939-04-14T00:00:00", "John Steinbeck's novel The Grapes of Wrath is first published."], ["1939-04-14T00:00:00", "At a meeting in Paris, French Foreign Minister Georges Bonnet meets with Soviet Ambassador Jakob Suritz, and suggests that a \"peace front\" comprising France, the Soviet Union, Great Britain, Poland and Romania would deter Germany from war."], ["1939-04-18T00:00:00", "The Soviet Union proposes a \"peace front\" to resist aggression."], ["1939-04-20T00:00:00", "Billie Holiday records \"Strange Fruit\", the first anti-lynching song."], ["1939-04-25T00:00:00", "The Federal Security Agency (FSA) is founded in the USA, along with the Civilian Conservation Corps and Public Health Service."], ["1939-04-27T00:00:00", "Ely Racecourse in Cardiff closes."], ["1939-04-28T00:00:00", "In a speech before the Reichstag, Adolf Hitler renounces the Anglo-German Naval Agreement and the German-Polish Non-Aggression Pact."], ["1939-04-30T00:00:00", "The 1939 New York World's Fair opens."], ["1939-05-01T00:00:00", "Batman, created by Bob Kane and Bill Finger makes his first appearance in a comic book."], ["1939-05-02T00:00:00", "Major League Baseball's Lou Gehrig, the legendary Yankee first baseman known as \"The Iron Horse\", ends his 2,130 consecutive games played streak after contracting amyotrophic lateral sclerosis. The record stands for 56 years before Cal Ripken, Jr. plays 2,131 consecutive games."], ["1939-05-03T00:00:00", "Vyacheslav Molotov succeeds Maxim Litvinov as Soviet Foreign Commissar."], ["1939-05-03T00:00:00", "The All India Forward Bloc is formed by Netaji Subhas Chandra Bose."], ["1939-05-06T00:00:00", "Carl Friedrich Goerdeler tells the British government that the German and Soviet governments are secretly beginning a rapprochement with the aim of dividing Eastern Europe between them. Goerdeler also informs the British of German economic problems which he states threaten the survival of the Nazi regime, and advises that if a firm stand is made for Poland, then Hitler will be deterred from war."], ["1939-05-09T00:00:00", "Spain leaves the League of Nations."], ["1939-05-14T00:00:00", "Lina Medina, a 5-year-old Peruvian girl, gives birth to a baby boy, becoming the youngest confirmed mother in medical history."], ["1939-05-17T00:00:00", "King George VI and Queen Elizabeth arrive in Quebec City to begin the first-ever tour of Canada by Canada's monarch."], ["1939-05-17T00:00:00", "The British government issues the White Paper of 1939, sharply restricting Jewish immigration to Mandatory Palestine."], ["1939-05-17T00:00:00", "Sweden, Norway, and Finland refuse Germany's offer of non-aggression pacts."], ["1939-05-20T00:00:00", "Pan-American Airways begins trans-Atlantic mail service with the inaugural flight of its Yankee Clipper from Port Washington, New York."], ["1939-05-22T00:00:00", "Germany and Italy sign the Pact of Steel."], ["1939-05-24T00:00:00", "First issue of Fashizmi is published in Tirana."], ["1939-05-29T00:00:00", "Albanian fascist leader Tefik Mborja is appointed as member of the Italian Chamber of Fasces and Corporations."], ["1939-06-03T00:00:00", "The Soviet government offers its definition of what constitutes \"aggression\", upon which the projected Anglo-Soviet-French alliance will come into effect. The French Foreign Minister Georges Bonnet accepts the Soviet definition of aggression at once. The British reject the Soviet definition, especially the concept of \"indirect aggression\", which they feel is too loose a definition and phrased in such a manner as to imply the Soviet right of inference in the internal affairs of nations of Eastern Europe."], ["1939-06-04T00:00:00", "The St. Louis, a ship carrying a cargo of 907 Jewish refugees, is denied permission to land in Florida after already having been turned away from Cuba. Forced to return to Europe, many of its passengers later die in Nazi death camps during The Holocaust."], ["1939-06-12T00:00:00", "The National Baseball Hall of Fame and Museum is officially dedicated in Cooperstown, New York."], ["1939-06-14T00:00:00", "Tientsin Incident: The Japanese blockade the British concession in Tianjin, China, beginning a crisis which almost causes an Anglo-Japanese war in the summer of 1939."], ["1939-06-17T00:00:00", "In the last public guillotining in France, murderer Eugen Weidmann is decapitated by the guillotine."], ["1939-06-21T00:00:00", "New York Yankees announce Lou Gehrig's retirement after doctors reveal he has amyotrophic lateral sclerosis."], ["1939-06-23T00:00:00", "Talks are completed in Ankara between French Ambassador René Massigli and Turkish Foreign Minister Şükrü Saracoğlu, resolving the Hatay dispute in Turkey's favor. Turkey annexes Hatay."], ["1939-06-24T00:00:00", "The government of Siam changes its name to Thailand, which means 'Free Land'."], ["1939-06-29T00:00:00", "Ford 9N tractor with Ferguson hydraulic three-point hitch first demonstrated at Dearborn, Michigan."], ["1939-07-02T00:00:00", "The 1st World Science Fiction Convention opens in New York City."], ["1939-07-02T00:00:00", "Theodore Roosevelt's head is dedicated at Mount Rushmore."], ["1939-07-04T00:00:00", "Lou Gehrig gives his last public speech, following a diagnosis of amyotrophic lateral sclerosis (ALS). In it, he says, \"Today, I consider myself the luckiest man on the face of the earth.\""], ["1939-07-04T00:00:00", "The Neuengamme concentration camp becomes autonomous."], ["1939-07-06T00:00:00", "The last remaining Jewish enterprises in Germany are closed by the Nazis."], ["1939-07-23T00:00:00", "Mahatma Gandhi the spiritual leader from India writes a personal letter to Adolf Hitler addressing him \"My friend\", requesting to prevent any possible war."], ["1939-07-27T00:00:00", "The first recorded snowfall in Auckland, New Zealand since records began in 1853."], ["1939-08-02T00:00:00", "The Einstein-Szilárd letter is signed, advising President of the United States Franklin D. Roosevelt of the potential use of uranium to construct an atomic bomb."], ["1939-08-04T00:00:00", "Neville Chamberlain dismisses Parliament until October 3."], ["1939-08-15T00:00:00", "MGM's classic musical film The Wizard of Oz, based on L. Frank Baum's famous novel, and starring Judy Garland as Dorothy, premieres at Grauman's Chinese Theatre in Hollywood."], ["1939-08-19T00:00:00", "Adolf Hitler, after evaluating the pace of the non-aggression negotiations with the Soviet Union, orders the Kriegsmarine to begin the opening operations for Fall Weiss, the invasion of Poland. The German pocket battleship Admiral Graf Spee, along with the German pocket battleship  Deutschland, as well as dozens of u-boats, cast off for their advance positions. According to William L. Shirer, Hitler spends the next few days worrying that the Russians will not come to terms in time for the rest of the invasion plans to unfold as scheduled."], ["1939-08-20T00:00:00", "Armored forces under the command of Soviet General Georgy Zhukov deliver a decisive defeat to Imperial Japanese Army forces in the Japanese-Soviet border war in Inner Mongolia."], ["1939-08-23T00:00:00", "Molotov-Ribbentrop Pact signed between Germany and the Soviet Union, a neutrality treaty that also agreed to division of spheres of influence (Finland, Estonia, Latvia, eastern Poland and Bessarabia (today Moldova), north-east province of Romania to the Soviet Union; Lithuania and western Poland to Germany). Its annex reassigns Lithuania to the Soviet Union."], ["1939-08-24T00:00:00", "As details of the Molotov-Ribbentrop Pact become public, Neville Chamberlain recalls the Parliament of the United Kingdom several weeks early. In a burst of legislation, a War Powers Act is approved; and HMG order the Royal Navy to be put on a war footing, all leaves to be cancelled, and the Naval and coast defense reserves to be called up, especially radar and anti-aircraft units. In addition, the last British and French private citizens in Germany are ordered home by their respective Governments."], ["1939-08-25T00:00:00", "The German Foreign Ministry cuts off all telegraph and telephone communication with the outside world in accordance with the plan for Fall Weiss. At approximately 1830 Central European time, Adolf Hitler postpones Fall Weiss for 5 days, after receiving a message from Benito Mussolini that he will not honor the Pact of Steel if Germany attacks Poland, and because Chamberlain's government has not fallen as a result of the German-Soviet Non-Aggression Pact. Some units already in their forward positions (the attack is scheduled for 0430 the next day) do not get the word in time and attack various targets along the border. That same day, Neville Chamberlain gives Edward Rydz-Śmigły his \"ironclad guarantee\" of assistance if Poland is attacked by Germany."], ["1939-08-25T00:00:00", "An Irish Republican Army bomb explodes in the centre of Coventry, England, killing 5 people."], ["1939-08-25T00:00:00", "MGM's classic musical film The Wizard of Oz, based on L. Frank Baum's famous novel, and starring Judy Garland as Dorothy, is released in theaters everywhere."], ["1939-08-26T00:00:00", "The first televised Major League Baseball games were shown on experimental station W2XBS: a double-header between the Cincinnati Reds and the Brooklyn Dodgers at Ebbets Field."], ["1939-08-26T00:00:00", "Division of Grazing renamed United States Grazing Service."], ["1939-08-26T00:00:00", "The Kriegsmarine orders all German-flagged merchant ships to head to German ports immediately in anticipation of the invasion of Poland."], ["1939-08-27T00:00:00", "A Heinkel He 178, the first turbojet-powered aircraft, flies for the first time with Captain Erich Warsitz in command."], ["1939-08-28T00:00:00", "The SS Normandie heads into New York after her Final Voyage and will stay in New York until 1946, After her 1942 Fire in Pier 88 in New York"], ["1939-08-30T00:00:00", "Poland begins a mobilization against Nazi Germany."], ["1939-08-31T00:00:00", "Operation Himmler: Nazi German troops posing as Poles stage a series of false flag operations on the border giving a pretext for the invasion of Poland."], ["1939-09-01T00:00:00", "Beginning of WWII: - Opening shots of World War II and Invasion of Poland: At 4:45am Central European Time, under cover of darkness, the German WW1-era battleship Schleswig-Holstein quietly slips her moorings at her wharf in Danzig harbor, drifts into the center of the channel, and commences firing on the fortress Westerplatte, a Polish army installation at the mouth of the port of Danzig, Poland. Simultaneously, shock-troops of the German Wehrmacht begin crossing the border into Poland."], ["1939-09-01T00:00:00", "Beginning of WWII: - The Reichstag passes a statement stating that Adolf Hitler's second-in-command Reichsmarschall Hermann Göring should be appointed as Hitler's successor as Führer should Hitler die during the War. Rudolf Hess is to be appointed in Göring's place should anything befall Göring."], ["1939-09-01T00:00:00", "Beginning of WWII: - Norway, Finland, Sweden and Switzerland declare their neutrality."], ["1939-09-02T00:00:00", "WWII: - Following the invasion of Poland, the Free City of Danzig (modern-day Gdańsk, Poland) is annexed to Nazi Germany."], ["1939-09-02T00:00:00", "WWII: - Spain and the Irish Free State declare their neutrality."], ["1939-09-03T00:00:00", "WWII: - The United Kingdom, France, New Zealand, Australia and India (by its Viceroy) declare war on Nazi Germany. Prime Minister of Canada Mackenzie King, in English, and Justice Minister Ernest Lapointe, in French, give an international radio address stating the Dominion's intention to declare war also."], ["1939-09-03T00:00:00", "WWII: - United States President Franklin D. Roosevelt advocates neutrality in a nationwide radio address."], ["1939-09-03T00:00:00", "WWII: - Ocean liner SS Athenia becomes the first British civilian casualty of the war when she is torpedoed and sunk by German submarine U-30 in the eastern Atlantic. Of the 1,418 aboard, 98 passengers and 19 crew are killed."], ["1939-09-04T00:00:00", "WWII: - First bombing of Wilhelmshaven in World War II by the British Royal Air Force."], ["1939-09-04T00:00:00", "WWII: - Nepal declares war on Germany."], ["1939-09-05T00:00:00", "WWII: The United States declares its neutrality in the war."], ["1939-09-06T00:00:00", "WWII: South Africa declares war on Germany."], ["1939-09-08T00:00:00", "Little Sisters of Jesus founded in Algeria by Little Sister Magdeleine."], ["1939-09-08T00:00:00", "WWII: Forward elements of General Hoeppner's XVI Panzerkorps take up positions outside Warsaw. The world is stunned by the rapidity of the German advance and the Polish High Command is effectively isolated, but lack of infantry support and effective civilian resistance cause Hoeppner to halt outside the city itself."], ["1939-09-08T00:00:00", "WWII: Polish troops on the Westerplatte are forced, due to lack of food and ammunition, to surrender. The garrison of about two hundred had held out against thousands of German forces (many of them Naval officer cadets from the Schleswig-Holstein,) for seven days."], ["1939-09-09T00:00:00", "WWII: Troops of the Polish Poznań Army under the command of General Kutrzeba open the Battle of the Bzura, the largest and best organized counter-attack mounted by the Polish forces in the campaign of 1939. For the first few days all goes well and the Germans are forced to retreat; but quick reaction by mechanized units and the Luftwaffe soon take their toll and the operation bogs down."], ["1939-09-10T00:00:00", "WWII: Canada declares war on Germany."], ["1939-09-15T00:00:00", "WWII: Diverse elements of the German Wehrmacht surround Warsaw and demand its surrender. The Poles refuse and the siege begins in earnest."], ["1939-09-16T00:00:00", "A ceasefire ends the undeclared Border War between the Soviet Union (and Mongolian allies) and Japan."], ["1939-09-17T00:00:00", "WWII: - The Soviet Union invades Poland and then occupies eastern Polish territories."], ["1939-09-17T00:00:00", "WWII: - Royal Navy aircraft carrier HMS Courageous is torpedoed and sunk by German submarine U-29 in the Western Approaches with the loss of 519 crew, the first British warship loss of the War."], ["1939-09-18T00:00:00", "WWII: The Polish submarine ORP Orzeł escapes internment from Tallinn harbour, Estonia, leading both the Soviet Union and Germany to question Estonia's neutrality."], ["1939-09-19T00:00:00", "WWII: The Poznan pocket collapses, and the Germans capture, according to many sources, over 150,000 men. Many elements of General Tadeusz Kutrzeba's forces work their way into Warsaw under extreme difficulty."], ["1939-09-21T00:00:00", "Reinhard Heydrich, chief of the Security Police, sends a directive, the Schnellbrief, explaining that Jews living in towns and villages in the Polish occupation zones are to be transferred to ghettos, and Jewish councils, Judenräte, will be established to carry out the German authorities’ orders."], ["1939-09-21T00:00:00", "Radio station WJSV in Washington, D.C. records an entire broadcast day for preservation in the National Archives."], ["1939-09-22T00:00:00", "WWII: Joint victory parade of Wehrmacht and Red Army in Brest-Litovsk at the end of the Invasion of Poland."], ["1939-09-24T00:00:00", "WWII: The Soviet Union issues an ultimatum to Estonia to allow Soviet military bases on its territory, which Estonia accepts on September 28. Similar ultimatums are issued to Latvia on October 5 and to Lithuania on October 10, who are forced to accept them as well."], ["1939-09-28T00:00:00", "WWII: - Nazi Germany and the Soviet Union agree on a division of Poland after their invasion."], ["1939-09-28T00:00:00", "WWII: - Warsaw surrenders to Germany; Modlin surrenders a day later; the last Polish large operational unit surrenders near Kock 8 days later."], ["1939-09-29T00:00:00", "Gerald J. Cox, speaking at an American Water Works Association meeting, becomes the first person to publicly propose the fluoridation of public water supplies in the United States."], ["1939-09-30T00:00:00", "General Władysław Sikorski becomes Prime Minister of the Polish government-in-exile."], ["1939-10-06T00:00:00", "WWII: Poland Battle of Kock ends the Polish Campaign. Polish resistance moves underground."], ["1939-10-08T00:00:00", "WWII: Germany annexes Western Poland."], ["1939-10-08T00:00:00", "The Holocaust: Piotrków Trybunalski Ghetto, the first Jewish ghetto in Nazi-occupied Europe, is proclaimed in German-occupied Poland."], ["1939-10-11T00:00:00", "The Einstein-Szilárd letter is delivered to President of the United States Franklin D. Roosevelt advising of the potential use of uranium to construct an atomic bomb, leading to the Manhattan Project."], ["1939-10-14T00:00:00", "The German submarine U-47 sinks the British battleship HMS Royal Oak at anchor in Scapa Flow (Scotland) with the loss of 833 crew."], ["1939-10-15T00:00:00", "The New York Municipal Airport (later renamed LaGuardia Airport) is dedicated."], ["1939-10-17T00:00:00", "Mr. Smith Goes to Washington premieres in Washington, D.C."], ["1939-10-21T00:00:00", "First meeting of the U.S. Advisory Committee on Uranium under Lyman James Briggs, authorized by President Roosevelt to oversee neutron experiments, a precursor of the Manhattan Project."], ["1939-10-24T00:00:00", "Nylon stockings go on sale for the first time anywhere in Wilmington, Delaware."], ["1939-10-25T00:00:00", "The Time of Your Life, a drama by William Saroyan, debuts in New York City."], ["1939-11-04T00:00:00", "WWII: U.S. President Franklin D. Roosevelt orders the United States Customs Service to implement the Neutrality Act of 1939, allowing cash-and-carry purchases of weapons to non-belligerent nations."], ["1939-11-04T00:00:00", "Stewart Menzies is appointed head of the British Secret Intelligence Service."], ["1939-11-06T00:00:00", "Hedda Hopper's Hollywood debuts on radio with Hollywood gossip columnist Hedda Hopper as host (the show runs until 1951, making Hopper a powerful figure in the Hollywood elite)."], ["1939-11-06T00:00:00", "WWII: Sonderaktion Krakau: Germans take action against scientists from the University of Kraków and other Kraków universities."], ["1939-11-08T00:00:00", "WWII: In Munich, an attempt to kill Adolf Hitler is made by Georg Elser while Hitler is celebrating the 16th anniversary of the Beer Hall Putsch."], ["1939-11-08T00:00:00", "CBS television station W2XAB resumes test transmission with an all-electronic system broadcast from the top of the Chrysler Building in New York City."], ["1939-11-09T00:00:00", "WWII: Venlo Incident: Two British agents of SIS are captured by the Germans."], ["1939-11-15T00:00:00", "In Washington, D.C., U.S. President Franklin D. Roosevelt lays the cornerstone of the Jefferson Memorial."], ["1939-11-16T00:00:00", "Al Capone is released from Alcatraz, due to deteriorating health caused by syphilis."], ["1939-11-17T00:00:00", "WWII: To punish protests against the Nazi occupation of the Czech homeland, the Nazis storm the University of Prague and murder nine Czech graduate students, send over 1,200 to concentration camps, and close all Czech universities, an event which will be commemmorated as International Students' Day."], ["1939-11-26T00:00:00", "Shelling of Mainila: The Soviet Union's Red Army shells the Russian village of Mainila, then claims that the fire originated from Finland, giving a casus belli for the Winter War."], ["1939-11-30T00:00:00", "WWII: - Winter War: Soviet forces attack Finland and reach the Mannerheim Line, starting the war."], ["1939-11-30T00:00:00", "WWII: - Sweden declares itself a non-belligerent in the Winter War."], ["1939-12-02T00:00:00", "LaGuardia Airport opens for business in New York City."], ["1939-12-04T00:00:00", "WWII: HMS Nelson is struck by a mine (laid by U-31) off the coast of Scotland and is laid up for repairs until August 1940."], ["1939-12-09T00:00:00", "Hugh Harman's animated short Christmas film Peace on Earth is released by MGM"], ["1939-12-12T00:00:00", "WWII: HMS Duchess sinks after a collision with HMS Barham off the coast of Scotland with the loss of 124 men."], ["1939-12-13T00:00:00", "WWII - Battle of the River Plate: The German heavy cruiser Admiral Graf Spee is trapped by cruisers HMS Ajax, HMNZS Achilles, and HMS Exeter after a running battle off the coast of Uruguay. The Graf Spee is scuttled by its crew off Montevideo harbor on December 17."], ["1939-12-14T00:00:00", "WWII - Winter War: The League of Nations expels the USSR for attacking Finland."], ["1939-12-15T00:00:00", "The epic historical romance film Gone with the Wind, starring Vivien Leigh, Clark Gable, Olivia de Havilland and Leslie Howard, premieres at Loew's Grand Theatre in Atlanta. Based on Margaret Mitchell's best-selling novel of 1936, it is the longest American film made up to this date (at nearly four hours) and rapidly becomes the highest-grossing film up to this time."], ["1939-12-18T00:00:00", "WWII - Battle of the Heligoland Bight: RAF Bomber Command, on a daylight mission to attack Kriegsmarine ships in the Heligoland Bight, is repulsed by Luftwaffe fighter aircraft."], ["1939-12-22T00:00:00", "the second cel-animated feature film and the first produced by an American studio other than Walt Disney Productions, Gulliver's Travels by Fleischer Studios and very loosely based upon the book by Jonathan Swift is released."], ["1939-12-26T00:00:00", "Miners strike in Borinage, Belgium."], ["1939-12-27T00:00:00", "The Erzincan earthquake in eastern Anatolia, Turkey, kills 30,000."]]