[["1949-01-01T00:00:00", "UN sponsored ceasefire brings an end to the Indo-Pakistani War of 1947. The war results in a stalemate (a position counting as a draw, in which a player is not in check but cannot move except into check) and the division of Kashmir, which is still continuing as of 2014."], ["1949-01-02T00:00:00", "Luis Muñoz Marín becomes the first democratically elected Governor of Puerto Rico."], ["1949-01-04T00:00:00", "RMS Caronia of the Cunard Line departs Southampton for New York on her maiden voyage."], ["1949-01-04T00:00:00", "February 22 - Series of winter storms in Nebraska, Wyoming, South Dakota, Utah, Colorado and Nevada - winds of up to 72 mph - tens of thousands of cattle and sheep perish."], ["1949-01-05T00:00:00", "U.S. President Harry S. Truman unveils his Fair Deal program."], ["1949-01-11T00:00:00", "Los Angeles receives its first recorded snowfall."], ["1949-01-16T00:00:00", "Şemsettin Günaltay forms the new government of Turkey. (18th government, last single party government of CHP)"], ["1949-01-17T00:00:00", "The first VW Type 1 to arrive in the United States, a 1948 model, is brought to New York by Dutch businessman Ben Pon. Unable to interest dealers or importers in the Volkswagen, Pon sells the sample car to pay his travel expenses. Only two 1949 models were sold in America that year, convincing Volkswagen chairman Heinrich Nordhoff the car had no future in the U.S. (The Type 1 went on to become an automotive phenomenon.)"], ["1949-01-19T00:00:00", "The Poe Toaster first appears at the grave of Edgar Allan Poe."], ["1949-01-20T00:00:00", "U.S. President Harry S. Truman is inaugurated for his second term."], ["1949-01-25T00:00:00", "Council for Mutual Economic Assistance (CMEA or COMECON) established by Soviet Union and other communist nations."], ["1949-01-25T00:00:00", "The first Emmy Awards are presented at the Hollywood Athletic Club."], ["1949-01-25T00:00:00", "In the first Israeli election, David Ben-Gurion becomes Prime Minister."], ["1949-01-26T00:00:00", "Australian citizenship comes into being and the Constitution of India was prepared."], ["1949-01-31T00:00:00", "Forces from the Communist Party of China enter Beijing."], ["1949-02-01T00:00:00", "Rationing of clothes ends in Britain."], ["1949-02-10T00:00:00", "Death of a Salesman opens in the Morosco Theatre and runs for 742 performances."], ["1949-02-11T00:00:00", "London Mozart Players perform their first concert at the Wigmore Hall, London."], ["1949-02-13T00:00:00", "António Óscar Carmona is re-elected president of Portugal for lack of an opposing candidate."], ["1949-02-17T00:00:00", "Chaim Weizmann began his term as the first President of Israel."], ["1949-02-19T00:00:00", "Ezra Pound is awarded the first Bollingen Prize in poetry by the Bollingen Foundation and Yale University."], ["1949-02-22T00:00:00", "Cincinnati Gardens opens in Cincinnati."], ["1949-02-22T00:00:00", "Grady the Cow, a 1,200-pound cow, gets stuck inside a silo on a farm in Yukon, Oklahoma and garners national media attention in the United States."], ["1949-02-28T00:00:00", "Margaret Roberts, the future Margaret Thatcher, is adopted as the Conservative candidate for Dartford. She will go on to fight two elections in the constituency unsuccessfully in 1950 and 1951."], ["1949-03-01T00:00:00", "World heavyweight boxing champion Joe Louis retires."], ["1949-03-01T00:00:00", "Indonesia seizes Yogyakarta from the Dutch."], ["1949-03-02T00:00:00", "The B-50 Superfortress Lucky Lady II under Captain James Gallagher lands in Fort Worth, Texas, after completing the first non-stop around-the-world airplane flight (it was refueled in flight 4 times)."], ["1949-03-17T00:00:00", "The Shamrock Hotel in Houston, Texas, owned by oil tycoon Glenn McCarthy, has its grand opening."], ["1949-03-20T00:00:00", "The Chicago, Burlington and Quincy, Denver and Rio Grande Western, and Western Pacific railroads inaugurate the California Zephyr passenger train between Chicago and Oakland, California, as the first long distance train to feature Vista Dome cars as regular equipment."], ["1949-03-25T00:00:00", "Operation Priboi: An extensive deportation campaign begins in Estonia, Latvia and Lithuania. The Soviet authorities deport more than 92,000 people from the Baltic states to remote areas of the Soviet Union."], ["1949-03-26T00:00:00", "The first half of Giuseppe Verdi's opera Aida, conducted by legendary conductor Arturo Toscanini, and performed in concert (i.e. no scenery or costumes), is telecast by NBC, live from Studio 8H at Rockefeller Center. The second half is telecast a week later. This is the only complete opera that Toscanini ever conducts on television."], ["1949-03-28T00:00:00", "United States Secretary of Defense James Forrestal resigns suddenly."], ["1949-03-28T00:00:00", "English astronomer Fred Hoyle coins the term Big Bang during a BBC Third Programme radio broadcast."], ["1949-03-29T00:00:00", "The 21st Academy Awards ceremony is held. The movie Hamlet wins the Academy Award for Best Picture."], ["1949-03-31T00:00:00", "The former British colony of Newfoundland joins Canada as its 10th province."], ["1949-04-04T00:00:00", "The North Atlantic Treaty is signed in Washington, D.C., creating the NATO defense alliance."], ["1949-04-07T00:00:00", "Rodgers and Hammerstein's South Pacific, starring Mary Martin and Ezio Pinza, opens on Broadway and goes on to become R&H's second longest-running musical. It becomes an instant classic of the musical theatre. The score's biggest hit is the song \"Some Enchanted Evening\"."], ["1949-04-08T00:00:00", "Kathy Fiscus, 3½ years old, dies from falling down an abandoned well in San Marino, California."], ["1949-04-14T00:00:00", "The day the N'Ko alphabet is held to have been completed by Solomana Kante."], ["1949-04-18T00:00:00", "Ireland leaves the British Commonwealth and becomes the Republic of Ireland."], ["1949-04-20T00:00:00", "The Royal Navy frigate HMS Amethyst goes up the Yangtze river to evacuate British Commonwealth refugees escaping the advance of Mao's Communist forces. Under heavy fire, she grounds off Rose Island. After an abortive rescue attempt on April 26, she anchors 10 miles upstream. Negotiations with the Communists to let the ship leave drag on for weeks, during which time the ship's cat Simon raises the crew's morale."], ["1949-04-23T00:00:00", "Chinese Communist troops take Nanjing."], ["1949-04-27T00:00:00", "British Commonwealth of Nations renamed The Commonwealth."], ["1949-04-28T00:00:00", "The Commonwealth Prime Ministers' Conference issues the London Declaration, enabling India (and, thereafter, any other nation) to remain in the British Commonwealth despite becoming a republic, creating the position of 'Head of the Commonwealth', and renaming the organisation as the 'Commonwealth of Nations'."], ["1949-04-28T00:00:00", "Former First Lady of the Philippines Aurora Quezon, 61, is assassinated while en route to dedicate a hospital in memory of her late husband; her daughter and 10 others are also killed."], ["1949-04-29T00:00:00", "The News Review reveals that neither the English public school Selhurst College nor its headmaster H. Rochester Sneath exist, but are a hoax created by Humphry Berkeley."], ["1949-05-01T00:00:00", "Nereid, a moon of Neptune, is discovered by Gerard Kuiper."], ["1949-05-04T00:00:00", "Superga air disaster: The Fiat G.212 airliner of Avio Linee Italiane carrying the entire Torino F.C. football team, crashes into the back wall of the Basilica of Superga, killing all 31 on board."], ["1949-05-05T00:00:00", "The Council of Europe is founded by the signing of the Treaty of London."], ["1949-05-06T00:00:00", "EDSAC, the first practicable stored-program computer, runs its first program at Cambridge University."], ["1949-05-09T00:00:00", "Rainier III of Monaco becomes Prince of Monaco, upon the death of his maternal grandfather Louis II."], ["1949-05-11T00:00:00", "Israel is admitted to the United Nations as its 59th member."], ["1949-05-11T00:00:00", "Siam officially changes its French name to \"Thaïlande\" (English name to \"Thailand\"), having officially changed its Thai name to \"Prated Thai\" since 1939."], ["1949-05-12T00:00:00", "Cold War: The Soviet Union lifts the Berlin Blockade."], ["1949-05-20T00:00:00", "The AFSA (predecessor of the NSA) is established."], ["1949-05-20T00:00:00", "The Kuomintang regime declares Taiwan under martial law."], ["1949-05-22T00:00:00", "After two months in Bethesda Naval Hospital, James Forrestal commits suicide, under circumstances that seem suspicious to many."], ["1949-05-23T00:00:00", "The Federal Republic of Germany is established."], ["1949-05-31T00:00:00", "First trial of Alger Hiss for perjury begins in New York with Whittaker Chambers as principal witness for the prosecution, but would end in a jury deadlock (8 for, 4 against)"], ["1949-06-02T00:00:00", "Transjordan becomes the Kingdom of Jordan."], ["1949-06-05T00:00:00", "Thailand elects Orapin Chaiyakan, the first Thai female member of Thailand's Parliament."], ["1949-06-06T00:00:00", "With the passage of the Bodh Gaya Temple Act by the Indian government, Mahabodhi Temple is restored to partial Buddhist control."], ["1949-06-08T00:00:00", "Red Scare: Celebrities including Helen Keller, Dorothy Parker, Danny Kaye, Fredric March, John Garfield, Paul Muni and Edward G. Robinson are named in an FBI report as Communist Party members."], ["1949-06-08T00:00:00", "George Orwell's dystopian novel Nineteen Eighty-Four is published in London."], ["1949-06-14T00:00:00", "Albert II, a rhesus monkey, becomes the first primate to enter space, on U.S. Hermes project V-2 rocket Blossom IVB, but is killed on impact at return."], ["1949-06-19T00:00:00", "Glenn Dunaway wins the inaugural NASCAR race at Charlotte Speedway, a 3/4 mile oval in Charlotte, North Carolina, but is disqualified due to illegal springs. Jim Roper is declared the official winner."], ["1949-06-24T00:00:00", "The first television western, Hopalong Cassidy, airs on NBC."], ["1949-06-29T00:00:00", "Dock workers strike in the UK."], ["1949-06-29T00:00:00", "Apartheid: The South African Citizenship Act suspends the granting of citizenship to British Commonwealth immigrants after 5 years and imposes a ban on mixed marriages."], ["1949-07-01T00:00:00", "The Institute of Chartered Accountants of India was established"], ["1949-07-11T00:00:00", "Pamir is the last commercial sailing ship to round Cape Horn under sail alone."], ["1949-07-19T00:00:00", "The Kingdom of Laos is officially formed but is not independent from the French Army."], ["1949-07-20T00:00:00", "Israel and Syria sign a truce to end their 19-month war."], ["1949-07-27T00:00:00", "The de Havilland Comet, world's first jet-powered airliner, makes its first flight."], ["1949-07-27T00:00:00", "Rhodesia beats the New Zealand All Blacks 10-8 in Bulawayo. It is the only non-Test nation to achieve this feat."], ["1949-07-30T00:00:00", "Birth of legal aid in England and Wales."], ["1949-07-31T00:00:00", "Captain Kerans of the HMS Amethyst decides to make a break after nightfall, under heavy fire from the Chinese People's Liberation Army on both sides of the Yangtze river, and successfully rejoins the fleet at Woosung the next day."], ["1949-08-05T00:00:00", "A 6.75 Richter scale earthquake in Ecuador kills 6,000 and destroys 50 towns."], ["1949-08-08T00:00:00", "Bhutan becomes independent"], ["1949-08-12T00:00:00", "The Fourth Geneva Convention is agreed to."], ["1949-08-14T00:00:00", "The Salvatore Giuliano Gang explodes mines under a police barracks outside Palermo, Sicily."], ["1949-08-14T00:00:00", "A military coup in Syria ousts the president."], ["1949-08-21T00:00:00", "Deportivo Saprissa enters Costa Rica - soccer's first division."], ["1949-08-22T00:00:00", "The Queen Charlotte earthquake is Canada's largest earthquake since the 1700 Cascadia earthquake."], ["1949-08-24T00:00:00", "North Atlantic Treaty Organization established."], ["1949-08-28T00:00:00", "The last 6 surviving veterans of the American Civil War meet in Indianapolis."], ["1949-08-29T00:00:00", "The Council of Europe meets for the first time."], ["1949-08-29T00:00:00", "The Soviet Union tests its first atomic bomb, code named \"Joe 1\". Its design imitates the American plutonium bomb that was dropped on Nagasaki, Japan, in 1945."], ["1949-08-31T00:00:00", "The retreat of the Greek Democratic Army in Albania after its defeat at Mount Grammos marks the end of the Greek Civil War."], ["1949-09-06T00:00:00", "Howard Unruh, a World War II veteran, kills thirteen neighbors in Camden, New Jersey with a souvenir Parabellum P.08 pistol to become America's first single-episode mass murderer."], ["1949-09-06T00:00:00", "Allied military authorities relinquish control of former Nazi Germany assets back to Germany."], ["1949-09-07T00:00:00", "The Federal Republic of Germany is officially founded. Konrad Adenauer is the first federal chancellor."], ["1949-09-09T00:00:00", "Albert Guay affair: A dynamite bomb destroys Canadian Pacific Airlines Douglas DC-3 in Quebec."], ["1949-09-09T00:00:00", "Notorious World War II veteran Edwin Alonzo Boyd commits his first career bank robbery in Toronto."], ["1949-09-13T00:00:00", "The Soviet Union vetoes United Nations membership for Ceylon, Finland, Iceland, Italy, Jordan and Portugal."], ["1949-09-17T00:00:00", "The Canadian steamship SS Noronic burns in Toronto Harbour with the loss of over 118 lives."], ["1949-09-19T00:00:00", "The United Kingdom government devalues the pound sterling from $4.03 to $2.80, leading to many other currencies being devalued."], ["1949-09-23T00:00:00", "U.S. President Harry S. Truman announced that the USSR tested the atomic bomb."], ["1949-09-24T00:00:00", "László Rajk, ex-foreign minister of Hungary, is sentenced to death."], ["1949-09-29T00:00:00", "The First Plenary Session of the Chinese People's Political Consultative Conference approves a design for the Flag of the People's Republic of China."], ["1949-09-29T00:00:00", "Iva Toguri D'Aquino is found guilty of broadcasting for Japan as \"Tokyo Rose\" during World War II."], ["1949-10-01T00:00:00", "The People's Republic of China is officially proclaimed."], ["1949-10-02T00:00:00", "The Soviet Union recognizes the People's Republic of China."], ["1949-10-07T00:00:00", "The Democratic Republic of Germany (East Germany) is officially established."], ["1949-10-13T00:00:00", "Severe flooding hits Guatemala"], ["1949-10-14T00:00:00", "Foley Square trial of Eugene Dennis and ten other Communist Party leaders ends in New York City (until then, the longest trial in US history); all defendants are found guilty and all but one sentenced to five years of prison"], ["1949-10-16T00:00:00", "Greek Civil War ends with a communist surrender."], ["1949-10-17T00:00:00", "Chinese communist troops take Guangzhou"], ["1949-10-27T00:00:00", "Chinese communist troops fail to take Quemoy in the Battle of Kuningtou; their advance towards Taiwan is halted."], ["1949-10-27T00:00:00", "An Air France flight from Paris to New York crashes in the Azores on São Miguel Island, killing all aboard. Among the victims are violinist Ginette Neveu and French boxer Marcel Cerdan."], ["1949-11-15T00:00:00", "Nathuram Godse and Narayan Apte are executed for assassinating Mohandas Gandhi."], ["1949-11-17T00:00:00", "Second trial of Alger Hiss begins in New York, again with Whittaker Chambers as principal witness"], ["1949-11-24T00:00:00", "The ski resort in Squaw Valley, Placer County, California officially opens."], ["1949-11-26T00:00:00", "The Indian Constituent Assembly adopts India's constitution [1]."], ["1949-11-28T00:00:00", "Winston Churchill makes a landmark speech in support of the idea of a European Union at Kingsway Hall, London."], ["1949-12-07T00:00:00", "The government of the Republic of China finishes its evacuation to Taiwan, and declares Taipei its temporary capital city."], ["1949-12-08T00:00:00", "United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) established as a UN agency."], ["1949-12-10T00:00:00", "Robert Menzies elected prime minister of Australia."], ["1949-12-14T00:00:00", "Traicho Kostov, ex-vice prime minister of Bulgaria, is sentenced to death."], ["1949-12-15T00:00:00", "A typhoon strikes a fishing fleet off Korea, killing several thousand."], ["1949-12-16T00:00:00", "Sukarno is elected president of the Republic of Indonesia."], ["1949-12-17T00:00:00", "Burma recognizes the People's Republic of China."], ["1949-12-27T00:00:00", "Queen Juliana of the Netherlands grants Indonesia sovereignty."], ["1949-12-30T00:00:00", "India recognizes the People's Republic of China."]]