[["1920-01-01T00:00:00", "Babe Ruth is traded by the Red Sox for $125,000, the largest sum ever paid for a player at that time."], ["1920-01-01T00:00:00", "Bolsheviks increase troops from four divisions to twenty along the Polish border"], ["1920-01-07T00:00:00", "The forces of Russian White Admiral Alexander Kolchak surrender in Krasnoyarsk. The Great Siberian Ice March ensues."], ["1920-01-07T00:00:00", "The New York State Assembly refuses to seat five duly elected Socialist assemblymen."], ["1920-01-09T00:00:00", "Thousands of onlookers watch as \"The Human Fly\" George Polley climbs the Woolworth Building in New York City. He reaches the 30th floor before being arrested."], ["1920-01-10T00:00:00", "League of Nations Covenant enters into force. On January 16 the organization holds its first council meeting, in Paris."], ["1920-01-11T00:00:00", "The Azerbaijan Democratic Republic is recognised de facto by European powers in Versailles."], ["1920-01-13T00:00:00", "The New York Times ridicules the American rocket scientist Robert H. Goddard. The newspaper has to recant publicly on July 17, 1969 when the Apollo crew is on its mission to the Moon."], ["1920-01-16T00:00:00", "Prohibition in the United States begins with the Eighteenth Amendment to the Constitution coming into effect."], ["1920-01-16T00:00:00", "The Allies of World War I demand that the Netherlands extradite the German Kaiser Wilhelm II, who fled there in 1918."], ["1920-01-16T00:00:00", "Zeta Phi Beta Sorority, Incorporated, is founded on the campus of Howard University in Washington, D.C."], ["1920-01-19T00:00:00", "The United States Senate votes against joining the League of Nations."], ["1920-01-22T00:00:00", "The Australian Country Party is officially formed, led by Nelson Pollard."], ["1920-01-23T00:00:00", "The Netherlands refuses to extradite the German Kaiser."], ["1920-01-28T00:00:00", "El Tercio de Extranjeros, the \"Regiment of Foreigners\", later the Spanish Legion, is established by decree of King Alfonso XIII of Spain."], ["1920-01-30T00:00:00", "The oldest surviving pro wrestling match on film takes place, with Joe Stecher defeating Earl Caddock."], ["1920-02-02T00:00:00", "Estonian War of Independence: The Tartu Peace Treaty is signed, ending the war and recognizing Estonian independence."], ["1920-02-02T00:00:00", "France occupies Memel."], ["1920-02-02T00:00:00", "Sayyid Muhammad, Khan of Khiva abdicates."], ["1920-02-07T00:00:00", "Admiral Kolchak and Viktor Pepelyayev are executed by firing squad near Irkutsk."], ["1920-02-09T00:00:00", "The Svalbard Treaty, signed by members of the League of Nations in Paris, recognises the sovereignty of Norway over the Arctic archipelago of Svalbard (at this time called Spitzbergen) while giving the other signatories economic rights in the islands."], ["1920-02-10T00:00:00", "General Józef Haller first performs Poland's Wedding to the Sea, a symbolic celebration of the restitution of Polish access to the Baltic Sea."], ["1920-02-13T00:00:00", "Switzerland rejoins the League of Nations."], ["1920-02-14T00:00:00", "The League of Women Voters is founded in Chicago."], ["1920-02-17T00:00:00", "A woman named Anna Anderson tries to commit suicide in Berlin and is taken to a mental hospital, where she claims she is Grand Duchess Anastasia of Russia."], ["1920-02-19T00:00:00", "The United States Senate refuses to ratify the Treaty of Versailles."], ["1920-02-20T00:00:00", "1920 Gori earthquake: An earthquake hits Gori in the Democratic Republic of Georgia, killing 114."], ["1920-02-21T00:00:00", "The island province of Marinduque in the Philippines archipelago is founded."], ["1920-02-22T00:00:00", "In Emeryville, California, the first dog racing track to employ an imitation rabbit opens."], ["1920-02-24T00:00:00", "Adolf Hitler presents his National Socialist Program in Munich to the German Workers' Party (Deutsche Arbeiterpartei) which renames itself as the Nazi Party (Nationalsozialistische Deutsche Arbeiterpartei)."], ["1920-03-01T00:00:00", "Hungarian Admiral and statesman Miklós Horthy becomes the Regent of Hungary."], ["1920-03-01T00:00:00", "The United States Railroad Administration returns control of American railroads to its constituent railroad companies."], ["1920-03-07T00:00:00", "Syrian National Congress proclaims Syria independent with Faisal I of Iraq as king."], ["1920-03-10T00:00:00", "The world's first peaceful establishment of a social democratic government takes place in Sweden. Hjalmar Branting takes over when Nils Edén resigns."], ["1920-03-10T00:00:00", "The Baylor Business Men's Club changes its name to the Baylor University Chamber of Commerce."], ["1920-03-15T00:00:00", "The Ruhr Red Army, a communist army 60,000 men strong, is formed in Germany."], ["1920-03-17T00:00:00", "Birthday of Bangabandhu Sheikh Mujibur Rahman, father of the nation of Bangladesh and a political leader (d. 1975)"], ["1920-03-18T00:00:00", "Greece begins using the Gregorian calendar."], ["1920-03-19T00:00:00", "The United States Congress refuses to ratify the Treaty of Versailles."], ["1920-03-23T00:00:00", "Admiral Miklós Horthy declares that Hungary is a monarchy without anyone on the throne."], ["1920-03-25T00:00:00", "Irish War of Independence: British recruits to the Royal Irish Constabulary begin to arrive in Ireland. They become known from their improvised uniforms as the \"Black and Tans\"."], ["1920-03-26T00:00:00", "The German government asks France for permission to use its own troops against the rebellious Ruhr Red Army in the French-occupied area."], ["1920-03-28T00:00:00", "The 1920 Palm Sunday tornado outbreak hits the Great Lakes region and Deep South of the United States."], ["1920-03-29T00:00:00", "Sir William Robertson is promoted to Field Marshal, the first man to rise from private (enlisted 1877) to the highest rank in the British Army."], ["1920-04-02T00:00:00", "The German army marches to the Ruhr to fight the Ruhr Red Army."], ["1920-04-04T00:00:00", "1920 Palestine riots: Violence erupts between Arab and Jewish residents in Jerusalem; 9 killed, 216 injured."], ["1920-04-06T00:00:00", "The short-lived Far Eastern Republic is declared in eastern Siberia."], ["1920-04-11T00:00:00", "Mexican Revolution: Álvaro Obregón flees from Mexico City during a trial intended to ruin his reputation; he flees to Guerrero where he joins Fortunato Maycotte."], ["1920-04-19T00:00:00", "Germany and Bolshevist Russia agree to the exchange of prisoners of war."], ["1920-04-20T00:00:00", "Mexican Revolution: Álvaro Obregón announces in Chilpancingo that he intends to fight against the rule of Venustiano Carranza."], ["1920-04-20T00:00:00", "The 1920 Summer Olympics open in Antwerp, Belgium. The Olympic symbols of five interlocking rings and the associated flag are first displayed at the games."], ["1920-04-23T00:00:00", "The Grand National Assembly of Turkey is founded by Mustafa Kemal Atatürk in Ankara. It denounces the government of Sultan Mehmed VI and announces a temporary constitution."], ["1920-04-24T00:00:00", "Polish-Soviet War: Polish and anti-Soviet Ukrainian troops attack the Red Army in Soviet Ukraine."], ["1920-04-26T00:00:00", "The Khorezm People's Soviet Republic is officially created by Bolshevist Russia as the successor to the Khanate of Khiva."], ["1920-04-28T00:00:00", "The Azerbaijan Soviet Socialist Republic is officially created."], ["1920-05-02T00:00:00", "The first game of Negro National League baseball is played in Indianapolis, Indiana."], ["1920-05-03T00:00:00", "A Bolshevik coup fails in the Democratic Republic of Georgia."], ["1920-05-07T00:00:00", "Polish-Soviet War: Polish troops occupy Kiev. The government of the Ukrainian People's Republic returns to the city."], ["1920-05-07T00:00:00", "Mexican Revolution: Venustiano Carranza leaves Mexico City in a large train."], ["1920-05-07T00:00:00", "Treaty of Moscow (1920): Soviet Russia recognizes independence of the Democratic Republic of Georgia only to invade the country six months later."], ["1920-05-15T00:00:00", "Russian Revolution: Russian White soldier Maria Bochkareva is executed in Soviet Russia."], ["1920-05-16T00:00:00", "Canonization of Joan of Arc. Over 30,000 people attend the ceremony in Rome, including 140 descendants of Joan of Arc's family. Pope Benedict XV presides over the rite, for which the interior of St. Peter's Basilica in Rome is richly decorated."], ["1920-05-16T00:00:00", "A referendum in Switzerland is favorable to joining the League of Nations."], ["1920-05-17T00:00:00", "French and Belgian troops leave the cities they have occupied in Germany."], ["1920-05-17T00:00:00", "The first flight of Dutch air company KLM, from Amsterdam to London, takes place."], ["1920-05-19T00:00:00", "Mexican Revolution: Álvaro Obregón's troops enter Mexico City."], ["1920-05-20T00:00:00", "Mexican Revolution: Venustiano Carranza arrives in San Antonio Tlaxcalantongo. Troops of Rodolfo Herrero attack him at night and shoot him."], ["1920-05-24T00:00:00", "Venustiano Carranza is buried in Mexico City; all of his mourning allies are arrested. Adolfo de la Huerta is elected provisional president."], ["1920-05-26T00:00:00", "Ganja revolt: Anti-Soviet opposition in the Azerbaijan SSR launches an abortive revolt in Ganja."], ["1920-05-27T00:00:00", "Tomáš Garrigue Masaryk becomes president of Czechoslovakia."], ["1920-05-29T00:00:00", "Great Floods at Louth, Lincolnshire in England kill 23."], ["1920-06-04T00:00:00", "Treaty of Trianon: Peace is restored between the Allied Powers and Hungary. Hungary loses 72% of its territory."], ["1920-06-05T00:00:00", "Bolshevik Cavalry break through Polish and Ukrainian lines south of Kiev, precipitating eventual withdrawal."], ["1920-06-12T00:00:00", "Polish-Soviet War: The Red Army retakes Kiev."], ["1920-06-13T00:00:00", "Essad Pasha Toptani, nominal ruler of Albania, is assassinated by Avni Rustemi in Paris."], ["1920-06-13T00:00:00", "The United States Post Office Department rules that children may not be sent via parcel post."], ["1920-06-15T00:00:00", "A new border treaty between Germany and Denmark gives northern Schleswig to Denmark."], ["1920-06-22T00:00:00", "Greece attacks Turkish troops."], ["1920-07-01T00:00:00", "Germany declares its neutrality in the war between Poland and Soviet Russia."], ["1920-07-02T00:00:00", "Polish-Soviet War: Red Army continues offensive into Poland."], ["1920-07-07T00:00:00", "Arthur Meighen becomes Canada's ninth prime minister."], ["1920-07-11T00:00:00", "In the East Prussian plebiscite the local populace decides to remain with Weimar Germany."], ["1920-07-12T00:00:00", "Soviet-Lithuanian Peace Treaty: The Russian Soviet Federative Socialist Republic recognizes independent Lithuania."], ["1920-07-13T00:00:00", "London County Council bars foreigners from council jobs."], ["1920-07-19T00:00:00", "August 7 - The Second Congress of the Communist International takes place in Saint Petersburg and Moscow. The notorious Twenty-one Conditions are adopted."], ["1920-07-20T00:00:00", "The United Kingdom cedes its brief control of the key Black Sea port of Batum to the Democratic Republic of Georgia."], ["1920-07-22T00:00:00", "Polish-Soviet War: Poland sues for peace with Bolshevist Russia (refused)."], ["1920-07-23T00:00:00", "Battle of Maysalun: The French defeat the Syrian army."], ["1920-07-24T00:00:00", "French troops occupy Damascus and depose Faisal I of Syria as king."], ["1920-07-26T00:00:00", "Mexican Revolution: Pancho Villa takes over Sabina and contacts de la Huerta to offer his conditional surrender. He signs his surrender on July 28."], ["1920-07-29T00:00:00", "The United States Bureau of Reclamation begins construction of the Link River Dam as part of the Klamath Reclamation Project."], ["1920-07-31T00:00:00", "Irish-born Australian Catholic Bishop Daniel Mannix is detained onboard ship off Queenstown and prevented from landing in Ireland or from speaking in the main Irish Catholic communities elsewhere in the United Kingdom."], ["1920-07-31T00:00:00", "France prohibits the sale or prescription of contraceptives."], ["1920-08-03T00:00:00", "Irish War of Independence: Catholic riots in Belfast in protest at the continuing British Army presence."], ["1920-08-10T00:00:00", "Ottoman Sultan Mehmed VI's representatives sign the Treaty of Sèvres with the Allied Powers, confirming arrangements for partitioning of the Ottoman Empire."], ["1920-08-11T00:00:00", "Bolshevik Russia recognizes independent Latvia."], ["1920-08-13T00:00:00", "Irish War of Independence: The Restoration of Order in Ireland Act, passed by the Parliament of the United Kingdom, receives Royal Assent, providing for Irish Republican Army activists to be tried by court-martial rather than by jury in criminal courts."], ["1920-08-20T00:00:00", "The first commercial radio station in the United States, 8MK (WWJ), begins operations in Detroit. It is owned by the 'Detroit News, the first U.S. radio station owned by a newspaper."], ["1920-08-26T00:00:00", "The Nineteenth Amendment to the United States Constitution is passed, guaranteeing women's suffrage."], ["1920-09-05T00:00:00", "Presidential elections begin in Mexico."], ["1920-09-08T00:00:00", "Gabriele D'Annunzio proclaims the Italian Regency of Carnaro in the city of Fiume."], ["1920-09-16T00:00:00", "The Wall Street bombing: A bomb in a horse wagon explodes in front of the J. P. Morgan building in New York City, killing 38 and injuring 400."], ["1920-09-17T00:00:00", "The National Football League is established as the American Professional Football Association."], ["1920-09-20T00:00:00", "The first soldier joins El Tercio de Extranjeros, the \"Regiment of Foreigners\", later the Spanish Legion, established on January 28, in Spain; today is celebrated as the unit's anniversary. Under the command of José Millán Astray and Francisco Franco, its first duties are against Rif rebels in the Spanish protectorate in Morocco."], ["1920-09-21T00:00:00", "Communist Party of Uruguay is founded."], ["1920-09-22T00:00:00", "The London Metropolitan Police forms the Flying Squad, a motorised mobile detective patrol unit."], ["1920-09-27T00:00:00", "Polish-Soviet War: Bolshevist Russia sues for peace with Poland."], ["1920-09-29T00:00:00", "The first domestic radio sets come to stores in the United States; a Westinghouse radio costs $10."], ["1920-09-29T00:00:00", "Adolf Hitler makes his first public political speech, in Austria."], ["1920-10-03T00:00:00", "Prix de l'Arc de Triomphe horse race first run in Paris."], ["1920-10-09T00:00:00", "Polish troops take Vilnius."], ["1920-10-10T00:00:00", "Carinthian Plebiscite: A large part of Carinthia Province votes to become part of Austria rather than Yugoslavia."], ["1920-10-14T00:00:00", "A peace treaty between the Soviet and the Finnish governments is concluded at Tartu."], ["1920-10-16T00:00:00", "Polish-Soviet War: After the Polish army captures Tarnopol, Dubno, Minsk, and Dryssa, the ceasefire is enforced."], ["1920-10-18T00:00:00", "Thousands of unemployed demonstrate in London; 50 are injured."], ["1920-10-26T00:00:00", "Álvaro Obregón is announced the elected president of Mexico."], ["1920-10-27T00:00:00", "- The League of Nations moves its headquarters to Geneva, Switzerland."], ["1920-10-27T00:00:00", "- Baron Louis De Geer the younger becomes the new Prime Minister of Sweden."], ["1920-11-02T00:00:00", "United States presidential election, 1920: Republican U. S. Senator Warren G. Harding defeats Democratic Governor of Ohio James M. Cox and Socialist Eugene V. Debs, in the first national U.S. election in which women have the right to vote."], ["1920-11-02T00:00:00", "In the United States, KDKA AM of Pittsburgh (owned by Westinghouse) starts broadcasting as a commercial radio station. The first broadcast is the results of the presidential election."], ["1920-11-11T00:00:00", "The Unknown Warrior is buried in Westminster Abbey."], ["1920-11-13T00:00:00", "The evacuation of the White Army's last units and civilian refugees from the Crimea on board 126 ships, the remnants of the Russian Imperial Navy, to Turkey, Tunisia and the Kingdom of Serbs, Croats and Slovenes, accompanied by wide-scale civilian massacres. The total number of evacuees amounted to approximately 150,000 people, of which ~20% were civilians."], ["1920-11-14T00:00:00", "The Edmonton Symphony Orchestra holds its first concert."], ["1920-11-15T00:00:00", "In Geneva, the first assembly of the League of Nations is held."], ["1920-11-16T00:00:00", "Queensland and Northern Territory Aviation Services (Qantas) is founded by Hudson Fysh and Paul McGinness."], ["1920-11-17T00:00:00", "The council of the League of Nations accepts the constitution for the Free City of Danzig."], ["1920-11-21T00:00:00", "Irish War of Independence: Bloody Sunday: The Irish Republican Army, on the instructions of Michael Collins, shoot dead the \"Cairo gang\", fourteen British undercover agents in Dublin, most in their homes. Later that day in retaliation the Auxiliary Division of the Royal Irish Constabulary open fire on a crowd at a Gaelic Athletic Association Football match in Croke Park, killing thirteen spectators and one player and wounding 60. Three men are shot this night in Dublin Castle \"while trying to escape\"."], ["1920-11-28T00:00:00", "Irish War of Independence: Kilmichael Ambush: The flying column of the 3rd Cork Brigade of the Irish Republican Army, led by Tom Barry, ambushes two lorries carrying men of the Auxiliary Division of the Royal Irish Constabulary at Kilmichael, County Cork, killing seventeen (with three of its men also dying), which leads to official reprisals."], ["1920-12-01T00:00:00", "The Mexican Revolution ends with a new regime coming to power, which couples with the end of the Old West."], ["1920-12-05T00:00:00", "A referendum in Greece is favorable to the reinstatement of the monarchy."], ["1920-12-10T00:00:00", "Irish War of Independence: Martial law is declared in Counties Cork, Kerry, Limerick and Tipperary."], ["1920-12-11T00:00:00", "The Burning of Cork in Ireland: British forces set fire to some 5 acres (20,000 m2) of the centre of Cork, including the City Hall, in reprisal attacks after a British auxiliary is killed in a guerilla ambush."], ["1920-12-16T00:00:00", "Finland joins the League of Nations."], ["1920-12-16T00:00:00", "An 8.6 Richter scale Haiyuan earthquake causes a landslide in Gansu Province, China, killing 180,000."], ["1920-12-22T00:00:00", "The 8th Congress of Soviets of the Russian SFSR adopts the GOELRO plan, the major plan of the economical development of the country."], ["1920-12-23T00:00:00", "United Kingdom and France ratify the border between French-held Syria and British-held Palestine."], ["1920-12-23T00:00:00", "Government of Ireland Act 1920, passed by the Parliament of the United Kingdom, receives Royal Assent from George V providing for the partition of Ireland into Northern Ireland and Southern Ireland with separate parliaments, granting a measure of home rule."], ["1920-12-25T00:00:00", "The Rosicrucian Fellowship's spiritual healing temple The Ecclesia is dedicated at Mount Ecclesia, Oceanside, California."]]